{"img": {"img_1425390997": {"origin": "http://press.princeton.edu/chapters/s9383.html", "src": "http://press.princeton.edu/images/images/fb25a.png"}, "img_1427099081": {"origin": "http://press.princeton.edu/chapters/s9383.html", "src": "http://press.princeton.edu/images/images/apps/androidbag.png"}, "img_1714474963": {"origin": "http://www.healthzine.org/Medicine/emergency-medicine", "src": "/img-sys/server_misconfigured.png"}, "img_19172503": {"origin": "http://press.princeton.edu/chapters/s9383.html", "src": "http://press.princeton.edu/images/images/google+2.png"}, "img_1940443918": {"origin": "http://press.princeton.edu/chapters/s9383.html", "src": "http://press.princeton.edu/images/images/youtube4.png"}, "img_2133505530": {"origin": "http://press.princeton.edu/chapters/s9383.html", "src": "http://press.princeton.edu/images/images/tumblr.png"}, "img_2703498204": {"origin": "http://press.princeton.edu/chapters/s9383.html", "src": "http://press.princeton.edu/images/images/tw25.png"}, "img_2913252941": {"origin": "http://press.princeton.edu/chapters/s9383.html", "src": "http://press.princeton.edu/images/images/wordpress.png"}, "img_293766420": {"origin": "http://www.smh.com.au/news/business/how-the-invention-of-a-box-changed-our-world/2006/06/11/1149964409162.html%0A", "src": "http://smh.com.au/images/business.gif"}, "img_2964546306": {"origin": "http://press.princeton.edu/chapters/s9383.html", "src": "http://press.princeton.edu/images/images/instagram.png"}, "img_2969296483": {"origin": "http://www.smh.com.au/news/business/how-the-invention-of-a-box-changed-our-world/2006/06/11/1149964409162.html%0A", "src": "http://smh.com.au/images/2005/rhc_newsbyemail.gif"}, "img_3011082015": {"origin": "http://press.princeton.edu/chapters/s9383.html", "src": "http://s7.addthis.com/static/btn/v2/lg-share-en.gif"}, "img_3449004467": {"origin": "http://www.smh.com.au/news/business/how-the-invention-of-a-box-changed-our-world/2006/06/11/1149964409162.html%0A", "src": "/images/2005/nav_mycareer.gif"}, "img_4210278482": {"origin": "http://press.princeton.edu/chapters/s9383.html", "src": "/images/j8131.gif"}, "img_4644439026": {"origin": "http://press.princeton.edu/chapters/s9383.html", "src": "/Blogo.gif"}, "img_5946338253": {"origin": "http://press.princeton.edu/chapters/s9383.html", "src": "http://press.princeton.edu/images/images/vimeo.png"}, "img_6109734158": {"origin": "http://press.princeton.edu/chapters/s9383.html", "src": "http://press.princeton.edu/images/images/rss25a.png"}, "img_6122761232": {"origin": "http://www.smh.com.au/news/business/how-the-invention-of-a-box-changed-our-world/2006/06/11/1149964409162.html%0A", "src": "http://fdimages.fairfax.com.au/cui/FM_95x29.gif"}, "img_7006468108": {"origin": "http://www.smh.com.au/news/business/how-the-invention-of-a-box-changed-our-world/2006/06/11/1149964409162.html%0A", "src": "/images/2005/nav_domain.gif"}, "img_7177535041": {"origin": "http://www.smh.com.au/news/business/how-the-invention-of-a-box-changed-our-world/2006/06/11/1149964409162.html%0A", "src": "http://fdimages.fairfax.com.au/cui/fairfax_digital.gif"}, "img_7681196102": {"origin": "http://www.smh.com.au/news/business/how-the-invention-of-a-box-changed-our-world/2006/06/11/1149964409162.html%0A", "src": "http://server-au.imrworldwide.com/cgi-bin/count?cid=au_f2_SMH-BusinessNews-Story-Paper"}, "img_9168166158": {"origin": "http://www.smh.com.au/news/business/how-the-invention-of-a-box-changed-our-world/2006/06/11/1149964409162.html%0A", "src": "/images/2005/nav_drive.gif"}, "img_9249208796": {"origin": "http://www.smh.com.au/news/business/how-the-invention-of-a-box-changed-our-world/2006/06/11/1149964409162.html%0A", "src": "http://smh.com.au/images/2005/rhc_newsstorealert.gif"}, "img_9502334518": {"origin": "http://www.healthzine.org/Medicine/emergency-medicine", "src": "/img-sys/powered_by_cpanel.svg"}, "img_9982729640": {"origin": "http://press.princeton.edu/chapters/s9383.html", "src": "http://press.princeton.edu/images/images/apps/appStoreMenu.gif"}}, "txt": {"p_1250163138": {"origin": "http://press.princeton.edu/chapters/s9383.html", "text": " The result of all this hectic activity is a nearly seamless system for shipping freight around the world. A 35-ton container of coffeemakers can leave a factory in Malaysia, be loaded aboard a ship, and cover the 9,000 miles to Los Angeles in 16 days. A day later, the container is on a unit train to Chicago, where it is transferred immediately to a truck headed for Cincinnati. The 11,000-mile trip from the factory gate to the Ohio warehouse can take as little as 22 days, a rate of 500 miles per day, at a cost lower than that of a single first-class air ticket. More than likely, no one has touched the contents, or even opened the container, along the way. "}, "p_1287842916": {"origin": "http://www.smh.com.au/news/business/how-the-invention-of-a-box-changed-our-world/2006/06/11/1149964409162.html%0A", "text": "And the development of huge container ships, carrying far more\ncargo than before but with fewer crew, reduced the actual shipping\ncomponent of the total cost."}, "p_1402256130": {"origin": "http://press.princeton.edu/chapters/s9383.html", "text": " Have declines in the cost of shipping really caused such significant economic shifts? Some scholars doubt that ocean freight costs have fallen very much since the middle of the twentieth century. Others, pointing to the undeniable fact that countries trade much more with neighbors than with distant lands, argue that transportation costs still matter a great deal. The present work intentionally takes a non-quantitative approach in addressing these questions. The data on freight costs from the mid-1950s through the 1970s are so severely deficient that they will never provide conclusive proof, but the undisputed fact that the transportation world raced to embrace containerization is very strong evidence that this new shipping technology significantly reduced costs. Nor does this book employ economic models to prove the container's impact. Given the vast changes in the world economy over a span that saw the breakdown of the exchange-rate system, repeated oil crises, the end of colonialism, the invention of jet travel, the spread of computers, the construction of hundreds of thousands of miles of expressways, and many other developments, no model is likely to be conclusive in distinguishing the impact of containerization from that of the many other forces. Nonetheless, dramatic shifts in trade patterns and in the location of economic activity over the past half century suggest that the connection between containerization and changes in economic geography is extremely strong.16  "}, "p_1459224286": {"origin": "http://www.smh.com.au/news/business/how-the-invention-of-a-box-changed-our-world/2006/06/11/1149964409162.html%0A", "text": "\nHome\n |\nNational\n |\nWorld\n |\nOpinion\n |\nBusiness\n |\nTechnology\n |\nSport\n |\nEntertainment\n"}, "p_1525642439": {"origin": "http://www.smh.com.au/news/business/how-the-invention-of-a-box-changed-our-world/2006/06/11/1149964409162.html%0A", "text": "Sprawling industrial complexes where products are manufactured\nfrom start to finish have given way to smaller, more specialised\nplants that ship components and half-finished goods to one another\nin ever lengthening supply chains."}, "p_1750197590": {"origin": "http://press.princeton.edu/chapters/s9383.html", "text": " The colorful chaos of the old-time pier is nowhere in evidence at a major container terminal, the brawny longshoremen carrying bags of coffee on their shoulders nowhere to be seen. Terry Malloy, the muscular hero played by Marlon Brando in On the Waterfront, would not be at home. Almost every one of the intricate movements required to service a vessel is choreographed by a computer long before the ship arrives. Computers, and the vessel planners who use them, determine the order in which the containers are to be discharged, to speed the process without destabilizing the ship. The actions of the container cranes and the equipment in the yard all are programmed in advance. The longshoreman who drives each machine faces a screen telling him which container is to be handled next and where it is to be moved--unless the terminal dispenses with longshoremen by using driverless transporters to pick up the containers at shipside and centrally controlled stacker cranes to handle container storage. The computers have determined that the truck picking up incoming container ABLQ 998435 should be summoned to the terminal at 10:45 a.m., and that outgoing container JKFC 119395, a 40-foot box bound for Newark, carrying 76,800 pounds of machinery and currently stacked at yard location A-52-G-6, will be loaded third from the bottom in the fourth slot in the second row of the forward hold. They have ensured that the refrigerated containers are placed in bays with electrical hookups, and that containers with hazardous contents are apart from containers that could increase the risk of explosion. The entire operation runs like clockwork, with no tolerance for error or human foibles. Within twenty-four hours, the ship discharges its thousands of containers, takes on thousands more, and steams on its way. "}, "p_1900220733": {"origin": "http://press.princeton.edu/chapters/s9383.html", "text": " Chapter 1   THE WORLD THE BOX MADE   On April 26, 1956, a crane lifted fifty-eight aluminum truck bodies aboard an aging tanker ship moored in Newark, New Jersey. Five days later, the Ideal-X sailed into Houston, where fifty-eight trucks waited to take on the metal boxes and haul them to their destinations. Such was the beginning of a revolution.   Decades later, when enormous trailer trucks rule the highways and trains hauling nothing but stacks of boxes rumble through the night, it is hard to fathom just how much the container has changed the world. In 1956, China was not the world's workshop. It was not routine for shoppers to find Brazilian shoes and Mexican vacuum cleaners in stores in the middle of Kansas. Japanese families did not eat beef from cattle raised in Wyoming, and French clothing designers did not have their exclusive apparel cut and sewn in Turkey or Vietnam. Before the container, transporting goods was expensive--so expensive that it did not pay to ship many things halfway across the country, much less halfway around the world.   What is it about the container that is so important? Surely not the thing itself. A soulless aluminum or steel box held together with welds and rivets, with a wooden floor and two enormous doors at one end: the standard container has all the romance of a tin can. The value of this utilitarian object lies not in what it is, but in how it is used. The container is at the core of a highly automated system for moving goods from anywhere, to anywhere, with a minimum of cost and complication on the way.   The container made shipping cheap, and by doing so changed the shape of the world economy. The armies of ill-paid, ill-treated workers who once made their livings loading and unloading ships in every port are no more, their tight-knit waterfront communities now just memories. Cities that had been centers of maritime commerce for centuries, such as New York and Liverpool, saw their waterfronts decline with startling speed, unsuited to the container trade or simply unneeded, and the manufacturers that endured high costs and antiquated urban plants in order to be near their suppliers and their customers have long since moved away. Venerable ship lines with century-old pedigrees were crushed by the enormous cost of adapting to container shipping. Merchant mariners, who had shipped out to see the world, had their traditional days-long shore leave in exotic harbors replaced by a few hours ashore at a remote parking lot for containers, their vessel ready to weigh anchor the instant the high-speed cranes finished putting huge metal boxes off and on the ship.   Even as it helped destroy the old economy, the container helped build a new one. Sleepy harbors such as Busan and Seattle moved into the front ranks of the world's ports, and massive new ports were built in places like Felixstowe, in England, and Tanjung Pelepas, in Malaysia, where none had been before. Small towns, distant from the great population centers, could take advantage of their cheap land and low wages to entice factories freed from the need to be near a port to enjoy cheap transportation. Sprawling industrial complexes where armies of thousands manufactured products from start to finish gave way to smaller, more specialized plants that shipped components and half-finished goods to one another in ever lengthening supply chains. Poor countries, desperate to climb the rungs of the ladder of economic development, could realistically dream of becoming suppliers to wealthy countries far away. Huge industrial complexes mushroomed in places like Los Angeles and Hong Kong, only because the cost of bringing raw materials in and sending finished goods out had dropped like a stone.1   This new economic geography allowed firms whose ambitions had been purely domestic to become international companies, exporting their products almost as effortlessly as selling them nearby. If they did, though, they soon discovered that cheaper shipping benefited manufacturers in Thailand or Italy just as much. Those who had no wish to go international, who sought only to serve their local clientele, learned that they had no choice: like it or not, they were competing globally because the global market was coming to them. Shipping costs no longer offered shelter to high-cost producers whose great advantage was physical proximity to their customers; even with customs duties and time delays, factories in Malaysia could deliver blouses to Macy's in Herald Square more cheaply than could blouse manufacturers in the nearby lofts of New York's garment district. Multinational manufacturers--companies with plants in different countries--transformed themselves into international manufacturers, integrating once isolated factories into networks so that they could choose the cheapest location in which to make a particular item, yet still shift production from one place to another as costs or exchange rates might dictate. In 1956, the world was full of small manufacturers selling locally; by the end of the twentieth century, purely local markets for goods of any sort were few and far between.   For workers, of course, this has all been a mixed blessing. As consumers, they enjoy infinitely more choices thanks to the global trade the container has stimulated. By one careful study, the United States imported four times as many varieties of goods in 2002 as in 1972, generating a consumer benefit--not counted in official statistics--equal to nearly 3 percent of the entire economy. The competition that came with increased trade has diffused new products with remarkable speed and has held down prices so that average households can partake. The ready availability of inexpensive imported consumer goods has boosted living standards around the world.2    As wage earners, on the other hand, workers have every reason to be ambivalent. In the decades after World War II, wartime devastation created vast demand while low levels of international trade kept competitive forces under control. In this exceptional environment, workers and trade unions in North America, Western Europe, and Japan were able to negotiate nearly continuous improvements in wages and benefits, while government programs provided ever stronger safety nets. The workweek grew shorter, disability pay was made more generous, and retirement at sixty or sixty-two became the norm. The container helped bring an end to that unprecedented advance. Low shipping costs helped make capital even more mobile, increasing the bargaining power of employers against their far less mobile workers. In this highly integrated world economy, the pay of workers in Shenzhen sets limits on wages in South Carolina, and when the French government ordered a shorter workweek with no cut in pay, it discovered that nearly frictionless, nearly costless shipping made it easy for manufacturers to avoid the higher cost by moving abroad.3       A modern containerport is a factory whose scale strains the limits of imagination. At each berth--the world's biggest ports have dozens--rides a mammoth oceangoing vessel, up to 1,100 feet long and 140 feet across, carrying nothing but metal containers. The deck is crowded with row after row of them, red and blue and green and silver, stacked 15 or 20 abreast and 6 or 7 high. Beneath the deck are yet more containers, stacked 6 or 8 deep in the holds. The structure that houses the crew quarters, topped by the navigation bridge, is toward the stern, barely visible above the stacks of boxes. The crew accommodations are small, but so is the crew. A ship carrying 3,000 40-foot containers, filled with 100,000 tons of shoes and clothes and electronics, may make the three-week transit from Hong Kong around the Cape of Good Hope to Germany with only twenty people on board.4   On the wharf, a row of enormous cranes goes into action almost as soon as the ship ties up. The cranes are huge steel structures, rising 200 feet into the air and weighing more than two million pounds. Their legs stretch 50 feet apart, easily wide enough for several truck lanes or even train tracks to pass beneath. The cranes rest on rails running parallel to the ship's side, so that they can move forward or aft as required. Each crane extends a boom 115 feet above the dock and long enough to span the width of a ship broader than the Panama Canal.   High up in each crane, an operator controls a trolley able to travel the length of the boom, and from each trolley hangs a spreader, a steel frame designed to lock onto all four top corners of a 40-ton box. As unloading begins, each operator moves his trolley out the boom to a precise location above the ship, lowers the spreader to engage a container, raises the container up toward the trolley, and pulls trolley and container quickly toward the wharf. The trolley stops above a rubber-tired transporter waiting between the crane's legs, the container is lowered onto the transporter, and the spreader releases its grip. The transporter then moves the container to the adjacent storage yard, while the trolley moves back out over the ship to pick up another box. The process is repeated every two minutes, or even every ninety seconds, each crane moving 30 or 40 boxes an hour from ship to dock. As parts of the ship are cleared of incoming containers, reloading begins, and dockside activity becomes even more frenzied. Each time the crane places an incoming container on one vehicle, it picks up an outbound container from another, simultaneously emptying and filling the ship.   In the yard, a mile-long strip paved with asphalt, the incoming container is driven beneath a stacking crane. The stacker has rubber-tired wheels 50 feet apart, wide enough to span a truck lane and four adjacent stacks of containers. The wheels are linked by a metal structure 70 feet in the air, so that the entire machine can move back and forth above the rows of containers stacked six high. The crane engages the container, lifts it from the transporter, and moves it across the stacks of other containers to its storage location. A few hours later, the process will be reversed, as the stacking crane lifts the container onto a steel chassis pulled by an over-the-road truck. The truck may take the cargo hundreds of miles to its destination or may haul it to a nearby rail yard, where low-slung cars specially designed for containers await loading.   The colorful chaos of the old-time pier is nowhere in evidence at a major container terminal, the brawny longshoremen carrying bags of coffee on their shoulders nowhere to be seen. Terry Malloy, the muscular hero played by Marlon Brando in On the Waterfront, would not be at home. Almost every one of the intricate movements required to service a vessel is choreographed by a computer long before the ship arrives. Computers, and the vessel planners who use them, determine the order in which the containers are to be discharged, to speed the process without destabilizing the ship. The actions of the container cranes and the equipment in the yard all are programmed in advance. The longshoreman who drives each machine faces a screen telling him which container is to be handled next and where it is to be moved--unless the terminal dispenses with longshoremen by using driverless transporters to pick up the containers at shipside and centrally controlled stacker cranes to handle container storage. The computers have determined that the truck picking up incoming container ABLQ 998435 should be summoned to the terminal at 10:45 a.m., and that outgoing container JKFC 119395, a 40-foot box bound for Newark, carrying 76,800 pounds of machinery and currently stacked at yard location A-52-G-6, will be loaded third from the bottom in the fourth slot in the second row of the forward hold. They have ensured that the refrigerated containers are placed in bays with electrical hookups, and that containers with hazardous contents are apart from containers that could increase the risk of explosion. The entire operation runs like clockwork, with no tolerance for error or human foibles. Within twenty-four hours, the ship discharges its thousands of containers, takes on thousands more, and steams on its way.   Every day at every major port, thousands of containers arrive and depart by truck and train. Loaded trucks stream through the gates, where scanners read the unique number on each container and computers compare it against ships' manifests before the trucker is told where to drop his load. Tractor units arrive to hook up chassis and haul away containers that have just come off the ship. Trains carrying nothing but double-stacked containers roll into an intermodal terminal close to the dock, where giant cranes straddle the entire train, working their way along as they remove one container after another. Outbound container trains, destined for a rail yard two thousand miles away with only the briefest of stops en route, are assembled on the same tracks and loaded by the same cranes.   The result of all this hectic activity is a nearly seamless system for shipping freight around the world. A 35-ton container of coffeemakers can leave a factory in Malaysia, be loaded aboard a ship, and cover the 9,000 miles to Los Angeles in 16 days. A day later, the container is on a unit train to Chicago, where it is transferred immediately to a truck headed for Cincinnati. The 11,000-mile trip from the factory gate to the Ohio warehouse can take as little as 22 days, a rate of 500 miles per day, at a cost lower than that of a single first-class air ticket. More than likely, no one has touched the contents, or even opened the container, along the way.   This high-efficiency transportation machine is a blessing for exporters and importers, but it has become a curse for customs inspectors and security officials. Each container is accompanied by a manifest listing its contents, but neither ship lines nor ports can vouch that what is on the manifest corresponds to what is inside. Nor is there any easy way to check: opening the doors at the end of the box normally reveals only a wall of paperboard cartons. With a single ship able to disgorge 3,000 40-foot-long containers in a matter of hours, and with a port such as Long Beach or Tokyo handling perhaps 10,000 loaded containers on the average workday, and with each container itself holding row after row of boxes stacked floor to ceiling, not even the most careful examiners have a remote prospect of inspecting it all. Containers can be just as efficient for smuggling undeclared merchandise, illegal drugs, undocumented immigrants, and terrorist bombs as for moving legitimate cargo.5     Getting from the Ideal-X to a system that moves tens of millions of boxes each year was not an easy voyage. Both the container's promoters and its opponents sensed from the very beginning that this was an invention that could change the way the world works. That first container voyage of 1956, an idea turned into reality by the ceaseless drive of an entrepreneur who knew nothing about ships, unleashed more than a decade of battle around the world. Many titans of the transportation industry sought to stifle the container. Powerful labor leaders pulled out all the stops to block its ascent, triggering strikes in dozens of harbors. Some ports spent heavily to promote it, while others spent huge sums for traditional piers and warehouses in the vain hope that the container would prove a passing fad. Governments reacted with confusion, trying to figure out how to capture its benefits without disturbing the profits, jobs, and social arrangements that were tied to the status quo. Even seemingly simple matters, such as the design of the steel fitting that allows almost any crane in any port to lift almost any container, were settled only after years of contention. In the end, it took a major war, the United States' painful campaign in Vietnam, to prove the merit of this revolutionary approach to moving freight.   How much the container matters to the world economy is impossible to quantify. In the ideal world, we would like to know how much it cost to send one thousand men's shirts from Bangkok to Geneva in 1955, and to track how that cost changed as containerization came into use. Such data do not exist, but it seems clear that the container brought sweeping reductions in the cost of moving freight. From a tiny tanker laden with a few dozen containers that would not fit on any other vessel, container shipping matured into a highly automated, highly standardized industry on a global scale. An enormous containership can be loaded with a minute fraction of the labor and time required to handle a small conventional ship half a century ago. A few crew members can manage an oceangoing vessel longer than three football fields. A trucker can deposit a trailer at a customer's loading dock, hook up another trailer, and drive on immediately, rather than watching his expensive rig stand idle while the contents are removed. All of those changes are consequences of the container revolution. Transportation has become so efficient that for many purposes, freight costs do not much effect economic decisions. As economists Edward L. Glaeser and Janet E. Kohlhase suggest, \"It is better to assume that moving goods is essentially costless than to assume that moving goods is an important component of the production process.\" Before the container, such a statement was unimaginable.6   In 1961, before the container was in international use, ocean freight costs alone accounted for 12 percent of the value of U.S. exports and 10 percent of the value of U.S. imports. \"These costs are more significant in many cases than governmental trade barriers,\" the staff of the Joint Economic Committee of Congress advised, noting that the average U.S. import tariff was 7 percent. And ocean freight, dear as it was, represented only a fraction of the total cost of moving goods from one country to another. A pharmaceutical company would have paid approximately $2,400 to ship a truck-load of medicines from the U.S. Midwest to an interior city in Europe in 1960. This might have included payments to a dozen different vendors: a local trucker in Chicago, the railroad that carried the truck trailer on a flatcar to New York or Baltimore, a local trucker in the port city, a port warehouse, a steamship company, a warehouse and a trucking company in Europe, an insurer, a European customs service, and the freight forwarder who put all the pieces of this complicated journey together. Half the total outlay went for port costs.7   This process was so expensive that in many cases selling internationally was not worthwhile. \"For some commodities, the freight may be as much as 25 per cent of the cost of the product,\" two engineers concluded after a careful study of data from 1959. Shipping steel pipe from New York to Brazil cost an average of $57 per ton in 1962, or 13 percent of the average cost of the pipe being exported--a figure that did not include the cost of getting the pipe from the steel mill to the dock. Shipping refrigerators from London to Capetown cost the equivalent of 68 U.S. cents per cubic foot, adding $20 to the wholesale price of a midsize unit. No wonder that, relative to the size of the economy, U.S. international trade was smaller in 1960 than it had been in 1950, or even in the Depression year of 1930. The cost of conducting trade had gotten so high that in many cases trading made no sense.8    By far the biggest expense in this process was shifting the cargo from land transport to ship at the port of departure and moving it back to truck or train at the other end of the ocean voyage. As one expert explained, \"a four thousand mile voyage for a shipment might consume 50 percent of its costs in covering just the two ten-mile movements through two ports.\" These were the costs that the container affected first, as the elimination of piece-by-piece freight handling brought lower expenses for longshore labor, insurance, pier rental, and the like. Containers were quickly adopted for land transportation, and the reduction in loading time and transshipment cost lowered rates for goods that moved entirely by land. As ship lines built huge vessels specially designed to handle containers, ocean freight rates plummeted. And as container shipping became inter-modal, with a seamless shifting of containers among ships and trucks and trains, goods could move in a never-ending stream from Asian factories directly to the stockrooms of retail stores in North America or Europe, making the overall cost of transporting goods little more than a footnote in a company's cost analysis.9    Transport efficiencies, though, hardly begin to capture the economic impact of containerization. The container not only lowered freight bills, it saved time. Quicker handling and less time in storage translated to faster transit from manufacturer to customer, reducing the cost of financing inventories sitting unproductively on railway sidings or in pierside warehouses awaiting a ship. The container, combined with the computer, made it practical for companies like Toyota and Honda to develop just-in-time manufacturing, in which a supplier makes the goods its customer wants only as the customer needs them and then ships them, in containers, to arrive at a specified time. Such precision, unimaginable before the container, has led to massive reductions in manufacturers' inventories and correspondingly huge cost savings. Retailers have applied those same lessons, using careful logistics management to squeeze out billions of dollars of costs.   These savings in freight costs, in inventory costs, and in time to market have encouraged ever longer supply chains, allowing buyers in one country to purchase from sellers halfway around the globe with little fear that the gaskets will not arrive when needed or that the dolls will not be on the toy store shelf before Christmas. The more reliable these supply chains become, the further retailers, wholesalers, and manufacturers are willing to reach in search of lower production costs--and the more likely it becomes that workers will feel the sting of dislocation as their employers find distant sources of supply.   Some scholars have argued that reductions in transport costs are at best marginal improvements that have had negligible effects on trade flows. This book disputes that view. In the decade after the container first came into international use, in 1966, the volume of international trade in manufactured goods grew more than twice as fast as the volume of global manufacturing production, and two and a half times as fast as global economic output. Something was accelerating the growth of trade even though the economic expansion that normally stimulates trade was weak. Something was driving a vast increase in international commerce in manufactured goods even though oil shocks were making the world economy sluggish. While attributing the vast changes in the world economy to a single cause would be foolhardy, we should not dismiss out of hand the possibility that the extremely sharp drop in freight costs played a major role in increasing the integration of the global economy. 10     The subject of this book lies at the confluence of several major streams of research. One delves into the impact of changes in transportation technology, a venerable subject for both historians and economists. The steamship, invented in the 1780s and put to regular use by 1807, strengthened New York's prominence as a port, and the Erie Canal, an undertaking of unprecedented size, had an even greater impact. The radical decline in ocean freight rates during the nineteenth century, the result of technological change and improved navigation techniques, encouraged a huge increase in world trade and added to Europe's eagerness to found colonies. The connection between railroad development and U.S. economic growth has been debated strenuously, but there is little dispute that lower rail freight rates increased agricultural productivity, knitted the North together before the Civil War, and eventually made Chicago the hub of a region stretching a thousand miles to the west. A transport innovation of the 1880s, the refrigerated railcar, made meat affordable for average households by allowing meat companies to ship carcasses rather than live animals across the country. The truck and the passenger car reshaped urban development starting in the 1920s, and more recently commercial aviation redrew the economic map by bringing formerly isolated communities within a few hours of major cities. This book will argue that container shipping has had a similarly large effect in stimulating trade and economic development--and that, as with steamships, railroads, and airplanes, government intervention both encouraged and deterred its growth.11    The importance of innovation is at the center of a second, and rapidly growing, body of research. Capital, labor, and land, the basic factors of production, have lost much of their fascination for those looking to understand why economies grow and prosper. The key question asked today is no longer how much capital and labor an economy can amass, but how innovation helps employ those resources more effectively to produce more goods and services. This line of research makes clear that new technology, by itself, has little economic benefit. As economist Nathan Rosenberg observed, \"innovations in their early stages are usually exceedingly ill-adapted to the wide range of more specialised uses to which they are eventually put.\" Resistance to new methods can impede their adoption. Potential users may avoid commitments until the future is more certain; as early buyers of Betamax video players can attest, it is risky to bet on a technology that turns out to be a dead end. Even after a new technology is proven, its spread must often wait until prior investments have been recouped; although Thomas Edison invented the incandescent lightbulb by 1879, only 3 percent of U.S. homes had electric lighting twenty years later. The economic benefits arise not from innovation itself, but from the entrepreneurs who eventually discover ways to put innovations to practical use--and most critically, as economists Erik Brynjolfsson and Lorin M. Hitt have pointed out, from the organizational changes through which businesses reshape themselves to take advantage of the new technology.12    This book contends that, just as decades elapsed between the taming of electricity in the 1870s and the widespread use of electrical power, so too did the embrace of containerization take time. Big savings in the cost of handling cargo on the docks did not translate immediately into big savings in the total cost of transportation. Transportation companies were generally ill-equipped to exploit the container's advantages, and their customers had designed their operations around different assumptions about costs. Only with time, as container shipping developed into an entirely new system of moving goods by land and sea, did it begin to affect trade patterns and industrial location. Not until firms learned to take advantage of the opportunities the container created did it change the world. Once the world began to change, it changed very rapidly: the more organizations that adopted the container, the more costs fell, and the cheaper and more ubiquitous container transportation became.13    The third intellectual stream feeding into this book is the connection between transportation costs and economic geography, the question of who makes what where. This connection might seem self-evident, but it is not. When David Ricardo showed in 1817 that both Portugal and England could gain by specializing in making products in which they had a comparative advantage, he assumed that only production costs mattered; the costs of shipping Portuguese wine to England and English cloth to Portugal did not enter his analysis. Ricardo's assumption that transportation costs were zero has been incorporated into economists' models ever since, despite ample real-world evidence that transportation costs matter a great deal.14   Economists have devoted serious effort to studying the geographic implications of transport costs only since the early 1990s. This new stream of work shows formally what common sense suggests. When transport costs are high, manufacturers' main concern is to locate near their customers, even if this requires undesirably small plants or high operating costs. As transportation costs decline relative to other costs, manufacturers can relocate first domestically, and then internationally, to reduce other costs, which come to loom larger. Globalization, the diffusion of economic activity without regard for national boundaries, is the logical end point of this process. As transport costs fall to extremely low levels, producers move from high-wage to low-wage countries, eventually causing wage levels in all countries to converge. These geographic shifts can occur quickly and suddenly, leaving long-standing industrial infrastructure under-utilized or abandoned as economic activity moves on.15    Have declines in the cost of shipping really caused such significant economic shifts? Some scholars doubt that ocean freight costs have fallen very much since the middle of the twentieth century. Others, pointing to the undeniable fact that countries trade much more with neighbors than with distant lands, argue that transportation costs still matter a great deal. The present work intentionally takes a non-quantitative approach in addressing these questions. The data on freight costs from the mid-1950s through the 1970s are so severely deficient that they will never provide conclusive proof, but the undisputed fact that the transportation world raced to embrace containerization is very strong evidence that this new shipping technology significantly reduced costs. Nor does this book employ economic models to prove the container's impact. Given the vast changes in the world economy over a span that saw the breakdown of the exchange-rate system, repeated oil crises, the end of colonialism, the invention of jet travel, the spread of computers, the construction of hundreds of thousands of miles of expressways, and many other developments, no model is likely to be conclusive in distinguishing the impact of containerization from that of the many other forces. Nonetheless, dramatic shifts in trade patterns and in the location of economic activity over the past half century suggest that the connection between containerization and changes in economic geography is extremely strong.16    Mysteriously, the container has escaped all three of these very lively fields of research. It has no engine, no wheels, no sails: it does not fascinate those captivated by ships and trains and planes, or by sailors and pilots. It lacks the flash to draw attention from those who study technological innovation. And so many forces have combined to alter economic geography since the middle of the twentieth century that the container is easily overlooked. There is, half a century after its arrival, no general history of the container.17    In telling the remarkable story of containerization, this book represents an attempt to fill that historical void. It treats containerization not as shipping news, but as a development that has sweeping consequences for workers and consumers all around the globe. Without it, the world would be a very different place.  "}, "p_1972451963": {"origin": "http://www.smh.com.au/news/business/how-the-invention-of-a-box-changed-our-world/2006/06/11/1149964409162.html%0A", "text": "Sitemap | Subscribe | Privacy | Contact Us | Conditions | Member Agreement | \n\n\n<!--\nvar setHomepage = \"http://www.smh.com.au/\";\nvar redirTo = \"http://redirect.fairfax.com.au/redir.cgi?from_site=smh&from_section=makehomepage&to=http%3A%2F%2Fwww.smh.com.au\";\nvar ua=navigator.userAgent;\nif ( (ua.indexOf(\"MSIE 5\")!=-1 || ua.indexOf(\"MSIE 6\")!=-1) && ua.indexOf(\"Win\")!=-1 && ua.indexOf(\"Opera\")==-1 ) {\n         document.write(\"<a href=\\\"\"+redirTo+\"\\\" onClick=\\\"style.behavior='url(#default#homepage)';setHomePage('\"+setHomepage+\"');\\\">Make&nbsp;this&nbsp;my&nbsp;Homepage</a>\");\n}\n// -->\n\n"}, "p_2040320785": {"origin": "http://press.princeton.edu/chapters/s9383.html", "text": "\n"}, "p_2307613686": {"origin": "http://www.smh.com.au/news/business/how-the-invention-of-a-box-changed-our-world/2006/06/11/1149964409162.html%0A", "text": "Look inside a personal computer or under the bonnet of a car and\nyou see parts made in many different countries."}, "p_2345104426": {"origin": "http://press.princeton.edu/chapters/s9383.html", "text": " Chapter 1 "}, "p_2448436759": {"origin": "http://press.princeton.edu/chapters/s9383.html", "text": "\n"}, "p_2576552338": {"origin": "http://www.smh.com.au/news/business/how-the-invention-of-a-box-changed-our-world/2006/06/11/1149964409162.html%0A", "text": "When transport costs fell, manufacturers were free to give\ngreater weight to other costs. They could move to where they had\nmore room because land was cheaper, or to where labour was\ncheaper."}, "p_2781755258": {"origin": "http://press.princeton.edu/chapters/s9383.html", "text": "This file is also available in Adobe Acrobat PDF format"}, "p_2919945870": {"origin": "http://www.smh.com.au/news/business/how-the-invention-of-a-box-changed-our-world/2006/06/11/1149964409162.html%0A", "text": "Standardisation facilitates automation. Computerisation improves\nautomation. Using both, ships can be unloaded and loaded at the\nsame time. Cranes can move 30 or 40 containers an hour. Ports can\nmove up to 10,000 containers a day. A container ship can unload and\nreload within 24 hours."}, "p_3227270212": {"origin": "http://press.princeton.edu/chapters/s9383.html", "text": " For workers, of course, this has all been a mixed blessing. As consumers, they enjoy infinitely more choices thanks to the global trade the container has stimulated. By one careful study, the United States imported four times as many varieties of goods in 2002 as in 1972, generating a consumer benefit--not counted in official statistics--equal to nearly 3 percent of the entire economy. The competition that came with increased trade has diffused new products with remarkable speed and has held down prices so that average households can partake. The ready availability of inexpensive imported consumer goods has boosted living standards around the world.2  "}, "p_3526490222": {"origin": "http://www.smh.com.au/news/business/how-the-invention-of-a-box-changed-our-world/2006/06/11/1149964409162.html%0A", "text": "The point of using a standard-size container is that you get\nhuge economies of scale. Trucks, trains, ports and ships in every\ncountry can be purpose-built to take any container in the\nworld."}, "p_353809461": {"origin": "http://www.smh.com.au/news/business/how-the-invention-of-a-box-changed-our-world/2006/06/11/1149964409162.html%0A", "text": "\n \nDid you know you could pay less than $1 a day for a subscription to the Herald? Subscribe today.\n"}, "p_3590606403": {"origin": "http://www.smh.com.au/news/business/how-the-invention-of-a-box-changed-our-world/2006/06/11/1149964409162.html%0A", "text": "The point of moving pretty much everything except bulk\ncommodities in containers is that you greatly reduce handling\ncosts. Once you pack a container, it can go door-to-door - from\ntruck to ship to train to truck - without the contents being\nhandled. But what gives the humble container extra power is\nstandardisation. Tens of millions of shipping containers move\naround the world each year, but they're all of the same dimensions:\neight feet wide, eight feet high and 20 or 40 feet long."}, "p_3622780611": {"origin": "http://press.princeton.edu/chapters/s9383.html", "text": " What is it about the container that is so important? Surely not the thing itself. A soulless aluminum or steel box held together with welds and rivets, with a wooden floor and two enormous doors at one end: the standard container has all the romance of a tin can. The value of this utilitarian object lies not in what it is, but in how it is used. The container is at the core of a highly automated system for moving goods from anywhere, to anywhere, with a minimum of cost and complication on the way. "}, "p_3745744873": {"origin": "http://press.princeton.edu/chapters/s9383.html", "text": "Return to Book Description"}, "p_3850544114": {"origin": "http://www.smh.com.au/news/business/how-the-invention-of-a-box-changed-our-world/2006/06/11/1149964409162.html%0A", "text": "CLASSIFIEDS Jobs | Real Estate | Cars | Dating | Place a classified ad"}, "p_3916774932": {"origin": "http://www.smh.com.au/news/business/how-the-invention-of-a-box-changed-our-world/2006/06/11/1149964409162.html%0A", "text": "Ross Gittins is the Herald's Economics Editor."}, "p_3998170395": {"origin": "http://press.princeton.edu/chapters/s9383.html", "text": " High up in each crane, an operator controls a trolley able to travel the length of the boom, and from each trolley hangs a spreader, a steel frame designed to lock onto all four top corners of a 40-ton box. As unloading begins, each operator moves his trolley out the boom to a precise location above the ship, lowers the spreader to engage a container, raises the container up toward the trolley, and pulls trolley and container quickly toward the wharf. The trolley stops above a rubber-tired transporter waiting between the crane's legs, the container is lowered onto the transporter, and the spreader releases its grip. The transporter then moves the container to the adjacent storage yard, while the trolley moves back out over the ship to pick up another box. The process is repeated every two minutes, or even every ninety seconds, each crane moving 30 or 40 boxes an hour from ship to dock. As parts of the ship are cleared of incoming containers, reloading begins, and dockside activity becomes even more frenzied. Each time the crane places an incoming container on one vehicle, it picks up an outbound container from another, simultaneously emptying and filling the ship. "}, "p_4121439481": {"origin": "http://press.princeton.edu/chapters/s9383.html", "text": " This new economic geography allowed firms whose ambitions had been purely domestic to become international companies, exporting their products almost as effortlessly as selling them nearby. If they did, though, they soon discovered that cheaper shipping benefited manufacturers in Thailand or Italy just as much. Those who had no wish to go international, who sought only to serve their local clientele, learned that they had no choice: like it or not, they were competing globally because the global market was coming to them. Shipping costs no longer offered shelter to high-cost producers whose great advantage was physical proximity to their customers; even with customs duties and time delays, factories in Malaysia could deliver blouses to Macy's in Herald Square more cheaply than could blouse manufacturers in the nearby lofts of New York's garment district. Multinational manufacturers--companies with plants in different countries--transformed themselves into international manufacturers, integrating once isolated factories into networks so that they could choose the cheapest location in which to make a particular item, yet still shift production from one place to another as costs or exchange rates might dictate. In 1956, the world was full of small manufacturers selling locally; by the end of the twentieth century, purely local markets for goods of any sort were few and far between. "}, "p_4259342812": {"origin": "http://press.princeton.edu/chapters/s9383.html", "text": " In telling the remarkable story of containerization, this book represents an attempt to fill that historical void. It treats containerization not as shipping news, but as a development that has sweeping consequences for workers and consumers all around the globe. Without it, the world would be a very different place. "}, "p_4288022190": {"origin": "http://www.smh.com.au/news/business/how-the-invention-of-a-box-changed-our-world/2006/06/11/1149964409162.html%0A", "text": "But in his new book, The Box, published by Princeton\nUniversity Press, Marc Levinson argues that this prosaic invention\nhas been a significant factor in the advance of globalisation and\nso has changed our world in significant ways."}, "p_4328289313": {"origin": "http://press.princeton.edu/chapters/s9383.html", "text": " As wage earners, on the other hand, workers have every reason to be ambivalent. In the decades after World War II, wartime devastation created vast demand while low levels of international trade kept competitive forces under control. In this exceptional environment, workers and trade unions in North America, Western Europe, and Japan were able to negotiate nearly continuous improvements in wages and benefits, while government programs provided ever stronger safety nets. The workweek grew shorter, disability pay was made more generous, and retirement at sixty or sixty-two became the norm. The container helped bring an end to that unprecedented advance. Low shipping costs helped make capital even more mobile, increasing the bargaining power of employers against their far less mobile workers. In this highly integrated world economy, the pay of workers in Shenzhen sets limits on wages in South Carolina, and when the French government ordered a shorter workweek with no cut in pay, it discovered that nearly frictionless, nearly costless shipping made it easy for manufacturers to avoid the higher cost by moving abroad.3 "}, "p_4362465458": {"origin": "http://press.princeton.edu/chapters/s9383.html", "text": "COPYRIGHT NOTICE: Published by Princeton University Press and copyrighted, © 2006, by Princeton University Press. All rights reserved. No part of this book may be reproduced in any form by any electronic or mechanical means (including photocopying, recording, or information storage and retrieval) without permission in writing from the publisher, except for reading and browsing via the World Wide Web. Users are not permitted to mount this file on any network servers. Follow links for Class Use and other Permissions. For more information, send e-mail to permissions@press.princeton.edu"}, "p_4395938845": {"origin": "http://press.princeton.edu/chapters/s9383.html", "text": "Questions and comments to: webmaster@pupress.princeton.eduPrinceton University Press"}, "p_4406955139": {"origin": "http://press.princeton.edu/chapters/s9383.html", "text": " On the wharf, a row of enormous cranes goes into action almost as soon as the ship ties up. The cranes are huge steel structures, rising 200 feet into the air and weighing more than two million pounds. Their legs stretch 50 feet apart, easily wide enough for several truck lanes or even train tracks to pass beneath. The cranes rest on rails running parallel to the ship's side, so that they can move forward or aft as required. Each crane extends a boom 115 feet above the dock and long enough to span the width of a ship broader than the Panama Canal. "}, "p_441133124": {"origin": "http://press.princeton.edu/chapters/s9383.html", "text": " How much the container matters to the world economy is impossible to quantify. In the ideal world, we would like to know how much it cost to send one thousand men's shirts from Bangkok to Geneva in 1955, and to track how that cost changed as containerization came into use. Such data do not exist, but it seems clear that the container brought sweeping reductions in the cost of moving freight. From a tiny tanker laden with a few dozen containers that would not fit on any other vessel, container shipping matured into a highly automated, highly standardized industry on a global scale. An enormous containership can be loaded with a minute fraction of the labor and time required to handle a small conventional ship half a century ago. A few crew members can manage an oceangoing vessel longer than three football fields. A trucker can deposit a trailer at a customer's loading dock, hook up another trailer, and drive on immediately, rather than watching his expensive rig stand idle while the contents are removed. All of those changes are consequences of the container revolution. Transportation has become so efficient that for many purposes, freight costs do not much effect economic decisions. As economists Edward L. Glaeser and Janet E. Kohlhase suggest, \"It is better to assume that moving goods is essentially costless than to assume that moving goods is an important component of the production process.\" Before the container, such a statement was unimaginable.6 "}, "p_4415678845": {"origin": "http://press.princeton.edu/chapters/s9383.html", "text": " A modern containerport is a factory whose scale strains the limits of imagination. At each berth--the world's biggest ports have dozens--rides a mammoth oceangoing vessel, up to 1,100 feet long and 140 feet across, carrying nothing but metal containers. The deck is crowded with row after row of them, red and blue and green and silver, stacked 15 or 20 abreast and 6 or 7 high. Beneath the deck are yet more containers, stacked 6 or 8 deep in the holds. The structure that houses the crew quarters, topped by the navigation bridge, is toward the stern, barely visible above the stacks of boxes. The crew accommodations are small, but so is the crew. A ship carrying 3,000 40-foot containers, filled with 100,000 tons of shoes and clothes and electronics, may make the three-week transit from Hong Kong around the Cape of Good Hope to Germany with only twenty people on board.4 "}, "p_4534500375": {"origin": "http://www.smh.com.au/news/business/how-the-invention-of-a-box-changed-our-world/2006/06/11/1149964409162.html%0A", "text": "Containerisation has also had a big effect on economic\ngeography, which Levinson defines neatly as the study of \"who makes\nwhat where\". When transport costs were high, manufacturers tended\nto locate close to their customers, even where this required\nundesirably small plants or high operating costs."}, "p_4650723957": {"origin": "http://www.smh.com.au/news/business/how-the-invention-of-a-box-changed-our-world/2006/06/11/1149964409162.html%0A", "text": "\nWelcome to The Sydney Morning Herald. \nSkip directly to: Search Box, \nSection Navigation, \nContent.\nText Version.\n"}, "p_4651141694": {"origin": "http://www.smh.com.au/news/business/how-the-invention-of-a-box-changed-our-world/2006/06/11/1149964409162.html%0A", "text": "The great benefit of containerisation, of course, was to\nsignificantly reduce transport costs. When goods were handled\nseparately, just the cost of moving cargo from land transport to\nship, and then from ship to land transport at the other end,\naccounted for half the door-to-door shipping cost."}, "p_4730091478": {"origin": "http://press.princeton.edu/chapters/s9383.html", "text": " Getting from the Ideal-X to a system that moves tens of millions of boxes each year was not an easy voyage. Both the container's promoters and its opponents sensed from the very beginning that this was an invention that could change the way the world works. That first container voyage of 1956, an idea turned into reality by the ceaseless drive of an entrepreneur who knew nothing about ships, unleashed more than a decade of battle around the world. Many titans of the transportation industry sought to stifle the container. Powerful labor leaders pulled out all the stops to block its ascent, triggering strikes in dozens of harbors. Some ports spent heavily to promote it, while others spent huge sums for traditional piers and warehouses in the vain hope that the container would prove a passing fad. Governments reacted with confusion, trying to figure out how to capture its benefits without disturbing the profits, jobs, and social arrangements that were tied to the status quo. Even seemingly simple matters, such as the design of the steel fitting that allows almost any crane in any port to lift almost any container, were settled only after years of contention. In the end, it took a major war, the United States' painful campaign in Vietnam, to prove the merit of this revolutionary approach to moving freight. "}, "p_4817739425": {"origin": "http://www.smh.com.au/news/business/how-the-invention-of-a-box-changed-our-world/2006/06/11/1149964409162.html%0A", "text": "The first effect of containerisation was on the stevedoring and\nmaritime industries. Many thousands of wharf labourers lost their\njobs around the world, and some old and unsuitable ports (such as\nNew York and Liverpool) went into sharp decline while new, more\nspacious ports (such as Seattle and Felixstowe) grew up. The\nobvious benefit of reduced transport costs is increased trade -\nboth within countries and between countries - and thus greater\nexploitation of the \"gains from trade\", including from comparative\nadvantage, specialisation and scale economies."}, "p_4888119199": {"origin": "http://www.smh.com.au/news/business/how-the-invention-of-a-box-changed-our-world/2006/06/11/1149964409162.html%0A", "text": "\"In 1956, the world was full of small manufacturers selling\nlocally; by the end of the 20th century, purely local markets for\ngoods of any sort were few and far between,\" Levinson says."}, "p_5131860172": {"origin": "http://press.princeton.edu/chapters/s9383.html", "text": " Every day at every major port, thousands of containers arrive and depart by truck and train. Loaded trucks stream through the gates, where scanners read the unique number on each container and computers compare it against ships' manifests before the trucker is told where to drop his load. Tractor units arrive to hook up chassis and haul away containers that have just come off the ship. Trains carrying nothing but double-stacked containers roll into an intermodal terminal close to the dock, where giant cranes straddle the entire train, working their way along as they remove one container after another. Outbound container trains, destined for a rail yard two thousand miles away with only the briefest of stops en route, are assembled on the same tracks and loaded by the same cranes. "}, "p_5172036094": {"origin": "http://www.smh.com.au/news/business/how-the-invention-of-a-box-changed-our-world/2006/06/11/1149964409162.html%0A", "text": "MONDAY COMMENT"}, "p_538459015": {"origin": "http://press.princeton.edu/chapters/s9383.html", "text": " This book contends that, just as decades elapsed between the taming of electricity in the 1870s and the widespread use of electrical power, so too did the embrace of containerization take time. Big savings in the cost of handling cargo on the docks did not translate immediately into big savings in the total cost of transportation. Transportation companies were generally ill-equipped to exploit the container's advantages, and their customers had designed their operations around different assumptions about costs. Only with time, as container shipping developed into an entirely new system of moving goods by land and sea, did it begin to affect trade patterns and industrial location. Not until firms learned to take advantage of the opportunities the container created did it change the world. Once the world began to change, it changed very rapidly: the more organizations that adopted the container, the more costs fell, and the cheaper and more ubiquitous container transportation became.13  "}, "p_5486311084": {"origin": "http://press.princeton.edu/chapters/s9383.html", "text": " Some scholars have argued that reductions in transport costs are at best marginal improvements that have had negligible effects on trade flows. This book disputes that view. In the decade after the container first came into international use, in 1966, the volume of international trade in manufactured goods grew more than twice as fast as the volume of global manufacturing production, and two and a half times as fast as global economic output. Something was accelerating the growth of trade even though the economic expansion that normally stimulates trade was weak. Something was driving a vast increase in international commerce in manufactured goods even though oil shocks were making the world economy sluggish. While attributing the vast changes in the world economy to a single cause would be foolhardy, we should not dismiss out of hand the possibility that the extremely sharp drop in freight costs played a major role in increasing the integration of the global economy. 10 "}, "p_5580205152": {"origin": "http://press.princeton.edu/chapters/s9383.html", "text": " "}, "p_57021289": {"origin": "http://press.princeton.edu/chapters/s9383.html", "text": " Mysteriously, the container has escaped all three of these very lively fields of research. It has no engine, no wheels, no sails: it does not fascinate those captivated by ships and trains and planes, or by sailors and pilots. It lacks the flash to draw attention from those who study technological innovation. And so many forces have combined to alter economic geography since the middle of the twentieth century that the container is easily overlooked. There is, half a century after its arrival, no general history of the container.17  "}, "p_5746393375": {"origin": "http://press.princeton.edu/chapters/s9383.html", "text": "\n"}, "p_6211642584": {"origin": "http://www.smh.com.au/news/business/how-the-invention-of-a-box-changed-our-world/2006/06/11/1149964409162.html%0A", "text": "Standardisation also brings \"network economies\". The more people\nuse containers, the more attractive it is for others to join them.\nThe more people join, the greater the benefit to those already\nusing them."}, "p_621960185": {"origin": "http://press.princeton.edu/chapters/s9383.html", "text": " This high-efficiency transportation machine is a blessing for exporters and importers, but it has become a curse for customs inspectors and security officials. Each container is accompanied by a manifest listing its contents, but neither ship lines nor ports can vouch that what is on the manifest corresponds to what is inside. Nor is there any easy way to check: opening the doors at the end of the box normally reveals only a wall of paperboard cartons. With a single ship able to disgorge 3,000 40-foot-long containers in a matter of hours, and with a port such as Long Beach or Tokyo handling perhaps 10,000 loaded containers on the average workday, and with each container itself holding row after row of boxes stacked floor to ceiling, not even the most careful examiners have a remote prospect of inspecting it all. Containers can be just as efficient for smuggling undeclared merchandise, illegal drugs, undocumented immigrants, and terrorist bombs as for moving legitimate cargo.5 "}, "p_622804685": {"origin": "http://press.princeton.edu/chapters/s9383.html", "text": " These savings in freight costs, in inventory costs, and in time to market have encouraged ever longer supply chains, allowing buyers in one country to purchase from sellers halfway around the globe with little fear that the gaskets will not arrive when needed or that the dolls will not be on the toy store shelf before Christmas. The more reliable these supply chains become, the further retailers, wholesalers, and manufacturers are willing to reach in search of lower production costs--and the more likely it becomes that workers will feel the sting of dislocation as their employers find distant sources of supply. "}, "p_6285899008": {"origin": "http://www.smh.com.au/news/business/how-the-invention-of-a-box-changed-our-world/2006/06/11/1149964409162.html%0A", "text": "\"Quicker handling and less time in storage translated to faster\ntransit from manufacturer to customer, reducing the cost of\nfinancing inventories sitting unproductively on railway sidings or\nin pierside warehouses awaiting a ship,\" Levinson says."}, "p_6464769022": {"origin": "http://www.smh.com.au/news/business/how-the-invention-of-a-box-changed-our-world/2006/06/11/1149964409162.html%0A", "text": "They're made of aluminium or steel to a set design, with a\nwooden floor and two enormous doors at one end. Fully packed, they\nweigh 27 to 36 tonnes each. A fully loaded container ship carries\nabout 3000 of them, in stacks six or seven high."}, "p_6483441009": {"origin": "http://press.princeton.edu/chapters/s9383.html", "text": " This process was so expensive that in many cases selling internationally was not worthwhile. \"For some commodities, the freight may be as much as 25 per cent of the cost of the product,\" two engineers concluded after a careful study of data from 1959. Shipping steel pipe from New York to Brazil cost an average of $57 per ton in 1962, or 13 percent of the average cost of the pipe being exported--a figure that did not include the cost of getting the pipe from the steel mill to the dock. Shipping refrigerators from London to Capetown cost the equivalent of 68 U.S. cents per cubic foot, adding $20 to the wholesale price of a midsize unit. No wonder that, relative to the size of the economy, U.S. international trade was smaller in 1960 than it had been in 1950, or even in the Depression year of 1930. The cost of conducting trade had gotten so high that in many cases trading made no sense.8  "}, "p_6502710797": {"origin": "http://press.princeton.edu/chapters/s9383.html", "text": "File created: 8/7/2007"}, "p_6512828881": {"origin": "http://www.smh.com.au/news/business/how-the-invention-of-a-box-changed-our-world/2006/06/11/1149964409162.html%0A", "text": "Containerisation has made it easier for manufacturers to engage\nin export, but also made it more necessary as they face greater\ncompetition from imports. So it's turned a lot more firms into\ntransnational corporations and increased the share of trade\n(exports plus imports) in national economies."}, "p_6774057422": {"origin": "http://www.smh.com.au/news/business/how-the-invention-of-a-box-changed-our-world/2006/06/11/1149964409162.html%0A", "text": "IN APRIL 1956 a crane lifted 58 aluminium boxes aboard an ageing\ntanker ship in Newark, New Jersey. Five days later, the\nIdeal-X sailed into Houston, where 58 trucks waited to take\non the boxes and haul them to their destinations."}, "p_6776777085": {"origin": "http://www.smh.com.au/news/business/how-the-invention-of-a-box-changed-our-world/2006/06/11/1149964409162.html%0A", "text": "The effects of all this on workers have been mixed. Some have\nbeen displaced from their jobs and some have never been able to\nregain employment. In aggregate, however, these costs have been far\noutweighed by the material benefits to everyone: a far wider range\nof imported goods to choose from and lower relative prices for all\nthe goods we buy."}, "p_6977919312": {"origin": "http://press.princeton.edu/chapters/s9383.html", "text": "\n"}, "p_7033433428": {"origin": "http://www.smh.com.au/news/business/how-the-invention-of-a-box-changed-our-world/2006/06/11/1149964409162.html%0A", "text": "Producers move from high-wage to low-wage countries, eventually\ncausing wage levels in all countries to converge. (And prompting\nsmart countries - which don't include us - to emphasise the greater\neducation and training of their workers.)"}, "p_7047709867": {"origin": "http://press.princeton.edu/chapters/s9383.html", "text": "Book Description | Reviews | Table of Contents"}, "p_7210955998": {"origin": "http://www.smh.com.au/news/business/how-the-invention-of-a-box-changed-our-world/2006/06/11/1149964409162.html%0A", "text": "This has led to massive reductions in manufacturers' inventories\nand correspondingly huge cost savings. Retailers have applied the\nsame lessons to reduce their own inventory costs."}, "p_7240715731": {"origin": "https://id.ndl.go.jp/auth/ndlna/00576479", "text": "以下のリンクボタンから国立国会図書館サーチで検索ができます。You can search NDL bibliographic records for the following headings:"}, "p_7439275354": {"origin": "http://press.princeton.edu/chapters/s9383.html", "text": " Economists have devoted serious effort to studying the geographic implications of transport costs only since the early 1990s. This new stream of work shows formally what common sense suggests. When transport costs are high, manufacturers' main concern is to locate near their customers, even if this requires undesirably small plants or high operating costs. As transportation costs decline relative to other costs, manufacturers can relocate first domestically, and then internationally, to reduce other costs, which come to loom larger. Globalization, the diffusion of economic activity without regard for national boundaries, is the logical end point of this process. As transport costs fall to extremely low levels, producers move from high-wage to low-wage countries, eventually causing wage levels in all countries to converge. These geographic shifts can occur quickly and suddenly, leaving long-standing industrial infrastructure under-utilized or abandoned as economic activity moves on.15  "}, "p_7533756857": {"origin": "http://www.smh.com.au/news/business/how-the-invention-of-a-box-changed-our-world/2006/06/11/1149964409162.html%0A", "text": "Every container has a unique number. Its contents and progress\naround the world are tracked by computer."}, "p_7626759075": {"origin": "http://www.smh.com.au/news/business/how-the-invention-of-a-box-changed-our-world/2006/06/11/1149964409162.html%0A", "text": "That event is the reason this year is the 50th anniversary of\nthe invention of the shipping container. Before then, most items\nused to be loaded, shipped and unloaded separately, partly on the\nbacks of wharfies."}, "p_7632096574": {"origin": "http://press.princeton.edu/chapters/s9383.html", "text": " Transport efficiencies, though, hardly begin to capture the economic impact of containerization. The container not only lowered freight bills, it saved time. Quicker handling and less time in storage translated to faster transit from manufacturer to customer, reducing the cost of financing inventories sitting unproductively on railway sidings or in pierside warehouses awaiting a ship. The container, combined with the computer, made it practical for companies like Toyota and Honda to develop just-in-time manufacturing, in which a supplier makes the goods its customer wants only as the customer needs them and then ships them, in containers, to arrive at a specified time. Such precision, unimaginable before the container, has led to massive reductions in manufacturers' inventories and correspondingly huge cost savings. Retailers have applied those same lessons, using careful logistics management to squeeze out billions of dollars of costs. "}, "p_7643500140": {"origin": "http://www.smh.com.au/news/business/how-the-invention-of-a-box-changed-our-world/2006/06/11/1149964409162.html%0A", "text": "They could relocate first domestically, then internationally.\nLow transport costs make capital more mobile, increasing the\nbargaining power of employers against their far less mobile\nworkers."}, "p_7710444780": {"origin": "http://press.princeton.edu/chapters/s9383.html", "text": " Even as it helped destroy the old economy, the container helped build a new one. Sleepy harbors such as Busan and Seattle moved into the front ranks of the world's ports, and massive new ports were built in places like Felixstowe, in England, and Tanjung Pelepas, in Malaysia, where none had been before. Small towns, distant from the great population centers, could take advantage of their cheap land and low wages to entice factories freed from the need to be near a port to enjoy cheap transportation. Sprawling industrial complexes where armies of thousands manufactured products from start to finish gave way to smaller, more specialized plants that shipped components and half-finished goods to one another in ever lengthening supply chains. Poor countries, desperate to climb the rungs of the ladder of economic development, could realistically dream of becoming suppliers to wealthy countries far away. Huge industrial complexes mushroomed in places like Los Angeles and Hong Kong, only because the cost of bringing raw materials in and sending finished goods out had dropped like a stone.1 "}, "p_7856328521": {"origin": "http://press.princeton.edu/chapters/s9383.html", "text": " In 1961, before the container was in international use, ocean freight costs alone accounted for 12 percent of the value of U.S. exports and 10 percent of the value of U.S. imports. \"These costs are more significant in many cases than governmental trade barriers,\" the staff of the Joint Economic Committee of Congress advised, noting that the average U.S. import tariff was 7 percent. And ocean freight, dear as it was, represented only a fraction of the total cost of moving goods from one country to another. A pharmaceutical company would have paid approximately $2,400 to ship a truck-load of medicines from the U.S. Midwest to an interior city in Europe in 1960. This might have included payments to a dozen different vendors: a local trucker in Chicago, the railroad that carried the truck trailer on a flatcar to New York or Baltimore, a local trucker in the port city, a port warehouse, a steamship company, a warehouse and a trucking company in Europe, an insurer, a European customs service, and the freight forwarder who put all the pieces of this complicated journey together. Half the total outlay went for port costs.7 "}, "p_7919129918": {"origin": "http://press.princeton.edu/chapters/s9383.html", "text": " On April 26, 1956, a crane lifted fifty-eight aluminum truck bodies aboard an aging tanker ship moored in Newark, New Jersey. Five days later, the Ideal-X sailed into Houston, where fifty-eight trucks waited to take on the metal boxes and haul them to their destinations. Such was the beginning of a revolution. "}, "p_7948163342": {"origin": "http://press.princeton.edu/chapters/s9383.html", "text": " The subject of this book lies at the confluence of several major streams of research. One delves into the impact of changes in transportation technology, a venerable subject for both historians and economists. The steamship, invented in the 1780s and put to regular use by 1807, strengthened New York's prominence as a port, and the Erie Canal, an undertaking of unprecedented size, had an even greater impact. The radical decline in ocean freight rates during the nineteenth century, the result of technological change and improved navigation techniques, encouraged a huge increase in world trade and added to Europe's eagerness to found colonies. The connection between railroad development and U.S. economic growth has been debated strenuously, but there is little dispute that lower rail freight rates increased agricultural productivity, knitted the North together before the Civil War, and eventually made Chicago the hub of a region stretching a thousand miles to the west. A transport innovation of the 1880s, the refrigerated railcar, made meat affordable for average households by allowing meat companies to ship carcasses rather than live animals across the country. The truck and the passenger car reshaped urban development starting in the 1920s, and more recently commercial aviation redrew the economic map by bringing formerly isolated communities within a few hours of major cities. This book will argue that container shipping has had a similarly large effect in stimulating trade and economic development--and that, as with steamships, railroads, and airplanes, government intervention both encouraged and deterred its growth.11  "}, "p_8190423534": {"origin": "http://press.princeton.edu/chapters/s9383.html", "text": " By far the biggest expense in this process was shifting the cargo from land transport to ship at the port of departure and moving it back to truck or train at the other end of the ocean voyage. As one expert explained, \"a four thousand mile voyage for a shipment might consume 50 percent of its costs in covering just the two ten-mile movements through two ports.\" These were the costs that the container affected first, as the elimination of piece-by-piece freight handling brought lower expenses for longshore labor, insurance, pier rental, and the like. Containers were quickly adopted for land transportation, and the reduction in loading time and transshipment cost lowered rates for goods that moved entirely by land. As ship lines built huge vessels specially designed to handle containers, ocean freight rates plummeted. And as container shipping became inter-modal, with a seamless shifting of containers among ships and trucks and trains, goods could move in a never-ending stream from Asian factories directly to the stockrooms of retail stores in North America or Europe, making the overall cost of transporting goods little more than a footnote in a company's cost analysis.9  "}, "p_8208917893": {"origin": "http://www.smh.com.au/news/business/how-the-invention-of-a-box-changed-our-world/2006/06/11/1149964409162.html%0A", "text": "News Store Alert will keep you informed. Find out more"}, "p_8267115902": {"origin": "http://press.princeton.edu/chapters/s9383.html", "text": "\n"}, "p_8315974652": {"origin": "http://www.smh.com.au/news/business/how-the-invention-of-a-box-changed-our-world/2006/06/11/1149964409162.html%0A", "text": "The invention of the container offers a fascinating example of\nthe way technological change leads to higher productivity, which\nlowers costs per unit and so prompts increased economic activity\nand higher material living standards."}, "p_8345579836": {"origin": "http://www.smh.com.au/news/business/how-the-invention-of-a-box-changed-our-world/2006/06/11/1149964409162.html%0A", "text": "But the high cost of transporting heavy or bulky items tends to\ngive the production of those items a form of \"natural protection\".\nAnd the significant reduction in transport costs has greatly\nreduced that protection."}, "p_8426932275": {"origin": "http://www.smh.com.au/news/business/how-the-invention-of-a-box-changed-our-world/2006/06/11/1149964409162.html%0A", "text": "Containerisation probably deserves a bigger share of the credit\nfor this growth than most economists have thought to give it. They\ntend to focus on man-made protection against imports through\ntariffs and other barriers, and tend to ignore \"transaction costs\"\nsuch as the cost of transport."}, "p_8607310711": {"origin": "http://press.princeton.edu/chapters/s9383.html", "text": " THE WORLD THE BOX MADE "}, "p_8864419451": {"origin": "http://www.healthzine.org/Medicine/emergency-medicine", "text": "The server can not find the requested page:"}, "p_8921831115": {"origin": "http://press.princeton.edu/chapters/s9383.html", "text": " In the yard, a mile-long strip paved with asphalt, the incoming container is driven beneath a stacking crane. The stacker has rubber-tired wheels 50 feet apart, wide enough to span a truck lane and four adjacent stacks of containers. The wheels are linked by a metal structure 70 feet in the air, so that the entire machine can move back and forth above the rows of containers stacked six high. The crane engages the container, lifts it from the transporter, and moves it across the stacks of other containers to its storage location. A few hours later, the process will be reversed, as the stacking crane lifts the container onto a steel chassis pulled by an over-the-road truck. The truck may take the cargo hundreds of miles to its destination or may haul it to a nearby rail yard, where low-slung cars specially designed for containers await loading. "}, "p_8963585003": {"origin": "http://press.princeton.edu/chapters/s9383.html", "text": " Chapter 1   THE WORLD THE BOX MADE   On April 26, 1956, a crane lifted fifty-eight aluminum truck bodies aboard an aging tanker ship moored in Newark, New Jersey. Five days later, the Ideal-X sailed into Houston, where fifty-eight trucks waited to take on the metal boxes and haul them to their destinations. Such was the beginning of a revolution.   Decades later, when enormous trailer trucks rule the highways and trains hauling nothing but stacks of boxes rumble through the night, it is hard to fathom just how much the container has changed the world. In 1956, China was not the world's workshop. It was not routine for shoppers to find Brazilian shoes and Mexican vacuum cleaners in stores in the middle of Kansas. Japanese families did not eat beef from cattle raised in Wyoming, and French clothing designers did not have their exclusive apparel cut and sewn in Turkey or Vietnam. Before the container, transporting goods was expensive--so expensive that it did not pay to ship many things halfway across the country, much less halfway around the world.   What is it about the container that is so important? Surely not the thing itself. A soulless aluminum or steel box held together with welds and rivets, with a wooden floor and two enormous doors at one end: the standard container has all the romance of a tin can. The value of this utilitarian object lies not in what it is, but in how it is used. The container is at the core of a highly automated system for moving goods from anywhere, to anywhere, with a minimum of cost and complication on the way.   The container made shipping cheap, and by doing so changed the shape of the world economy. The armies of ill-paid, ill-treated workers who once made their livings loading and unloading ships in every port are no more, their tight-knit waterfront communities now just memories. Cities that had been centers of maritime commerce for centuries, such as New York and Liverpool, saw their waterfronts decline with startling speed, unsuited to the container trade or simply unneeded, and the manufacturers that endured high costs and antiquated urban plants in order to be near their suppliers and their customers have long since moved away. Venerable ship lines with century-old pedigrees were crushed by the enormous cost of adapting to container shipping. Merchant mariners, who had shipped out to see the world, had their traditional days-long shore leave in exotic harbors replaced by a few hours ashore at a remote parking lot for containers, their vessel ready to weigh anchor the instant the high-speed cranes finished putting huge metal boxes off and on the ship.   Even as it helped destroy the old economy, the container helped build a new one. Sleepy harbors such as Busan and Seattle moved into the front ranks of the world's ports, and massive new ports were built in places like Felixstowe, in England, and Tanjung Pelepas, in Malaysia, where none had been before. Small towns, distant from the great population centers, could take advantage of their cheap land and low wages to entice factories freed from the need to be near a port to enjoy cheap transportation. Sprawling industrial complexes where armies of thousands manufactured products from start to finish gave way to smaller, more specialized plants that shipped components and half-finished goods to one another in ever lengthening supply chains. Poor countries, desperate to climb the rungs of the ladder of economic development, could realistically dream of becoming suppliers to wealthy countries far away. Huge industrial complexes mushroomed in places like Los Angeles and Hong Kong, only because the cost of bringing raw materials in and sending finished goods out had dropped like a stone.1   This new economic geography allowed firms whose ambitions had been purely domestic to become international companies, exporting their products almost as effortlessly as selling them nearby. If they did, though, they soon discovered that cheaper shipping benefited manufacturers in Thailand or Italy just as much. Those who had no wish to go international, who sought only to serve their local clientele, learned that they had no choice: like it or not, they were competing globally because the global market was coming to them. Shipping costs no longer offered shelter to high-cost producers whose great advantage was physical proximity to their customers; even with customs duties and time delays, factories in Malaysia could deliver blouses to Macy's in Herald Square more cheaply than could blouse manufacturers in the nearby lofts of New York's garment district. Multinational manufacturers--companies with plants in different countries--transformed themselves into international manufacturers, integrating once isolated factories into networks so that they could choose the cheapest location in which to make a particular item, yet still shift production from one place to another as costs or exchange rates might dictate. In 1956, the world was full of small manufacturers selling locally; by the end of the twentieth century, purely local markets for goods of any sort were few and far between.   For workers, of course, this has all been a mixed blessing. As consumers, they enjoy infinitely more choices thanks to the global trade the container has stimulated. By one careful study, the United States imported four times as many varieties of goods in 2002 as in 1972, generating a consumer benefit--not counted in official statistics--equal to nearly 3 percent of the entire economy. The competition that came with increased trade has diffused new products with remarkable speed and has held down prices so that average households can partake. The ready availability of inexpensive imported consumer goods has boosted living standards around the world.2    As wage earners, on the other hand, workers have every reason to be ambivalent. In the decades after World War II, wartime devastation created vast demand while low levels of international trade kept competitive forces under control. In this exceptional environment, workers and trade unions in North America, Western Europe, and Japan were able to negotiate nearly continuous improvements in wages and benefits, while government programs provided ever stronger safety nets. The workweek grew shorter, disability pay was made more generous, and retirement at sixty or sixty-two became the norm. The container helped bring an end to that unprecedented advance. Low shipping costs helped make capital even more mobile, increasing the bargaining power of employers against their far less mobile workers. In this highly integrated world economy, the pay of workers in Shenzhen sets limits on wages in South Carolina, and when the French government ordered a shorter workweek with no cut in pay, it discovered that nearly frictionless, nearly costless shipping made it easy for manufacturers to avoid the higher cost by moving abroad.3       A modern containerport is a factory whose scale strains the limits of imagination. At each berth--the world's biggest ports have dozens--rides a mammoth oceangoing vessel, up to 1,100 feet long and 140 feet across, carrying nothing but metal containers. The deck is crowded with row after row of them, red and blue and green and silver, stacked 15 or 20 abreast and 6 or 7 high. Beneath the deck are yet more containers, stacked 6 or 8 deep in the holds. The structure that houses the crew quarters, topped by the navigation bridge, is toward the stern, barely visible above the stacks of boxes. The crew accommodations are small, but so is the crew. A ship carrying 3,000 40-foot containers, filled with 100,000 tons of shoes and clothes and electronics, may make the three-week transit from Hong Kong around the Cape of Good Hope to Germany with only twenty people on board.4   On the wharf, a row of enormous cranes goes into action almost as soon as the ship ties up. The cranes are huge steel structures, rising 200 feet into the air and weighing more than two million pounds. Their legs stretch 50 feet apart, easily wide enough for several truck lanes or even train tracks to pass beneath. The cranes rest on rails running parallel to the ship's side, so that they can move forward or aft as required. Each crane extends a boom 115 feet above the dock and long enough to span the width of a ship broader than the Panama Canal.   High up in each crane, an operator controls a trolley able to travel the length of the boom, and from each trolley hangs a spreader, a steel frame designed to lock onto all four top corners of a 40-ton box. As unloading begins, each operator moves his trolley out the boom to a precise location above the ship, lowers the spreader to engage a container, raises the container up toward the trolley, and pulls trolley and container quickly toward the wharf. The trolley stops above a rubber-tired transporter waiting between the crane's legs, the container is lowered onto the transporter, and the spreader releases its grip. The transporter then moves the container to the adjacent storage yard, while the trolley moves back out over the ship to pick up another box. The process is repeated every two minutes, or even every ninety seconds, each crane moving 30 or 40 boxes an hour from ship to dock. As parts of the ship are cleared of incoming containers, reloading begins, and dockside activity becomes even more frenzied. Each time the crane places an incoming container on one vehicle, it picks up an outbound container from another, simultaneously emptying and filling the ship.   In the yard, a mile-long strip paved with asphalt, the incoming container is driven beneath a stacking crane. The stacker has rubber-tired wheels 50 feet apart, wide enough to span a truck lane and four adjacent stacks of containers. The wheels are linked by a metal structure 70 feet in the air, so that the entire machine can move back and forth above the rows of containers stacked six high. The crane engages the container, lifts it from the transporter, and moves it across the stacks of other containers to its storage location. A few hours later, the process will be reversed, as the stacking crane lifts the container onto a steel chassis pulled by an over-the-road truck. The truck may take the cargo hundreds of miles to its destination or may haul it to a nearby rail yard, where low-slung cars specially designed for containers await loading.   The colorful chaos of the old-time pier is nowhere in evidence at a major container terminal, the brawny longshoremen carrying bags of coffee on their shoulders nowhere to be seen. Terry Malloy, the muscular hero played by Marlon Brando in On the Waterfront, would not be at home. Almost every one of the intricate movements required to service a vessel is choreographed by a computer long before the ship arrives. Computers, and the vessel planners who use them, determine the order in which the containers are to be discharged, to speed the process without destabilizing the ship. The actions of the container cranes and the equipment in the yard all are programmed in advance. The longshoreman who drives each machine faces a screen telling him which container is to be handled next and where it is to be moved--unless the terminal dispenses with longshoremen by using driverless transporters to pick up the containers at shipside and centrally controlled stacker cranes to handle container storage. The computers have determined that the truck picking up incoming container ABLQ 998435 should be summoned to the terminal at 10:45 a.m., and that outgoing container JKFC 119395, a 40-foot box bound for Newark, carrying 76,800 pounds of machinery and currently stacked at yard location A-52-G-6, will be loaded third from the bottom in the fourth slot in the second row of the forward hold. They have ensured that the refrigerated containers are placed in bays with electrical hookups, and that containers with hazardous contents are apart from containers that could increase the risk of explosion. The entire operation runs like clockwork, with no tolerance for error or human foibles. Within twenty-four hours, the ship discharges its thousands of containers, takes on thousands more, and steams on its way.   Every day at every major port, thousands of containers arrive and depart by truck and train. Loaded trucks stream through the gates, where scanners read the unique number on each container and computers compare it against ships' manifests before the trucker is told where to drop his load. Tractor units arrive to hook up chassis and haul away containers that have just come off the ship. Trains carrying nothing but double-stacked containers roll into an intermodal terminal close to the dock, where giant cranes straddle the entire train, working their way along as they remove one container after another. Outbound container trains, destined for a rail yard two thousand miles away with only the briefest of stops en route, are assembled on the same tracks and loaded by the same cranes.   The result of all this hectic activity is a nearly seamless system for shipping freight around the world. A 35-ton container of coffeemakers can leave a factory in Malaysia, be loaded aboard a ship, and cover the 9,000 miles to Los Angeles in 16 days. A day later, the container is on a unit train to Chicago, where it is transferred immediately to a truck headed for Cincinnati. The 11,000-mile trip from the factory gate to the Ohio warehouse can take as little as 22 days, a rate of 500 miles per day, at a cost lower than that of a single first-class air ticket. More than likely, no one has touched the contents, or even opened the container, along the way.   This high-efficiency transportation machine is a blessing for exporters and importers, but it has become a curse for customs inspectors and security officials. Each container is accompanied by a manifest listing its contents, but neither ship lines nor ports can vouch that what is on the manifest corresponds to what is inside. Nor is there any easy way to check: opening the doors at the end of the box normally reveals only a wall of paperboard cartons. With a single ship able to disgorge 3,000 40-foot-long containers in a matter of hours, and with a port such as Long Beach or Tokyo handling perhaps 10,000 loaded containers on the average workday, and with each container itself holding row after row of boxes stacked floor to ceiling, not even the most careful examiners have a remote prospect of inspecting it all. Containers can be just as efficient for smuggling undeclared merchandise, illegal drugs, undocumented immigrants, and terrorist bombs as for moving legitimate cargo.5     Getting from the Ideal-X to a system that moves tens of millions of boxes each year was not an easy voyage. Both the container's promoters and its opponents sensed from the very beginning that this was an invention that could change the way the world works. That first container voyage of 1956, an idea turned into reality by the ceaseless drive of an entrepreneur who knew nothing about ships, unleashed more than a decade of battle around the world. Many titans of the transportation industry sought to stifle the container. Powerful labor leaders pulled out all the stops to block its ascent, triggering strikes in dozens of harbors. Some ports spent heavily to promote it, while others spent huge sums for traditional piers and warehouses in the vain hope that the container would prove a passing fad. Governments reacted with confusion, trying to figure out how to capture its benefits without disturbing the profits, jobs, and social arrangements that were tied to the status quo. Even seemingly simple matters, such as the design of the steel fitting that allows almost any crane in any port to lift almost any container, were settled only after years of contention. In the end, it took a major war, the United States' painful campaign in Vietnam, to prove the merit of this revolutionary approach to moving freight.   How much the container matters to the world economy is impossible to quantify. In the ideal world, we would like to know how much it cost to send one thousand men's shirts from Bangkok to Geneva in 1955, and to track how that cost changed as containerization came into use. Such data do not exist, but it seems clear that the container brought sweeping reductions in the cost of moving freight. From a tiny tanker laden with a few dozen containers that would not fit on any other vessel, container shipping matured into a highly automated, highly standardized industry on a global scale. An enormous containership can be loaded with a minute fraction of the labor and time required to handle a small conventional ship half a century ago. A few crew members can manage an oceangoing vessel longer than three football fields. A trucker can deposit a trailer at a customer's loading dock, hook up another trailer, and drive on immediately, rather than watching his expensive rig stand idle while the contents are removed. All of those changes are consequences of the container revolution. Transportation has become so efficient that for many purposes, freight costs do not much effect economic decisions. As economists Edward L. Glaeser and Janet E. Kohlhase suggest, \"It is better to assume that moving goods is essentially costless than to assume that moving goods is an important component of the production process.\" Before the container, such a statement was unimaginable.6   In 1961, before the container was in international use, ocean freight costs alone accounted for 12 percent of the value of U.S. exports and 10 percent of the value of U.S. imports. \"These costs are more significant in many cases than governmental trade barriers,\" the staff of the Joint Economic Committee of Congress advised, noting that the average U.S. import tariff was 7 percent. And ocean freight, dear as it was, represented only a fraction of the total cost of moving goods from one country to another. A pharmaceutical company would have paid approximately $2,400 to ship a truck-load of medicines from the U.S. Midwest to an interior city in Europe in 1960. This might have included payments to a dozen different vendors: a local trucker in Chicago, the railroad that carried the truck trailer on a flatcar to New York or Baltimore, a local trucker in the port city, a port warehouse, a steamship company, a warehouse and a trucking company in Europe, an insurer, a European customs service, and the freight forwarder who put all the pieces of this complicated journey together. Half the total outlay went for port costs.7   This process was so expensive that in many cases selling internationally was not worthwhile. \"For some commodities, the freight may be as much as 25 per cent of the cost of the product,\" two engineers concluded after a careful study of data from 1959. Shipping steel pipe from New York to Brazil cost an average of $57 per ton in 1962, or 13 percent of the average cost of the pipe being exported--a figure that did not include the cost of getting the pipe from the steel mill to the dock. Shipping refrigerators from London to Capetown cost the equivalent of 68 U.S. cents per cubic foot, adding $20 to the wholesale price of a midsize unit. No wonder that, relative to the size of the economy, U.S. international trade was smaller in 1960 than it had been in 1950, or even in the Depression year of 1930. The cost of conducting trade had gotten so high that in many cases trading made no sense.8    By far the biggest expense in this process was shifting the cargo from land transport to ship at the port of departure and moving it back to truck or train at the other end of the ocean voyage. As one expert explained, \"a four thousand mile voyage for a shipment might consume 50 percent of its costs in covering just the two ten-mile movements through two ports.\" These were the costs that the container affected first, as the elimination of piece-by-piece freight handling brought lower expenses for longshore labor, insurance, pier rental, and the like. Containers were quickly adopted for land transportation, and the reduction in loading time and transshipment cost lowered rates for goods that moved entirely by land. As ship lines built huge vessels specially designed to handle containers, ocean freight rates plummeted. And as container shipping became inter-modal, with a seamless shifting of containers among ships and trucks and trains, goods could move in a never-ending stream from Asian factories directly to the stockrooms of retail stores in North America or Europe, making the overall cost of transporting goods little more than a footnote in a company's cost analysis.9    Transport efficiencies, though, hardly begin to capture the economic impact of containerization. The container not only lowered freight bills, it saved time. Quicker handling and less time in storage translated to faster transit from manufacturer to customer, reducing the cost of financing inventories sitting unproductively on railway sidings or in pierside warehouses awaiting a ship. The container, combined with the computer, made it practical for companies like Toyota and Honda to develop just-in-time manufacturing, in which a supplier makes the goods its customer wants only as the customer needs them and then ships them, in containers, to arrive at a specified time. Such precision, unimaginable before the container, has led to massive reductions in manufacturers' inventories and correspondingly huge cost savings. Retailers have applied those same lessons, using careful logistics management to squeeze out billions of dollars of costs.   These savings in freight costs, in inventory costs, and in time to market have encouraged ever longer supply chains, allowing buyers in one country to purchase from sellers halfway around the globe with little fear that the gaskets will not arrive when needed or that the dolls will not be on the toy store shelf before Christmas. The more reliable these supply chains become, the further retailers, wholesalers, and manufacturers are willing to reach in search of lower production costs--and the more likely it becomes that workers will feel the sting of dislocation as their employers find distant sources of supply.   Some scholars have argued that reductions in transport costs are at best marginal improvements that have had negligible effects on trade flows. This book disputes that view. In the decade after the container first came into international use, in 1966, the volume of international trade in manufactured goods grew more than twice as fast as the volume of global manufacturing production, and two and a half times as fast as global economic output. Something was accelerating the growth of trade even though the economic expansion that normally stimulates trade was weak. Something was driving a vast increase in international commerce in manufactured goods even though oil shocks were making the world economy sluggish. While attributing the vast changes in the world economy to a single cause would be foolhardy, we should not dismiss out of hand the possibility that the extremely sharp drop in freight costs played a major role in increasing the integration of the global economy. 10     The subject of this book lies at the confluence of several major streams of research. One delves into the impact of changes in transportation technology, a venerable subject for both historians and economists. The steamship, invented in the 1780s and put to regular use by 1807, strengthened New York's prominence as a port, and the Erie Canal, an undertaking of unprecedented size, had an even greater impact. The radical decline in ocean freight rates during the nineteenth century, the result of technological change and improved navigation techniques, encouraged a huge increase in world trade and added to Europe's eagerness to found colonies. The connection between railroad development and U.S. economic growth has been debated strenuously, but there is little dispute that lower rail freight rates increased agricultural productivity, knitted the North together before the Civil War, and eventually made Chicago the hub of a region stretching a thousand miles to the west. A transport innovation of the 1880s, the refrigerated railcar, made meat affordable for average households by allowing meat companies to ship carcasses rather than live animals across the country. The truck and the passenger car reshaped urban development starting in the 1920s, and more recently commercial aviation redrew the economic map by bringing formerly isolated communities within a few hours of major cities. This book will argue that container shipping has had a similarly large effect in stimulating trade and economic development--and that, as with steamships, railroads, and airplanes, government intervention both encouraged and deterred its growth.11    The importance of innovation is at the center of a second, and rapidly growing, body of research. Capital, labor, and land, the basic factors of production, have lost much of their fascination for those looking to understand why economies grow and prosper. The key question asked today is no longer how much capital and labor an economy can amass, but how innovation helps employ those resources more effectively to produce more goods and services. This line of research makes clear that new technology, by itself, has little economic benefit. As economist Nathan Rosenberg observed, \"innovations in their early stages are usually exceedingly ill-adapted to the wide range of more specialised uses to which they are eventually put.\" Resistance to new methods can impede their adoption. Potential users may avoid commitments until the future is more certain; as early buyers of Betamax video players can attest, it is risky to bet on a technology that turns out to be a dead end. Even after a new technology is proven, its spread must often wait until prior investments have been recouped; although Thomas Edison invented the incandescent lightbulb by 1879, only 3 percent of U.S. homes had electric lighting twenty years later. The economic benefits arise not from innovation itself, but from the entrepreneurs who eventually discover ways to put innovations to practical use--and most critically, as economists Erik Brynjolfsson and Lorin M. Hitt have pointed out, from the organizational changes through which businesses reshape themselves to take advantage of the new technology.12    This book contends that, just as decades elapsed between the taming of electricity in the 1870s and the widespread use of electrical power, so too did the embrace of containerization take time. Big savings in the cost of handling cargo on the docks did not translate immediately into big savings in the total cost of transportation. Transportation companies were generally ill-equipped to exploit the container's advantages, and their customers had designed their operations around different assumptions about costs. Only with time, as container shipping developed into an entirely new system of moving goods by land and sea, did it begin to affect trade patterns and industrial location. Not until firms learned to take advantage of the opportunities the container created did it change the world. Once the world began to change, it changed very rapidly: the more organizations that adopted the container, the more costs fell, and the cheaper and more ubiquitous container transportation became.13    The third intellectual stream feeding into this book is the connection between transportation costs and economic geography, the question of who makes what where. This connection might seem self-evident, but it is not. When David Ricardo showed in 1817 that both Portugal and England could gain by specializing in making products in which they had a comparative advantage, he assumed that only production costs mattered; the costs of shipping Portuguese wine to England and English cloth to Portugal did not enter his analysis. Ricardo's assumption that transportation costs were zero has been incorporated into economists' models ever since, despite ample real-world evidence that transportation costs matter a great deal.14   Economists have devoted serious effort to studying the geographic implications of transport costs only since the early 1990s. This new stream of work shows formally what common sense suggests. When transport costs are high, manufacturers' main concern is to locate near their customers, even if this requires undesirably small plants or high operating costs. As transportation costs decline relative to other costs, manufacturers can relocate first domestically, and then internationally, to reduce other costs, which come to loom larger. Globalization, the diffusion of economic activity without regard for national boundaries, is the logical end point of this process. As transport costs fall to extremely low levels, producers move from high-wage to low-wage countries, eventually causing wage levels in all countries to converge. These geographic shifts can occur quickly and suddenly, leaving long-standing industrial infrastructure under-utilized or abandoned as economic activity moves on.15    Have declines in the cost of shipping really caused such significant economic shifts? Some scholars doubt that ocean freight costs have fallen very much since the middle of the twentieth century. Others, pointing to the undeniable fact that countries trade much more with neighbors than with distant lands, argue that transportation costs still matter a great deal. The present work intentionally takes a non-quantitative approach in addressing these questions. The data on freight costs from the mid-1950s through the 1970s are so severely deficient that they will never provide conclusive proof, but the undisputed fact that the transportation world raced to embrace containerization is very strong evidence that this new shipping technology significantly reduced costs. Nor does this book employ economic models to prove the container's impact. Given the vast changes in the world economy over a span that saw the breakdown of the exchange-rate system, repeated oil crises, the end of colonialism, the invention of jet travel, the spread of computers, the construction of hundreds of thousands of miles of expressways, and many other developments, no model is likely to be conclusive in distinguishing the impact of containerization from that of the many other forces. Nonetheless, dramatic shifts in trade patterns and in the location of economic activity over the past half century suggest that the connection between containerization and changes in economic geography is extremely strong.16    Mysteriously, the container has escaped all three of these very lively fields of research. It has no engine, no wheels, no sails: it does not fascinate those captivated by ships and trains and planes, or by sailors and pilots. It lacks the flash to draw attention from those who study technological innovation. And so many forces have combined to alter economic geography since the middle of the twentieth century that the container is easily overlooked. There is, half a century after its arrival, no general history of the container.17    In telling the remarkable story of containerization, this book represents an attempt to fill that historical void. It treats containerization not as shipping news, but as a development that has sweeping consequences for workers and consumers all around the globe. Without it, the world would be a very different place.   Return to Book Description File created: 8/7/2007Questions and comments to: webmaster@pupress.princeton.eduPrinceton University Press"}, "p_8977742091": {"origin": "http://press.princeton.edu/chapters/s9383.html", "text": " The container made shipping cheap, and by doing so changed the shape of the world economy. The armies of ill-paid, ill-treated workers who once made their livings loading and unloading ships in every port are no more, their tight-knit waterfront communities now just memories. Cities that had been centers of maritime commerce for centuries, such as New York and Liverpool, saw their waterfronts decline with startling speed, unsuited to the container trade or simply unneeded, and the manufacturers that endured high costs and antiquated urban plants in order to be near their suppliers and their customers have long since moved away. Venerable ship lines with century-old pedigrees were crushed by the enormous cost of adapting to container shipping. Merchant mariners, who had shipped out to see the world, had their traditional days-long shore leave in exotic harbors replaced by a few hours ashore at a remote parking lot for containers, their vessel ready to weigh anchor the instant the high-speed cranes finished putting huge metal boxes off and on the ship. "}, "p_904951329": {"origin": "http://www.smh.com.au/news/business/how-the-invention-of-a-box-changed-our-world/2006/06/11/1149964409162.html%0A", "text": "\"In the decade after the container first came into international\nuse, in 1966, the volume of international trade in manufactured\ngoods grew more than twice as fast as the volume of global\nmanufacturing production, and two and a half times as fast as\nglobal economic output,\" Levinson says."}, "p_9109536534": {"origin": "http://www.smh.com.au/news/business/how-the-invention-of-a-box-changed-our-world/2006/06/11/1149964409162.html%0A", "text": "An important dimension of cost is time. Containerisation allows\nships to be loaded and unloaded much quicker, so they spend less\nidle time in ports. It also allows trucks to pick up or drop off\nfreight without having to wait around while they're packed or\nunpacked."}, "p_9338798372": {"origin": "http://press.princeton.edu/chapters/s9383.html", "text": " Decades later, when enormous trailer trucks rule the highways and trains hauling nothing but stacks of boxes rumble through the night, it is hard to fathom just how much the container has changed the world. In 1956, China was not the world's workshop. It was not routine for shoppers to find Brazilian shoes and Mexican vacuum cleaners in stores in the middle of Kansas. Japanese families did not eat beef from cattle raised in Wyoming, and French clothing designers did not have their exclusive apparel cut and sewn in Turkey or Vietnam. Before the container, transporting goods was expensive--so expensive that it did not pay to ship many things halfway across the country, much less halfway around the world. "}, "p_9404829556": {"origin": "http://www.smh.com.au/news/business/how-the-invention-of-a-box-changed-our-world/2006/06/11/1149964409162.html%0A", "text": "This explains the rapid spread of containerisation, despite the\nefforts of unions and various transport interests to frustrate it\nand the six years or more it took to get agreement on standard\nspecifications, first in the United States, then\ninternationally."}, "p_9611853649": {"origin": "http://press.princeton.edu/chapters/s9383.html", "text": " The importance of innovation is at the center of a second, and rapidly growing, body of research. Capital, labor, and land, the basic factors of production, have lost much of their fascination for those looking to understand why economies grow and prosper. The key question asked today is no longer how much capital and labor an economy can amass, but how innovation helps employ those resources more effectively to produce more goods and services. This line of research makes clear that new technology, by itself, has little economic benefit. As economist Nathan Rosenberg observed, \"innovations in their early stages are usually exceedingly ill-adapted to the wide range of more specialised uses to which they are eventually put.\" Resistance to new methods can impede their adoption. Potential users may avoid commitments until the future is more certain; as early buyers of Betamax video players can attest, it is risky to bet on a technology that turns out to be a dead end. Even after a new technology is proven, its spread must often wait until prior investments have been recouped; although Thomas Edison invented the incandescent lightbulb by 1879, only 3 percent of U.S. homes had electric lighting twenty years later. The economic benefits arise not from innovation itself, but from the entrepreneurs who eventually discover ways to put innovations to practical use--and most critically, as economists Erik Brynjolfsson and Lorin M. Hitt have pointed out, from the organizational changes through which businesses reshape themselves to take advantage of the new technology.12  "}, "p_9671528374": {"origin": "http://www.smh.com.au/news/business/how-the-invention-of-a-box-changed-our-world/2006/06/11/1149964409162.html%0A", "text": "\"The container, combined with the computer, made it practical\nfor companies like Toyota and Honda to develop just-in-time\nmanufacturing, in which a supplier makes the goods its customer\nwants only as the customer needs them and then ships them, in\ncontainers, to arrive at a specified time.\""}, "p_9771252947": {"origin": "http://press.princeton.edu/chapters/s9383.html", "text": "   "}, "p_9838336401": {"origin": "http://www.smh.com.au/news/business/how-the-invention-of-a-box-changed-our-world/2006/06/11/1149964409162.html%0A", "text": "Hardly the most exciting example of technological change, you\nmay think. The containers we see every day being moved on the beds\nof trucks are ugly, uninspiring and very low-tech."}, "p_9859226993": {"origin": "http://www.smh.com.au/news/business/how-the-invention-of-a-box-changed-our-world/2006/06/11/1149964409162.html%0A", "text": "Get free news emails from smh.com.au. Sign-up now"}, "p_9929549271": {"origin": "http://press.princeton.edu/chapters/s9383.html", "text": " The third intellectual stream feeding into this book is the connection between transportation costs and economic geography, the question of who makes what where. This connection might seem self-evident, but it is not. When David Ricardo showed in 1817 that both Portugal and England could gain by specializing in making products in which they had a comparative advantage, he assumed that only production costs mattered; the costs of shipping Portuguese wine to England and English cloth to Portugal did not enter his analysis. Ricardo's assumption that transportation costs were zero has been incorporated into economists' models ever since, despite ample real-world evidence that transportation costs matter a great deal.14 "}}}