{"b4usernames": ["@CNN they should also take in refuges", "@pepokiss @realDonaldTrump didn't know your mom was going to be there?!", "@CNN how about they use their own money and hit the gym", "@shayfromonline let's be honest though, I don't think we really need black help in a swimming situation.", "@StJames_Project @BBCWorld turns out his black privilege card is only accepted in the US. Other countries won't stand for this behavior.", "@CNN the lesson is don't pull over privileged lawyers.", "RT @LanaDelRaytheon: when the mass graves are too much for one war criminal to dig https://t.co/6SE1YLHGKd", "@polNewsForever all after importing cancer.", "@xychelsea what's wrong? Need more tax money for your mental illness? I mean \"transition\"", "@realDonaldTrump let Russia do its job", "@CNN https://t.co/tAlTrPJY55", "@CNN https://t.co/WNxcuU8ntg", "@vicenews tasty https://t.co/TkpRBh6CNC", "@sam_rothenberg @polNewsForever what?! I learn something new everyday.", "@sam_rothenberg @Bilderbergh @polNewsForever have you actually been on Pol? Half of them are gay", "@sam_rothenberg @polNewsForever the jew has a point.", "@CNN thank god trump is safe", "RT @realDonaldTrump: #FraudNewsCNN #FNN https://t.co/WYUnHjjUjg", "@ShitlordUSA white lesbian, pastor. Imagine my shock. https://t.co/D0qfcnMHbG", "@Jung_us_Koelle you sound like the type who would hand over their wallet to a mugger while muttering thank you and apologies.", "@Jung_us_Koelle @FierceDeity300 @AcidicMem @rampage_misfit @ajplus because the white guy wouldn't resist.", "@Mighty_Mike01 @FISHERALUMNI @CNN tweets and gifs are free, dipshit", "@RichardHaass @realDonaldTrump I don't think journos have to worry about getting shot up at a baseball game.", "@Hashtag_New_Fad @NPR no proof. Only logic. Where is proof that assad did it?", "@NPR the rebels attacked their own in desperation", "@BevHillsAntifa I don't think he returned it.", "@VICE lifting the ban could mean death for queer Americans", "@ajplus stop funding terrorism.", "@playbill  @Lin_Manuel yeah cheap slave labor!", "@ajplus the media calling someone inflammatory.. That's rich.", "@CNN let's hear more about Russia.", "@CNN must be the rising sea level", "@polNewsForever I bet a lot of cops post though", "@20committee Russia story looking more and more dead everyday. You promised John.", "@CNN @CNNOpinion the UN and the Clintons took turns on Haiti.", "@vicenews now that's privilege. Anyone else would be fired.", "@AJEnglish you wouldn't want a junkie working at a pharmacy.", "@CNN that biker needs a sidecar for his huge balls.", "@MattDrooby @thehill so no proof? That's what I thought.", "@MattDrooby @thehill the burden of proof normally lands on those who made the claim. Well?", "@GlomarResponder @KevinJacksonTBS and they probably already spent it.", "@Its_Johanny @CNN what? That some Hollywood liberals couldn't buy an election in GA?  Yeah, total BS.", "@broadly well on the bright side, at least it wasn't a jew this time.", "@ajplus I think you mean \"will they be used against Qatar?\"", "@ajplus they shouldn't have broken the law.", "@DaveGass sorry, alt right is doing the Lord's work. https://t.co/yWua8uNu5i", "@ShitlordUSA P", "Giving the media the silent treatment and it is working. They are breaking alright https://t.co/V61YMCU5SJ", "@CNN  Kim just became the darling of the left. Along side Castro, Guevara, and Mao.", "@TheAVClub who got the role of the Clintons?", "@vicenews 2017. this is the year the reporter became the story.", "@4chansbest reverse grip", "@HDSlogic @ajplus lol Christian is his name, Retard. And he is a Bernie bro", "@TuffBlue @thehill really? More people died at the pulse shooting than all right-wing attacks in the past twenty years.", "@VICE guy totally looks like he's sliced a few off", "@20committee @NTarnopolsky dude, Germany gave up on preservation a long time ago.", "@girl_daisey @RawStory @realDonaldTrump don't you look like an idiot?", "@ShitlordUSA you have a gf?", "@AJENews smh typical Bernie supporter", "@CNN the fat ass kids here would accidentally eat the toy inside", "@neontaster looks like?", "@Thomas1774Paine it's a shame people have to be rewarded.", "@trutherbotornge this is kurt eichenwalds wife... You did it again", "@ShawnSRocks @CNN yeah, some of them troll fox 24/7. #life", "@ABC lol this guy a new Super villain?", "@spang99 @ABC wtf are you going to do about it?", "@anthagiox @Scout202sport if it means Affirmative action, welfare and getting to  blame my own failures on the success of others? Maybe", "@sallykohn @washingtonpost Maga here. Please let this be the end of kushner", "@AltRightWI @ShitlordUSA lol the left can have their fag Harry Potter. I'm with Tolkien", "@ajplus lol some of these are funny", "@ajplus that's a serious amount of self inflicted attacks and hoaxes!", "@ajplus it's OK. Qatar will take them in. Won't you?", "Food must've been terrible https://t.co/xp1Air5IFf", "@Salon good for him", "@PolitiFact and how could you prove that? WL go through great lengths to protect anonymity.", "@MetCC @helloiammariam because it is easier to pursue mean people on the Internet than combating Islamic scumbag terrorist.", "@ajplus what did that Muslim Statistic at the end even have to do with it?", "@ajplus what weren't they wearing? Was it a hijab?  A hijab?? I have to know. Was it a hijab?", "@Shoshweeetx @D_Althab205 @staugy @sparkdega @ajplus as lethal as a bomb?", "@_NotFakeNews_ you are fake news.", "@nprmusic @Harry_Styles npr is a bunch of middle aged fags stuck inside a bubble. They obviously don't get out much.", "@VICE I guess that's what happens when you legalize Marijuana", "@icryclouds @ajplus yes. Borders would protect these migrants from mean old Europe.", "@GraceTheUnknown @CCoppertop @casschrysler in a country with 13% black population. You math much?", "@ajplus how many people will even know about the civil war 100 years from now.", "@ajplus I LOVE THIS GUY", "@GlomarResponder places like College of the Ozarks are an alternative to the Universities of public high school.", "@thehill that doesn't make any sense", "@ajplus @DearWhitePeople really wish someone would leave me bananas.", "@ajplus and you wonder why they only make up a 1/3 of Parliament..", "@ajplus just using her kid as a political statement.", "@AmaniQuinnea @girlswithtoys we literally refuse to be victims while you thrive on your grievances. How as that turned out for each of us?", "@ajplus he does have a point", "@VICE strange. it's usually real news the left does like to report or talk about.", "@Justin12393LEE @HillaryClinton no", "@VICE and the right hates her for pandering to the left", "@Salon they are a lot quicker than Clinton's then", "@ajplus I wouldn't go to France", "@sallykohn @France24_en but woman president and stuff.", "@LeviSmithUSA 3 million views...", "@ShitlordUSA I love mark demaco", "@TanyaKasim @ajplus US?", "@PAYOLETTER the best part comes after \"actually\"", "@ajplus notice these claims of racism are never caught on cam..", "@vdare @CNN_Oppmann but only one is allowed to do it.", "@VICE wonderful 6th grade answer vice... But no.", "@ramzpaul 8. Racist!", "@SarcasticRover how does a tongue boil while it's frozen?", "@NoiseyMusic no", "@Salon build the wall", "Just realized  #maddow and Sally kohn are not the same dude..", "@ajplus he expired before the drugs did", "@ajplus we don't need monuments or history. we have the media to remind us of racism and tell us what happend.", "@DailyCaller bill nye is not a scientist as well has a politician", "@neontaster but I never got to say it..", "@qc_me @ajplus what about the gays?!", "@DailyCaller what civil war?", "@BevHillsAntifa was this filmed with a carrot? It's 2017 enough terrorist cell phone quality!", "@NishikiPrestige I wonder how many got ripped off buying those ak on armslist", "@RedPillDropper @RichardBSpencer I hope a based black dude just hangs out there for his \"reparations\" then throws on a Maga hat and walks", "@MarkPygas @realDonaldTrump oopsie https://t.co/FF6SsjNCk2", "@ajplus we get it. Liberals are racist.", "@ajplus hoax", "@Big_Daddy382 @ajplus I missed the part where they said it was Christians?", "@RailrodeMike @thehill to you.. Patriotism!", "@RailrodeMike @thehill hillary made money selling her position at wh to the highest bidder", "@RailrodeMike @thehill who am I defending?", "@RailrodeMike @thehill white trash? yep!\nPatriot? You really set that bar low.", "@Forever_Lucid wait is the person filming speaking Arabic too?", "@goatburgler @thehill lol prison", "@thehill they had to fact check that?", "@ajplus @brianschatz @maziehirono any reason to push @ChelseaClinton and broadcast what she says.", "@ajplus @brianschatz @maziehirono @ChelseaClinton is he wrong?", "@polNewsNet last one didn't make any sense. he's pro assad?", "@FreeMemesKids that last one was actually French too", "RT @FreeMemesKids: https://t.co/8u8XefN1WQ", "@motherboard @VICE @NoiseyMusic better question, who's been microwaving fish?", "@JackPosobiec @VesselNews now Is the time to unload your $600 sks on armslist", "@bakedalaska assad did nothing wrong", "@ajplus more acting lessons?", "@Dallas4Bernie @hartzfeld_rick (continued) no matter who you tax..", "@Dallas4Bernie @hartzfeld_rick  progressive policy is making America what it is today. Prog entitlements are not sustainable.", "@ajplus they should be more embarrassed about their deadbeat parents", "@TEN_GOP lol it brings me joy watching them fail", "@thehill coincidence?", "@rolandscahill  @realDonaldTrump the first tweet of Easter is the most sacred of tweets.", "@CNN the Clintons want that back", "@20committee @BrianJonesOK yeah we know what your peepee looks like..", "@ajplus assad did nothing wrong", "@ajplus @ACLU unless it's wrongthink. We call that hate speech", "@VICE respect Muslim culture, you Islamophobs.", "@russell_sievers @RichardBSpencer lol pickup truck. you going to load them up like livestock? Don't forget your whip, racist.", "@thehill 2m? normally a plea deal is involved.", "@sallykohn you gotta sloppy memory dude", "@sayed_ridha @politico it was really good cake", "@ArtWendeley @SH32328951 no seriously what is your expertise?", "@bravenak @cwindt99 @FoxNews educate yourself on f&amp;f before you make yourself look even more ridiculous", "@DailyCaller now? after we bombed them?", "@NPR @washingtonpost fisa warrants are passed out like candy. 99% of warrants get approved. It's not that hard.", "@Salon look at salon asking meaningful questions! Proud of you guys", "On @npr just now: \"it's a high bar to get a fisa warrant\" \nRejection rate: less than 1 percent", "@SuperiorGab @HoneyBabyLovato @trustnorminah Chechnya is an Islamic country that is why media doesn't care.", "@HuffingtonPost why? Is he trilingual?", "@politico nope just a neocon stooge", "@ajplus @united @emirates @RoyalJordanian anything for a buck", "@thehill so do trumps supporters", "@20committee @united are we still crying about that? Oh, turns out he's a weird perv. Birds of a feather", "@4chansbest Africa is a country. Duh", "@TocRadio @DailyCaller best part is she knows he's a dude", "@Salon when they become the shooters I guess", "@D_Althab205 @BxbbyTrill @ajplus  take a look at their tl. Nothing but spin and half truth. Al banna and the racist airbnb in recent memory", "@ajplus those selected text don't make any sense. why not show all of the text?", "@ajplus this is completely false and taken out of context. Suh tried to screw over host and got booted then cried racism", "@ajplus is this what Beyonce used?", "@realwesmyers 4 more years of public school", "@ColtCabana @united then you have a weak stomach", "@MachinePix at least no one would know you pissed yourself", "@LilEgoStar @VICE lol this tweet is hilarious when read out loud. Try it!", "@ramzpaul maybe but he needs to stop bending backwards for them. Lot of good people got the boot to make left happy", "@ikolatasii @ajplus are Muslims worse than Asians?", "Now the @20committee and @realDonaldTrump love/assgrab fest begins", "@NPR we bitch about the lack of parenting in black community. when black parents discipline their kids media shames them.", "@leithfadel how many Chem weapons taken out? Any?", "Trump just threw away the 2020 election over syria.", "@20committee @AP you neocons are hard to please. You got your war dumbass. Not enough?", "@Team_Trump45 the last trump supporter..", "RT @realDonaldTrump: What I am saying is stay out of Syria.", "@stranahan this week alone has seen many changes. I think it's a foretelling of what is going to be the Whitehouse for now on.", "@ajplus the horror", "@skar_canal_skar @AnimeRightMemes awooo by lim Kim :)", "@IzzyBaezeli @ajplus why are you comparing Moroccans to intolerant right wingers? That's their culture. Not cool dude.", "@IzzyBaezeli @America_1st_ lol what's wrong? Couldn't defend your racist Moroccan remarks so you scoured my feed", "@madkins66 @ajplus they are not profiting off of war you say?", "@SeanMcElwee lead paint? Quite sure there is better things to spend money on to protect kids. Try again.", "@IzzyBaezeli @ajplus @LiseGvH @pierrevh17 @APechtold the attackers were Moroccan. Islamophobic much?", "@Twilord @SenSanders good question! Also Indian men.", "@thehill so they are rejecting the money?", "@ajplus syria doesn't seem so bad", "@thefourthdegree @CNN I'm sorry. Just ignorant sobriety talking.", "@CNN go after the real drug dealers, pharmaceutical companies", "@CNN abused? Is there a responsible way to use heroin?", "@motherboard lol big score", "@False_Nobody \"a good concept\"  what?", "@ajplus it's not a privilege to be kidnapped", "@VICE @vicecanada lol that shit is written?", "@BevHillsAntifa that's not a stop sign", "@HuffingtonPost the wrapper is the tastiest looking thing about that sandwich", "@vicenews no. No he has not.", "@Salon you never learn. What was the last one? Pissgate or something?", "@ajplus you don't think people should have that right to choose?", "@Breaking911 why would any hack Lil Marco?", "@vicenews @HBO free housing", "@ajplus community organizers are getting hard to find.", "@patriotthinker  @CNN are you retarded. I was defending trump.", "@ajplus you can die from suicide? Thanks aj", "@maysenstgermain @patriotthinker @CNN it's his job to recognize. If he didn't you'd be blasting him for being silent.", "@CNN so Mexico is essentialy a concentration camp?", "@NoiseyMusic @gorillaz women guitarist", "@thehill me too. It would be fun to watch Joe lose", "@CNN it would be revenge to have to watch her.", "@vicenews but illegals are the ones doing it. So, Win win.", "@CNN like going on CNN?", "@MustyPalmTree I see. Troll on", "@MustyPalmTree @sharp_sonya @IfIWereObama @HuffingtonPost when your only argument is \"but the Christians\" you don't have one.", "@HuffingtonPost stop. you push the agenda that allows for attacks like these to happen", "@DailyCaller you mean Cruz?", "@NPR they look like idiots", "@ShayneTheAries @ajplus #AmericaFirst", "@NoiseyMusic yeah, clean sheets is just the thing that room needs..", "@telefunkenu46 @thehill found this on your tl. https://t.co/IcKkhBghB4", "@polNewsNetwork1 lol the guy pissing on the side of the house", "@PizzaParty_Pepe @phloob @Brannon1776 https://t.co/RhBiOdxd6C", "@ArianeBellamar @CNN @ICEgov you should look up the definition of police.", "@CNN worst judge. So cops shouldn't arrest criminals at court by that logic.", "@CNN when is trump's set?", "@NPR do they have national propaganda radio too?", "@ajplus I guess that's what happens when you act tough and flick your cig at a guy with spray", "@pitchfork @azizansari @MasterofNone @netflix please no", "@Regulator2408 @ajplus @marcorubio \"bitches ain't shit but hoes and tricks\" \n-Snoop Dogg", "@Delo_Taylor \"resistcapitalism\" yeah I don't think you have room to talk about world hunger dude. Nice try", "@thehill when fake news reports people read real news", "@motherboard it's as fake as Hollywood?", "@pitchfork is the @rockhall still taken seriously by anyone?", "@ajplus how did they get there if they don't burn oil?", "@ajplus wth happened to these people. Used to such a great civilization.", "@PizzaPartyBen where was anon when we were looking for bin Laden?", "@CNN take note. this will change politics forever.", "@Syricide funny thing is that the Samsung remote is the one listening for the cia.", "@premierguitar not prince", "@SeanMcElwee it's nice to see some bipartisanship", "@Evan_McMullin @mindyfinn @StandUpRepublic  what kind of weird bronie shit is this?", "@Duracell how many AA's does that truck take?", "@AnimeRightMemes I can't find this song. Can you help me?", "@thehill a week?", "@HuffingtonPost what's Islamophobia? Is it bad?", "@kjksccr @halstark88 @AMuller65 @SamuelLJackson \"you'll believe whatever they want to, also muh Russians\"", "@VICE at last, there is one lib outlet not calling for Bush reelection", "@EnglishRussia1 what is Ukraine? Is it in Russia?", "@vicenews Pepsi with baby flavoring.", "@MomsThoughts simple*", "@ajplus @SenSchumer haha he made a donut joke so we are OK with him being a dumbass", "@garethfenley @ajplus you're right. Pesticides and other chemicals are far more critical to bees than climate change. Very misleading info.", "@WSJ @WSJMoneyBeat and less stable", "@CNN is this going to be another black church burning hoax?", "@therealroseanne get a real one", "@NBCNightlyNews did they catch (((who))) did it yet?", "@CNN giving himself another award I see.", "@20committee omg the entire government is working for putin! https://t.co/mhpXOnpG9x", "@thehill first graham and McCain bromance now this. birds of a feather.", "@EnglishRussia1 this is the country that beat us to space..", "@HuffingtonPost like you are doing now?", "@sweden maybe the new bearded rapist of Sweden will evolve too", "@CNN I'd like to hear about his trips to syria", "@Salon weighed in at what? A small whale?", "@polNewsNetwork1 rare CNN pepe", "@marciebp @moftsoney @netflix do your own homework", "@AJEnglish https://t.co/X07XushDYS", "@NBCNightlyNews imagine all that free stuff she would give us.", "@VICE this was like a week ago", "@TheAVClub says the media puppet", "@pitchfork I bet it sucks for bands when nationalist are fans. Then everyone and their grandma are asking you if you'll denounce. Who cares?", "@politico how does this little weirdo keep finding jobs?", "@kicksb4rent_ @ajplus they passed warning stot bill a mere one year after that. She got f'd and Florida's retarded", "@kicksb4rent_ @ajplus that was in Florida. They have strict laws and mandatory sentences for warning shots. She should have shot him.", "@CNN that's sad. Also, you're very fake news.", "@CNN @keithellison looking forward to tomorrow?  #cnnleaks", "@HuffingtonPost they all say\"do your job\". because that's all they were told to say.", "@Deplorable_Pugs it was a bad trade off. Huge debt for mediocre (at best) growth.", "@CNN China. The same country where millions of female babies were killed because of a preference towards males?", "@politico he has also out worked obama", "@CNN are your masters ok with this?", "@heyjoshhaines it means she know knows what it stands for. Don't plead ignorance for her.", "@heyjoshhaines thousands of feminist marched under her organization. I'm sure linda knows a lot more about sharia than you.", "@heyjoshhaines @Mitt_Fit @LawlessPirate Linda sarsour", "@ScottSthlm @20committee in Stockholm?", "@StellaRosa82 @deborahskyrim @ShaunKing false", "@ajplus Sweden will take him", "@mic true, and blacks are more likely the kill you than whites.", "@ObamaMalik I found one that was already in a sack. Does that count?", "@D_Althab205 @rababness @yearsofyou @ajplus it's OK. Bana fooled lots of people. Don't feel bad.", "@ResistanceEndor why do people keep regurgitating this? A counter to an argument that isn't even there.", "@polNewsNetwork1 what's wrong with hangers?", "@CNN what's going on? Is this a token?", "@Daddy_Warpig  what else would you call it?", "@AntiGlib @PerryHeenis @SheriffClarke lol yeah that wasn't scripted at all.", "@CNN didn't even notice", "@ajplus any Asians offended or just a bunch of whiney white libs?", "@CNN anything other than Harry Potter?", "@ajplus lol https://t.co/4S5yjvEZv3", "@CNN immigration?", "@CNN so nasa scientist deserve special treatment?", "@ajplus lol Qatar and Saudi royalty are bummed that they can't buy the White House anymore", "@ajplus how many houses did Obama buy after his presidency?", "@HuffingtonPost Busta Whines", "@Salon I'd say he deserves it if he has to touch that land whale", "@TheAVClub because they are going out of business and aren't even a thing anymore", "@PizzaPartyBen 190k followers? What", "@drawandstrike @AnonimosHdroxos a phone with a blank screen.", "@HuffingtonPost you care more about that than Warren lieing about her ethnicity to further her education and career", "@TedBusiek yeah you were right. Pakistan is apparently south Asian.", "@TedBusiek this was my afterthought. Asia covers a lot of people. South Asian region could throw numbers maybe", "@MullerRuler @ajplus not to mention blacks are treated like garbage there too", "@MullerRuler @ajplus because rape by migrant is normal. This is unique and newsworthy.", "@CNN he is a human trafficker and probably used them for cheap labor", "@JackPMoore @GQMagazine like no one deserves aids", "@ajplus pretty sure that says more about the opposition than it does trump", "@MrOnyx1 @CNN haha yeah man you get that 10 year old! Boom!", "That's it? https://t.co/HOgl1fzPLd", "@PelirrojoPat they'll be the only ones without diabetes", "@OmanReagan what's wrong with your eye dude https://t.co/UZq5DLsSPT", "@ajplus or maybe it's protection against the sue happy lgblt people.", "@BrookingsInst there are Asians that scored lower than 350?", "@kamel_hatahet  @ajplus it should always be covered no matter who is in office.", "@kamel_hatahet  @ajplus I'm not defending either of them. I'm condemning the media for using dead children whenever it's convenient.", "@kamel_hatahet @chrisuch @ajplus are you stupid or something?  Reread it.", "@kamel_hatahet @chrisuch @ajplus then why the coverage all the sudden? I had to really search for these stories during Obama. Sick", "@NBCNightlyNews @NBCNewYork apparently a failed governor would make a good president", "@MarkRuffalo this kind of protection our streams need? https://t.co/tgpBOKMNz9", "It is important for us the protect the free speech and rights of the lbgt community. Unless they disagree with us politicaly #MiloatCal", "@VICE that's just a wmd.", "The state of solid. https://t.co/eklxpohXf2", "@pitchfork @Msldemarco I like mark demaco. He's good at the guitar.", "@Salon and how is that going?", "@20committee @besnikpula @BalkanInsight you were in a biker gang right?", "@lifebythecreek @20committee  The shooters must be Muslim or something", "@20committee you ever get tired of being wrong?", "@neontaster I have to refollow you every other week because somehow I unfollow?", "@politico @POLITICOMag good read", "RT @Brannon1776: NPR salaries. pretty good racket for being the propaganda arm of the degenerate radical left. @NPR https://t.co/GgbA1ZAEQn", "@ajplus @BadlandsNPS I wonder if they gave up burning fuel.", "@CliftonB @MachinePix yeah, you would probably have to get in the pond too..", "@mulatta10 @KamalaHarris they're gay?!", "@MachinePix couldn't you just submerge the tank then lift it", "@RT_com ever heard of a boat?", "@politico @HillaryClinton picking out a nursing home for her and Bill?", "@CNN it wasn't putin at all, just an actor. More fake news!", "@thehill so snl skits are news now?", "@sophiahase1 @Scotty_T14 @cnnbrk yeah umm, trump is still president. https://t.co/4XJofLO5uB", "@JaceWrites he's getting a little old to be doing snl. That's usually where you start your career..not end it", "@vicenews don't worry.  you'll know what jobs are soon enough.", "@BBCWorld @BBCNews so there are still parents who love their kids", "Just some neo nazi punching Richard Spencer. Nothing to see here.", "@thehill poor Alec thinks this trump thing will be his big break like Bush did for Ferrell", "@gingerland62 @ajplus @OBEYGIANT you're right. I'm sorry. https://t.co/RkvAaLdsOM", "@hayadoin_ @FoxNews @GriffJenkins then they aren't very good press.", "@FoxNews @GriffJenkins I'm pretty sure there are more press than protesters", "Black hoodies fighting establishment and a president who is not \"legitimate\" enough. Irony or stupidity? #DisruptJ20", "@POLITICOLive @WhotelDC crashed on an ad in 20 sec in", "@nytimes he put it in reverse", "@atbobb @TheWhiteInferno @mrlrj2004 @RealAlexJones your protest is full of shit", "@BigRepublitard @thehill it was a good show.", "@thehill bring out the celebs to pacify the dummies", "@Erik_Verduzco lol the guy who politely and gingerly knocks over a newspaper stand", "@Breaking911 what did the cop say?", "@thehill only massive because he is there", "@Salon no, hopefully we learned our lesson.", "@RT_com @scorpionmonitor let them feast on the person responsible", "@thehill divorce her!", "@RJMA03 @ClarkHat @CatlinNya I'd honestly like to say it was on purpose", "@ClarkHat @CatlinNya we all know how effective those agencies are against gorilla wf", "@Oogabooga  @2020fight you can't tell trumps photo is taken right below it and Obama's is a mile away? Scales indeed.", "@vicenews polls don't lie...ever.", "@LawlessPirate \"man\"ning", "@oh_sssh I already knew what it looks like. Just wonder why they would tweet about artwork and not show the piece. Twitter is a visual aswel", "@oh_sssh @BBCWorld @BBCNews very good. So did I, but most people don't.", "@BBCWorld @BBCNews why don't you show a picture of it?", "@BBCWorld @BBCNews says the guy who built his career on it", "@nutsackjunior @skybluemonty @JamesOKeefeIII probably to james' profile pic", "@justicenow503 @nytimes lol and it's probably the same 11% who also believe in bigfoot", "@ajplus he's got a point", "@politico @POLITICOMag rest of US thinks it's alright too!", "@nytimes @Watching miss this show, but I'm glad it's not on anymore. It would be nothing but politics and agenda", "@20committee sorry John, the gop has been the traitor for quite some time now. Time to say your goodbyes", "@TradPost9000 I like how he says poopoo", "@20committee like the one he gave reporters today?", "@MStewartWrites @StephenKing a guy who could barely get out \"if\" a wordsmith?", "@CNN I wish someone would do this to me", "@goldenglobes @MichaelKeaton no one cares anymore.", "@20committee maybe the anti russian hysteria is finally wearing off", "@thehill where can I get that hat though", "@20committee @147DW @McnealyGeorge I thought US was Islam's ally?", "@markcubsfan @thehill I really hope you're right about that last part.", "@mattkleinkeys do you really have pictures of yourself pointing at the sky while wearing scarves?", "@ajplus he's got a  point", "@thehill yeah I guess you can look at it that way if you ignore fabricated and manipulated jobs and stats", "@thehill I hope pence writes \"is gay\" next to it.", "@PrisonPlanet msm is loathing the fact that putin holds more influence their fake news", "@thehill haha I feel like he's done this before?", "@ajplus thoughts? https://t.co/KCz4SNKfS8", "@ajplus 1. Deported more ppl than any other president. \n2,3,4,&amp;5...?", "@RealAlexJones @infowars Japan should give the swede refuge bc his home is too dangerous", "@Breaking911 did hillary cut them a deal?", "@Sadieisonfire https://t.co/UqfDAEVoni", "@ajplus who will be the first to put it to their butt", "@RT_com great, as if moths weren't annoying enough.", "@vicecanada @VICE what is this fake bull shit you show me??", "@AndreatheWade @CNN we don't have to buddy up. There will be a response. Hopefully after Jan 20th.", "Kicking out 35 Russians is Obama saying good luck to US diplomats in Russia.", "@CNN what a coward. Doing such destructive actions on the way out the door.", "@FoxBusiness @Trumpocrats they better accept food stamps", "@premierguitar I use my false tooth sometimes.", "@SugarMama7 @valwayne @thehill looks like you already ate it all. https://t.co/y41c2HlHW7", "@BradwayJeff I know. I was trying to see if you could make the connection on your own. Very good.", "@TheThespar @senaer75 @BradwayJeff \"oh muh gawd this proof what an idiot\" https://t.co/MLLxey8FUF", "@TheThespar @BradwayJeff a businessman conducted business in Saudi. Where exactly did you think that was going to go? lol", "@TheThespar @senaer75 @BradwayJeff well this just proves how wrong I was. Oh wait, no it doesn't.", "@BradwayJeff @TheThespar @senaer75 ditto. I'm sure we both wouldn't want foreign manipulation in our politics, though.", "@TheThespar @senaer75 @BradwayJeff a lot better than a Saudi backed Clinton admin.", "@PizzaPartyBen @Zanting dog filter is gateway to beastialty and that's not good", "@PrisonPlanet @infowars probably just because he was speaking Arabic.", "@Sadieisonfire they got halfman? Not looking good for the infidels", "@thehill he vaguely looks familiar", "@JaydenCrowder don't they have a guy in the Trump admin? What's his name... Bannon?", "@ajplus and we all know the Syrian boy was a staged photo op", "@ajplus Russia is killing your isis friends. Get over it.", "@Team_Trump45 is it supposed to look like him? Creepy.", "@ajplus trannys were last months flavor. Try to keep up", "@CNN why do their protest look different from our \"protest\"", "@nytimes year is not over yet. There's still time...", "@WSJ I came for funny comments and left disappointed", "@ajplus best year ever.", "@Crazyinnasia the aussies made a dog.", "@vicenews quadrupled because there are now more users.", "@ShawnStingel @jorgeodaviriato @nytimes @nytopinion what's wrong with your nipples?", "@ajplus hillary could eat a baby and you would still shill", "@ajplus where is kellyanne Conway?", "@LawlessPirate has anyone taken the Un seriously in recent years?", "@thehill is she a celebrity?", "@angryam3 @Stannisthemann2 agree, our rape culture is out of hand https://t.co/Ij0ZudpOrv", "@CNN this will be proven wrong by scientists a year from now", "@motherboard they should shoot back", "@unsavoryagents Teach me.", "@etotoucan @thehill https://t.co/Ci1VwnGtzc", "@JayFivekiller was this fact checked?", "@thehill it's funny how a fictional show is so boring compared to real life politics.", "@EvilGary101 yeah what gives! I wanted him to appoint 20k a year, unsuccessful, college dropouts.", "@HuffingtonPost wth is an iconic feminist?", "Arabs #BoycottDelta making it the safest airlines in the world.", "@wingding341 @Delta @KatlynS19 no you're good. Most Filipinos aren't competent enough to come up with hoaxes like that.", "@AJEnglish must be nice to not work for a living", "@ajplus we'll just delete it when they get put in the interment camps", "@glennbobsmith31 @CruisingGallows @kathi1_va @nagevpon3 @GeorgeTakei https://t.co/ZZKc2YYDyk", "@thehill are they legal, though", "@PolitiFact California is still in terrible shape compared to Texas.", "@PeteGiorgianni @jaketapper they are all Democrats,  so yeah you're probably right about nothing will happen.", "@ewok4est @CNN they are saying \"shame\" on the the lady", "@LisaAmaArchin @RobeyTwitt @raiden41x @ajplus didn't Muhammad marry a nine year old? Maybe pedophilia isn't the best way to defend Islam..", "@ajplus would you say he was radicalized by leftist propaganda?", "@Gcarter3 @CNN no she will probably win. A cop won a similar case involving a campaign yard sign.", "@ajplus well that was an awkward reach..", "@CBallroom your ballroom is not a good ballroom.", "@benshapiro https://t.co/rpssoIived", "@RT_com he did the same with Obama", "@nytimes can't pay the fine, don't do the crime.", "@NoiseyMusic oh no you didn't! Noise got that sasss", "@matthewpa_to @ajplus blacks still don't make as much as other races, but hey at least they are on the currency right?", "@ajplus Canada and u.s in a contest of who is the least racist while offering these empty gestures", "@JohnRiversX4 why aren't there any lbgt zombies? Literally shaking and whatnot.", "@ShitpostBot5000 this one actually makes sense", "@ClarkHat \"under socialism it will be necessary\"  couldn't agree more.", "@ABudazyfy @CNN @camanpour good meme but that's not an appropriate use of a \"I'll leave this here\".", "@CNN dang hackers", "RT @OperationAutism: Last straight man desperately fends off mob trying to inject him with the gay in the year 2020 https://t.co/EOKsyh06py", "@NoiseyMusic @guitarcenter their workers do nothing.", "@JeanneB1962 @CNN Obama cabinet was picked by citibank", "@politico @realDonaldTrump @HillaryClinton because Democrats love throwing away their money #recount", "@GlomarResponder @BuzzFeed OK, so where is my 0.07 gay I am owed?", "@EnglishRussia1 what a creep", "@ImRand__ @martinmchendry @Vestra_Culpa @GodfreyElfwick @ShaunKing yes he did.", "@CNN THEN WE WILL FORCE THEM.", "@VICE it's cute when celebs pretend to be scientists.", "@PrisonPlanet too bad it wasn't Merkel", "RT @4chansbest: /pol/ goes to McDonald's https://t.co/m4GnGcyA7d", "@motherboard how many tweets do you need to become a czar?", "@CNN I was wowed when I thought the boat was cycle powered. Now I just feel tricked", "@Superior_to_God standard issue western style clothes and brands so they fit in amongst American citizens", "@thedcworldnews @DailyCaller too late you're done", "@ajplus sounds good to me.", "@nytimes nothing the Chinese do surprise me anymore.", "@CNN trump is in more danger than Obama ever was. The left are thuggish animals.", "@thehill a phone call had to be organized?", "@HuffingtonPost Huffington Compost doesn't matter", "@HouseCracka @wikileaks there are other people that work for WL", "@DrJillStein throw more money at it", "@ajplus I thought it was pretty cool.", "@thehill probably how poor college kids felt when they forked over their monthly allowance to Bernie.", "@DrJillStein @algore @NBCNews you still won't win.", "@CNN lol the triggering. And from CNN.", "@ajplus I'd rather receive mean letters than get stabbed.", "@_JasonMahone @CNN @TeeChipOfficial no one wants your shitty cups", "@CNN very timely. Covered a plane wreck in South America has it was going down but waited a day on this.", "@DrJillStein you're the only fraud I see.", "@aquafairy_ze @ajplus @____PantheR @OhioState @AJENews you were saying?", "@HuffingtonPost worked didn't it?", "@Salon dang you guys have been around for a while.", "@SputnikInt https://t.co/16o1zz12tT", "@AJEnglish will she take a trade?", "@CNN protection from who?.... Oh, that's right.", "RT @AJENews: Cuba's Fidel Castro has died aged 90, Cuban state television reports. https://t.co/qhwvEe3OBq https://t.co/LM5SWGC3OX", "@CNN Jill is not done... wasting other people's money", "@SputnikInt @ClintonFdn a little late don't you think", "@CNN also gets rid of insects", "@JohnRiversX2 @jartaylor @AmRenaissance don't know, but I've found two more people to follow.", "@CNN makes sense. half of them are soulless inanimate people.", "@Sadieisonfire there's voting booths at my local mall", "@WhiskeyNeon make more podcast", "@Sadieisonfire we should fake a nuclear war then", "RT @EnglishRussia1: Tips from Russian youtube: \"How to cock Makarov pistol single-handedly\" https://t.co/cdw0v1PuLy", "@EnglishRussia1 I'm going to try this, unloaded though..  I love my maky", "@trumpsterMG Bob knows it's not worth the ribbon it hangs on.", "@MrPatriarch @TIME cmon, that was an easy one..", "@NBCNightlyNews ouch", "@Cernovich so is anyone devoted to this yet?", "@ajplus coming from a Wallstreet sellout who has no cred left", "@CNN fake news", "@0hour https://t.co/sGBKOog5fK", "RT @EnglishRussia1: Driving in Russia https://t.co/8Tqk9oyKIh", "@ajplus your master isn't going to be happy about this", "@VICE what a shitty flow that tweet has.", "@CNN do they have a rape hotline to report rape", "@ajplus  this video proves a well organized and well funded global whitelash... Systematically.", "@ajplus would it be that way if it was blm?", "@thehill that's about how many illegals voted.", "@politico @POLITICOEurope it's contagious", "@nytimes why can't people be honest and admit they don't have a clue", "@ajplus at least big banks didn't pick for him like dear old obama", "Trump and Brexit. A new poll shows that nobody believes polls anymore.", "@ajplus @MerriamWebster lol the left has been spouting it for years and now wants to know what they really mean.", "@ajplus because immigration worked out so well for them", "RT @bm27_uragan: Pro-gov soldier has a close call with rocket in Aleppo https://t.co/bJbs5eST3v", "@BryceMcLeod22 @JohnRiversToo this is so satisfying", "@PizzaPartyBen that swastika is legit.", "@ajplus Clinton stole votes from them", "@deplorablemax1 @realDonaldTrump if you support trump, don't buy this shit", "@ajplus can't hear anything over all the winning", "@Salon so what you're saying is.. they're not.", "@ThePhil @wikileaks sometimes truth doesn't seem impartial, but in the end it's just facts.", "@peterdaou rioting and destroying public property part of liberal values?", "@CNN why are these idiots saying no!? Obviously not motorcyclist here.", "@ajplus she bbq'd children. sicko", "@nytimes omg they're like 12 years old!", "@ajplus treadmill should've finished the job..", "@ajplus I wouldn't think so..", "RT @Timmy________: @ScottInSC @sawmilltaters https://t.co/M3QGYVcQvT", "RT @CNN: Pack of mongooses swarm golf tournament in South Africa, temporarily halting play https://t.co/VeUQ0MpyKB https://t.co/FMs5CSnx5e", "@gracie_katt  They'll find out they were just fear mongering a month from now. But only want all the fans to act and think the same as them.", "@jasian12345 they'll be at war with each in a week.", "@DailyCaller oh so women can't win an election? Sexist", "@ajplus you're all losing steam. Hope you took pics", "Going to buy my first pair of #newbalance tomorrow. Thank you for your patriotism. Block TPP. @newbalance", "@BBCNewsAsia @BBCNews that hooked hammer though..", "@thehill already marching in nyc, Denver, San Francisco...", "@CNN aww man, I want to change my vote... Oh wait, no I don't!", "@starfucker now shut up and play and enough of the fear mongering. BTW, ain't been shit since Jupiter.", "@ItB_LikeThat @big_o_97 anarchy symbol is in a different color and style.", "@muslgrl19975 @yeezusreloaded @CNN you're wasting your time. You really think he knows who goldwater is?", "@SeanMcElwee 8*", "@VICE I'm sure they have a very indepth insight.", "@harrismazari @ajplus I said he WASN'T one of the rapey ones. geez...", "@ajplus lucky they didn't get one of the rapey ones", "@wikileaks thank you. Without you, it would still be just speculation.", "Trump elected and still bringing in the crowds #TrumpProtest #maga", "Trump sure can bring a crowd. He still got it!  #protest", "@MQuicho9182 you going to have open borders right?", "@ajplus and we couldn't have done it without trump.", "@pitchfork that doesn't even make sense. You suffered a terrorist attack?", "RT @PrisonPlanet: HELLO DARKNESS MY OLD FRIEND. #NotMyPresident https://t.co/WuXXhJGYZO", "@nytimes @tomfriedman @nytopinion tell that to homeless people", "@HuffingtonPost whoa, looks crazy...", "@SputnikInt @realDonaldTrump America first", "Five years after #Calexit: famine, corruption, mass illegal immigration into America... again.", "Trump is redrawing the border line right now. IQ of both countries are expected to rise as a result. #Calexit", "RT @wikileaks: New York Times: \"How our forecasts have changed\" https://t.co/UjxTmEOyIq", "#NeverTrump crowd on Clinton's loss: \"I did that\".", "@Jasperge107 @NeilTurner_ literally shaking I'm laughing so hard", "@ajplus Maga, son.", "@HuffingtonPost MAGA", "@AJEnglish poor, white, southern, looking for a hand out", "@lnvestorpreneur I don't like it either. I'd rather him start lower and pull ahead at the end", "@Salon good", "@ajplus @MiamiHerald I'm glad outlets endorsed this year. Let's me see who is a fraud and who is reporting.", "@JHurley_Tweets don't order. They don't support wl", "@VICE looks sad and shitty", "@CNN you guys are literally a fraud.", "@starshine9160 @americanradical @CNN read some wikileaks", "@MomsDement @GlomarResponder they're empty right now", "@motherboard @VICE stop tweeting yourself", "@Lisacon111 @HuffingtonPost @RealRyanReid @ladygaga https://t.co/Kvp2IUhwXy", "RT @wikileaks: @desantis We have been under unrelenting DDoS attacks over the last 24h", "@HuffingtonPost then why are you hiding the arm band?", "@PrisonPlanet another week and it will be a ramp", "@pitchfork @marilynmanson does he still have fans now that the mall goths have grown up", "@VICE @NoiseyMusic one has the fan base of millions of uneducated whites, the other is running for president", "@BreitbartNews does dixville have lead in their water", "@JohnRiversToo wtf those faggots", "@ajplus what do you expect from liberal ivy league", "#ImVotingBecause Hillary is leading in Qatar and Saudi Arabia", "RT @IAm2skilled: #ElectionFinalThoughts #Election2016 #draintheswamp https://t.co/KZZ4vCRxcb", "@Salon is that joke about how dead people are voting hillary?", "@ajplus @realDonaldTrump he is tweeting as you say this", "@DailyCaller hide yo interns, hide yo kids", "@PolitiFact anyone saying \"truth-o-meter\" probably isn't very accurate on their \"truthyness\"", "@RT_com wrong music", "That's cause she won't have to live through the 4 years of lies and corruption. https://t.co/ZJHwK3n3PW", "@MyPresidentme @wikileaks I support trump, but these bots are so Goddanm annoying. I'm trying to read important stuff. Gtfo.", "@AJEnglish we don't have homeless citizens. That's why we are taking in your refugees", "@th3j35t3r fed", "@nytimes https://t.co/lUxChQH8dY", "@politico @realDonaldTrump I liked Podesta's rough draft better.", "@PolitiFact @PolitiFactOhio Pedesta cool with you tweeting this?", "@rosieglow2010 @Salon yeeeeaah... https://t.co/TPEQVWaQAI", "@lindasm87705438 @BreitbartNews if Michelle had been photographed like that my eyes would bleeding", "@Xircuits @BuzzFeedNews lol if you have to ask, maybe I did mean conversation.", "@thehill his best joke ever", "@BuzzFeedNews everyone for metric is too dumb to do conversations I guess", "@ajplus Dang Korea knows how to do it. Watch and learn u.s", "@HuffingtonPost @HuffPostPol Omg! I'm changing my vote to hillary. Thank you Huffington for shedding light on this grave injustice.", "RT @donnabrazile: Please God, let this end soon", "@MMFlint @YouTube You're not a true liberal. You just know that Retard libs will pay you for shit they want to hear.", "@Nauj_1017 @VICE @NoiseyMusic I bet it's the same person", "@DanJoseph78 Is it because he's too expensive or because stagnant wages?", "@KimDotcom @TGowdySC @seanhannity @realDonaldTrump Mike told me to fuck off. What do now?", "RT @foxandfriends: Clinton ally Gov. McAuliffe gave major campaign contributions to FBI official's wife https://t.co/EjqmpCuKAO", "@0HOUR1__ I know jester was a fed. But this makes since too", "I wouldn't be surprised if hillary did dirty deeds herself. Listen for coughing when you go into alleys https://t.co/e3pA0z7aHN", "@ajplus also we should segregate male and female climbers to make sure this little incident doesn't happen again.", "@ajplus photos are sexist. Stop taking pictures.", "@ajplus 18?", "RT @thehill: O'Keefe claims another scalp with new video https://t.co/y3Y1lsT1Wo https://t.co/fwbsH7X41A", "@thehill he's irrelevant.", "@VICE summer Isles! Suck it!", "@ajplus until the drawbridge syndrome kicks in and they vote R in 4 years.", "@JoePrich pretty sure most of their viewership is forgotten lobby tvs", "@VICE he looks just like Zimmerman!", "@ajplus https://t.co/rHh1tJ0Kze", "@thehill our next superpower.", "@SeanMcElwee why is he mowing an already cut lawn?", "@JohnDePetroshow the most interesting caller (former Pentagon) and you interrupted and dropped him. Thanks.", "@AlexKGonzalez @AnnCoulter @sallykohn so? one is saying it on stage on national TV one is wearing a shirt", "@TheSteining2016 @WDFx2EU7 @NeilTurner_ I love how they marched him right in front of the camera. That was perfect.", "#trumptapes are the only reason I'm voting for him", "@FrankLuntz @Cernovich I'll sell you a follow or two..", "RT @kgrace3321: Agreed #abrahamhamiltonIII.  #religiouslibertymatters.   @CofOHardWorkU", "RT @b4usernames: So many unspoken things are getting addressed at Pensmore. Preach it Abe #ReligiousLibertyMatters\n@CofOHardWorkU", "RT @RachealCarlyon: What kind of America do you hope for? Are you willing to stand up now?  #religiouslibertymatters @AmericanFamAssc", "RT @IndiaMarieJ: The plague has started, and it has been placed on us to be intercessors. @CofOHardWorkU #ReligiousLibertyMatters #nomore", "RT @IndiaMarieJ: Blessed are the peacemakers. Forge peace out of chaos. @CofOHardWorkU #ReligiousLibertyMatters #Pensmore2016", "RT @RachealCarlyon: What is your showing up moment? Do you have one? Will you have one? -Abraham Hamilton III  #religiouslibertymatters", "RT @CarileenBroeker: Not sorry!! The Media Team and I believe strongly that #ReligiousLibertyMatters @CofOHardWorkU https://t.co/0KbysToyoZ", "RT @IndiaMarieJ: Do not whisper. Speak out! The spiral of silence has no place here. #Pensmore2016 #ReligiousLibertyMatters @CofOHardWorkU", "RT @mclinson: #preach! Abe Hamilton! @AmericanFamAssc #ReligiousLibertyMatters", "RT @kalkemp: Brilliance @CofOHardWorkU #ReligiousLibertyMatters https://t.co/O8BEJrDrrV", "RT @kalkemp: Preach it Abe Hamilton! #ReligiousLibertyMatters @CofOHardWorkU", "RT @CarileenBroeker: \"The Bible is not limited to the type of skin color you have.\" -AH3 #ReligiousLibertyMatters @CofOHardWorkU", "RT @CarileenBroeker: What are you gonna do about promoting religious liberty?! #ReligiousLibertyMatters @CofOHardWorkU", "RT @kalkemp: God planted you and I to be here &amp; positively impact our nation. -Abe Hamilton #ReligiousLibertyMatters @CofOHardWorkU", "RT @kalkemp: Abe Hamilton has inspired me! \"It's about the King of Glory!\" #ReligiousLibertyMatters @CofOHardWorkU", "RT @nataliep2013: \"Sin is sin. It's a sin problem in the world.\" Abe Hamilton III #ReligiousLibertyMatters @CofOHardWorkU @AmericanFamAssc", "RT @nataliep2013: This man can BRING THE WORD #amirite #ReligiousLibertyMatters @CofOHardWorkU", "RT @CofOHardWorkU: Abe Hamilton, you have challenged us all to be faithful citizens. Thank you for your message! #ReligiousLibertyMatters", "RT @IndiaMarieJ: #showup @CofOHardWorkU #Pensmore2016 #ReligiousLibertyMatters", "RT @RachealCarlyon: Allow Christ to flow out of you to meet the issues of our day! -AH3 #ReligiousLibertyMatters\n@AmericanFamAssc", "RT @CarileenBroeker: Loved your thoughts on how #ReligiousLibertyMatters Abraham Hamilton III!! Thank you!  @CofOHardWorkU", "RT @nataliep2013: @replouiegohmert I'm loving your sense of humor! @CofOHardWorkU #ReligiousLibertyMatters", "RT @kalkemp: #religiouslibertymatters 9243 tweets to the SM team @CofOHardWorkU!", "RT @nataliep2013: Me after listening to Abe Hamilton III #ReligiousLibertyMatters @CofOHardWorkU https://t.co/fxqY5a6W2M", "RT @kalkemp: Eager to learn how to \"irritate\" the media. #ReligiousLibertyMatters @CofOHardWorkU https://t.co/ofZ6YKLoEc", "RT @kgrace3321: Abe's speech nailed it today #religiouslibertymatters @CofOHardWorkU https://t.co/eRM31qEneR", "RT @CarileenBroeker: Our next speaker at Pensmore 2k16. #ReligiousLibertyMatters @CofOHardWorkU https://t.co/gKZAUAV6Cg", "RT @IndiaMarieJ: Alrighty Congressman Gohmert, Jr. bring it! #ReligiousLibertyMatters #pensmore2016 @CofOHardWorkU", "RT @IndiaMarieJ: If you go to @CofOHardWorkU you best suit up and #showup. #ReligiousLibertyMatters #Pensmore2016", "RT @CarileenBroeker: \"Put your helmet on and get ready to do what God has called you to do!\" -AH3 #ReligiousLibertyMatters @CofOHardWorkU", "RT @kgrace3321: @LouieGohmertTX1 is pretty funny!  #religiouslibertymatters  @CofOHardWorkU", "RT @RachealCarlyon: \" Nothing bugs a true liberal more than references to the Bible\"  - @LouieGohmertTX1  #religiouslibertymatters", "RT @nataliep2013: \"You can't let media get away with false information.\" @replouiegohmert @CofOHardWorkU #ReligiousLibertyMatters", "RT @kalkemp: #religiouslibertymatters You can't let the media get away w false premises.-@LouieGohmertTX1 @CofOHardWorkU", "RT @nataliep2013: So thankful we have freedom to pray, especially publicly. @CofOHardWorkU #ReligiousLibertyMatters https://t.co/hbg2cMaf1M", "RT @IndiaMarieJ: \"Nothing bugs a true liberal than references to the Bible.\"@replouiegohmert #ReligiousLibertyMatters #Pensmore2016", "RT @RachealCarlyon: \"God who gave us life gave us liberty..\"-@LouieGohmertTX1 #religiouslibertymatters", "RT @schaal_michaela: I'm sad I am missing the 2nd half of Pensmore, but glad my classmates are keeping me updated #religiouslibertymatters", "RT @RachealCarlyon: #religiouslibertymatters  https://t.co/VxOBB7Om5S", "RT @RachealCarlyon: Is Religious Liberty a #ShowMePriorities ? #religiouslibertymatters @MoGov", "RT @AncientNeil: Science needs to discover the facts and present them, not mandate.\n#ReligiousLibertyMatters \n@CofOHardWorkU", "RT @kalkemp: Bentham &amp; Mills \"greatest good for the greatest # of people.\" #religiouslibertymatters @LouisGohmert @CofOHardWorkU", "RT @kalkemp: We should make it a crime to deny climate change-@LouisGohmert @CofOHardWorkU #religiouslibertymatters", "RT @schaal_michaela: #showmepriorities my priorities are with Pensmore. #religiouslibertymatters", "RT @nataliep2013: We got you!  @CofOHardWorkU #religiouslibertymatters https://t.co/tB557c34x3", "RT @kalkemp: We are supposed to impact government. -@LouisGohmert @CofOHardWorkU #ReligiousLibertyMatters", "RT @RachealCarlyon: #ReligiousLibertyMatters  https://t.co/oL71bjLmUX", "RT @RachealCarlyon: #ReligiousLibertyMatters  https://t.co/HpqxuIVdPV", "RT @RachealCarlyon: #ReligiousLibertyMatters  https://t.co/mEJ9DhBhDd", "RT @kalkemp: Christianity is the only religion that is based on love-@LouisGohmert @CofOHardWorkU #ReligiousLibertyMatters", "RT @RachealCarlyon: \"No matter who is in office you HAVE to hold them accountable!\" - @replouiegohmert #ReligiousLibertyMatters", "RT @RachealCarlyon: We've got to be wise! @replouiegohmert #ReligiousLibertyMatters", "RT @IndiaMarieJ: Whoever is in office, it is OUR job to hold them accountable. #ReligiousLibertyMatters #Pensmore2016 @CofOHardWorkU", "RT @kalkemp: The SM 2016 team is 10,000 tweets strong! @CofOHardWorkU #religiouslibertymatters", "RT @CarileenBroeker: Time to turn in your voter registration cards! Do it because #ReligiousLibertyMatters @CofOHardWorkU", "RT @kalkemp: We need to hold politicians accountable @LouisGohmert @CofOHardWorkU #religiouslibertymatters", "RT @nataliep2013: It's time to stand up! @replouiegohmert @CofOHardWorkU #ReligiousLibertyMatters https://t.co/JrhIFhyIpT", "RT @IndiaMarieJ: @katyperry Thanks for the music to pump me up this morning for #Pensmore2016 on #ReligiousLibertyMatters!! I appreciate it!", "RT @kalkemp: #religiouslibertymatters to @GenBoykin @CofOHardWorkU https://t.co/mclsJmf1f6", "RT @nataliep2013: Final speaker of the day: LTG William Boykin! @CofOHardWorkU #ReligiousLibertyMatters https://t.co/MIkAxLH0L3", "RT @kalkemp: We're on the threshold of completely losing religious freedom. -@LouisGohmert @CofOHardWorkU #ReligiousLibertyMatters", "RT @titusgood: @brennanpearson but how will you know that #ReligiousLibertyMatters???", "RT @kalkemp: @GenBoykin is an excellent speaker! So passionate! #ReligiousLibertyMatters @CofOHardWorkU", "RT @RachealCarlyon: \"I spared you for this fight\" @GenBoykin thank you for this testimony. Jeremiah 51:50 #ReligiousLibertyMatters", "RT @kalkemp: Winston Churchill -we must not surrender. @CofOHardWorkU #religiouslibertymatters", "RT @RachealCarlyon: We shall NEVER surrender! - Winston Churchill #ReligiousLibertyMatters", "RT @nataliep2013: Such inspiring words! @CofOHardWorkU #religiouslibertymatters https://t.co/RZ2e7WFK4I", "RT @CofOHardWorkU: @GenBoykin thank you for your service and sacrifice for our country. #ReligiousLibertyMatters", "RT @CofOHardWorkU: We are honored to listen to your experience and wisdom @GenBoykin. #ReligiousLibertyMatters", "RT @IndiaMarieJ: I spared you for this fight: for the fight of the soul for America @GenBoykin @CofOHardWorkU #religiouslibertymatters", "RT @RachealCarlyon: Do not conform to the world - Romans 12:2 @GenBoykin #ReligiousLibertyMatters", "RT @kalkemp: Christians need to get off the pew and get into government. There is hope! @GenBoykin @CofOHardWorkU #religiouslibertymatters", "RT @kalkemp: Let's stand up for what is right! There is hope for this country! @GenBoykin @CofOHardWorkU #religiouslibertymatters", "RT @IndiaMarieJ: Be in the world, but do not become of it. @CofOHardWorkU  #ReligiousLibertyMatters #Pensmore2016", "RT @nataliep2013: \"How does God accomplish things? He does it through us.\" @GenBoykin @CofOHardWorkU #ReligiousLibertyMatters", "RT @RachealCarlyon: Courage is not the absence of fear. It's overcoming fear. @GenBoykin #religiouslibertymatters", "RT @schaal_michaela: Tuning into https://t.co/hcbFHBUwmS to watch what I can of Pensmore. #religiouslibertymatters @CofOHardWorkU", "RT @kalkemp: Voting is a stewardship issue. @GenBoykin @CofOHardWorkU #religiouslibertymatters", "RT @IndiaMarieJ: Get out of your comfort zone and get in the fight. #ReligiousLibertyMatters #Pensmore2016 @GenBoykin @CofOHardWorkU", "RT @kalkemp: Courage is not the absence of fear. @CofOHardWorkU @GenBoykin #religiouslibertymatters", "RT @RachealCarlyon: \"Your fear may strike fear in the hearts of others, so go on home\" - @GenBoykin  #religiouslibertymatters", "RT @RachealCarlyon: \"The Lord has revealed to me that you are a false prophet and a coward.\" -@GenBoykin  #religiouslibertymatters", "RT @RachealCarlyon: \"We can restore this nation\" - @GenBoykin  #religiouslibertymatters", "RT @AncientNeil: Moral courage.\n#ReligiousLibertyMatters \n@CofOHardWorkU \n@GenBoykin https://t.co/4PKHcT5mNc", "RT @kalkemp: We've got to put our faith into action.-@GenBoykin  @CofOHardWorkU  #ReligiousLibertyMatters", "RT @kgrace3321: We need to stand up with courage today.  \n #religiouslibertymatters. @CofOHardWorkU", "RT @CofOHardWorkU: What is the most important lesson that you have learned at the Pensmore Symposium?  #religiouslibertymatters", "RT @RachealCarlyon: Here am I, send me. Isaiah 6:8 \n#ReligiousLibertyMatters", "RT @AncientNeil: Now that we've all been schooled in religious liberty, go out and impliment it and spread the word #religiouslibertymatters", "RT @RachealCarlyon: #religiouslibertymatters  https://t.co/uP3yv2kvI8", "RT @RachealCarlyon: #religiouslibertymatters  https://t.co/PNBUn6GV0F", "RT @RachealCarlyon: #religiouslibertymatters  https://t.co/VOwpYOddft", "RT @RachealCarlyon: #religiouslibertymatters  https://t.co/oL71bjtM3p", "RT @RachealCarlyon: #religiouslibertymatters  https://t.co/HpqxuIVdPV", "RT @RachealCarlyon: #religiouslibertymatters  https://t.co/mEJ9DhBhDd", "RT @RachealCarlyon: Do you have the courage to put the ones you love before yourself? @GenBoykin #religiouslibertymatters", "RT @kalkemp: Favorite speaker in second session? #religiouslibertymatters @cofohardworku", "RT @RachealCarlyon: \"Don't sacrifice your freedoms at the alter of political correctness\" @GenBoykin  #religiouslibertymatters", "RT @RachealCarlyon: \"Sometimes all you have to do is step out and others will follow.\" @GenBoykin  #religiouslibertymatters", "RT @IndiaMarieJ: Sometimes all you need to do is take the lead. @GenBoykin #Pensmore2016 #ReligiousLibertyMatters @CofOHardWorkU", "RT @AncientNeil: i can not wait for next years pensmore!\n#ReligiousLibertyMatters \n@CofOHardWorkU", "RT @schaal_michaela: I'm thankful to go to @CofOHardWorkU where we acknowledge #religiouslibertymatters and we take steps to make it known.", "RT @schaal_michaela: Pensmore 2016: Done.\nWhat do you think next year's topic will be? #religiouslibertymatters", "RT @IndiaMarieJ: #ReligiousLibertyMatters #realtalk", "RT @IndiaMarieJ: Preparing for the second half of #Pensmore2016 on #ReligiousLibertyMatters!!", "RT @IndiaMarieJ: Super excited to hear Mr. Alexander Hamilton III on turning apathy into activism! #Pensmore2016 #ReligiousLibertyMatters", "RT @IndiaMarieJ: @RealBenCarson glad to have had you at #Pensmore2016 on #ReligiousLibertyMatters", "I'm a conservative because I believe..-Abe H. III #ReligiousLibertyMatters @CofOHardWorkU", "RT @kgrace3321: #Pensmore2016. \n#religiouslibertymatters\n @CofOHardWorkU https://t.co/znFEx6taAC", "RT @nataliep2013: \"@CofOHardWorkU educates students through their hearts, heads &amp; hands.\" Rich Batt II\n#ReligiousLibertyMatters", "Civil rights are being hijacked. This is a consequence of elections. #ReligiousLibertyMatters", "Thank you Abe for have the courage to speak the truths of our society #ReligiousLibertyMatters\n@CofOHardWorkU", "RT @nataliep2013: @RichBott2 thank you for your kind words about our wonderful college! @CofOHardWorkU #ReligiousLibertyMatters", "RT @CarileenBroeker: @kalkemp Of course! Wouldn't want to be anywhere but here! #ReligiousLibertyMatters @CofOHardWorkU", "RT @nataliep2013: \"The light shines brightest in darkness.\" Abe Hamilton III @AmericanFamAssc @CofOHardWorkU #ReligiousLibertyMatters", "RT @CarileenBroeker: \"Light shines brightest in the darkness.\" -Abraham Hamilton III #ReligiousLibertyMatters @CofOHardWorkU", "RT @IndiaMarieJ: The light shines brightest in the darkness.  @CofOHardWorkU #ReligiousLibertyMatters #Pensmore2016", "RT @FrannyTrueheart: What a great morning at @CofOHardWorkU Couldn't be more proud of a school that knows #ReligiousLibertyMatters", "RT @garrettgrant13: \"Democrats and Republicans both agree that Religious Liberty is a freedom.\" - Mark David Hall #ReligiousLibertyMatters", "RT @nataliep2013: So exited to hear from him! #ReligiousLibertyMatters @CofOHardWorkU https://t.co/xVVVo0tkYr", "RT @EmilyBatesss: This is the nation that stands between peace and utter chaos. -@RealBenCarson #ReligiousLibertyMatters", "So many unspoken things are getting addressed at Pensmore. Preach it Abe #ReligiousLibertyMatters\n@CofOHardWorkU", "RT @katielathem: So much Truth spoken here this morning! Thanks, Dr. Carson! #RLM #ReligiousLibertyMatters", "RT @JustinCopley2: It's a great feeling to be back at College of the Ozarks! #CofO #Classof2006! #ReligiousLibertyMatters", "RT @kalkemp: Can't beat listening to @RealBenCarson  &amp; @_KShackelford @CofOHardWorkU #FridayFeeling #ReligiousLibertyMatters", "Abe: never underestimate the dedication we have to Christ #ReligiousLibertyMatters", "RT @CofOHardWorkU: Today! @RealBenCarson joins us! #ReligiousLibertyMatters https://t.co/ilH1gb7NLa", "RT @nataliep2013: 3 more incredible speakers to come! @CofOHardWorkU #ReligiousLibertyMatters https://t.co/2YGVTeBbuS", "RT @nataliep2013: #ReligiousLibertyMatters @CofOHardWorkU https://t.co/2ihCMPlFrK", "RT @IndiaMarieJ: T-minus 10 minutes for the second half! #Pensmore2016 @CofOHardWorkU #ReligiousLibertyMatters", "RT @IndiaMarieJ: Filled seats here at @CofOHardWorkU #Pensmore2016 #ReligiousLibertyMatters https://t.co/ix9NURRvfS", "RT @kgrace3321: Don't forget to pledge!!  #religiouslibertymatters  @CofOHardWorkU https://t.co/VKbYdOabgZ", "RT @nataliep2013: @PensmoreFndn is doing great things! @CofOHardWorkU #ReligiousLibertyMatters", "Welcome Abe! It is a pleasure to hear you speak #religiouslibertymatters", "RT @nataliep2013: @CofOHardWorkU #ReligiousLibertyMatters https://t.co/epiInXbl3o", "RT @kgrace3321: God bless America. #religiouslibertymatters   @CofOHardWorkU", "RT @kalkemp: @CarileenBroeker #getfiredup because #ReligiousLibertyMatters!", "Our liberties are worth protecting! #religiouslibertymatters", "Kaine has a racist face with a rapey vibe. #VPDebate", "Shout outs to the @AncientNeil letting everybody know that #religiouslibertymatters !!! Keep it up:)", "@ProgressOutlook @GreenLeafPub @jgawron77 @mike_pence does it bother you third world dictators including putin have her in their pocket?", "@HuffingtonPost why didn't beef go down?", "#HowToConfuseAMillennial explain something without the use of emoji", "@puppymnkey omg how did that little super predator get past ss?!", "@America_1st_ video quality is shit. We need to send them more money for iPhones.", "@AmericanExpress millionaires are best at convincing lower middle class into cc debt.", "@USPSbiz does Anthony Weiner use political mail?", "@USPSbiz millennial here, what's a political mail?", "@RT_com looks like a nice place for refugees", "@HuffingtonPost telling us because nobody watched", "@politico what is there to leak of GOP? Dems are infested with corruption making them an easy target.", "@ajplus @baltimoresun in a city with black leaders in local gov and police force? No. It can't be.", "@PolitiFact stop spreading this homophobic pic", "@Sabanocchio @jstephencooper @PolitiFact lmao dumbest thing I have heard all day.", "@JWillMobile @RyP1984 @JaredWyand wtf does Iraq have to do with ss fraud?", "@PolitiFact mostly true at best.", "@ajplus and homophobic somehow", "@bridoc @PolitiFact Lol no doubt", "@bridoc @PolitiFact raising taxes without curbing spending doesn't make any sense. It's a money pit that never fills. Cut spending 1st.", "@bridoc @PolitiFact pshh yeah right. You know what the deficit is at?", "@DRUDGE_REPORT @SCMP_News why is her sex bot wearing glasses?", "@thehill you were played. Very well", "@PolitiFact Clinton's poltifactory", "Pokemon is isis", "@MjDaWeatherman @thehill yeah, Hillary carries hot sauce. Donald Trump... does not. Slavery.", "@ajplus first female nom to lose", "@JohnRiversToo  who is that guy that's always on there?", "@thehill take her down", "@TMnFL @jimmy_dore geez you ran off fast. Still, badass by liberal standards.", "@Salon San Jose &amp; Chicago", "@ajplus focus on Clintons. He actually did rape women.", "@RgrimsleyG @CNN of course it's a waste. The witches are above the law of the commoners", "@magic_murphtone not all cretins are created equal. There are thugs and ours(whites) go by the name of liberals who enable the thugs.", "@nzinga1112 @stranahan it's ok. every race has its cretins and ingrates", "@redsteeze @vine I don't like mosquitoes either", "@my2bits4u @realDonaldTrump I've noticed terrorism has gone up since Obama took office", "@ajplus she should go be Pres there.", "@ajplus how many child refugees has Qatar taken in?", "@NoiseyMusic wow you showed him", "@3rdReichStudies @ArtWendeley I see an evil mind with most of these but the honeyed words?", "@bitch_hoggle @dan2melz @jbar_vp pun intended?", "@Sadieisonfire I thought it was the other way around with Hawking", "@Reuters did they know there was a vote?", "@Bidenshairplugs that's actually and unfortunately a pretty good argument for gun control:(", "@Seja75 @Snowden what book is it?", "@AJEnglish @Oxfam @Winnie_Byanyima @AJENews you killed one of your own for votes.", "@ajplus @HouseDemocrats @RepJudyChu @repjohnlewis @JohnCarneyDE @YvetteClarke @RepJohnLarson @RepDanKildee gov shud provide guns to citizens", "@Trump_Videos 3G refugees", "@ajplus @RepPeteAguilar @StaceyPlaskett @RepMarkTakano @RepJudyChu sitting on your ass doing nothing. Just another day to them.", "@ajplus I totally do the minimal sound. I didn't know that was a thing. Thought I was just weird", "@PaulTown_ is this one in it?", "@HuffingtonPost they can face consequences right now if they do.", "@ajplus the CDC would find out that the shooters are all unstable democrats and my. Ban gun sales to liberals", "@theblaze half were undercover \" journalist\"", "@BeardsonBeardly @JohnJanieroXXX 1777, I have to unfollow", "What do you think all of these undercover journos are doing with their new ar15?", "@CNN @CNNPolitics transparency like drywall", "@ajplus almost as bad as Isis. Deport them now!", "@ajplus stop yellow journalism and the propaganda machine. Good luck AJ+ !!", "@ajplus good thing for that 911 call or you would still be denying it.. oh wait.", "@VICE he attended an Islamic kindergarten. Radicalized early.", "@Salon nope, but 8 years of Obama did.", "@ajplus lol the joy liberals have to suppress after shooting. Try your hardest not to like it ;)", "@ajplus you're the fox news of the muslim world", "@ajplus that's a dude for sure.", "@stranahan lol so was that second chick agreeing with you?", "@stranahan their silence says it all", "@ajplus look what is happening to Europe. Can you blame them?", "@kimoco @ajplus the left; never let a good tragedy go to waste.", "@ajplus imagine a doctor who refuses to say \"cancer\"", "@Reuters leave", "@Thuglier_ lol that is what I accused you of. I believe you. Sorry", "@Thuglier_ look at your original tweet and tell me why you think they are being treated differently.", "@Thuglier_ I asked you a question. I don't know how to simplify this any further. What is it about then? What is your point?", "@Thuglier_ also it just happened. Give the cretins some time to harass the parents, will you?!", "@Thuglier_ what does it have to do with? This is a case of apples and oranges/gorillas and gators.", "@Thuglier_ only on Twitter can you use a horrific accident to race bait.", "@HuffingtonPost did your killing machine kill anyone?", "@KStylePodcast @dacian_draco @JohnRiversToo  still not using that word correctly.", "@ajplus @POTUS then come up with a strategy Mr President. Donald Trump has one. Can you do better?", "@ajplus refuse to sell guns to a Muslim? Are guys crazy? Our white privilege means that we have to.", "@HuffingtonPost Americans vs non-american", "@TheAVClub still cannot believe the GOP killed all those gays. Prayers", "@jasonmethystine @PizzaPartyBen oh, like how dems are exploit the dead for gun control?", "@Righttosilence @realDonaldTrump Hillary doesn't care about you.", "@MaireadMcMahon @patriotskevin @realDonaldTrump that is really your response? That's like saying one of his guns had the safety on. Sad!", "@___Q__ @BBCWorld yeah take away their guns and no one can murder again..", "@___Q__ @BBCWorld yes they have. It's called prescription(and non) drugs. Anyway, nice deflection", "@___Q__ @BBCWorld  a \"lunatic with evil intentions\" would never acquire guns illegally.. because that's illegal!", "@razourblade1 @ajplus don't say fag, you faggot.", "@razourblade1  @ajplus don't ever stop believing berniefag!", "@razourblade1 @bsche_ @ajplus  thanks?  Double negatives can be tricky, huh? I can't tell if you are illiterate or just plain stupid.", "@ajplus Love. As in, Muslims love killing gays", "@razourblade1 @bsche_ @ajplus lol Ikr?! There is that typical, liberal, know-nothing response I was looking for ;)", "@bsche_ @ajplus I clicked hoping to find Muslims doing OUTreach; disappointed. Helping no one but themselves. I was naive to think otherwise", "@bsche_  @ajplus you get hurt when someone questions obvious propaganda; blind. Never said anything bad about Islam. You filled in the blank", "@bsche_ @razourblade1 @ajplus Facts don't care about your feelings.", "@ajplus looks like most of the homeless are Muslims", "@ajplus protest terror by committing terror. Ok.", "@OldRowOfficial @JohnRiversToo idk, I think this one kind of speaks for itself", "@Salon except when he was donating $ to the dems", "@ajplus great titles.", "@BigEasy1967 @politico @BernieSanders lol what would that make Hillary's famous screeches.. oops, I mean speeches.", "@Patrick_Fogerty @wileywillay @CalebRapoport anyone who needs a source to know Hillary lies; you're just without a clue.", "@Patrick_Fogerty @wileywillay @CalebRapoport Sorry, I get off when ppl call blogs \"sources\"", "@ajplus 70 percent is not a subsidy. When subsidies total more than your income something has to change.", "@wileywillay @Patrick_Fogerty @CalebRapoport  grammar is typically the position taken when they can't finish a thought. Oh, and also racism", "@ajplus imagine if they had refused. build that fucking wall.", "@FixieTrackStand @ajplus haha I was waiting", "@ajplus I missed the part where it benefits the students", "@Salon yes. I'm a parent and if my kid does something that stupid, arrest me. Take responsibility and stop raising cretins.", "@ScottInSC sounds exhausting, but not as much as \"who will I offend next?!\".", "@TraceyBVoice @_AltRight_ lol!  you can't imagine a brain?", "@Snowden still treason", "@ajplus the liberals demonstrate their violence as usual, but racism and stuff.", "@PizzaPartyBen guessing I haven't been following long enough to get this one", "@TriciaOfMice I'm just agreeing with you. It is all about racial composition.", "@TriciaOfMice @ajplus @dumbfoundead and Asians make up about 6% of the US. So that must mean they should be casted accordingly by your logic", "@TriciaOfMice @ajplus @dumbfoundead so we are going by racial composition? Do go on :)", "@ajplus @dumbfoundead how many white actors star in Asian films?", "@NoiseyMusic stay away from musicians", "@ajplus but is the beer any good?", "@AmyMek @jasian12345 what's you point?! We all know nuns are terrorist and Muslims only want peace", "@ajplus I fall asleep during her bits.", "@ajplus but she obviously did go public so she is a liar", "@ajplus ugg rich old men!! Just like the one who owns AJ+ ..", "@leogwalter @RepStevenSmith @politico lol calm down and drink your Clinton koolaid son", "@ajplus @Amites285 but my ex gf did hit me.", "@ajplus @candundaradasi I guess i missed the part where his wife restrained the shooter.", "@ajplus build a wall or build coffins", "@keksec__org @realDonaldTrump how do you get to have the first reply every time?", "@Nero starting to think you're a little gay", "@ajplus they should smash up some more cop cars and incite violence again. Seems what they are best at.", "@HuffingtonPost what? Everything about this is generic. We've all seen this before.", "@thumpthump @VICE lol well that old fellow looks like he's asleep. I'll say yes.", "@thirdwavefem @alison_doc is there something wrong with nurses? I know hard-working, dedicated nurses both male and female.", "@ajplus ppl have a hard time coming up with their own culture and traditions, they have to poke fun at others to feel good about them selves", "@FemsHaveBallz they probably think he was worth more..", "@DineshDSouza every old person ask for a senior discount. They're the ones with all the money!", "@Salon \"neo-liberals\" lol", "@VICE in that case we are all on death row.", "@Spotify no thank you on the lemonade. We're fine :)", "@NoiseyMusic because he was high af", "@JohnRiversToo probably my second favorite racist. Behind you of course :)", "@Salon would have been nice if someone pivotal to history was chosen.", "@ajplus yeah and he did it anyway!", "@weaselzippers you know he did it. Ate it I mean.", "@thehill well at least it's their own money they are wasting. Progress.", "@ajplus what the hell is wrong with canada", "@ajplus @sacbee_news well that was a waste of money", "@BreitbartNews US public schools and universities are full of robots", "@scrowder I'd rather deal with a machine than a mouth breather any day", "@MikeChipperson I have one semester left and damn... spot on.", "@FixTheLoophole how about making the idiots who smoke pay their own bills", "@AbdulEll_ @UrNotThatSmart @ajplus typical middle East view. Fleeing to the counties they blame for their demise.", "@SelmaJonque @HuffingtonPost kartrashians", "@Good_Lt @AdamJames_42 @Nero I'm from the US. They are not a big deal.", "@HuffingtonPost I know I need a good nap halfway through a HP article", "@AJEnglish how many has Qatar taken in?", "@ajplus you had to put comedy under your aj+ logo so people could tell the difference? Lol", "@ajplus yes, but we're thick of skin. We'll be OK.", "@ajplus pacifists make horrible war allies", "@DianeSymons  I know.  The said attacker told you that alot was acceptable and it is not.", "@Rhilman @DianeSymons @nytimes @whaledefenders no. alot is not a word.", "@ajplus looks like cops messed it up. This was probably a search.", "@2Zuethes @Jeffrey52095461 @coreybking @trymainelee you really like that word. You know what it means don't you?", "@HuffingtonPost Cuba is not a major issue. We shouldn't be wasting our time even in a debate.", "@CNN what part of North Korea is this?", "@Salon that SeaWorld doc?", "@SputnikInt immigrants", "@SputnikInt @splcenter are you trying to say \"hate crimes\"", "@NoiseyMusic then why do they look like dudes", "@Salon they got off their scripts?", "@BBCWorld @BBCNews the last place they looked", "@AJENews with a fake smile like that it's no wonder!", "@jfiix I'd totally Jew it.", "@branch0_c @nytimes and ironically people all over the world choose to study here over those free countries.", "@ajplus you are not Muslim or extremists.", "@ajplus can we have another gif of a black girl doing that stereotype bug eyed thing?", "@HRBlock I don't have an amend option under my tax filing resources. Federal has been accepted.", "@BBCWorld @BBCNews armslist", "@StephHerold cunt", "@ClinicEscort @StephHerold husky is the whitest dog. They are also pretty superior. Maybe you should try a trash dog. Pit?", "@theblaze when was this pic taken?", "@ajplus was he proved wrong?", "@CNN there are certainly worst dads in America. At least he spends time with his kid.", "@owillis riots. And the riots too!", "@KipHenley how so?", "@MailOnline he's like 40", "@ajplus too late", "@HuffingtonPost and BET of today", "@Rach_IC @townhallcom I too think we should retire the \"N-Word\".", "@ajplus the real party of choice where the candidates actually run against each other.", "@HuffingtonPost as expensive as Ferguson? Baltimore?", "@ajplus and how much was this ad?", "@ajplus where is Hillary's money coming from again? I think I missed that part.", "@FoxNews this is where we bring up that he is a modern day Robin Hood", "@ajplus must be a boring debate if this is a highlight.", "@theblaze 60 years later.. About time.", "@ajplus great points on here from the party of tolerance.", "@ajplus essentially, we like to think for ourselves", "@premierguitar a lot of these already have rundowns.. But anyways, Mac demarco, ducktails, modmouse, wild nothing", "@ajplus crack is not an opioid. Ignore the race baiters and Thanks for reporting", "@pzf how much are they?", "@LydiaValch @AJEnglish it's \"it's\" not \"is\".", "@politico why does Ben have to respond to anything trump says", "@aaronnemo @HuffingtonPost is Hitler running now?", "@VICE gotta watch out for those skinny jeans wearing male feminists", "@ajplus would eastern countries accept western refugees?", "@TARAWRENBLUE @CNN and why would we take tips from a country who has 10% unemployment? It's desperation. Did you read the article?", "@Bidenshairplugs @springxniall at least he waited 3 years. That has got to count for something!", "@ACMFTHAMNA why don't you quote the entire verse, jackass", "@biryaniisbae WELL, THAT'S ALL THE PROOF I NEED! :D", "@mk1969 Muslims would say that about him though", "@nytimes bill is a t shirt. Life aquatic was pretty good, though", "@premierguitar @DantzigGuitar I have 2 on my jazzy by accident. Strat style on body and traditional on guard. It'd be great to have vol 4 ea", "@motherboard you know how boring that would be??", "@ReutersWorld @Reuters they should start with the ones in their own country.", "@MikeRotondo86 @IL4EVER so what your saying is it's a tie..", "@ajplus  ha looks worst than the war zone they came from. Welcome!", "@premierguitar bass drum pedal.", "@HuffingtonPost I'd rather put up with wildlings", "@SputnikInt they should throw some co2 canisters", "@theblaze @DanaTheBlaze meanwhile CNN is still hung up on the 13 year old \"YouTube sensation\"", "@CNN @thecjpearson people renounce liberalism; typical. People renounce conservatism; national news!", "@Syricide maybe the US should join", "@ajplus and like the pilgrims they will conquer the natives eventually. How many who offered will actually open the doors?", "@ajplus  I don't get it.", "@AblativMeatshld @weaselzippers setting them on fire you say? Dang dude. That is fucked up", "@vicecanada @vicenews looks shady", "@Randy19804u @OneWhiteMale @colinflaherty @Talkmaster dang this guy really knows how to Google AND cherry pick. He's dangerous.", "@bullriders1 @politico that said, does it make it right that we did it? No, but I won't lose sleep over the guilt.", "@bullriders1 @politico land (private property) was constantly won in battle along with people (forced labor) between the natives.", "@PrisonPlanet baitnswitch friday", "@politico @wuerker Indians are just sore we beat them at their own game of destroy and conquer. So is everyone else.", "@ajplus it must have been really hard to find the only woman in the economic refugee camp", "@DonJuan7204 @EgorKopelev @cnnbrk and the us track record? Spotless right?", "@theblaze why do you make me like this guy", "@ajplus do you really see a raid stopping to take the keys, say thank you, and quietly unlock a door? What a tragedy..", "@Anomaly100 @MikeChipperson @BRios82 umm we were talking about proving hands up was a lie? You're all over the place.", "@Anomaly100 @MikeChipperson @BRios82 well, that and eye witnesses, physical evidence, and forensic analysis", "@pzf actively going after the rebels..more than they already are.", "@BBCWorld Russia is the only player making any progress. Turks are cowards for shooting at helpless parachuters", "@crtjr @TheRealAndyH @CNN and to think some people make a living at it #AlSharpton", "@ajplus taking a break from your normal propaganda to bring us the weather?", "@AmyStephen companies want to hire people they know won't sue or slander them if they have to be fired", "@NoiseyMusic sweet I want a headdress now", "@premierguitar idk, I think it's an improvement to a tele", "@ajplus dems got to import those voters", "@ajplus I sense privilege", "@reverbdotcom here we go again", "@nytimes funny they waited until Russian confirmations before releasing this.", "@xwaldie  it should be eagles of death metal", "@Independent but they get to keep the credit card and ss numbers right?", "@AJEnglish that's still 700k", "@AJEnglish that's 6% too many", "@neontaster @ScottInSC look up why it was Photoshoped", "@ajplus that's right. Remain silent and hope it will all go away.", "@politico @BernieSanders lol all of the hilldabeast supporters buying in to this. Democrats are damned both ways", "@ajplus a lot of empty words", "@gblair1987 @ajplus Obama did", "@AJEnglish unless they are Jewish or Christian", "@austincarrier11 @CloydRivers too soon?", "@cnnbrk it would only be breaking news if there were..", "@HuffingtonPost these are kids that can't stand the thought of growing up and not being told what to do. What a flock sheep.", "@CloydRivers Washington 2016", "@ajplus doesn't change the fact he's getting man handle by Russia and Iran. And likes it.", "@premierguitar I love playing my jazzmaster through my 73' musicmaster bass amp", "@thatssmart7 @nytimes you really need to take a second look at that map.", "@thehill is will claim responsibility anytime someone slips on a banana peel", "@ajplus cry and stamp your feet some more. It worked at sanders' rally", "@FoxNews @fxnscitech when we told the military to secure dinosaur bones, they took it literally", "@ajplus the worst parents", "#ScaryBands @reverbdotcom tame impaler", "#ScaryBands @reverbdotcom hateful undead", "@nytimes agreed. All kids should wear a specific type of potato sack everyday", "@BreitbartNews every one of these economic migrants have camera phones", "@IStandWithAhmed don't let them strap any clocks to you", "@NoiseyMusic @VICE are they a band?", "@WashTimes @RickCanton too bad he's not pushing gun control. He'd have a voice then", "@DRUDGE_REPORT Florida?", "@nytimes you left out the rebel's favorite allies, IS", "@AJENews gunshows too expensive. Armslist is where it's at", "@DailyCaller not the horny goat weed", "@vicenews Afghanistan, Africa, basically any 3rd world countries we throw money at", "@theblaze the way he holds it looks weird", "@TheAVClub hopefully better than his last 2", "@TheJasonCarney @politico the neurosurgeon? And what would that make you?", "@vasilidante @politico @RealBenCarson you're right. Just look at trump.", "@TheAVClub because he is not", "@Salon who was exposed? crappy druggie mothers?", "@premierguitar exactly what that jazzmaster rhythm circuit is for", "@exposeliberals @HouseCracka yes but Putin killed some rebels we trained.", "@HuffingtonPost tickets are free right?", "@AJEnglish @KamahlAJE even if it ended tomorrow, we would have it back the day after.", "@Salon if you call tearing apart a store bought clock and shoving it in a briefcase is gifted.", "@NoiseyMusic ugh ikr! I get so offended when I see minorities wearing cowboy hats! Geez Louise", "@fairtradecoke I'll take one of each shirt.", "@HuffingtonPost that's a good slide", "@Reuters all that litter. Just a preview of what they are going to do to the counties they are traveling to.", "@VeniseBaxter @HuffingtonPost the airlines have always required attendants to serve alcohol.", "@HuffingtonPost the hackers ARE babies", "@WSJ @MattMcBradley @margitfeher why is \"wellcome\" misspelled and in English?", "@aah_pat @thehill @realDonaldTrump lead singer of smashing pumpkins", "@ajplus yeah simulated violence against someone we don't agree with!", "@CNN idk why but this picture cracks me up.", "@SooperMexican we don't care unless the tear up an old building", "@AJENews that makes sense", "@UselessObstacle @DineshDSouza this happened days ago. Charleston started before the bodies got cold.", "@ajplus or we could adopt China's system.", "@maxwellstrachan @HuffingtonPost as long as we are not talking about the people who stayed against warning and the lack of state response.", "@ajplus news pfft.. Who needs news?", "@AJEnglish what's wrong with farming?", "@Silaslang @CNN @ChickfilA what laws are they breaking exactly?", "@Silaslang @CNN @ChickfilA right. Everyone MUST CONFORM to our ways or ELSE", "@ajplus  a bunch of pussies.", "@CloydRivers take notes francy pants. This is how it's done.", "@VICE what is it about vice that breeds bias and intolerance?", "@Nero eww and lol.", "@BoSnerdley @DailyCaller lol love the equal sign between them.", "@Nero turns out Shaun king is a male.", "@google how often does it need water?", "@GoT_Tyrion deserves worse than the wall", "@premierguitar @petethorn I fav for the board", "@CNN can't just wait to topple the last, exhausted man standing?", "@thehill \"its\" OK. It's in quotation marks.", "@PzFeed I just want to put a blanket over him", "@HuffingtonPost just stomp your feet and yell. That seems to work.", "@Bidenshairplugs and who will be there to pick up the pieces?", "@AJENews grandma detainee on her phone!", "@GoT_Tyrion since his watch has ended.", "@nprmusic @Msldemarco God bless", "@VICE no. you did, media. You did.", "@AJENews that guy is inviting a bullet.", "@CocaCola @taylorswift13 do I have to buy the coke for her?", "@iLEx_006 @VICE it was in the US", "@HuffingtonPost cabins in the sky are a sore to the eye", "@NationalMemo that's not what democratic presidential hopefuls are saying..", "@HuffingtonPost leaked, huh?", "@JRehling almost as white as the 2016 democratic presidential campaign", "Good, cheap fun with #korg http://t.co/497BtsNJfa", "@BridgeProject21 please stop aiding and abetting criminals.", "@raushenbush @HuffingtonPost very cool. I hope you kept your head in light of its stunning beauty.", "@johnsdontpanic @ChuckNellis  20th century? Lol I agree most liberals are behind the times", "@TheAVClub you can also eat it", "@FoxNews @realDonaldTrump drawbridge syndrome votes", "@CNN no one can", "@TheAVClub he'll be enjoying his foot longs in prison", "@nytimes I don't want a president that takes selfies at all", "@VICE satanist are losers who never grew out of their highschool nerddom.", "@thehill and also rename it...?", "@YourAnonCentral you forgot Alaska and Hawaii in your clever, little picture", "@pitchfork watch elitist knownothings report on what fox news said.", "@eg_wade you wouldn't hear about it.", "@YNPierce let's ask you that question in reversed", "@HuffingtonPost being gay is the new black? Got it.", "@thehill tbf she would be a disappointment to anyone's family", "@nytimes right now", "@HuffingtonPost are you getting the increase you hoped for from your gay avi?", "@MikeSpeaks @anamariecox probably wouldn't have to.", "@oldkinderhook @redsteeze sitting down", "@redsteeze I'm offering $5.26 to whoever defiles it", "@Salon I must of missed the part where he \"destroyed\" the defense..", "@politico because flags", "@Daenerys everybody cool now?", "@AJENews who cares", "@trutherbot here is my empty threat to unfollow", "@thehill @POTUS @MittRomney \"yeah, me too!\"", "@VICE it will only be worth half as much.", "@trutherbot I like the TL version before it expanded lol", "@AJEnglish why do refer to yourself in the third person?", "@HuffingtonPost does this have anything to do with Islam or the dog eating festival, Huffington Post?", "@AntonJGunn true. The flag has become the center piece, not the victims or shooter. What is supposed to happen when it comes down?", "@trutherbot don't they know they can flip burgers for 15 an hr", "@HuffingtonPost if you have never heard of wes Anderson, you watch too much Tyler Perry", "@HuffingtonPost open cokes for people", "@VICE journalism!", "@ajplus yeah, I guess..they won't...uhh...supersize....that?", "@TheAVClub might as well. None of the others there are journalist", "@VICE punks", "@cnnbrk south African and Rhodesian? That is a round about way to show racism..", "@trutherbot lol cmon guys. It's a joke.", "@HuffingtonPost you mean a dad?", "@NoiseyMusic but not that pissed.", "@HuffingtonPost but can Huffington find a breaking story? No. News? Nope.", "@CNN nice shot", "@ajplus who needs a job?", "@BBCWorld uh oh. About time to get a life alert Dave.", "@DanJoseph78 your a liar!", "RT @nprmusic: How well can you hear audio quality? Take our quiz! http://t.co/vH5sINOngX http://t.co/JVQ9fGgxtM", "@VICE there's nothing to see anyways", "@GoT_Tyrion wth did these idiot writers do to stan?! I miss George..", "@BBCNewsMagazine @BBCWorld that's a gross looking plate of meats.", "@Joweeezy @thehill ok then.  I guess he's not.", "@thehill is he still a thing?", "@CNN @BarackObama @CNNPolitics I wish we were all this excited about his policies.", "@thehill all Bush ever wanted was to go to Texas.", "@CNN everyone should use metric. Everyone should also speak English.", "@c_tonge @ajplus it is much harder to hit a limb and it does not guarantee a stop.", "@AJENews former ruling Yemen family had al Qaeda ties.  why is this deeply embarrassing again?", "@HuffingtonPost who would even want to be a cop anymore?", "@ajplus there seems to be missing statistics... Why not publish all of the numbers?", "@blueturtlen @jeverettmorton @HuffingtonPost my shot wasn't at Barry. It was his hollywood supporters who are typically anti-what?", "@HuffingtonPost dude has massive balls for that kind of talk in Obamaland.", "@vicenews now she is a true American.", "@VICE living?", "@GoT_Dany almost made up for the last 5", "@VICE people do this all the time. Welfare", "@motherboard even the government won't use the postal service.", "@BBCWorld better than the US who only go after celebs and journalist.", "@VICE \"they already are!\" Hardy harr..", "@HuffingtonPost now some of those burgers are worth 15 an hr.", "@Marcos30575 @cnnbrk maybe they'll get shanked in prison for free.", "@RamsaySnow_ iron island storyline for sure! Crows eye? Victarion?", "@support Reinstate @ChuckCJohnson &amp; support investigative journalism like http://t.co/6zMy1QrVjT. Free #ChuckCJohnson", "Chuck C. Johnson kicked off and trending. Must be doing something right.", "@HuffingtonPost can I sue the Jackson estate?", "@nytimes and IS can't wait to take them away from the Iraqis.", "@Reuters i hope they do a better job than the Iraqis they trained.", "@back_ttys @redsteeze @nytpolitics bless her", "@NoiseyMusic gimmicks for nothing and their checks for free.", "@nytimes still more than what most people make", "@nytimes yes, let money and other people raise your children! What a joke.", "@modestmouseband wish you made god is and Indian into a full song.", "@benlharrell @nytimes good thing they couldn't get pics.", "@VICE cop nailed him", "@scrowder I won't know to walk or put my arm around the dude next to me.", "@Rhandy4100 @aubrynathome @Karnythia  in the club too? She must have ran out of talking points and put her blindfold and earplugs back in.", "@FreedomGotAnAK @Karnythia how many do you need?! http://t.co/Ql4ZUqYRz2", "@Karnythia what about the numerous slave owners who were black? Do they still benefit?", "@BBCNewsbeat @BBCNewsAsia but they were asking for it right? Just like in Texas?", "@haceepeeix @ChuckCJohnson haha that's awesome!", "@CNNPolitics @CNN @peterbergencnn @CNNOpinion cover your eyes and plug your ears, folks. Who cares about truth anymore?", "@scrowder yes. Same person wins ever year. They just wear a wig or fake mustache each time.", "@MatthewJCasey @scrowder lol I don't think he said that.", "@MatthewJCasey @ThePirhana @scrowder in the name of oil? Sounds like a secular problem to me. Your all over the place.", "@MatthewJCasey @scrowder it sounds like you live in fear of the Christians.", "@journalismguru1 @FoxNews he's not a billionaire.", "@50th_President it looks like the Utopians and the realist.", "@MissMandyHale first person to block me! :) thanks miss handy male", "@MissMandyHale @macrinapochatko guilty much? I'm curious as to what you've done. Drop the N bomb with your white friends? Stereotypes?", "@JonSnow_18 the good ol days", "@VICE no flat brim hats? I'm liking that!", "@HuffingtonPost pit bulls are like tampons. Every pussy has got to have one.", "@politico @POLITICOMag very good.", "@SueLynsey @chelsea_elisa @FemsHaveBallz @AbbyMartin same and I'm still not entirely sure.", "@ajplus most POWs don't get to make demands after their release; no less get free housing.", "@HuffingtonPost these post are stupid. I don't think he is talking about numbers, but perception.", "@GRRM @GameOfThrones highly superior story. So yeah, I think so.", "@vicenews @VICE and vice is sad.", "@HollyFisher723 weird. I don't seem to have the problem you are having..", "@scrowder that and she is blonde in a sea of Hispanics. Talk about a sore thumb.", "@fawfulfan @ChuckCJohnson yay, I did it.", "@fawfulfan @ChuckCJohnson http://t.co/wIKUWXF859 ? This is the first link I've ever tried to tweet.", "@fawfulfan @kdmcln13187 @ChuckCJohnson @gofundme well?", "@fawfulfan @kdmcln13187 @ChuckCJohnson @gofundme thousands of parents do this? Please cite your sources.", "@NoiseyMusic pixies", "@jamroc69 @HuffingtonPost @FoxNews please read the article before posting. You look ridiculous.", "@ReutersOpinion @Reuters @HillaryClinton someone throw a brick at that cop!", "@HuffPostCollege @HuffingtonPost those soft, sensitive jerks.", "@stanleyrogouski @edhined @politico @wuerker no worries, fox. We are well off. Got that way through hard work and good choices not handouts.", "@stanleyrogouski @edhined @politico @wuerker fox down. I was just highlighting that your only foxing point is fox. For fox sake.", "@stanleyrogouski @edhined @politico @wuerker you tried mentioning fox?pulled the fox card yet? Maybe you should fox about fox. Just a fox..", "@VICE looks like %70 of the ads out there. What's so special about this one?", "@ChuckCJohnson they try so hard to insert themselves in the story.", "@cmatiash @WSJ everyone wants their picture in front of a police line. Photo op for the \"brave\"", "@nytimes time to take back that space the mayor gave away?", "@BraveConWarrior perhaps it was a store owner.", "@GoT_LordSnow I hope they bring pigeon back in the next season", "@The_Trumpet @LanceWiley_Inc @FoxNews oh noooooooo! :0 will it help if I married a 9 year old?", "@CNN yeah, like Clinton voters actually read books.", "@Perdnoot @jazzpurist atheism is a religion. You idiots have churches now, you buffoon.", "@nytimes cat people didn't bother to read the article.", "@nytimes low ball then meet in the middle.", "@VICE you die faster and more expensively", "@AJEnglish did your headline mean to say \"Muslims throw christian migrants overboard\"?", "@HuffingtonPost criticism of the media by the media.", "@HuffingtonPost a man executed for a crime. This has happened before and will happen again. It's not news..", "@jsyche @HuffingtonPost maybe if we raise it they will get a job.", "@jessmarmor @WSJ I'm genuinely more worried about the hypochondriacs on medicare bleeding us dry than military.", "@BBCWorld how did an armadillo get a gun?!", "@HuffingtonPost off brand cookie monster", "@GoT_Dany if hodor isn't in it I'm not watching.", "@VICE well, holder got away with it.", "@PaulJElliott @CNN @CNNSitRoom seriously. Do they not have a TV?!", "@CNN @CNNSitRoom punched 37 times and only has a black eye?", "@scrowder you would think the Peta patrol would be more understanding.", "@gycurtis1 @nytimes lol we are not all great shots like you are, Anne Oakley", "@HuffingtonPost their stuff is just better.", "@HuffingtonPost probably found a bigger check from worse people.", "@GoT_Dany @GRRM people that read got and idiots.", "@FoxNews Wisconsin", "@ChuckCJohnson finally. I watched it 100 times for the plant. Glad I'm not the only one.", "@cnnbrk does anyone read the articles anymore?!", "@nytimes yes. \"Hunger for scoops\" that's what we'll call it..", "@FoxNews please do not make fun of fearless leader :(", "@ThadRueterIR @MulletMadness1 @ChuckCJohnson Jackie wannabe in the making", "@MattBinder @ChuckCJohnson this makes me proud to follow the chuck", "@MartinGuitar 97' D-15. The dirty 15", "@HuffingtonPost the most accurate description of millennials.", "@VICE is 50 a lot?", "@HuffingtonPost @MileyCyrus lol wow. he better watch out!", "@VICE why are you reporting news, vice?", "@BBCNewsAsia @BBCNewsnight dear Hitler, we want our swastika back.", "@DineshDSouza I was on the fence on this, but that is a very good point.", "@scrowder it has its.. good parts.", "@FoxNews  too bad. They could have got it cheaper in mexico", "@MikeLeePearl @VICE he would have been the ultimate tweeter. One line king.", "@VICE I go to college, work two part times, have a family on 15,000. And I still save $.. Lazy people sure can be greedy.", "@nytimes there citizens are just better.", "@VICE that's a wicked selfie. Serious, you couldn't crop the blurry face?", "@Starbucks @USATODAY well this looks like it's going great!", "@Darby_Terrance @Starbucks @USATODAY I actually wait until they leave so I don't hurt anyone's feelings. I'm being serious. I always lockup", "@CNN Ha to #6! Like anyone is dumb enough to take a check.", "@CNNMoney @CNN wow lots of book burners here. You know who else burned books...?", "@sara_randazzo @WSJ @WSJBankruptcy good! I hope the CellphoneShack dies.", "@VICE there's nothing good. Looks like a bunch of paper/junk. Buy the guns.", "@HuffingtonPost maybe they should grow out their armpit hair.", "@DomFlanaganC300 @DRUDGE_REPORT Lol very good!", "@RoySekoff @HuffingtonPost @HuffPostLive  are all celebs politicians now?", "@politico This will be forgiven and forgotten soon enough. The response from the dem side is mostly \"who cares\"", "@cnnbrk This isn't breaking. Vice broke it a week ago.", "@TCastro_Esq @FoxNews believe over president Obama? Yes. Trust Laden? No.", "@WSJ Can't wait until I'm the last person driving", "@CNN The war on sea people", "@GRRM I don't see the hound hmm.", "@CNNbelief @CNN I've never heard these called bible verses.", "@WSJ Do people really worry about this stuff?", "@HuffingtonPost This happens a lot.. And they are STILL throwing rocks!", "@ChuckCJohnson They all just want to be inclusive", "@MartinGuitar @edsheeran Gross.", "@FoxNews good. At least it's humane and cheap.", "@NoiseyMusic Lol very good.", "@BBCNewsAsia Meatwad is my hero", "@hiranbarman @AJENews Millions? Exaggerations and finger pointing seem to be the normal argument for everyone these days.", "@letsgorube @Bryan_Mills_ @VICE I guess Paris is to conservatives as Sandy Hook is to liberals. Lol did you really not think about that?", "@megynkelly @FoxNews @TKovachNashvil @IronFalcon77  Slow reload, poor accuracy, louder than a decent silencer, cannot conceal.", "@Wisco @SandiDoolin Ditto. Double meanings for jackass: the animal and you. Nighty night.", "@Wisco @SandiDoolin Oh double meanings!! Well shoot.. Can you elaborate on the multiple meanings you have for victim? How about \"offender\"?", "@SandiDoolin @Wisco \"there were no victims\" and \"Besides, you're trying to smear the victims\".. Pick one.", "@SafeSchoolsCzar @kadelopa @thinkprogress educating kids period would be teaching them to hate liberals. Liberals lack knowledge.", "@ChuckCJohnson well it was going to happen. I have a feeling we will see more pick up this story.", "RT @pitchfork: .@Msldemarco is selling a pair of old sneakers on eBay to benefit @williemaerock http://t.co/CircMr1Oak", "@ChuckCJohnson It would be easier to make a list of those who didn't.", "@hallewsr @cnnbrk No. They are making them out to be the heroes that they are. Ismaaiyl is the \"saint\".", "@WSJ And 13 cents to make a 100 dollar bill. It evens out..", "@tkgnamboodhiri @andylocal @nytimes Lol nope...", "@BBCWorld @BBCPanorama half of these comments are sent from iphones", "@YouNoAmSuperman @truth2bob @Dman1427 @ChuckCJohnson pretty sure saying \"you don't wanna be THAT guy\" makes you THAT guy.", "@ElrayB @ChuckCJohnson @leeleemunster No he would want the credit.", "@ChuckCJohnson the threats in broken English sounded pretty convincing.. But that's what they want you to think.", "@NYTArchives @nytimes After the photo was snapped they started making out.", "@AJENews \"Americans, get out of our country... ok, now come back\".", "@CNN Rock and roll hof is a joke.. So yeah, Green day would fit right it.", "@tcote @pitchfork its d'angelo that should be sorry.", "@pitchfork No disappointment here. All of the best bits of old songs with tons of progress.", "@jeffsparshott @WSJ The 100 dollar bill cost 13 cents.", "@NoiseyMusic Because it's rap.", "@NoiseyMusic Yes noisey. You can get in on this race cash cow too.", "@pitchfork Rare when someone in his genre is staying true to himself and not caving into please the masses.", "@CNNMoney @LaurieSegallCNN Typical cowardly hackers. Airing other people's dirty laundry while hiding behind a computer. How brave..", "@pitchfork Glacial pace living up to its name.", "@WSJ yeah I'm with everyone here: \"what are facts and statistics good for if they don't work in our favor?\"", "@CNN Kittens", "@BygMan85 @JenniferChalupn @WEnsminger @AC360 Do you think it's OK to hide behind and use rape victims? Do it often?", "@VICE More truth and info than the average TEDtalk, sadly.", "@BBCNewsAus @BBCWorld @JonDonnison  its cute that other countries still think there is a Klan. Probably still think there is a wild west too", "@ngrey651 @FoxNews @foxnewspolitics Maybe we should release their heads like they do to their innocent prisoners?", "@BBCWorld  another example of oldman\n strength", "@nytimes Alumni just giving back whatever they got from their school.", "@pitchfork glad to see he still got it. Crazy mac antics.", "RT @Gobbler: An engineer's take on \"The Modern Recording Technique\" #lol #proaudio http://t.co/1LrPwSET", "@SPINmagazine @taylorswift13 good. I don't want to see her dumb face every time I log in to spot.", "@BBCNewsAus @BBCWorld Lol who is he apologizing to?", "@GRRM I send my regards.", "@nprmusic @taylorswift13 now I don't feel so bad for not being a supporter. Overexposure.", "@CNN Yes. Criminals make the best politicians.", "@nytimes Barry's book was going to have all that stuff in it!", "@GRRM I am thinking their last name is Bolton or lanister.", "@GRRM I have a bad feeling about Tyrion now. :/", "@VICE pro-palestinian journalism? Anti-Israel propaganda sounds closer.", "@Cynicalreality @fatheromalley1 @sarasidnerCNN @CNN No sir. Irony is as far I'll go.", "@Cynicalreality @fatheromalley1 @sarasidnerCNN @CNN  oh look a \"how original tweet\". How original.", "@CNNMoney @CNN @SarahKSilverman @jillianeugenios take a page from apple's book and base your snatch in Ireland.", "@cnnbrk what kind of sandwich?", "Hey!@DAaronPhillips stop trying to get pot legal and taking selfies all the time. ANd let's rock and roll.\n#flatbillhatsandsuch", "@DAaronPhillips Dang kids. With your yo-yos and that one game with the giant hoop.. The hula something.\n#getoffmylawn", "I'm not a millennial. I was just born in the 80's. #dontpigeonholemewiththeselosers", "@starfucker BEACH MONSTER and YAYAYA!... and also Last Words. And all of the other great hits on Mir Mi everyday now.", "@starfucker Wheres Mr. Alan Watts?"]}