{"BBCBusiness": ["What can this hunter-gatherer tribe tell us about where the modern diet is going wrong? #bbcfoodchain https://t.co/qD6QI2g0xU", "Young families 'hit by income slowdown' https://t.co/qQhckEVOIq", "John Bernecker: Walking Dead stuntman dies in fall https://t.co/uHRLyZH3b8", "When cash is king https://t.co/rB3viyJjrb", "Jamie Dimon rails against the state of US politics https://t.co/vWpDyb7Zxq", "Barclays in talks to expand Dublin office post-Brexit https://t.co/Qn7WnKBoch", "Waste products, not crops, key to boosting UK biofuels https://t.co/2Z1m6gjqIT", "India exports tuk-tuks or 'auto rickshaws' to Africa https://t.co/lGRUkvv7SW", "JP Morgan Chase second quarter profits rise to $7bn https://t.co/EvJ5DyLjyd", "Looking into our food past to solve our food future #bbcfoodchain https://t.co/EEdx08jkyb", "Would you consider writing your will in a text or an email? https://t.co/oCM058puZb https://t.co/MKwkCmwKbu", "RT @BBC_Capital: Are you living in the wrong city for your career? Moving to one of these cities could change that: https://t.co/MN9lbKGMEd", "EasyJet picks Austrian base for post-Brexit plan https://t.co/2lqqMqEpLF", "FTSE 100 opens lower as AstraZeneca shares fall further https://t.co/beysP6Qqcb", "Visa considers incentives for UK firms to go cashless https://t.co/UFRhFNyk77", "Amazon warehouse firm GLP bought for $16bn https://t.co/TIpQ5h3zh4", "RT @sameerhashmi: This is a big development - India's Supreme Court orders CBI probe into fake encounters in Manipur", "New chair wants Treasury Committee to widen its scope https://t.co/RXRr7NpQv9", "Rakuten boss Hiroshi Mikitani talks noodles and Barcelona https://t.co/oqgziUIni5", "The BBC's Aaron Heslehurst on the story behind the Smiley https://t.co/2ZALuHHc7M", "Liar! Liar! https://t.co/LJebKco1BC", "US opioid abuse 'linked to jobs market' says Fed boss https://t.co/Pg5VPGzUBY", "Rail passenger satisfaction 'little changed in a decade' https://t.co/0gyOa3yGX8", "Trump hints at climate deal shift in Paris talks https://t.co/XVwPWNXCzt", "Yandex and Uber combine forces in Russia https://t.co/7UCGM7BoRr", "Air Zimbabwe lays off half its workforce amid financial woes https://t.co/NHZIk3oWpk", "Weak pound sees surge in tourists visiting UK https://t.co/ez4bRqeTkL", "There's money to be made in showcasing your home to the world. #moviemagic https://t.co/LAXiEyaOy6 https://t.co/ech41h4qvU", "Formula 1 signs Snapchat deal ahead of British Grand Prix https://t.co/LKX7Vte8c9", "Facebook Messenger gets adverts added to app https://t.co/awAypbwcRT", "Google announces London cloud computing data centre https://t.co/Adrf9ApqUf", "RT @BBC_HaveYourSay: If you've suffered mental health difficulties we'd like to hear from you\nhttps://t.co/l7pNhawKeP", "@BBC_HaveYourSay Well @BBCLeisha started this...https://t.co/tpNjLa4yCu", "Luxury phone-maker Vertu collapses https://t.co/poOW4xGspv", "Health the biggest risk to UK finances https://t.co/XQxEJ1Oohe", "Qatar Airways CEO sorry for calling US air hostesses 'grandmothers' https://t.co/LAhgVno5gH", "RT @bbckamal: \"Pressures on public spending abound. By far the biggest relate to health.\" @OBR_UK Fiscal Risks Report", "RT @hairydel: Violence in and around betting shops is rising in London https://t.co/9APjUa9Ddh", "RT @BBCNewsbeat: A New Zealand woman has died after being hit by the air from a jet's engine https://t.co/Ta71eaoyEO https://t.co/T8qNN4bLMk", "Is #Brexit a 'chocolate orange'? https://t.co/1u5ixO8r6H", "How do you coax oil out of the ground? https://t.co/zQwZDIrj5I #futureenergy", "Would you consider writing your will in a text or an email? https://t.co/8rHtYMGRmC https://t.co/bVoqCSJnEK", "The maker of Havaianas - perhaps the world's most famous brand of flip-flops - has been sold for $1.1bn ($850m) https://t.co/UyG2vIwdgQ", "A Kolkata charity has copyrighted the blue and white striped pattern on nun Mother Theresa's sari. https://t.co/kgZVVwkYXX", "What's the view like from your office? @ reply with your pictures https://t.co/qyZOCvpgNR", "RT @BBCTech: Facebook shuts down 'legal pot shops' https://t.co/LmodrLamRC", "@vanessa_jm_gray Scruffles doesn't look very busy, we're afraid. What's their business strategy?", "@NoConceptOfTime @Buses_McGills Angus looks very serious. What does he think of the state of the markets?", "@Steve_WhiteUK Steve, thanks for sharing. Do we have a name and job title for such a beauty?", "What can a hunter-gatherer tribe tell us about where the modern diet is going wrong? #bbcfoodchain https://t.co/jqIBij87yp", "Cambodia bans sand exports permanently https://t.co/SMCsBOuYWE", "RT @BBCNorthAmerica: What exactly is #NetNeutrality?\nhttps://t.co/3SWdkmgxyw https://t.co/TMTd5g0ST2", "Mike Ashley's Sports Direct buys 26% stake in Game Digital https://t.co/7Vg6nYJXy8", "RT @ruskin147: Web inventor comes out fighting on net neutrality https://t.co/8u1GYBpxAc", "Will law should be brought into 'modern world' https://t.co/2qNsu5tNq1", "RT @WillSmale1: The homeowners hiring out their houses as film sets https://t.co/SHhDbnf7JS https://t.co/hNUEyYs1u4", "AstraZeneca leads FTSE 100 lower https://t.co/ctOomeKxra", "What's your office mascot? @ reply with your pictures https://t.co/p1jCaIDHRN", "Southern rail: Government fines owners over delays https://t.co/Nty6vWlHEi", "RT @DaveLeeBBC: Facebook is doing what it can to try and attract moo users https://t.co/vQ3jYn7yb2", "RT @kprescott: Another pay row is brewing at British fashion house Burberry. This morning's biz pod @BBCr4today https://t.co/vi04v2kA0s", "New customs system may not be ready for Brexit, NAO warns https://t.co/KEWW0UpUd1", "Havaianas flip-flop brand sold in $1bn deal https://t.co/SioRwIPmhK", "Brexit: Irish business leaders warn of 'calamitous divorce' https://t.co/LkGM8FETld", "Far from crude https://t.co/3fAhEM5wgP", "Living on location https://t.co/RBXlKxYSLw", "Estate agents have lowest stock of homes for 40 years https://t.co/eQyEvHvK8i", "US to renegotiate Korea trade deal https://t.co/APLfVHM5Uo", "Janet Yellen testimony: Six takeaways https://t.co/dgrCtSAYXU", "Nicky Morgan to lead Treasury committee https://t.co/i9H4OoOwfI", "Brazil's ex-President Lula convicted of corruption https://t.co/9bNjPNXI9e", "Google not liable for back taxes in France https://t.co/tVgmEoYPiS", "Coca-Cola UK is to double the amount of recycled plastic in its bottles https://t.co/wL1pv84bYd", "Fed sees limits to interest rate rises https://t.co/moRBe10sxM", "Oversight of Greek spending to be lifted https://t.co/X799gO3Dvi", "Can an app for the blind guess Rory's mood? https://t.co/qPRRcApEDW", "Games giant https://t.co/uqGwgio309", "John West owners to improve tuna fishing methods https://t.co/Zsh5VR1NZp", "Why is Panipat in northern India known as the world's \"cast off capital\"?https://t.co/Lng2GuqtAY #oldclothes https://t.co/ef7k26Ll5i", "Gay man wins case for equal pension rights https://t.co/40ZuO2eE6z", "Why was Mother Teresa's uniform trademarked? @soutikBBC explains further. https://t.co/Wc8Zw6iD4u https://t.co/9tc2Jv445C", "UK unemployment drops to 1.49m https://t.co/uH2nQWDTpd", "FCA: More taking out drawdown pensions without advice https://t.co/cTJMB4sDKc", "Burberry sales helped by Chinese demand https://t.co/EfHySguIeq", "Trump's biggest fans? https://t.co/6VlWLUIGE1", "RT @elisabethmahy: Looking for a financial advisor clued up on pensions - pref under 30 due to subject matter. #journorequest", "RT @kprescott: BoE deputy 'not ready' to raise rates https://t.co/CICAEXZoUd via @BBCNews", "RT @tomdavies32: For those entering the workforce, a pension \"pot\" will be a luxury. https://t.co/UjUsl74rSj", "Tesco-Booker deal to face in-depth competition probe https://t.co/003ivwm3fA", "RT @suranjanasays: Whatever happened to #DinchakPooja? Fab stuff by @ayeshea https://t.co/YvPzmksOu8 @BBCIndia", "RT @BBC_Capital: Understanding the anxiety of unanswered e-mails https://t.co/s3u1I4X97j  https://t.co/USUStyUnT8", "RT @ruskin147: Off to Microsoft's pitch to be a leader in AI - more later, including an app that sees the world for blind people", "Crown Resorts staff freed from Chinese jail https://t.co/VxsNIvFqjS", "Qatar crisis: Air-lifted cows start arriving in Doha https://t.co/Uq4NYpdbjm", "Hitting the brakes https://t.co/1IwVYZUuE2", "Toyota targeting US millennials https://t.co/uTBmjWtLef", "Rags to riches https://t.co/99e3D9MUQm", "Aldi 'best supermarket for customer satisfaction' https://t.co/y2ShSxaXYo", "Lloyds Bank to abolish charges for unplanned overdrafts https://t.co/4lGOuNTq5v", "Thomas Cook wins fake holiday sickness case https://t.co/ACvMuvla8t", "The #TaylorReport has criticised the \"cash-in-hand economy\" - but how many of us still use cash? https://t.co/nFYFifTQzx", "RT @BBCSimonJack: JP Morgan boss sounds Brexit job warning - BBC News. My blog from Paris.  https://t.co/RNRAx87hFG", "RT @MartinSLewis: BBC News - Martin Lewis looks at student finance https://t.co/DKumwXCawv", "TripAdvisor teams up with Deliveroo https://t.co/54MncY68b0", "RT @andyverity: 1/2 Taylor:  The level of NI contribution\npaid by employees and self- employed people\nshould be moved closer to parity...", "RT @bbckamal: Here's the @RSAMatthew report in full https://t.co/d0IC4JPw4w #TaylorReport", "RT @BBC_Capital: The best jobs for the smart, but lazy https://t.co/ICkfDghR1e  https://t.co/PV951DdMqI", "RT @matthew_wall: From toasting marshmallows to learning computing...\nhttps://t.co/qa10PZV1qQ", "Store Twenty One collapse costs 900 jobs https://t.co/660GSKw7pE", "Ofcom sets out rules for mobile auction https://t.co/p89jdmDHzK", "South Korea tourism hit by China ban https://t.co/yI9vUMx3ol", "RT @brianmilli: Brilliant explanation of student debt by @martinslewis. Every student should listen https://t.co/ItZJWNlf3h", "Pearson sells 22% stake in Penguin Random House https://t.co/vcCCEByy2i", "RT @ruskin147: But Three describes Ofcom spectrum rules as  \"a kick in the teeth for all consumers\" - it wanted 33% cap", "M&amp;S slows fall in clothing sales https://t.co/xhoAoZvTIH", "RT @amolrajanBBC: So @Snap is trading below IPO price", "RT @suranjanasays: Indian campaigners protest over sanitary pad and tampon tax @BBCBusiness @BBCIndia  https://t.co/qiON6hbluO", "RT @rachelburden: Can we ever get rid of the cash-in-hand economy? Can anyone here say they NEVER pay cash-in-hand? @bbc5live", "Air India: No chicken in cattle class https://t.co/p8hP50tD4P", "Gig economy firms 'should pay national insurance' on workers https://t.co/8IuYLoerEO", "Guiding lights https://t.co/2JbNfHf5AS", "Tech boss attacks 'whiners' in angry email https://t.co/HDZ7L4yc9l", "Taylor Review: UK should end cash in hand economy https://t.co/uFhohmPXEV", "Amazon shares rise ahead of Prime Day https://t.co/APz2eUP9lT", "Dating app tech finds celebrity lookalikes https://t.co/Ddcrn93C6C", "One billion new pound coins have been minted https://t.co/4Vxo1c8Aox", "Google criticised over Ed Sheeran ticket adverts https://t.co/a7LQEPueGp", "Siemens in dispute with Russia over diverted turbines https://t.co/IevLvh7D9s", "Martin Lewis looks at student finance https://t.co/BkwZiphpaP", "Abercrombie stock falls as sale talks end https://t.co/slesLHnCFt", "BMW workers accept revised pension deal https://t.co/oKZYEhNlTn", "Drug industry to challenge Nice over new cost limits https://t.co/taV3FP7ZTS", "Tottenham Hotspur not for sale. https://t.co/CqzOYxkiH4 https://t.co/EQGhKUQZSr", "UK arms sales to Saudi Arabia ruled lawful https://t.co/GCetVmpsuY", "Fancy sharing the cost of a flight on a private aircraft?  https://t.co/XJSm2ZU6GD https://t.co/tGO6IwXuo0", "Tottenham Hotspur not for sale, says Premier League club https://t.co/MiSfgw4vmU", "Do you know how money works? https://t.co/X5pywlGFxo #currency https://t.co/kTVUaH5qzJ", "Stripe strikes Alipay and WeChat Pay deal for China access https://t.co/MObk4zaYZL", "Spider-Man: Homecoming beats US box office expectations https://t.co/VE7a38Z9HK", "RT @BBCNorthAmerica: Underground success https://t.co/x0eqEZjvyX", "RT @BBCTech: The coming battle over 'net neutrality' https://t.co/S8N39lxlwm", "Dalian Wanda deal: Why is China's 'Disney rival' being sold? https://t.co/D8dEHzH6tv", "Carillion shares dive on sales warning https://t.co/lcfSeX2VXW", "RT @paullewismoney: The country where all tax returns are published and why it works so well https://t.co/xM97LbYo3h", "RT @BBCPanorama: On tonight: Britain's food and farming - the Brexit Effect at 8.30pm on @BBCOne #bbcpanorama https://t.co/5lJPdF2xbK", "RT @sameerhashmi: I guess - all tea/chai lovers in #India would agree with that! #chai https://t.co/L62Dn8jO9r", "RT @BBC_Joe_Lynam: Holiday sickness fakers face government crackdown - BBC News https://t.co/BEHdmD6tix", "Philip Morris: Tobacco giant ordered to compensate Australia https://t.co/0bC9TP2BA5", "China shipper Cosco makes $6.3bn bid for HK rival OOIL https://t.co/EHMfEzDHZ7", "Indian campaigners protest over sanitary pad and tampon tax https://t.co/QiqwA4STQA", "Ex-Sainsbury's boss warns Brexit will hit weekly shop https://t.co/SR6yxtkp8v", "CEO Secrets: Opera boss says make it all about the people https://t.co/bH0KTEPTUn", "Medieval money https://t.co/oF0Jd9xZ43", "The Californian trying to make wine like the French https://t.co/yqDhxu0wot", "One man's quest https://t.co/xIPhihIuWm", "Underground success https://t.co/Hs5hROkJVf", "Shoppers 'in the dark' about Brexit effect https://t.co/8eOJGtAjbJ", "US laptop ban lifted on Kuwait Airways and Royal Jordanian https://t.co/TUJBCy5CA5", "Holiday sickness fakers face government crackdown https://t.co/aztJo7n1Ij", "Superdrug owner looks to expand in UK https://t.co/dP4mgBM8Eq", "Tesla's Elon Musk tweets new photos of latest car, the Model 3 https://t.co/KasfemJC6O", "Brexit may never happen - Sir Vince Cable https://t.co/2cYqI9WdHg", "Strikes hitting Northern, Merseyrail and Southern routes https://t.co/KcLAqyQHhn", "'Cheaper' Heathrow airport third runway plans proposed https://t.co/fpgFNifwl2", "'Images, not words' https://t.co/BigV0zYFUw", "RT @BBCJustinR: Adrenaline: what does it really do and how can you use the rush it brings to best effect? https://t.co/l2PmHUsjjE", "How did these cheap shoes help @dhrutishah find peace during her career break? https://t.co/JD2YSiCzC7 https://t.co/gIBRQ743Up", "How much do world leaders earn? https://t.co/cSJVD6iYiM", "Motor insurance premiums 'at record high' https://t.co/192HKQrdnj", "Select committees: Six Tories vie for coveted Treasury role https://t.co/HSL7z3fnXt", "Fancy sharing the cost of a flight on a private aircraft? https://t.co/gWpvU9iOQJ", "Why are jumbo jets being turned into beer cans? https://t.co/lsKXkl9FfF", "Fox host Charles Payne suspended amid harassment claim https://t.co/OKq20hDMcV", "Do you know how protected your personal data really is? https://t.co/riNFExIZqH #GDPR https://t.co/SV5Z64I5pf", "RT @PhilipHampsheir: Has someone unilaterally decided to tackle the office mouse problem? https://t.co/3KtExheMsu", "RT @BBCNuala: For Sale: Wedding Dress. Never Worn: Six dream weddings that were left in tatters - https://t.co/sTHUHKnNsT", "Fitness tracker firm Jawbone faces liquidation https://t.co/0LDDxbx9ZD", "RT @matthew_wall: \"Many businesses have no idea what to do...\" #GDPR https://t.co/8z0Fe4i20X", "US creates 222,000 jobs in June https://t.co/ja5BqVGTM9", "Clarks shoes returns to UK production in Somerset https://t.co/GoIbloNHai", "Dairy-free ice cream taps into 'healthy' treat trend https://t.co/cTEAgqEd3Z", "Audi manager arrested in emissions probe https://t.co/3f2r6BFphQ", "Car parker, Ivory Coast: 'I'm the boss of this street' https://t.co/uEFe2wXHJ7", "South Africa's booming private security industry https://t.co/0oZae1dX4n", "Why does Nestle add nutrients to processed food? #foodchain finds out https://t.co/iklHCL3W1x", "Using VR to improve designs for people with sight loss https://t.co/UM6eCv3QCv", "UK manufacturing output falls in May https://t.co/8zSPrS3mg7", "Could new data laws end up bankrupting your company? https://t.co/riNFExIZqH https://t.co/1UN1adcwc4", "Why are the elderly turning to crime in Japan? https://t.co/6eO7pfgG8L", "Centrica shares up on takeover talk https://t.co/bkUzLy54u4", "Former Catesby railway tunnel to be used to test racing cars https://t.co/z3vK3AvilZ", "House prices fall for third quarter running, says Halifax https://t.co/CbazGGZHEo", "RT @BenMBland: What have you missed out on by waiting too late to book? \nLet us know - @BBCRachelHorne &amp; @BenMBland on #BBCBizLive today.", "RT @BBCLeisha: Asia markets wrap: risk aversion takes hold ahead of US non-farm payrolls https://t.co/uJZrG6Om5f via @BBCBusiness #livepage", "Honour of Kings: China's most vilified online game https://t.co/cbf4CpDjER", "Tesla to build 'historic' large battery https://t.co/SfNYPoXVUd", "RT @gompertz: Thousands may be let down by funeral plans, report warns https://t.co/2UnOS5Uzl7", "RT @dhrutishah: Are cheap shoes the answer when you're on the hunt for peace? A little article I wrote: https://t.co/jOD85V4dWG", "RT @BBCKarishma: Cheryl Yeoh: 'It was sexual harassment at the highest level' https://t.co/co00pAfn1V", "Samsung sees record quarterly profit on chip demand https://t.co/S1Wde03gaX", "I'll make more money, but miss my mum https://t.co/H1gQQA5gFg", "The BBC's Aaron Heslehurst on how the Biro ballpoint pen became a million dollar idea. https://t.co/CHrSHeKc4F", "Shoe trouble https://t.co/BYjn8PJUwM", "Countdown to D-Day https://t.co/8xwqvi0Ecx", "Thousands may be let down by funeral plans, report warns https://t.co/ZhtPkXxy0M", "France set to ban sale of petrol and diesel vehicles by 2040 https://t.co/iTWqgPc8k6", "Cirque du Soleil buys Blue Man Group https://t.co/ahUicUAqLJ", "RT @BizFleury: Microsoft shares are down after the American tech company announced it's to axe up to 3000 jobs outside the US $MSFT", "RT @justinbones: Tomorrow's #wakeuptomoney Funerals, Brexit and Dairy-Free Ice Cream. Live 5.15 or podcast https://t.co/1JV3ZkdXUv", "Microsoft plans cuts in reorganisation https://t.co/hnGVafAGma", "CBI urges single market until Brexit deal https://t.co/qwNKMUkCRb", "RT @zsk: I spent ages talking with Cheryl - this is a big, important read. Hear her on @bbctechtent tomorrow too. \n https://t.co/2vUAJa4m3W", "RT @Vic_Gill: Elephant tourism is 'fuelling cruelty' https://t.co/2uShgFKn5G", "Sex scandal rocks start-up scene https://t.co/uL265addMA", "RT @benedict_king: Here's my account of an amazing day in court yesterday learning about the world of Mike Ashley https://t.co/HqEiSxtrOD", "RT @BBC_Capital: Terrible at remembering names? Here's the simple trick to never forgetting: https://t.co/0zl2fMmonW", "RT @BBCr4today: Go easy on the pouring cream... https://t.co/tZNOLTNelc #r4today", "Brexit: Airbus would suffer constraints, Barnier warns https://t.co/LgZLccMfDl", "ONS: Household income falling at fastest rate since 2011 https://t.co/5zIluvzddZ", "Lord Kinnock on Labour's City policies and credibility https://t.co/IbZ6h5BcgD", "Big jump in African tourists https://t.co/gkNsq7c1P6", "Sports Direct boss Mike Ashley is a 'power drinker' https://t.co/Xe8FIsaLj2", "Brexit should not end UK financial firms' access to EU, says FCA https://t.co/SqiaO7xlXA", "How essential is having a sense of humour when you're at work? https://t.co/SOa6r9kLBq #comedy #businessbrain https://t.co/pnyRoFVAis", "EU and Japan reach free trade deal https://t.co/gpvx1PlNUU", "Qatar Airways sees US laptop ban lifted https://t.co/h6wbWWsAD6", "Is food fortification a marketing ploy? #foodchain finds out https://t.co/xsVWBOt1LW", "How toxic are your clothes? https://t.co/VBNx3dl4gP", "Butter, milk and cream... could we be facing a shortage by Christmas? https://t.co/nYXihvxcVH https://t.co/An76zLtG18", "Why do we need smarter power plants? https://t.co/O9zte3lLiK #futureenergy https://t.co/CJJR1FHuh6", "British Gas investigated over switching fees https://t.co/OLYN3Goowq", "Reckitt Benckiser warns of permanent sales hit from cyber attack https://t.co/QmY6dCIS4g", "RT @BBCTech: Snapchat Maps: What you need to know about Snap Maps, the latest addition to the app https://t.co/fFWWUa4mxR", "AB Foods lifted by Primark sales boost https://t.co/2AJvWePHkv", "RT @WillSmale1: Is humour the way to keep an office happy? https://t.co/MX7G0Ujehh Read the latest BBC Business Brain article", "Baidu boss investigated for riding in self-driving car https://t.co/BzkEqyu7ii", "RT @Adrienne_Murray: How a strike has paralysed life in India's Darjeeling region  https://t.co/xBp8sdkxhI", "RT @BBCPolitics: One in three nursing homes in England 'fail safety' https://t.co/izU4HLtgzg", "RT @emilythomaset: Who is fortifying your food and why? #bbcfoodchain @bbcworldservice https://t.co/Fjv44lgYlA", "RT @BBCSimonJack: Mike Ashley - in his own words. And some of mine. Blog.  https://t.co/wUiiSHzr3P", "RT @JoeMillerJr: I took a spin around Boxberg in @BoschGlobal's self-driving prototype for @BBCWorld. Smooth. https://t.co/pgTTakHQyM", "JAY-Z's digital-only album goes platinum in under a week https://t.co/V2iUzX1PKf", "Arla dairy boss warns of Christmas shortages https://t.co/0oliccHUHV", "The Philippines guitar makers competing with karaoke https://t.co/ElgHYW87bz", "Fuel savers https://t.co/chGQuC1CAE", "No laughing matter https://t.co/kks0dhoR3h", "Six new things we know about Mike Ashley https://t.co/rnxWNJbEkn", "Airlander: World's longest aircraft in test flight https://t.co/CkfKOimouz", "BA cabin crew to stage new 14-day strike https://t.co/95uaiRnXar", "Alibaba reveals Echo-like smart speaker https://t.co/Z9nAZqdxhR", "Vauxhall takeover by PSA given go-ahead https://t.co/nMlaxEOYDr", "Ken Loach thinks Brexit will be bad for British films https://t.co/bX1HeutKkD", "Bosch brain drives autonomous Tesla car https://t.co/21ZvidREIS", "Worldpay ties up with US rival Vantiv in preliminary deal https://t.co/jX6V4gUvOh", "Spam is 80 years old. In the West, it's seen as cheap food.. but in South Korea, it's a bit of a delicacy. Why? https://t.co/Kd8U9hHafY", "Hackers steal Bitcoin funds from Bithumb exchange traders https://t.co/iUFHDg9Jgj", "RT @BBC_Capital: The typical expatriate profile is not what it used to be. https://t.co/hSXdLPEFTC", "UK productivity falls to pre-crisis level https://t.co/RoTqxlMSED", "UK car registrations fall for third month https://t.co/U82oPb2u6C", "Meet a 'moonshine maker' from the Kentucky town hoping to cash in on a total solar eclipse https://t.co/JunCcrSpN2", "RT @BBCr4today: How will sex robots change our love lives? https://t.co/Vi6mMH5ejB #r4today https://t.co/X04JqKeqFw", "Spam celebrates its 80th birthday https://t.co/hgRVdPRkJz", "Scottish economy rebounds in first quarter of 2017 https://t.co/6yWythUuyI", "Cheaper rail fares now available on day of departure https://t.co/OTczO9kTve", "Some tips to help you save money during the summer. What are yours? https://t.co/Oul2VnDEGf", "If we made better use of the secrets held within our DNA, could it lead to a revolution in the way we treat disease? https://t.co/t979YTCLdi", "Volvo to drop traditional engines https://t.co/uKQ37L0i8x", "HMRC wins Rangers 'big tax case' ruling https://t.co/MCoJlayFc3", "Ocado still tight-lipped on mystery deal https://t.co/OgFAWbiMjT", "Spam is 80 years old. In the West, it's seen as cheap food.. but in South Korea, it's a bit of a delicacy. Why? https://t.co/sABF8CTZ3k", "Persimmon surges but FTSE 100 becalmed https://t.co/dppU61tfu5", "On #BBCBizLive: As Volvo calls time on the internal combustion engine, are you ready to give up your gas guzzler? https://t.co/3PO18aOJBN", "Laptop ban lifted on Emirates flights https://t.co/PK2CbW96O5", "RT @AmirPaivar: And \"still\" is the key word!- #Brexit\nBBC News - London 'still Europe's top tech hub' https://t.co/ZWIhVqIiAx", "Shell pulls Malaysia cardboard cutouts after 'distasteful' groping https://t.co/4r8jKvxDIM", "London 'still Europe's top tech hub' https://t.co/UrdB77ijGx", "Summer holiday money tips to avoid overspending https://t.co/2VL7nvaxZD", "How much?? https://t.co/DjxX7KpwEM", "RT @BBC_Capital: How do you inject humanity into technology? https://t.co/CZO4Jf64C3  https://t.co/DPd3c172Lh", "RT @justinbones: Currys PC World makes safety push https://t.co/dgLuvS4V2t via @BBCNews", "Subway: What's behind the sandwich chain's success? https://t.co/ZEe9EnaT8L", "How would you describe the smell of Subway? https://t.co/YFxoBKR7Wu", "BT Sport wins TV rights to European rugby union https://t.co/46XF0kONPS", "Philippines bank boss promises continuity https://t.co/EclCpRt3RK", "What can you buy for $123.47? https://t.co/4bj2GdJEcn", "RT @BBCLeisha: Asia stocks fall after North Korea missile test sours sentiment https://t.co/E07SuKbE7F via @BBCbusiness daily live page", "Worldpay shares jump on takeover approach https://t.co/yVtw6sdvp1", "Lenders told to be vigilant over loans https://t.co/6Io2b4wJJa", "RT @matthew_wall: What's the connection between F1 and new-born babies?\nhttps://t.co/odMAClBULd", "FTSE 100 down but Worldpay jumps on bid talk https://t.co/YRA8tz02tX", "Sainsbury's sales boosted by warm weather https://t.co/PyW5HghWoj", "LeEco chairman 'has bank accounts frozen over debt' https://t.co/P7t4roAr3z", "The baby carrier made from Formula 1 technology https://t.co/e1jv4J9wT0", "F1 pedigree https://t.co/aHtiT56h3C", "Minimum wage for the self-employed, suggests think tank https://t.co/sxh0dysgWm", "Sandwich chain Subway plans expansion in High Street war https://t.co/PFE4fJ4XwB", "Senior MPs urge post-Brexit EU drug regulation deal https://t.co/72mPJC295X", "Philip Hammond says public sector pay has not changed https://t.co/MZKAzACtAq", "RT @BBCNews: Grenfell fire: Chairman prepared to hold 'very broad' inquiry https://t.co/HQ3BjNO6kY", "RT @BBCRealityCheck: Is public sector pay still above the private sector? https://t.co/bwLE8sp22j https://t.co/c6tncXQZAm", "Tesla boosted ahead of Model 3 electric car launch https://t.co/hCjqMs7C3g", "Ukrainian companies are still struggling with the after-effects of the recent cyber-attack. https://t.co/qaADnpizHS", "Ex-Barclays bankers appear in court https://t.co/Cua2umdU8q", "Mike Ashley 'vomited into fireplace at pub meeting' https://t.co/Mg8ajSPtx6", "Ultra-fast broadband fund launched by UK government https://t.co/4YpexTAubf", "Etihad flights to and from US avoid laptop ban https://t.co/QDYd7xvq2p", "Mortgage-seekers ignoring extra fees, says Moneyfacts https://t.co/dALMIHd1qN", "Baby Dove adverts criticised over breastfeeding stance https://t.co/Ez7YCDKGbq", "The Office: Life after a virus https://t.co/PZ6Ty7IRbX", "RT @BBCNewsGraphics: 10 charts on 10 years since the UK's #smokingban in workplaces https://t.co/14H84gwFzk https://t.co/H1j35ya5st", "Bank of England staff to go on strike https://t.co/FbPWd3ocbS", "Superdry owner Supergroup plans sports stores https://t.co/APTQKRvsQF", "Hinkley Point: EDF raises cost estimate for nuclear plant https://t.co/YiksM5EYcn", "On the first day in his new job, Choe Peng Sum was told: \"Go make us a lot of money.\" He did that and more. How? https://t.co/Oe24uPIMEx", "How has your passport changed your life? https://t.co/KDzD8TeflB", "City of London 'to press EU for post-Brexit deal' https://t.co/X88AQGdKbB", "Tencent introduces limit to combat online gaming addiction https://t.co/iIFODeitQB", "Foreigners get more access to China bonds https://t.co/bJQJDQRvTI", "New energy price cap considered https://t.co/kRyoyEggkN", "Samsung salvages Galaxy Note 7 parts for new phone https://t.co/OZs8qKA4Mx", "Something to shout about https://t.co/yzI4BOHnv8", "CEO Secrets: Tips from a 12-year-old CEO https://t.co/Jd73AjFQHg", "Here to serve https://t.co/YOHwHohWsX", "Selling seats on private jets online https://t.co/A5rffDUxuc", "Bureaucratic block https://t.co/xTTWHiP2a8", "Flying high https://t.co/Ns22PEvXDQ", "Employers 'having to pay more to recruit new staff' https://t.co/KMFAhFrtnM", "Entrepreneur unleashes power of moss to clean city air - FULL VIDEO: https://t.co/3RmLnt9BjZ #ICYMI https://t.co/WikWFG09Fa", "Scottish economy 'still suffering from oil slump' https://t.co/FKkv95lXea", "Iran to sign gas deal with France's Total and China's CNPC https://t.co/rs2qBobexb", "Pay for under-40s is 11% lower than in 2008, says report https://t.co/R8kiMqqArA", "UK to withdraw from international fishing arrangement https://t.co/r1A5EjdmwT", "Fyre Festival co-founder arrested and charged with fraud https://t.co/ByWLjWLX9u", "UK to withdraw from London Fisheries Convention https://t.co/CNdPGeDuAZ", "Will the planes of the future be battery powered? https://t.co/ULmDG1qjB1", "Pressure grows on No 10 to end public sector pay cap https://t.co/KaPN9BYeJj", "What countries spend the most money on beauty? https://t.co/QZ64JMIvPa https://t.co/JG2vW26Fdj", "Does society shape cookbooks, or do cookbooks shape society? #bbcfoodchain finds out https://t.co/qVo6jyPtc8", "Martin Shkreli's trial shines light on US healthcare debate https://t.co/kqweJCajrd", "India GST: Sweeping tax reform introduced https://t.co/teDkNnHf4Y", "BA to get strike cover from Qatar Airways https://t.co/OQOkHt9MPk", "How Super Glue became a million dollar idea https://t.co/aiifrJzuyn", "Qatari riyals no longer available at many UK banks https://t.co/QSkyVB3i4G", "RT @matthew_wall: Could \"surge pricing\" be coming to a supermarket near you?\n\nhttps://t.co/8kniK0kisx", "How is 'surge pricing' going to affect you? Will your bananas cost more at night because of your buying habits? https://t.co/XHcK3Z1oCA", "How has a suicide prevention course helped Britain's railways? @BBCwestcott finds out more: https://t.co/jVbbPzpmDp", "Rocketing house prices in Hong Kong push first time buyers into ever smaller homes https://t.co/8UgIjx8Rcw", "Cultivating Angola's banana crop https://t.co/9WNX5FywPp", "'Challenging the narrative' of African art https://t.co/J8HzmwFcCk", "RT @BBCwestcott: BBC News - Rail suicides: Samaritans' training course sees numbers fall https://t.co/lTZX3zF4iS", "Lloyds misses own compensation deadline https://t.co/L6reGHcZhj", "Ron Dennis ends 37-year association with McLaren by selling shares https://t.co/UehgYm8bN9", "UK economic growth confirmed at 0.2% in first quarter https://t.co/q1mwk3yAhe", "Why did this woman spend more than half her life collecting recipes? #bbcfoodchain https://t.co/bCOVNYjZCK", "Weetabix vs Weet-bix: UK cereal held by New Zealand customs https://t.co/hb6HSbHOOd", "RT @JoeMillerJr: Full story here: https://t.co/Q0MMXbRqFa", "Germany votes for 50m euro social media fines https://t.co/CvIhpekbhG", "RT @BBCTech: Germany votes for 50m euro social media fines https://t.co/96oJQkz3gF", "FTSE 100 falls but pound holds above $1.30 https://t.co/QLVrJIon9n", "Game Digital warns on profit on low Switch supplies https://t.co/1Zg0Pv9f1P", "RT @FergusNicoll: Our second @bbcworldservice @BBCWorldBiz live show from #HongKong20 with #XiJinping in town:  https://t.co/6oqx9E034a", "RT @newsroomgirl: Grenfell Tower: Cladding 'changed to cheaper version' https://t.co/AmxosKSTvA", "RT @ruskin147: Raspberry Pi scores UK's top engineering award - congrats to @EbenUpton and team  https://t.co/rkCZVmvUEL", "Cutting rail suicides https://t.co/N11D75JRyS", "Well that's cheating... https://t.co/ljJVcxJrBX", "A very personal take on the Asian financial crisis from our very own @BBCKarishma https://t.co/f3FeIWcJXv", "Bitcoin accepted at New York pre-school https://t.co/alm8UrbN5K", "Artist recreates Star Wars trailer on 1984 Apple computer https://t.co/KWhvshtqjz", "Surge pricing https://t.co/BL1zxuAKKf", "Citizens Advice warning over 'phantom goods' scams https://t.co/QDxfzyq7CJ", "20 years on https://t.co/j6dD3C8dLW", "Asia's 1997 financial crisis: How did it happen? https://t.co/ExYSpy56CF", "Online fraud 'overlooked' by government says watchdog https://t.co/aD5EtMH7uh", "Haldane: UK pay has flatlined https://t.co/gADXYdQNJl", "Jeremy Corbyn sacks three frontbenchers over single market vote https://t.co/P5UwIJYj5O", "UK 'frustrated by flatlining pay', says key economist https://t.co/eUoZtuLBFu", "EU appeals WTO decision in Boeing dispute https://t.co/BUebh7Iz9d", "Last governor of Hong Kong says we must hold China to pledges in the territory https://t.co/cEIFP6wjo2", "Explaining India's Goods and Services Tax: In 90 seconds https://t.co/Wd9RkolSjO", "Why a German start-up wants cities to embrace 'moss power' FULL VIDEO: https://t.co/13eDGmnabB https://t.co/qj2qMp0End", "Should men have to wear ties to work any more? https://t.co/09b3jonfue", "Could LA cars be powered by crystals? https://t.co/3pOkEk8XfT https://t.co/M5nNlsdQGe", "US growth rate revised higher https://t.co/LNMEEPQWbw", "Sony Music goes back to vinyl records https://t.co/DIHgDqR1Sm", "Nigeria: Ogoni widows sue Shell over military crackdown https://t.co/ysHRNl3y1G", "Walgreens Boots Alliance scraps plans to buy Rite Aid https://t.co/HdlcsS3Wq5", "UK expats in Spain outnumber Spanish in UK https://t.co/8P8ndNMAAE", "Murdoch Sky takeover decision delayed https://t.co/GSHEkTAjpA", "Malawi and Unicef launch drone air corridor https://t.co/OBaOpmV1Fb", "RT @BBCSimonJack: Govt refers Sky Fox merger to competition authorities for further (phase 2) inquiry.", "Would you take a career break in your mid-thirties? What would you do? @dhrutishah tried to find peace https://t.co/iulFKOcgHr", "The best inoculation against needing a food bank seems to be a full-time permanent job. @seanjcoughlan on #foodbanks https://t.co/UijwVpengf", "RT @emilythomaset: Never underestimate the cookbook #bbcfoodchain https://t.co/nt5fUa8Ncp", "A weak pound may be luring clothes shoppers to the UK, but how are shops coping with the change? https://t.co/COCE4ZnCs3 #globaltrade", "Bank of England: Wales facing cost of living 'squeeze' https://t.co/KhuVKeGGlf", "Global beauty price gap revealed https://t.co/Axo8GOez6v", "Nars make-up boycotted, after cosmetics tested on animals in China https://t.co/4P9VZAHPhQ", "Rolls-Royce safeguards 7,000 jobs in East Midlands https://t.co/uTksDmKhPC", "When you take the food out of cookbooks, what do you have left? Quite a lot it turns out https://t.co/8GyEiSkq1a #bbcfoodchain", "UK car output fell 10% in May, says SMMT https://t.co/oK0EgsqX5H", "HSBC leads UK stock market higher https://t.co/WiBz951fH9", "RT @zsk: Here I am inside the Ocado driverless delivery truck - with nothing to do! https://t.co/RRKljeXuvj", "Tesco and Booker call for fast-track competition probe https://t.co/I8KELPpKlb", "BT auditing under investigation https://t.co/u7oRktrEEP", "Start-up reinvents the tree to beat pollution https://t.co/xFiEVigPcX", "Southern axes quarter of trains as drivers' overtime ban begins https://t.co/WwG6FSANrS", "Are you a time ninja? We talk wacky job titles w/ @ProfCaryCooper @rdhearing @thewritesush next on Business Matters https://t.co/6MI3WJSxRL", "Convenience food https://t.co/0e2JyV2Mo9", "Ocadao supermarket trials driverless van deliveries https://t.co/OgMykoNewA", "Visiting Europe's largest permanent VR facility https://t.co/5EwLaXzwGA", "India's IT industry: What has gone wrong? https://t.co/zEJPx9btIn", "Conflict Resolution https://t.co/m5e0mQoPXf", "Crystal energy https://t.co/deL9KQjClP", "Global demand for opals soaring https://t.co/MaBh8rJobF", "Decision on Fox's Sky takeover due today https://t.co/UtT40IO1sw", "Glittering prize https://t.co/XWxDxFTCvR", "US banks clear stress test https://t.co/zuBcg81PTj", "Air India cleared for privatisation by Delhi https://t.co/WuaHlpdAXK", "Tax software blamed for cyber-attack spread https://t.co/XS4cyE1Z4A", "Pound jumps on Bank of England Governor's rate rise hint https://t.co/BTPJtTqnae", "Arrests in UK over Microsoft scam calls https://t.co/sS3J9DtMLP", "Stagecoach hit by Virgin East Coast rail line woes https://t.co/qIPC00TNcY", "Tesco to axe 1,200 head office jobs https://t.co/QDB7ZKns4i", "Wrong time for interest rate rise, Cunliffe warns https://t.co/0UtmsTmavv", "Uber to appeal against English tests for drivers https://t.co/MqOtBOy8P7", "City watchdog cracks down on investment industry charges https://t.co/8qmHSx31uz", "RT @dominicoc: In @FCA report - a further investigation planned into investment platforms like @HLInvest", "Stagecoach stumbles as markets cool https://t.co/eZSd3l9dK6", "Dixons Carphone reports record full-year profits https://t.co/8SjEIHFvpI", "RT @BBCr4today: Listen back to that @BBCMoreOrLess episode on who pays tax here... https://t.co/sEdewPu87Q", "RT @BBCBenThompson: I've gotta up my game. @mrdanwalker out numbering me this morning on @BBCBreakfast https://t.co/9hPvVG6MqH", "RT @gompertz: Not many homes for sale so prices rise despite \"emerging squeeze on household incomes\" says Nationwide", "RT @bbckamal: On @BBCr4today 8.30am with former MPC member DeAnne Julius discussing all things austerity", "Volvo's driverless cars 'confused' by kangaroos https://t.co/0ETrvTyDFR", "UK house prices rebound, Nationwide says https://t.co/9t1W7WsKY8", "Toshiba sues Western Digital over memory chip sale https://t.co/QBXC0JHTuJ", "Faecal bacteria 'in ice in Costa, Starbucks and Caffe Nero' https://t.co/BO2fRwUEdF", "In or out? https://t.co/wsZnQGTyks", "More for less? https://t.co/p6E9BVluzw", "Mobiles 'fast replacing' bank branch visits https://t.co/yEfRzZE296", "Sir Philip sold BHS to dodge pension cost, says regulator https://t.co/JiDr0jSAgo", "Federal Reserve chair Janet Yellen urges soft Brexit https://t.co/XHsDImljum", "Facebook hits two billion users https://t.co/u5oTVApsUv", "Britain's best and worst shopping districts ranked https://t.co/iC1rTwTOOa", "David Davis: Brexit 'as complicated as moon landing' https://t.co/f4nIakB7F9", "IMF cuts forecasts for US economic growth https://t.co/Rj5075CpSh", "RT @danielgallas: BBC News - Body Shop bought by Brazil's Natura - deal signed but pending regulatory issues https://t.co/et1GyGX0pG", "Effect of union laws on industrial action and strikes https://t.co/MptW9rm32e", "RT @BBCTech: Ukraine hit by major cyber-attack https://t.co/hb6SO64mCZ", "Savers face 'never-ending battle' https://t.co/SUuS5waQSG", "Body Shop bought by Brazil's Natura https://t.co/xlRpVKFYF9", "Ukraine hit by major cyber-attack https://t.co/qKKIjzfZG9", "RT @gompertz: BBC News - The first cash machine came into use 50 years ago today https://t.co/F8itcFfZWL", "What's the difference between a hard or soft Brexit? https://t.co/PDJQGGnNkZ", "Super Mario World and Yoshi's Island are set to be re-released as part of Nintendo's new classic SNES https://t.co/5UaVZUKVXr", "RT @Theothebald: #Google/Alphabet fined E2.4bn by EC for competition breaches. Row over treatment of US firms likely to resume", "RT @bbckamal: Bank goes \"amber\" as consumer debt rises at fastest rate since 2005 https://t.co/5gdVCN3v24 My Economics Blog", "Google hit with record EU fine over Shopping service https://t.co/sopKwbDTi5", "RT @PeacheyK: ATMs, trams, and the future of cash in one story - https://t.co/0mZf9a0tlN", "RT @ruskin147: EC fines Google record 2.4bn euros for giving illegal prominence to its shopping service", "RT @BBCRoryCJ: EC fines Google record 2.4bn euros for giving illegal prominence to its shopping service", "Bank of England takes action over bad debts https://t.co/89TJMH2bPu", "RT @matthew_wall: Look...the ants don't actually power the bus...it was just a...oh never mind. https://t.co/bUAo1BrlTn", "Western Digital resubmits Toshiba chip unit bid https://t.co/WRViNwqoxz", "'Pharma bro' Martin Shkreli fraud trial opens in New York https://t.co/Tn8vWYzZvC", "Debenhams shares slip as sales dip https://t.co/xO3oBIf9ln", "Ice cream rush helps supermarket sales soar in June https://t.co/QO6zwG9WUk", "Ant power https://t.co/pYlXZPXDVg", "The first cash machine came into use 50 years ago today https://t.co/M0toCE1QbI", "Scottish areas worst for broadband speeds, says Which? https://t.co/Gbn7YOMj59", "Cash 'lives on' after 50 years of ATMs https://t.co/kDH79i9Z02", "SpaceX completes launch and landing double bill https://t.co/5O9MFM2wnv", "Grenfell Tower: Cladding firm ends global sales for tower blocks https://t.co/sGdENxoelc", "UK safety standards are 'cut to the bone', expert says https://t.co/qWUrv4TAYI", "Shares in Grenfell cladding maker sink https://t.co/xm3KF899lw", "'The government's approach to Brexit will not change' https://t.co/yza647pabv", "A High Street star? https://t.co/Ej0HaZNCeM", "Gmail to end ad-targeting email scans https://t.co/Sb9AhRBADX", "Growth in personal debt is slowing, says BBA https://t.co/0VosLHLqzx", "Lord Adonis: Brexit delay over Heathrow must end https://t.co/2MkHJKphwd", "FTSE 100 rises as bank stocks rally https://t.co/U1B8V9TC5T", "Energy industry has an 'opportunity' to oppose price cap https://t.co/oY9qq4791A", "Co-operative Bank no longer up for sale https://t.co/jhnQxFL2YM", "Crown Resorts staff jailed for enticing Chinese gamblers https://t.co/tB1AYBQecU", "How I stayed in business during Asian Financial Crisis https://t.co/aoRgg61FzL", "Takata: Airbag-maker files for bankruptcy https://t.co/VskeKhasqX", "CEO Secrets: Bumble founder says don't take yourself too seriously https://t.co/a3bXXCGG62", "Tricky trade-off https://t.co/okcjy2l5la", "Business confidence on the up, Lloyds survey finds https://t.co/M59RzopaSM", "Brexit: David Davis 'pretty sure' of free trade deal https://t.co/c4s6wDhG2A", "Parliament cyber-attack 'hit up to 90 users' https://t.co/z4SZx6l8Z2", "Wonder Woman continues to smash box office records https://t.co/w5Ft12pRHg", "Italy bails out two banks for 5.2bn euros https://t.co/5PGtpZ0r3R", "Royal Bank of Scotland to move hundreds of jobs to India https://t.co/ndV1j6rHTm", "Next boss Lord Wolfson calls for 'smooth' Brexit https://t.co/ZlyukZRplh", "Sausage roll row: US 'invents' new summer snack https://t.co/mDLMiBWYhW", "Free trade deals for 'poorest countries' to be maintained post-Brexit https://t.co/6NNOjgugB0", "Brexit: Tory MP Leadsom says broadcasters should be patriotic https://t.co/n64DyrOpk9", "Building society's account deadline axed https://t.co/zG1sDDLMaT", "Big hitters https://t.co/1CRzMVa5zI", "The start-ups plugging the hole in Zimbabwe's economy https://t.co/8Jw2PMONZ4", "Tesco is raising store staff pay by 10.5% over two years https://t.co/wfRU9vx2I5", "RT @BBCWorld: This poor Indian farmer ties himself to a yoke to plough his field https://t.co/kzVLQp8iY2", "The strange story of how Velcro became a million dollar idea on #TalkingBusiness with @bbcaaron @BBCWorld https://t.co/WB59f83oSQ", "London's temporary African-inspired architecture https://t.co/WO0gGHf1Cp", "How safe is your internet router? https://t.co/19n3OwCUu2", "RT @PeacheyK: In England in last six years, there was an average of four fires a week caused by fridge freezers, says @ElecSafetyFirst", "Togo's 'voodoo vacations' https://t.co/TxskzsZIVz", "One year on, what do economists and businesses think of the aftermath of the Brexit vote?  https://t.co/9jFQCZp1gJ #BrexitAnniversary", "EU prepares to move two agencies from London https://t.co/HsLVDg3Nnk", "Meet the man who travelled the world to meet the world's oldest people. What do their diets tell us? #bbcfoodchain https://t.co/wBYom6Csgy", "How Velcro became a million dollar idea https://t.co/4QcfWzBP7e", "Troubled Toshiba flags deeper losses https://t.co/loUmGUjAXG", "Shark attacks threaten Reunion Island tourist trade https://t.co/pSPt4bLcfX", "About 2bn people have no insurance, but \"pay-by-mobile\" policies are growing in popularity. How do they work? https://t.co/qc3Kp4cUrI", "ECB bids for more euro clearing oversight https://t.co/KncVWk1ZDp", "FTSE 100 slides as pound rises https://t.co/ThcV6i4lkR", "RT @matthew_wall: Don't poorer people have a right to insurance too? https://t.co/l2NMJIueLN", "RT @JohnMoylanBBC: Hinkley Point #nuclear deal 'risky and expensive' says @NAOorguk. @edfenergy #HPC https://t.co/Le1ZwLd7VX", "Watchdog clamps down on online gambling https://t.co/V34d0qX4hT", "RT @BBCKarishma: 'The weirdest city in the world?' - BBC News - our look at Astana, Kazakshtan  https://t.co/J2dEBYGDm2", "RT @BBCKarishma: How China's shaping one country's future - our piece from Kazakhstan  https://t.co/CusXKzPbm7", "Singapore's Instagrammable hipster Ramadan https://t.co/ULL31B1yBU", "Facebook launches initiative to fight online hate speech https://t.co/lHtWchbchx", "Virgin Media urges password change over hacking risk https://t.co/MkUWsO2JyV", "Fed: US banks have money for crisis https://t.co/aOrv4HkSeQ", "'I lost my eye' https://t.co/QRXNX1QPY1", "Better prospects https://t.co/JyJ5kw5Th7", "One year on https://t.co/jGzBiTIw31", "Premier Inn urgently reviews cladding https://t.co/nfWaX5qSYf", "Auditors lambast Hinkley Point deal https://t.co/C6s0Pt4NTy", "What's the recipe for a longer life? #bbcfoodchain investigates: https://t.co/O0QEkwOQ04", "New railway connection to London Luton Airport approved https://t.co/vavh5IUtGY", "UK rail ticket machines hit by IT glitch https://t.co/zL0ADcXTHS", "Why investing in midwives can save lives...https://t.co/YoSRPiBTP7", "'The weirdest city in the world?' https://t.co/7phkcdc2hM", "Hornby says takeover bid undervalues firm https://t.co/k4Ua1sYehC", "Raytheon: 'There's a broad range of threats' https://t.co/ge6SuRu8WK", "Pesto excluded from liquid ban by Italian airport https://t.co/MFstPDh5dJ", "Amazon accuses Walmart of bullying in cloud computing clash https://t.co/JmlX9KxeE3", "OOCL Hong Kong: Felixstowe Port welcomes 'World's biggest ship' https://t.co/8iQwBK7bY9", "Qatar wants 10% of American Airlines https://t.co/1zgYQWLqYQ", "Can younger people replicate the diets of their grandparents? #bbcfoodchain  https://t.co/oUSLNG1P0l", "Why does China have big solar ambitions - and can it meet them? https://t.co/WoJqWt7gkZ", "China raises heat over foreign investment https://t.co/jIcs5QVGe7", "Paris Airshow: Astrobotic's lunar lander is set for a Moon landing #PAS17 #siae2017 #airshow #LeBourget #AvGeek https://t.co/7AQ4iEojPj", "Fruit farm: 'One Brit applied in five years' https://t.co/lywwdYnXvL", "CMA clears Standard Life-Aberdeen Asset Management merger https://t.co/wSoYg51Sdi", "Paris Airshow: Preparing to land on the Moon https://t.co/cm2nKiwx7K", "Single parents win benefits cap High Court challenge https://t.co/BDylW2YFyO", "Spare landlords more tax changes, says CML https://t.co/ThjbZ96tJA", "Paris Airshow: eight takeaways from the major aerospace event https://t.co/REzcl1ooEr", "FTSE 100 drops as mining shares fall https://t.co/ctaOmi0Ojy", "HS2 franchise: Bidder shortlist revealed https://t.co/yUbAEcOqFx", "\"Dance like no-one is watching\". Can dance classes purely be about fun?https://t.co/L4cXzjjRfb", "Imagination Technologies put up for sale amid Apple row https://t.co/Wh018QbSrL", "UK summer fruit and salad growers are having difficulty recruiting pickers. https://t.co/48AnWwRabn", "WhatsApp rises as a major force in news media https://t.co/7o6WGqyY5z", "Green light for UK driverless car road trials https://t.co/ChxuvgkXtM", "Energy revolution https://t.co/NQQ1trRUZA", "'There's no judgement' https://t.co/xozoB4LQIs", "Fruit and veg farmers facing migrant labour shortages https://t.co/SQXVTazXHe", "Alibaba boss Jack Ma arrives in US https://t.co/GgNqGK4DBu", "RT @BBC_Capital: There are people making millions from your pet's poo https://t.co/BxcmS72ZJJ", "RT @stephbreakfast: The @BBCWatchdog class of 2017! @Mattallwright @FoxNikkiFox + me https://t.co/zRUKMmAyr7", "George Clooney's tequila firm Casamigos sells for $1bn https://t.co/rJ7XV4CINX", "The Philippines sits at the heart of the \"business process outsourcing\" industry. Why? https://t.co/pETD2rUOz0", "Etsy announces 140 more layoffs https://t.co/vyWJwVjtx1", "RT @zsk: The UK's first cash point, installed in 1984 - On display @IBMUKLabs https://t.co/z34qhckWr1", "Alibaba's Jack Ma courts US firms https://t.co/CdXicSgTd0", "There are 264 million young people without access to school, with few signs of progress, says Unesco. Why? https://t.co/W2HFlw6O80", "Tesco Bank customers hit by computer problems https://t.co/vlRKvCWMkC", "Meet the former banker who's not afraid of death.. but just what is his secret? https://t.co/VbULzDlqWe", "Wimbledon champion Boris Becker declared bankrupt https://t.co/hQm2KjUAYk", "In pictures https://t.co/mP7j4YFvwn", "Haldane expects to vote for rate rise this year https://t.co/SUZhKhbcNn", "1,200 Cardiff Tesco call centre jobs at risk, union claims https://t.co/2fLz7VbiNg", "Queen's Speech: Petrol stations to go electric https://t.co/AzfYbuOqPk", "Why suitcases rock and fall over - puzzle solved https://t.co/uHGIP3a2TH", "Just to clarify - this is for a radio show. We want to ask people about their experiences working as moderators - there is no job available!", "Flying cars are the stuff of sci fi fantasy no more! Jean-Brice Dumont of @AirbusHC speaks to @TheoTheBald https://t.co/CgJDmjsKzY", "Making aircraft parts with 3D printing https://t.co/8MXfV5s2IJ", "The college dropout who headed the most valuable start-up in Silicon Valley has quit. @DaveLeeBBC explains more: https://t.co/MLvE98DEKp", "How to spot if a friend is in debt. More details: https://t.co/p5FDYmGErq https://t.co/Q9QEwf91WB", "For full story: https://t.co/0vipGNNxCb https://t.co/CWBNDUmJWs", "RT @BBCBreaking: The key points from the #QueensSpeech https://t.co/MmtyyZbBL6 https://t.co/vDetqqRQp8", "Queen's Speech summary: Bill-by-bill at a glance https://t.co/DLbTDyEFMb", "RT @BBCVishalaSP: No mention of #DementiaTax or cap on energy bills in the #QueensSpeech", "Queen's Speech: Bill to secure UK space sector https://t.co/2YZV7U1YYH", "Building a supersonic successor to Concorde https://t.co/dXPZ3Yk0kz", "Provident Financial shares dive by 19% https://t.co/AyNZdGR3Z9", "Queen's Speech 2017: Lettings fees to be banned - finally https://t.co/r0tn8YXpa5", "RT @BBCNews: Heads warn parents of 'cash-starved schools' https://t.co/j2Zy9bSOof", "RT @BBCKarishma: BBC News - China's MSCI inclusion is a game changer - my quick take https://t.co/07LbT63p6K", "UK holiday fraudsters could face jail https://t.co/0ETiJ4SNYB", "RT @BBCBenThompson: Uber's boss quits: We'll have the latest on #BBCBizLive at 0830bst @BBCNews and @BBCWorld https://t.co/K2yCw61Qa0", "On #BBCBizLive: As the Ken doll gets a revamp for the 21st century - what childhood toy would you like to see reinvented?", "Chinese bike share firm goes bust after losing 90% of bikes https://t.co/OClaXBCeDG", "Uber chief Kalanick 'resigns' https://t.co/K4UBWBLmqp", "China shares get long-sought MSCI index listing https://t.co/rNAdXLTqPS", "Hidden problem https://t.co/JhKC4zqNvK", "A hot issue https://t.co/7udGNHIFBJ", "Philippines outsourcing https://t.co/1HmQnAnxeb", "Eight ways to spot a friend or family member is in debt https://t.co/maFaCdovgq", "Angolan capital 'most expensive city for expats' https://t.co/xDmCGCjGvU", "Ford moves Ford Focus production to China https://t.co/7FcfXeHZjn", "Netflix lets children call TV shots https://t.co/kq8fcfWvAw", "RT @ruskin147: \"Britain is open for business\" concludes @MattHancock at AI conference", "Mattel makes over Ken doll line https://t.co/b3y80A6NI1", "'Quiet Concorde' aims to revive supersonic air travel https://t.co/z4UWaydLPA", "South Western orders new fleet of 90 trains https://t.co/QPmE6SLVSB", "Decision close on Fox's Sky takeover plan https://t.co/xz0HcbPqmX", "Should women interrupt more in meetings? World Business Report takes a look.. https://t.co/GWKDmkqKu5", "How social is your brunch? #bbcfoodchain https://t.co/xyj9FAu7Ig", "Flying car: One way to beat traffic https://t.co/1e03CgNhM9", "Insurers should do more to help cancer patients, says FCA https://t.co/CN5T3SGZqn", "Mark Carney: UK wage growth 'anaemic' https://t.co/DkN6EHQmVi", "Jose Mourinho accused of tax fraud during Real Madrid stint https://t.co/dhEiLOBW5V", "Philip Hammond on Brexit: Prioritise jobs and living standards https://t.co/33c2iOhLzh", "RT @matthew_wall: Thinking of buying a car you can start remotely? You may want to think again. \nhttps://t.co/9v080QBniR", "Merkel reaches out to France's Macron on eurozone budget https://t.co/PFNcXmYmvR", "Rolls-Royce: Brexit uncertainty is an issue https://t.co/8MAYzfaWlX", "Tesco home deliveries hit by computer glitch https://t.co/oiHzcsiwMV", "Pound drops on Carney rate comments https://t.co/4hkBix4oJU", "RT @Ben_Morris1: Hammond says Britain 'weary' after years of austerity. More on Business Live. https://t.co/r4nErYQVKN via @BBCNews", "Mark Carney says time not right for interest rate rise https://t.co/SybtPd080e", "RT @BBCSimonJack: Barclays, execs face criminal charges. Did SFO pick the right target. My blog.  https://t.co/BxkAK1YZvc", "RT @dominicoc: John Varley charged in SFO investigation into Barclays' Qatar fundraising @BBCr4today", "Barclays and ex-staff charged with fraud https://t.co/hiDT3y5ka4", "Carmakers call for transitional EU deal https://t.co/mi79homXTL", "Australian A$11.3bn gambling merger gets go-ahead https://t.co/51qusJGq0X", "Grand theft auto https://t.co/ryik7Ev4Ab", "UK growth will be 'subdued' as Brexit unfolds, says CBI https://t.co/zDWejRiJIM", "Rolls-Royce boss warns against a 'hard Brexit' https://t.co/VIVbmdiF89", "Meal kit start-up Blue Apron aims to raise $450m https://t.co/Fl8w6Nwhj7", "Brexit talks: Davis 'determined optimist' after day one https://t.co/0TMNTDmAX5", "Snapchat expands television offerings https://t.co/jYqZYVTAwQ", "Let workers shed suits in hot weather, says trade union body https://t.co/B3rHLtzZe6", "Should we be able to dress down for work in the heat wave? https://t.co/4WeMxwBmrP", "Shareholders back Standard Life-Aberdeen Asset merger deal https://t.co/kznJAEyKrC", "M&amp;S says labelling avocados with lasers is more sustainable https://t.co/MWtvn6nqQO", "How hackers took over one man's life https://t.co/FPPD0Q9aA5", "#ParisAirShow: Boeing and Airbus under pressure at Paris Airshow https://t.co/HLduNs7qcj via @Theothebald", "RT @Theothebald: Evil bird - Embraer E-195 E2 at #ParisAirShow https://t.co/ZksNCvz4ne", "RT @Theothebald: Our preview of the #ParisAirshow https://t.co/gnBeJRF65P", "Boeing sees long term market growth https://t.co/VlnXzy6anG", "Silvana Tenreyro appointed to Monetary Policy Committee https://t.co/0ESuspAN72", "Boeing launches new version of 737 jet https://t.co/WQc9Ql90fm", "FTSE 100 in strong start to the week https://t.co/k8GdmYety6", "Co-op Bank in 'advanced' talks over fund raising https://t.co/xUh7MZkKAE", "Jaguar Land Rover to create 5,000 jobs https://t.co/WHQzrb6SAl", "Lynn Faulds-Wood: Government 'failing on product safety' https://t.co/OgoDyiVnrw", "Would you go into business with your bestie? https://t.co/FmmDoquxNe", "Gaming gift https://t.co/2dD9IEWU9R", "Brexit negotiations begin: David Davis targets 'historic' deal https://t.co/MftkzIgHy5", "Diva of divorce https://t.co/eXztKZNSbw", "Aerospace giants to vie for sales at Paris Air Show https://t.co/uTUs18wtJj", "Airbus unveils 'more efficient' A380 jumbo https://t.co/gdfxQb5p4s", "Business bodies come together in call for softer Brexit https://t.co/XQoVwM5uSs", "Keir Starmer: 'Customs union should be left on the table' https://t.co/i4YvmGVAVQ", "'Tory campaign failed to focus on economy' https://t.co/CHp3L4C51e", "Why do we spend less on Father's Day than Mother's Day?https://t.co/BEAGfqRBoa #fathersday https://t.co/f1zAhNBNpI", "UK wealth gap 'widening since mid-2000s' says report https://t.co/Ag4rdBWbSd", "Whisky and salmon boost food and drink exports https://t.co/gzuVnI0BOA", "Five robots that are changing everything https://t.co/3oagu2jXH3", "Pension savers 'missing out on top-ups' https://t.co/hoREV7trBu", "Why is Amazon buying Whole Foods? https://t.co/6nPywhQnJV", "Paris Airshow https://t.co/TXoCrW5abg", "Poor harvest causes maize shortages in Kenya https://t.co/hUz1v0hdeQ", "RT @BBCEmmaSimpson: Amazon buying Whole Foods in $13.7bn deal. Upmarket chain has more than 465 stores in US.", "Amazon to buy Whole Foods for $13.7bn https://t.co/BKUH9h3KGT", "Reality Check https://t.co/Q955FqRqg3", "McDonald's ends Olympics deal three years early https://t.co/S8EtrVSp8O", "British Airways cabin crew to stage two-week strike https://t.co/ewJPabhTXj", "Insurer Admiral gave customers incorrect details https://t.co/QpRIHK16YM", "Lake Tanganyika hit by climate change and over-fishing https://t.co/O8yWXXqYkS", "New US Russia sanctions bill riles Germany and Austria https://t.co/sPahI8xc59", "Mobile operator Three fined over 999 call issue https://t.co/eo7Aux8gPa", "Brexit talks: Hammond says jobs and economy the priority https://t.co/eKfPSZ4dBH", "RT @matthew_wall: Why you need to secure your smart home... https://t.co/pgtwkZyee8", "RT @BBCRealityCheck: Why do buildings like Grenfell Tower not have sprinklers? https://t.co/sSzEbIL8Z3", "Tesco sales surge lifts FTSE 100 https://t.co/WVEBnOlnRI", "Tesco recovery gathers pace in the UK https://t.co/vS8A8vIpDb", "Takata shares suspended ahead of expected bankruptcy https://t.co/b5rk2qthGR", "UK's fraud hotspots revealed by Which https://t.co/9fm2PNA6Px", "How the Rubik's Cube became a million dollar idea https://t.co/reBrlnxgRO", "Home hijack https://t.co/zpxyBtoWFs", "Prince Andrew: Brexit glass half full https://t.co/hc6FNPYe1A", "Uber faces lawsuit over rape investigation https://t.co/diIG6uUt0Z", "Duke of York: UK firms should make best of Brexit https://t.co/HIrAVuwnlt", "Eurozone ministers strike deal to release funds to Greece https://t.co/XcQPzDl6Bo", "Facebook reveals measures to remove terrorist content https://t.co/KCcqBq0esK", "US unveils new claims in 1MDB money laundering case https://t.co/8NfMsqkJN6", "Nestle may sell US confectionery business https://t.co/0D4vX21Fee", "Bridge card game 'should be exempt from VAT' https://t.co/NwfslDIrMV", "Spotify hits more than 140 million users https://t.co/LJqRYTrYjg", "Greek gifts https://t.co/tmuaSlPpt3", "RT @ruskin147: At #fflondon Prince William calls for tech industry to work to stop cyber bullying https://t.co/C4dbIEwymO", "Why do we spend less on Father's Day than Mother's Day? https://t.co/BEAGfqRBoa #fathersday https://t.co/UuEssyH2JO", "Germany 'confident' on deal to release funds to Greece https://t.co/2DKbPCV0VE", "RT @anthony_reuben: Pre-release access has been abolished - no more ministers getting the numbers in advance. https://t.co/xkANOpr2Dh", "M6 Toll is sold to investment group IFM https://t.co/2LeZu6jPrI", "Philip Hammond pulls out of Mansion House speech https://t.co/FCb3b5s9JG", "Yoko Ono added to Imagine writing credits https://t.co/a3d05lRxbx", "RT @bbckamal: Pound rises against dollar as Bank signals that \"gradual\" and \"limited\" rise in interest rates could be ahead", "RT @Theothebald: IAG CEO Willie Walsh says British Airways' computer meltdown had 'absolutely nothing' to do with how it resources IT", "UK interest rates unchanged at 0.25% https://t.co/AVPnzwKryF", "EU citizens celebrate the end of roaming fees https://t.co/zhYmnVxee9", "How BAE sold cyber-surveillance tools to Arab states: https://t.co/rwpFUzecfo https://t.co/MDmLET3Mty", "Mass surveillance https://t.co/MJlYeRyrYK", "Majestic Wine toasts turnaround plan despite loss https://t.co/9lU1DPripv", "Retail sales fall in May as prices rise https://t.co/F1sD9vpZqI", "Trump gets nine more trademarks approved in China https://t.co/etwlKVSVKb", "Will buses be run on coffee in the future? https://t.co/xeMqQ1MM4z #futureenergy https://t.co/VcCw97RZJa", "Company directors targeted by identity fraudsters https://t.co/qXZZpQ5ss7", "RT @andyverity: In non-food stores, sales FELL by 1.2% in May compared to the same month a year ago (ONS figures just released)", "Could a plan to send thousands of cows to Qatar help the country? https://t.co/Du8aXEwLvp #bovineairlift", "RT @Ben_Morris1: Big baggage handling problems at Heathrow Terminals 3 &amp; 5. More on the Business Live page. https://t.co/H8svN2KWmV", "RT @WillSmale1: Why do we spend less on Father's Day than Mother's Day? https://t.co/viwOFufuOT https://t.co/1yRjrJKlJO", "UK shares slip in early trade https://t.co/hBn6nn61G5", "Heathrow Airport Terminals 3 and 5 baggage system failure https://t.co/f2YjcqY7yH", "DFS blames general election for dwindling demand https://t.co/stuEdp2hcF", "Smartphone apps 'bad for my finances' https://t.co/zjDwaDPyXK", "Future fuel https://t.co/Qb0AxaJkAh", "Hard done dads? https://t.co/zRrUwSfOT7", "EU mobile roaming charges scrapped https://t.co/yxBsMiGpS3", "VW 'to address diesel fix concerns but offer no compensation' https://t.co/Bdmvlh17sU", "US key interest rate highest since 2008 https://t.co/aVHlQRCVbw", "'US rethinks Chinese investment in AI start-ups' https://t.co/rjOgCutkR1", "US retail shares hit as sales fall in May https://t.co/bAR8u7UzCD", "Worries over care home fees and funding https://t.co/dx4Wx9J8df", "UK unemployment is at record low but wages aren't rising https://t.co/tGeiMXZegr", "Airlander 10 reaches 'highest altitude so far' https://t.co/thtcwrbrTr", "EU court rules no dairy-style names for soya and tofu https://t.co/TIthAacw1s", "European employment rises 1.4% to hit record levels https://t.co/yp58qhv826", "Wages hit by higher inflation https://t.co/S8raU6CCty", "RT @BBCBreaking: UK unemployment fell by 50,000 to 1.53 million in the three months to April, official figures show https://t.co/2Dk2RHUNuD", "RT @PeacheyK: The everyday realities of living in serious #debt https://t.co/UcFb6gQbMY", "Guardian and Observer newspapers to become tabloids https://t.co/wrZKdEtqOr", "Inditex profits jump 18% as Zara sales soar https://t.co/x7lrJAM9lZ", "Borough Market opens after London Bridge terror attack https://t.co/n0ddPskwFl", "Wu Xiaohui steps aside as Anbang chairman https://t.co/P4515DN4y7", "Tough school? https://t.co/uQvHKstbDP", "Pay more, wait longer https://t.co/uocVVceSsL", "One in 10 in serious debt 'have no bed' https://t.co/SwFSUoiBes", "Trucker body to seek cartel compensation https://t.co/FclIvCIGZx", "Uber chief 'to take leave from company' https://t.co/xCIgH5zfhD", "Trump administration unveils plan to defang consumer watchdog https://t.co/hZt8LUyYah", "London could lose EU euro clearing role https://t.co/irWcqjekkL", "Vivienne Westwood gives her advice on new designers and fashion waste https://t.co/Q0WlSugT06", "Hello's sleep-tracking Kickstarter hit collapses https://t.co/8mZYv7nwza", "What on earth is this euro clearing - and why should you care? https://t.co/MAfnGoRC2j", "Toshiba facing fresh demand for damages https://t.co/wzwbViCQoI", "#ICYMI We asked Sophia - a human-like robot - about the meaning of life on #TalkingBusiness with @bbcaaron https://t.co/YnC3FGlTyK", "RT @gompertz: Retail Prices Index (RPI) rose to 3.7% in May, CPI measure at 2.9%", "RT @bbckamal: Inflation now at highest level since June 2013 @ONS", "RT @matthew_wall: Why the metals we need for our gadgets may be in short supply https://t.co/PEGRY2xWGt", "RT @andyverity: Inflation in the year to May was 2.9 per cent (ONS)", "RT @bbckamal: Inflation hits 2.9% - above Bank's forecast that it would peak at 2.8% Q4 2017 @ONS", "RT @andyverity: It's the first time in years that the price of goods is rising faster than the price of services: https://t.co/DSI3JOM9VI", "UK inflation rate rises to 2.9% https://t.co/Km1t3vl2bG", "Pound and FTSE steady in early trade https://t.co/mGSSNxRi34", "Care worker zero-hours contracts tackled by Welsh Government https://t.co/JiSt0DtxE2", "Terror attacks hit tourist attractions https://t.co/Bd0ZyXAcdW", "Heineken warned over pub merger plans https://t.co/Xpfkp4whU0", "Would you rent used baby clothes? https://t.co/MggVM3UlNr", "Are Trump's US economy boasts correct? https://t.co/GvnaYHF7uZ", "Precious metals https://t.co/BiHknd1jWF", "Payday loan complaints see sharp rise despite new rules https://t.co/sH3jZl4EZe", "EU mobile roaming fees 'may still catch you out' https://t.co/lZhXdyKi2W", "Manufacturers call for Brexit strategy rethink https://t.co/d3XlCuseFr", "Wall Street falls amid tech stock sell-off https://t.co/pn4TEbkKIx", "Earnings not 'Diddy' for top celebrities https://t.co/OoDG6AYunf", "Germany to test Porsche Cayenne after media report on emissions https://t.co/HoabqPgReO", "E3 2017: Microsoft unveils Xbox One X https://t.co/QhRpZ91gwn", "Uber set to lose another top executive Emil Michael https://t.co/7Gpt2mAM8O", "What business wants from Brexit https://t.co/MfyKzbHVN4", "Apple and Dell join Foxconn bid for Toshiba's chip unit https://t.co/AehD7KVDhs", "Qatar ships cargo via Oman to bypass Gulf restrictions https://t.co/Ee10HtTVMk", "Ineos unveils major expansion plans in Europe https://t.co/ccxOGEgARX", "Forbes rich list: Which celebrities earned the most over the past year? https://t.co/VlpZxRFbrr", "Man asks Twitch users to pick shares for $50,000 portfolio https://t.co/VHgMdBK1R8", "'We are skint': Spending falls for first time in four years https://t.co/diy0Jmtvsg", "RT @BBC_Capital: This is how to fire someone the Chinese way https://t.co/Weqze34fRz  https://t.co/kMj4ymiZv4", "Apologies for getting it wrong with that tweet.", "BMW workers reject new offer in pensions dispute https://t.co/5E2CeOUmW1", "'UK election result may delay Brexit talks' https://t.co/lZksnJzD5p", "Housing market: Affordability is 'biggest tenant concern' https://t.co/ANgk2OjhNw", "General Electric chief executive Jeff Immelt to retire https://t.co/mDzZJDJq3M", "How did the world's first accountants count? https://t.co/riKzF8eCT3 https://t.co/TwRQp4X8FP", "Stanley Gibbons up for sale following review https://t.co/zjQD1AjUFD", "RT @MarkSyred: \"59% of IoD members DO NOT want another election this year\" @the_iod tells #wakeuptomoney https://t.co/2fWVlQw0o2", "Sterling stabilises as May prepares minority government https://t.co/3zCWYQGUlK", "CEO Secrets: Cath Kidston says 'you can't do everything' https://t.co/se09C7oYmu", "Hung parliament sinks business confidence, IoD finds https://t.co/SY4tmSb7p0", "Trading tool https://t.co/2tIcj31jYB", "Food for thought https://t.co/HHJvF2oxFf", "Gay Pride: Abercrombie and Fitch accused of blunder https://t.co/yhm6AWGBkL", "Uber chief Travis Kalanick 'set for a bumpy ride' in board meeting https://t.co/gOby7A81lX", "Calls mount for rethink of Brexit stance https://t.co/CnJZBa9Vz4", "British Airways cabin crew suspend four-day strike https://t.co/cKYfpJgCLY", "Could you eat out at 250 restaurants a year? #bbcfoodchain https://t.co/Y9KipBj3Hg https://t.co/OcVXA8BDiL", "Mozambique silversmiths face modern competition https://t.co/k7QrfqWcm9", "Democrats say Dodd-Frank repeal is 'wrong choice' https://t.co/IwP7DfK5eL", "#UPDATED: Mars said the products affected (Galaxy, Maltesers Teasers and bags of Minstrels) should not be eaten https://t.co/KLUbnVh7Sr", "Mars recalls chocolates over salmonella fear https://t.co/KLUbnVh7Sr", "Business leaders demand answers over Brexit strategy https://t.co/BV3lwvYqpE", "RT @BBCVishalaSP: Political uncertainty typically helps government bonds. 10yr U.K. yields rise 3bps #markets #ge2017results", "RT @bbckamal: Theresa May suggests she wants to lead the government for five years", "What are the markets telling us about the election? https://t.co/dFLMw2AGqs", "Did 72% of young people really vote at #GE2017 @BBCRealityCheck https://t.co/13TLiM6MDv #BBCelection", "RT @matthew_wall: Is it time to rein in the tech giants: Amazon, Google, Apple, Microsoft, Facebook? \nhttps://t.co/0dIIKJGBTO", "How can Africa's electricity problem be solved? https://t.co/ddhFEyko67", "Election 2017: How the outcome hit the pound https://t.co/MzQ46LX2cX", "10-year-old app maker's plan: Change world, become turtle https://t.co/AWytlpjHUS", "UK election result welcomed in many German boardrooms https://t.co/Z8iI6CGfmS", "UK industrial output weaker than expected https://t.co/SsF896gGJQ", "#GE2017 We've got a hung Parliament - what now for your finances? https://t.co/pw0a8IlM5L @PeacheyK #BBCelection", "Election 2017: What now for your finances? https://t.co/O1dLrCaEsP", "Germany fears big losses over tax scandal https://t.co/29ViwXEgwn", "#GE2017 Politicians must act fast to reassure businesses in the wake of the election result, bosses say #BBCelection https://t.co/gBlSIJiWxK", "RT @adebradley: We'll be live on @BBCTwo very soon. @BBCBusiness https://t.co/gYY7rQTHUN", "Business and City leaders call for reassurance https://t.co/uXHvrgah7U", "Body Shop sale moves closer as L'Oreal talks to Natura https://t.co/USacgx5Fxw", "UK election 2017: The impact on Asian business https://t.co/OIRLlR3rO7", "RT @gompertz: Big uncertainty now over money issues: tax hikes, higher pension ages, care costs, triple lock. As MPs try to appease voters", "RT @gompertz: Short term pressure on GBP should ease and the currency should strengthen from here as the news soaks in - Panmure Gordon", "#GE2017 \"Once again, British politics has bamboozled international markets\", writes @BBCSimonJack https://t.co/Wr4041F9pZ #BBCelection", "RT @gompertz: Travellers will find their pound is worth a lot less and their holidays will be more expensive - Rupert Lee-Browne, Caxton FX", "RT @BBCSimonJack: Just about to do a Facebook live visit bbc Facebook page", "RT @richardcoll1: Tan Dhesi becomes Britain's first turban-wearing Sikh MP #BBCelection #GE2017 https://t.co/jgkBElkEzP", "Traders brace for volatile day for London shares and the pound after the hung parliament result #BBCelection #GE2017 https://t.co/UPY9tq1YBg", "Election 2017: Pound and shares set for volatile trading https://t.co/cHbIyOuG6u", "Taming the giants https://t.co/cRSaEZBYUG", "Qatar and the UK https://t.co/CllAPIIxYZ", "RT @markabroad: Tory MP Stephen Crabb says the party has ended up with 'more divisions and less stability'. #GE2017", "Softbank buys robot-maker Boston Dynamics from Alphabet https://t.co/k0hF7Vwn5A", "Just like Brexit, this election has caught investors off-guard. @bbckamal #BBCelection #GE2017 https://t.co/g6L1oxGDMV", "RT @bbckamal: GBP/US reacting to whether there will be a majority govt, not necessarily who will lead it #GeneralElection", "RT @bbckamal: \"The exit poll is a thunderbolt that leaves only two outcomes in play, slender Tory maj or hung parliament\" @samueltombs", "#GE2017 The pound has fallen sharply against the dollar after the official election exit poll https://t.co/uFf39cmXqW #BBCElection", "Pound slides after exit polls released https://t.co/iNX9hbbPSs", "Republicans aim to roll back financial rules https://t.co/qsKpEKxa3H", "BT drops PwC following Italian accounts scandal https://t.co/ab3FxpRP6R", "ECB keeps rates unchanged at zero https://t.co/RpJnUIrqQ4", "Tennis player faces legal action over Special K nickname https://t.co/OxsTAelQ5a", "Does British Airways' explanation of its systems crash stack up https://t.co/4BUbFDwpKx @BBCwestcott", "Aramco: London listing inappropriate, says Royal London https://t.co/OLZjcIgqrj", "China trade healthier than expected https://t.co/reU1uqOzMP", "Welcome to the Museum of Failure https://t.co/Zd5N1vnIeT", "Non-fossil fuel energy outstrips UK coal and gas power for first time https://t.co/WSZMKVW2xj", "Japan growth rate revised down but spending improves https://t.co/IOK1Drv0pn", "US President Trump sued over business connections https://t.co/o7KAHZ9x7Z", "Topshop owner sees profits dive by 79% https://t.co/nQn56ft506", "Election exacerbating UK property slowdown, say surveyors https://t.co/btfwq5ipKK", "Does British Airways' explanation stack up? https://t.co/OsDqs8D3X0", "Finally, a place for your helicopter at sea https://t.co/xlKYJp9FD7", "Easy charm https://t.co/k49aHx4F3Q", "S&amp;P lowers Qatar's credit rating https://t.co/HV5EwwY4zA", "Man Utd overtake Real Madrid to top Forbes football rich list https://t.co/pChTnVHTuO", "Tyre maker Pirelli suspends production in Venezuela https://t.co/PMFTePajwc", "The use of internet voting is growing - will electing your government online ever catch on? https://t.co/xQXYr4k2AT #GE2017", "Organic milk not good for the land, says ad watchdog https://t.co/LEPb7Cr0o9", "Court rules that Germany's nuclear tax is illegal https://t.co/CNHCpBl74K", "Some RBS investors still refuse settlement https://t.co/5CjhNOdtQ2", "We asked leading women in business what they wanted from the next government https://t.co/Lq8pWbPQ5J #GE2017 https://t.co/cswYtonNOM", "FTSE 100 steady ahead of election https://t.co/W7jBHtQJM6", "OECD predicts fastest global growth in six years https://t.co/E8cIV9j3nc", "RT @BBCTech: Apple's iOS 11 update ends support for iPhone 5 and 5C https://t.co/tokNie6S81", "House price growth cools further in May, says Halifax https://t.co/rmQerRIFjk", "Santander rescues rival Banco Popular from collapse https://t.co/SJWYoq5Y24", "What does the Yahoo Japan boss discuss over breakfast? https://t.co/G4zZ7v1CVY", "Philippines temporarily bans workers from going to Qatar https://t.co/BAp6MR2Mki", "'We must be allowed to hire the best' https://t.co/tNFkXGrJ8l", "'Build digital skills in small businesses' https://t.co/9SRT97vZ9y", "Reality Check: What are your taxes spent on? https://t.co/vBKeMbepqk", "Still waiting https://t.co/z5l0NtPn6b", "How many boxes? https://t.co/kY6jxYysbF", "Three business people talk about their election wish-list https://t.co/KPt27Q2Mzw", "Uber fires more than staff after harassment investigation https://t.co/b4J12FH3VW", "Adnan Khashoggi: Saudi billionaire arms dealer dies aged 82 https://t.co/LKNBQTx9Yv", "Security firm asks EU to investigate Microsoft https://t.co/WPAyXtfKAG", "China's HNA: The biggest company you've never heard of https://t.co/jjLTiz4IJg", "China's HNA eyes global growth https://t.co/LqVlzVKdHT", "Rangers fraud trial: Craig Whyte found not guilty https://t.co/Sk8n5M6UNW", "South Africa falls into second recession in a decade https://t.co/FbfGU19DKT", "RT @gompertz: BBC News - First cash Lifetime Isa launched https://t.co/cUVzs0akPN", "RT @gompertz: Skipton launching UK's first Cash Lifetime ISA on election day, with an interest rate...wait for it...of 0.5%", "First cash Lifetime Isa launched https://t.co/7HxnfY6zp0", "RBS reaches settlement with shareholders https://t.co/GOFGZtEFS1", "Qatar row: Saudi revokes Qatar Airways' licence https://t.co/S0CGEVoL4E", "'More options for workplace childcare' https://t.co/XghZQ0X8Xt", "RT @matthew_wall: Milking it: How breastfeeding apps are benefiting from the baby care boom  https://t.co/MxyJ6AfFRp", "RT @BBCBenThompson: Nothing personal @SallyBundockBBC #BBCBizLive @BBCBusiness https://t.co/BuMpRtD4kA", "RT @gompertz: UK rents fall for first time in 8 years says Homelet survey of NEW tenancies. UK down 0.3% year on year in May, London down 3%", "Retail sales down as consumers start to feel the pinch https://t.co/6qWgJaBRv4", "Qatar row: What does it mean for travellers? https://t.co/XcYQNmBs3x", "FTSE 100 lower as Burberry shares slip https://t.co/lZ76RS3Lag", "AO World warns of 'significant' slowdown in UK growth https://t.co/hTd2KaST3J", "Qatar faces airspace ban as crisis with neighbours grows https://t.co/b9D8VvcM1b", "Qatar Airways puts out passenger advice. No UAE, Bahrain, Saudi, Egypt flights &amp; not using their airspace. https://t.co/K0beOF85cE", "Adani gives 'green light' for controversial Australia coal mine https://t.co/RdAWMlzrRW", "'Pink slime': Meat processer seeks $5.7bn in defamation case https://t.co/HGPKZmiEkv", "EY report: Scottish economy 'stuck in slow lane' https://t.co/73xpCmXkjT", "General Election 2017: May would revive Board of Trade https://t.co/uT1o4aHI59", "'Help us tap into new export markets' https://t.co/HgO4rYivsx", "Baby bytes https://t.co/w5f14z53ci", "Trump to privatise air traffic control https://t.co/3VYIa4ncm7", "Apple reveals HomePod smart speaker https://t.co/krm8TdKLcQ", "British Airways IT chaos was caused by human error https://t.co/m3MswBOX1a", "Alex Mahon named as new Channel 4 chief executive https://t.co/MymXi3XiYw", "'Help more people to work part-time' https://t.co/GvBOLHB63p", "Wonder Woman's female director conquers box office https://t.co/HBgxDoFaR2", "'Reduce High Street stores' business rates' https://t.co/g7Neb3bKQw", "Eurozone services growth remains fastest for six years https://t.co/SL6IZoPPuk", "Japanese company holds 'macho' competition https://t.co/tITAgrQFf0", "Telegram https://t.co/yHTwOicOMt", "UK car registrations fall 8.5% in May https://t.co/aavcvv60zm", "Ocado soars on first overseas deal https://t.co/HT9jWtWOTd", "Qatar row: Economic impact threatens food, flights and football https://t.co/S3iKsTxCNT", "'Focus on UK workers first, not migrants' https://t.co/RmbZry9VgS", "'Tighten the rules on self-employment' https://t.co/7fKnDZpyKR", "Qatar row: Four countries cut links with Doha https://t.co/QU2BvtZF3h", "Tesco PWC accounts probe called off https://t.co/XMetJ1DAeh", "Manufacturing sees 'buoyant' European demand, survey says https://t.co/BplOsM9ohz", "Savings would last about a month on average, report says https://t.co/X6IPURt63U", "CEO who fled war: Draw on your inner strength https://t.co/bmfNC43u7h", "Taking his own path https://t.co/lIVW9JYSmp", "Cold revolution https://t.co/aLUSy1p0hU", "RT @BBC_Joe_Lynam: London attack: PM's condemnation of tech firms criticised - BBC News https://t.co/9ca1lblYfu", "RT @BBC_Joe_Lynam: .@Google response to terror attacks and @theresa_may comments that tech firms should do more https://t.co/QVyWvN8wNf", "London terror: Theresa May calls to regulate web further https://t.co/SjWXnXbkdb", "Global beer sales drying up, says report https://t.co/ntPwh1CWz2", "'Make more use of UK's science talent' https://t.co/bGX1yWoDmC", "'More help for fledgling entrepreneurs' https://t.co/OaH6WSgdnu", "Splendid isolation? https://t.co/G3CWRRzfxy", "Caroline Lucas: 'Blaming immigration lets government off the hook' https://t.co/qxsHOyxDMl", "BA delays: Automatic compensation urged by consumer group https://t.co/vuefJnYz94", "Monty Don: Supermarket plant sales cut customer choice https://t.co/nVvg9Lft3V", "'More support for women start-ups' https://t.co/mBSePO4800", "'Incentives for UK manufacturing' https://t.co/WgUeVZkccK", "Tanzania's mobile-based health insurance https://t.co/2cv1WZGd66", "British Airways cabin crew vote for more strike action https://t.co/70OPrl9dlj", "Russia lifts sanctions on Turkish food in diplomatic thaw https://t.co/nfpL7TJcZC", "Putin asks US business chiefs to help improve ties https://t.co/XcKpfDr8dT", "How the Post-it note became a million dollar idea https://t.co/RTTo7WtQT2", "Google to charge ad-blocker users https://t.co/e0iRQkr1nd", "Motorbike sales help to fuel Togolese economy https://t.co/PdMizcJBw9", "US adds fewer jobs than expected https://t.co/eGHAopWXh3", "Hoover pension deal agreed affecting 7,500 members https://t.co/GpcIEtLlyz", "Rise in housebuilding boosts construction sector in May https://t.co/72jgpLMR6j", "Could South Africa be bruised by a bad Brexit deal? https://t.co/kkD1BKrAjC", "ICYMI What outrageous questions have you been asked in job interviews? Could you beat these? https://t.co/ZSVMUiMuTA", "Can you make a burger in 40 seconds? @bbckamal tries his hand at making a Big Mac https://t.co/EwvTL0YlSP https://t.co/7anMcCwHbj", "BA delays: Insurers clash with airline over expenses https://t.co/0pJPW2vvBG", "How has the fitness video adapted to the YouTube age? https://t.co/yGznpRAL7W https://t.co/92FDfPNkhI", "Why are young Japanese working themselves to death? @EdwinLane investigates https://t.co/Vkkxua4iuJ #karoshi https://t.co/JolZjRAqSe", "ViaSat-2: Satellite goliath goes into orbit https://t.co/omWU0g1IkJ", "RT @ruskin147: Here's a Snapchat Spectacles view of the #bbcbizlive studio https://t.co/kYRBsu9Vdj", "Snapchat Spectacles arrive in UK https://t.co/RmSUo7nRC7", "Sterling sinks as shares edge higher https://t.co/kuNjnIubA7", "'Don't treat international students as migrants' https://t.co/Kv8mLhIi4Q", "RT @ruskin147: https://t.co/5WGFOiQ3WO Snapchat spectacles arrive in UK - be honest do I look good in these?", "Brazil emerges from recession as GDP grows 1% https://t.co/BAAfcbt9ed", "Fresh bid to oust Unite union boss Len McCluskey https://t.co/nHPX6eINoF", "One in 13 ethnic minority workers are in insecure jobs, says TUC https://t.co/NZcDxWLIGW", "'We need a fundamental review of business taxes' https://t.co/K5LNgqNcML", "Worked to death https://t.co/tr3RPThyqF", "From videos to vlogs https://t.co/nDPUY50CWE", "Trump's climate decision under fire from business leaders https://t.co/UPJXY5loNV", "Facebook shareholders press management on fake news https://t.co/fTAvLhai8Y", "Nasdaq hits new high on jobs numbers https://t.co/KK8kf44fkJ", "We're on the lookout for stories from these communities, so if you're willing to be interviewed about your experiences, please get in touch", "Are young people struggling to find work? https://t.co/64tOlazm8U", "Kamal Ahmed tries burger making https://t.co/Dl3oyApIiQ", "Why are vultures able to eat so much rotting food? #bbcfoodchain https://t.co/hAZaQ9JasS https://t.co/V2gMvOaY1A", "Q&amp;A: Why did 'power surge' hit BA? https://t.co/TBUf4TnQF3", "Another Uber executive quits but losses improve https://t.co/bbmT6v6ecl", "IAG boss Willie Walsh backs British Airways https://t.co/rBWxd034Tc", "Walsh backs BA boss after computer chaos https://t.co/cShFaO63Vm", "PPG drops bid to buy Dulux owner AkzoNobel https://t.co/ijeKVwJlPf", "Why is business blooming for women start-ups? @BBCEmmaSimpson and @katiehile found out more: https://t.co/ZKdwSCTsur https://t.co/EnLIzl5Ewv", "RT @BBCSimonJack: BA board members to demand IT chaos inquiry - BBC News my blog.  https://t.co/rWxpXWXu38", "School buses boost FirstGroup profits https://t.co/WXZQKOL5HZ", "Green motivation https://t.co/gYewDC03Je", "@steverwood Ah.. we'll flag up to the Live page writers.", "Are 'McJobs' really history? @bbckamal delves deeper... https://t.co/Ix9hY7TxYJ https://t.co/YqvegQhnwA", "Nomura admits part in Goldman Venezuelan bond deal https://t.co/goCHCKPnsR", "Highest rate taxpayers at record level https://t.co/UnWUDb7npl", "BA computer chaos: the unanswered questions https://t.co/2U1ynPZzh0", "Barclays Africa sale sparks share surge https://t.co/0I8BpWtrkT", "House prices fell again in May, Nationwide says https://t.co/onhhe79wAF", "Older age https://t.co/t4IFiBtAp7", "World's most expensive handbag auctioned in Hong Kong https://t.co/NAEEeoWU3s", "Brazil meat-packing giant JBS to pay record $3.2bn corruption fine https://t.co/0c7zenVaRp", "'Reduce firms' National Insurance payments' https://t.co/oxV6IQuUzG", "Why is hardly anyone using Sri Lanka's new airport? https://t.co/pQytry7hqM", "'We need access to the world's best talent' https://t.co/y3wsaRzEYq", "Keeping the faith https://t.co/JDsrVWrP9n", "Firms warned to prepare for tougher EU data protection rules https://t.co/xXA4gD13Zf", "Insurance premiums 'rising due to tax change' https://t.co/GydHV1xQp9", "Banks 'rebuilding reputation' after crash https://t.co/MlBUBzqBFI", "BA's owner launches new trans-Atlantic budget airline https://t.co/7o3TLH3WSn", "Exxon shareholders back 'historic vote on climate https://t.co/F1rkHdZIdt", "G4S rejoins FTSE 100 as Debenhams drops out of FTSE 250 https://t.co/DekICXDpQF", "RT @ruskin147: Are tube passengers ready for phone calls in the tunnel? I predict a chorus of tutting https://t.co/64mnlRVP53", "RT @BBC_Capital: How many avocado toasts does a house cost? Now you know... https://t.co/PMrPC7VwWy https://t.co/sGyNBDc1i3", "Investment groups tell investors to give up tobacco industry https://t.co/cyQMU6v3Cp", "The digital notepad that's like paper https://t.co/wBJKuZLsTP", "Indian growth figures miss estimates https://t.co/GwPYNOclcF", "Size 12 student criticises H&amp;M after struggling to fit into size 16 dress https://t.co/bDqRttQjHt", "Aldi and Lidl sales soar as prices rise https://t.co/KFbixtUhIJ", "How firms can recruit top talent: In 60 seconds https://t.co/EspfN0XAFJ", "Turtle eclipse https://t.co/CB1dneBQti", "Ireland set to sell 25% of Allied Irish Banks https://t.co/p2AQLceVBY", "Mortgage approvals at seven-month low https://t.co/zRLoVMp41V", "Reality Check: What would be the impact of a four-day week? https://t.co/9Od1lc4UZ8", "Fraudsters 'use tricks of speech' in cons https://t.co/Dd3sLPrtbp", "Food inflation 'hits three-year high' on weak pound https://t.co/jTUyg5WdOc", "Outrage as Emirates tells cabin crew to remove Taiwan flag pins https://t.co/WSBjaBnXmH", "RT @ruskin147: Startling evidence of insider trading on official statistics leaks - top work from More or Less https://t.co/GPWCpRULjb", "Undercover activist detained at Ivanka Trump shoe supplier https://t.co/Q1AeZVE8Ul", "RT @elisabethmahy: Food prices rise https://t.co/WT02MLqa7y via @BBCNews #wakeuptomoney https://t.co/HOwA1iu8Ap", "Can India's economy keep up its current growth rate? https://t.co/1uthddAUOc", "Sterling dips after poll suggests hung parliament https://t.co/RB7hVavRQJ", "'I don't want to see tariffs on EU raw food imports' https://t.co/UPtvO3vakQ", "'Tougher bankruptcy laws' https://t.co/esejln9IjK", "Filling the kitty https://t.co/zrTjrao5Qu", "'Zero-hour contracts should be reformed' https://t.co/CReHzf5nEl", "Juice wars https://t.co/ezDNHQumzO", "Salmon and whisky top UK exports, but are still outweighed by food imports https://t.co/BY667T37Jj", "Manchester United most valuable club in Europe, says KPMG https://t.co/N6DeYYIpF2", "Venezuela opposition condemns Goldman Sachs debt deal https://t.co/lcG5HBmIFO", "Three Mile Island to close 40 years after nuclear accident https://t.co/451sZRKzOo", "Uber fires self-driving car engineer amid legal fight with Google https://t.co/IOC9fOaqkY", "If Germany can't count on old friends, perhaps its time to make new ones https://t.co/5zbbN7ad4a", "Ukraine raids offices of 'Russian Google' https://t.co/0xAoezjEZN", "Urinating dog joins Wall Street statue row https://t.co/wYPO5LxWsM", "Signals mixed on US economy https://t.co/A3rK1Re3mE", "Amazon shares hit $1,000 for first time https://t.co/CSI0dGofig", "RT @BBCWorldBiz: British Airways counts cost of global shutdown.  https://t.co/zWjGBri4qK", "Liverpool One shopping centre screen 'hacked' https://t.co/vncRAPBQKY", "Tesco-Booker competition inquiry begins https://t.co/wt9vOfuX9k", "RT @BBCSanjoyM: Our report on how even as the monsoon arrives in India, #Bangalore is facing a severe water crisis https://t.co/ZNcstLFg4t", "RT @PeacheyK: Beko tumble dryer recall - here's what we know so far https://t.co/g5j16ewbgs", "Fire risk alert issued over Beko tumble dryers https://t.co/RU2aWcQOUW", "Were you caught up in the BA chaos? Here's a guide to your rights to compensation: https://t.co/t81SXBhWzS https://t.co/Dguuzqs32r", "RT @atko1978: Sometimes this stuff writes itself. https://t.co/q6u3IkllDv", "RT @Bizrobertson: Fun as always when cameras go rogue and presenting with @BBCBenThompson https://t.co/JiDa0EWb8G", "RT @zsk: Can I beat @atko1978's \"ping pong ding dong\" headline today... a gauntlet has been laid \nhttps://t.co/pdWIKeFh1C", "BA boss Alex Cruz 'won't resign' over flight disruption https://t.co/UkJ7v0azk8", "FTSE 100 falls as IAG shares hit by BA debacle https://t.co/Zw8un127JY", "RT @HelierCheung: \"If you were a fruit, what fruit would you be?\" // Just the job? When interviews go wrong https://t.co/8QrkzWfm5K", "RT @BBC_Joe_Lynam: .@British_Airways parent company IAG shares open down 4%", "Ryanair expects lower fares but reports record profits https://t.co/isYOfqWE3i", "China table tennis champion sued over casino debts https://t.co/sAVzzmkZWT", "'Toughen the laws on bankruptcy' https://t.co/lRHWlPilNj", "'Aid the growth of self-employment' https://t.co/A5ob84Lxp7", "Indonesian beauty boss: 'They thought I was a crazy woman' https://t.co/Gx9c3JsATi", "Timpson CEO: 'Trust your staff' https://t.co/5N7V1a55lf", "Outrageous job interview questions https://t.co/z4DcqHh7LV", "Voter change https://t.co/DGuJGM5nCB", "Just the job? https://t.co/LTVCNrF4be", "Small firms hit as government tax relief delayed https://t.co/NsD0OOqmML", "BA to operate all flights from Tuesday https://t.co/EsjCe16Pcd", "Dulux owner wins court victory in shareholder battle https://t.co/p2i7XfZqIc", "Greek minister warns 'no excuses' on bailout deal https://t.co/dI6MvvtVjC", "WannaCry ransom notice analysis suggests Chinese link https://t.co/w8MNDgigR0", "Reality Check: The fight over women's state pensions https://t.co/J5cSvnlxHY", "BA boss 'won't resign' over flight chaos https://t.co/08Q77Rjvve", "RT @matthew_wall: More than a million page views for @JoeMillerJr 's @facebook feature. Have you read it yet? https://t.co/tizBw3AChs", "RT @ruskin147: What went wrong at BA? A few theories from a corporate IT expert -  keen to hear more https://t.co/Tfazx4bqew", "RBS reaches settlement with disgruntled shareholders https://t.co/39iTj5kmm9", "BA - what are my rights? https://t.co/QlSSSgo6fl", "BA flight disruption at Heathrow set for third day https://t.co/4PsJqV2cF1", "Is Sri Lanka 'up for sale'? https://t.co/u0gULQXgHv", "Back to work https://t.co/MuLTiDsV0H", "Going up? https://t.co/3vKzy7OqS5", "US might extend cabin laptop ban worldwide, top official says https://t.co/yNh4vb6TQ0", "Thousands of drivers caught despite mobile crackdown https://t.co/fA85oheRX9", "Reality Check: Does it matter if you own your home or not? https://t.co/Tp7JDNZc5q", "Reality Check https://t.co/z5pVpaXXlP", "Are these the world's most unusual jobs? https://t.co/lvfxsMKGxG", "Five questions for BA https://t.co/RitvMSsndA", "'I panic every month as I can't afford my rent' https://t.co/hg67bCZ5GX", "Burger King ad angers real-life Belgian royal family https://t.co/sqMvHT0F6f", "Uber CEO Kalanick's mother dies in boat accident https://t.co/Gtha9aYqZN", "BA aims to resume most UK flights after IT failure https://t.co/sbWilb6CJQ", "RT @shilpakannan: All @British_Airways flights from @HeathrowAirport cancelled due to IT problems #aviation https://t.co/b4eJageqfV", "RT @BBCKarishma: Call to raise retirement age to at least 70 https://t.co/GtDI8M2AmC", "RT @BBC_Joe_Lynam: If you're in LHR Terminal 5 pls get in touch and let me know what's going on", "How Balenciaga shaped modern fashion https://t.co/SNWT0iZ5vO", "The British (pitch) invasion https://t.co/o7ZlGg81Ve", "The fishing port where the catch is soaring house prices https://t.co/hXa75KAUoP", "Amazon opens seventh US bookstore https://t.co/h2kSUpCb2x", "UK achieves solar power record as temperatures soar https://t.co/Df4ZlZfqWP", "US growth rate revised up to 1.2% https://t.co/NrT7NRsfFn", "Call to raise retirement age to at least 70 https://t.co/KvqPaflcuT", "Where is the world's 'cast-off clothes' capital? https://t.co/Pz122vHmUL", "Cutting HIV and Aids treatments costs in South Africa https://t.co/UdMHOgDHB5", "Gatwick Airport flights depart without luggage https://t.co/RucW2EIwIg", "Cutting HIV and Aids treatments costs in South Africa https://t.co/JWy6vJFWeh", "Frankie &amp; Benny's owner sees shares jump https://t.co/ry8VlofXax", "UK shares touch new highs as sterling slips https://t.co/znMhUOzUMs", "RT @cajuk: @TheIFS says Labour sums don't add up, while Tory manifesto lacks detail. My @BBCBusiness story: https://t.co/gmeo4WJ0z1", "RT @matthew_wall: A fascinating exploration of @facebook 's growing power by @JoeMillerJr  https://t.co/tizBw3AChs", "Why are so many Sri Lankans learning Chinese? Full story: https://t.co/UTJHJUXZrR https://t.co/CiH5tYGaQD", "IFS criticises Labour and Tory plans https://t.co/g9qaipIu9v", "Pension Regulator website 'now fixed' https://t.co/asVrNPcvUm", "RT @justinbones: \"Uncertainty's not good news for anybody\" David Buik, Panmure Gordon on price of oil #wakeuptomoney https://t.co/5jYO93k3W8", "Why are so many Sri Lankans learning Chinese? https://t.co/IsEYdJQ96h", "Trapped in debt https://t.co/pjVjPhXKbJ", "Mapping a new frontier https://t.co/Yja6T3E5q4", "New payday loan regulations come into force https://t.co/E3aGdgoaTA", "Amazon goes shopping offline https://t.co/EKOs7PHUHR", "Paradise in the Med https://t.co/mAFuZD4Vs0", "Walkers Crisps Gary Lineker campaign suffers Twitter sabotage https://t.co/hfIAz0SehP", "Making money-making movies on a budget https://t.co/sORvICwYrA", "Pension Regulator's website crashes https://t.co/FgCtI3thHg", "https://t.co/hQnTEBt4eQ denies exploiting users' DNA https://t.co/qLtuSWB0qX", "Opec extends oil production cuts https://t.co/fPRaZatccR", "Jonathan Ive: UK needs global talent https://t.co/PvV0rX8XvI", "English house-building at highest for a decade https://t.co/Dlvw1ikuPs", "Petrofac executive suspended amid fraud probe https://t.co/VdcpmsiVsk", "Ansell offloads condom division for $600m https://t.co/Lab5qUVFr0", "Housing market moving sideways, lenders say https://t.co/rly8iwNHuS", "Apple's Jonathan Ive says immigration vital for UK firms https://t.co/GW9cZOSLu0", "Net migration to the UK falls to 248,000 in 2016 https://t.co/9VPqyISBwL", "Google AI defeats human Go champion https://t.co/EXnFP8VwSy", "UK growth estimate revised down https://t.co/fq4Gv93usJ", "FTSE firm as Wizz Air takes off https://t.co/RmD20BnjIv", "Proud papa https://t.co/nCdw47urnZ", "New Zealand space launch is first from a private site https://t.co/105DAwZj8B", "Boots of Nottingham opens 'historic' digital archive https://t.co/4imgSf1O2u", "Halfords profits hit by weak pound https://t.co/hPaDoyZvee", "RT @dominicoc: Apologies to Petrofac - chief operating officer Marwen Chadid has resigned from the board, not the company @BBCr4today", "UK car production fall blamed on late Easter https://t.co/KGrVh9itbv", "RT @BBCLerato: Be Bold, be Proud, be Beautiful... That's what it means to be an African #AfricaDay2017 https://t.co/8ig8YwPuf2", "Mongolia gets financial aid totalling $5.5bn from IMF https://t.co/zOjh49AoNd", "LISTEN: Thousands Demonstrate In Brussels As US President Arrives For EU And NATO Talks https://t.co/5BYVkwIMwT", "Samsung S8 'eye security' fooled by photo https://t.co/ePscitgpKu", "Bad sex scenes https://t.co/pVCRUldpPL", "Dollar slips after cautious Fed minutes https://t.co/sCGoG0iNlo", "White House denies 'egregious' budget accounting error https://t.co/LN04bR1g3d", "RT @janewakefield: Interesting new take on digital marketing from Google but will it be spiked by EU data laws? https://t.co/xScemc8kG7", "Aston Martin roars back into profit https://t.co/uy4m4AvuNf", "Nokia 3310 sparks wave of nostalgia as it goes on sale https://t.co/FW22BlCjXA", "Tiffany &amp; Co suffers fall in US sales https://t.co/n6zshfMyDM", "Sean FitzPatrick cleared as Anglo Irish trial collapses https://t.co/n0mM1EdZFN", "Google plans to track credit card spending https://t.co/DeWT7lnK8H", "British sports car maker Lotus bought by China's Geely https://t.co/gyhwED0H5Z", "How long could you survive with a retro phone? @BBCRoryCJ didn't last long! https://t.co/FJqQ1AU7hv", "RT @danielgallas: Moody's downgrades China's credit rating; first since 1989 https://t.co/zbQdaNp2ia", "How international is your university? https://t.co/34tHHi8HFh https://t.co/biYCajLR7g", "Have you shunned a traditional nine-to-five job for more flexibility? https://t.co/CNV1S0y3OZ https://t.co/9phNmaQLic", "RT @ruskin147: Tried to give up my smartphone for a Nokia 3310 - it didn't go well https://t.co/d6MZw7lVCX", "RT @BBCSimonJack: RBS case could face further delay. Judge may lose already tested patience https://t.co/izvWaR4dn6", "Not just Bitcoin... https://t.co/FR1uHHHOHG", "Ikea unpacks Jesper Brodin as new chief executive https://t.co/qlBHRYm9h2", "Dixons Carphone says consumers keep spending https://t.co/srJ2DptSqj", "Kingfisher revenues slip as French sales fall https://t.co/jhYLcG78Az", "RT @BBCEmmaSimpson: Marks and Spencer CEO says consumer sentiment is \"fragile\" .. we're seeing that come through in spending patterns.", "Andrea Radrizzani: Italian businessman completes Leeds United takeover https://t.co/C7cxp0Yc3N", "M&amp;S annual profits fall by 64% as revamp costs bite https://t.co/VCVKKXg34n", "Birmingham University to open campus in the Gulf https://t.co/8HeF8ucXVu", "Hard Brexit 'could impact Northern Ireland legal profession' https://t.co/53xrBnftPS", "Moody's downgrades China's credit rating https://t.co/Kxnx8l1JSp", "LISTEN: Britain Increases Security Level to Critical https://t.co/4OnnVx6HIP", "Nokia 3310: How long could you survive with a retro phone? https://t.co/GxkMoFP3CL", "Will Opec extend output cuts in bid to push up oil prices? https://t.co/1MhDpWom8z", "There was nothing we could do https://t.co/UnkQclaQF7", "US accuses Fiat Chrysler of using 'defeat devices' https://t.co/5x0LW2tNTN", "Trump's $4.1tr budget takes hatchet to safety net https://t.co/G40NxUVj4v", "SFO to investigate pension liberation scams https://t.co/ALXCtQOgiI", "German police raid Daimler offices https://t.co/MZyKl5Imx7", "Scotland sees record foreign investment https://t.co/MaLzyEBWX4", "Apple and Nokia to 'co-operate' after settling patent row https://t.co/1fUcC2Dl1c", "Firms pledge to recruit more over-50s https://t.co/XfKPW3jTiD", "How does Britain work? https://t.co/6AwDXlKTLp", "Further signs of UK property slowdown in April https://t.co/VqGJcAPxYa", "Government borrowing at three-year April high https://t.co/l6BDYNbSPJ", "Government review to order zero-hours contracts overhaul https://t.co/DABGrDpu0h via @bbckamal", "FTSE 100 bolstered by Severn Trent https://t.co/iZelEASSmZ", "RT @BBCLerato: And this is how you prep for a sit down interview with the Finance Minister of India #AfDBAM2017 https://t.co/C4X4ay6o1I", "Nationwide profits hit by low interest rates https://t.co/mPEwvZWIuS", "LISTEN: Nineteen People Killed at Pop Concert https://t.co/4a0NgDa7EC", "The mum whose home-based business is blooming https://t.co/H4zFPBycq5", "Greece fails to secure fresh bailout funds https://t.co/qoXDApPXd8", "Cuban revolution https://t.co/o5VrGtAF0t", "Business is blooming for women start-ups https://t.co/qTWqrAB5Zj", "Reality Check: What do manifestos say about productivity? https://t.co/5ApQrSqkna", "Amazon adds live TV channels to Prime Video https://t.co/xYzf2yUKXG", "Election 2017: What jobs do UK workers actually do? https://t.co/9JzqyiaYWV", "Debt fears remain despite manifesto 'breathing space' plans https://t.co/xJxWdBdxb2", "LISTEN: Wall Street Update https://t.co/qyEpBWG3Fq via @BBCWorldBiz", "LISTEN: Ford Appoints New Chief Executive https://t.co/QwI7cAz4TT via @BBCWorldBiz", "EU's Barnier refuses to imagine UK Brexit talks walkout https://t.co/iWnPnsSwQD", "LISTEN: Ford Appoints New Chief Executive https://t.co/j4nvPgZ2G0 via @BBCWorldBiz", "CMA to examine Aberdeen/Standard Life merger https://t.co/MB9ZXur3fW", "Reality Check: Have governments since 2010 borrowed more than Labour ones? https://t.co/W25aPGBIiG", "AA calls for crackdown on sharing dashcam video https://t.co/as9E9E4GGK", "FTSE 100 rises as Intertek boosted by upgrade https://t.co/Z6VLJaWG94", "Portugal back to fiscal health, says EU https://t.co/VGMAS8raoc", "Billionaire makes 'biggest philanthropic gift' by living Australian https://t.co/Z67dMswEpt", "Arsenal: Stan Kroenke says Gunners shares 'are not, and have never been, for sale' https://t.co/NtmzFz1xCY", "Leaks 'expose peculiar Facebook moderation policy' https://t.co/gdFBHfq5Vs", "UK firm designs 'world's most affordable solar lamp' https://t.co/MFtCo5VTDE", "EU accused of anti-City 'protectionism' https://t.co/dVIQRSo7Sg", "RT @BBCNews: Still haven't registered to vote in #GE2017?\n\nYou have until 23:59 BST tonight\n\nhttps://t.co/bpVHwLu9mj https://t.co/3HhCMIMtCC", "Ford to replace chief executive Mark Fields, reports say https://t.co/9PIkeLqaAl", "How much household debt do we owe? https://t.co/1DtUcMWOT5", "Cathay Pacific cuts hundreds of jobs in major shake-up https://t.co/i3u6h6CzS7", "LISTEN: President Trump Signs Saudi Arms Deals https://t.co/NYsDgY8tPr via @BBCWorldBiz", "Ex-RBS boss Fred Goodwin to face investors in court https://t.co/HHNUKYLrvU", "Car vending machine: We try out the novel Singapore dealership https://t.co/F7S3XxNXWA", "CEO Secrets: 'Life's not a movie, be patient' https://t.co/5qG1clQgs8", "Reproductive rebels https://t.co/H6onKTsQY8", "Dough kidding https://t.co/5985weD5gL", "Church of England fund sees 'stellar' returns https://t.co/6VbqyUfNaA", "Scottish Power lands US wind farm deal https://t.co/JOA0vQakBy", "TPP trade deal will continue without Trump https://t.co/LD3zYJlbvd", "Fair shares? https://t.co/oKloDVkvkf", "LISTEN: Trump Heads to Saudi Arabia https://t.co/42hTv3MHaZ", "The UK's most delayed airlines revealed https://t.co/GntY8Icc4y", "Young people 'most likely to go abroad without insurance' https://t.co/ghKkHmdlXG", "Police probe UK links to Magnitsky money https://t.co/KzFyzKJrSN", "LISTEN: Wall Street Update https://t.co/BEVAkn4O0C via @BBCWorldBiz", "Foot Locker shares plunge after weak sales https://t.co/kLLzQEscJi", "LISTEN: Trump to Visit Saudi Arabia https://t.co/NFc5JlsdOi via @BBCWorldBiz", "RT @matthew_wall: #wannacry lessons: Is your firm safe? \nhttps://t.co/Myv0Tet5wv", "Will the Ivory Coast mutiny affect business? https://t.co/FNgyWiu4LX", "Air traffic control of the future https://t.co/IoSVo35nNQ", "Text-to-switch plan for mobile users https://t.co/QOEaKntXb5", "RT @Eleanor_Lawrie: My article for @BBCBusiness - More Pritt Stick than Pippa: Why millennials want a DIY wedding https://t.co/UEETVDC13Q", "'I got hooked on Shakespeare, it was an outlet' https://t.co/uxuz0PpkE4", "Peppa Pig owner announces new series https://t.co/r5gfK35RAU", "RT @dannsimmons: HSBC says it will review its Voice ID security system in light of our @BBCClick investigation this weekend.", "RT @BBC_Capital: The problem #expats find when travelling abroad, then returning home https://t.co/LjZZL0dpsy  https://t.co/Rl6FZoSmte", "FTSE 100 rebounds after two days of losses https://t.co/IX0YH6QtRB", "Watch Mark Zuckerberg find out he's got into Harvard https://t.co/8qVe8B8BPL", "GM to stop making cars for Indian market https://t.co/kvpaQw43Fv", "RT @BBCKarishma: Why the US has changed its tune on the yuan - my take https://t.co/0X3ExKeXdX", "RT @shanaz17: DIY weddings - you don't have to break the bank for your special day https://t.co/7ROh8gpk19", "Just Eat and Hungryhouse merger faces competition probe https://t.co/8BsXQGy3u6", "LISTEN: Brazil President 'Won't Quit' over Bribe Claim https://t.co/1UBzxGP5N8", "Would you drive a car made from plants? https://t.co/1rMFn5iheZ", "How do you turn used coffee grounds into clothes? https://t.co/ILQRNgjlcX", "WannaCry lessons https://t.co/G2r8kHRNrb", "More Pritt Stick than Pippa https://t.co/TSEvrfVCRN", "LISTEN: Wall Street Update https://t.co/d3ZkqNpH0c via @BBCWorldBiz", "Greece adopts more austerity measures in bailout bid https://t.co/qOcm5RA9Cc", "Trump pulls trigger on NAFTA negotiations https://t.co/Mp8j6tjFkp", "Alibaba revenues jump 60% as Chinese growth continues https://t.co/l6O2wsqowh", "Brazil's stock market plunges after corruption claims https://t.co/q6F6vsUZan", "LISTEN: Brazil Faces a New Corruption Scandal https://t.co/qM2SHgWAgx via @BBCWorldBiz", "Election 2017: State pension triple lock battle lines drawn https://t.co/PKTgpiUBLc", "RBS settlement has left business couple feeling 'gutted' https://t.co/inw3kLiinW", "Asda suffers 11th quarter of falling sales https://t.co/B5CMu99blE", "Roger Ailes: Fox News founder dies at 77 https://t.co/cuiReUE2WC", "Serious Fraud Office under threat from Tory plans https://t.co/h31ktPNaZQ", "India's Zomato says data from 17 million users stolen https://t.co/lwzB8FxOpU", "Recycling nightmares - but can packaging be improved? https://t.co/O1qB5mulIx", "Japan's economy grows faster than expected https://t.co/Ds6OcJzVOj", "FTSE 100 falls as jitters over Trump persist https://t.co/Z9T1m5Ksqh", "Retail sales in April beat forecasts with a 2.3% rise https://t.co/5QrXejoJ3B", "RT @bbckamal: I take full responsibility for the rubbish joke. @lauracgardiner superb as our expert guest https://t.co/kOpMpT37S2", "RT @WillSmale1: Would you carry something abroad for a stranger? https://t.co/nRcigMWQql", "EU fines Facebook over 'misleading' WhatsApp data claim https://t.co/WxtJFleuDq", "RT @bbckamal: Listen in - unwrapping the economics behind the election  @bbcradio4 https://t.co/8poF8YydHv", "RT @JoannaMarieHall: Who knew that a Pringles can was \"Number One recycling villain\"? https://t.co/jjyq1BCpQv", "Burberry's profits fall amid 'challenging' US trading https://t.co/L1wjgAumMN", "Recycling body criticises Pringles and Lucozade packaging https://t.co/q8nobzywiO", "Royal Mail posts strong rise in profits as parcels improve https://t.co/WH4H43O8BB", "LISTEN: US Markets React to Political Turbulence https://t.co/GwSCdVuU9d", "Anything to declare? https://t.co/3301CPZ5xX", "US and EU reject expanding laptop ban to flights from Europe https://t.co/MDtD14cKGt", "LISTEN: Wall Street Update https://t.co/04chMkktKA via @BBCWorldBiz", "Conservative manifesto: Firms to pay more to hire migrant workers https://t.co/D4fXV7WrA8", "Ford looks to cut 1,400 jobs https://t.co/gLRb74RSki", "Wall Street stock markets fall as political uncertainty intensifies https://t.co/CSkZQj0jTA", "Unite suspends planned BMW strikes after new offer https://t.co/AF30sDJIWE", "Brazilian YouTube stars' zany investment lessons https://t.co/UJznZnAfD1", "Ikea to create 1,300 new UK jobs https://t.co/9zbpt2E1oW", "Fanning the flames https://t.co/MH2ThRlvFS", "Lloyds chief executive Antonio Horta Osorio welcomes the end of government ownership https://t.co/Ppx6NnOPto", "Nestle fails to trademark four-fingered KitKat shape https://t.co/JMeMIKqiEW", "RT @PeacheyK: First full year since stamp duty surcharge on landlords - here's the effect on buy-to-let borrowing https://t.co/KXPDeERX7h", "RT @adebradley: Kit Kat has lost it's appeal to try to trademark the design of its four fingered chocolate bar.", "Porsche bosses probed under VW emissions scandal https://t.co/ix7e3cyurS", "Buy-to-let slump after stamp duty change https://t.co/iJAOPvsdll", "RT @suranjanasays: We went to meet the company that's trying to break taboos @BBCIndia @BBCWorld @BBCBusiness https://t.co/Ysbu2l4S5W", "RT @bbckamal: \"This is the first decline in real earnings since September 2014.\" @ONS #squeeze", "RT @andyverity: Unemployment hit its lowest rate since 1975 in Jan-Mar of 4.6%", "RT @bbckamal: UK unemployment rate has fallen to 4.6% - lowest since mid-70s. But, no wage pressure evident yet @ONS #squeeze", "RT @bbckamal: Average earnings growth - excluding bonuses - falls to 2.1% from 2.3%. Inflation 2.7% @ONS #squeeze", "Greek services halted as workers stage general strike https://t.co/zMJttecc8J", "UK unemployment falls by 53,000 https://t.co/IGiJd4aJTt", "Could you afford to buy a masterpiece? https://t.co/0NsFqbvfm4 #art #MoneySaving https://t.co/7fEOgISOjX", "RT @BBC_Capital: An expat's guide to #London https://t.co/hlcimxvObT  https://t.co/uvJ2Y58Y7Z", "SSE warns of 'consequences' of price cap https://t.co/gv4CdVV4IA", "Reality Check: Who would be hit by Labour's higher taxes? https://t.co/25UwEe9toQ", "FTSE record breaking run stalls at open https://t.co/BjpOLuWSmB", "Universal agrees deal to stream on China's Tencent's services https://t.co/x2W6698rXl", "McDonald's decides to withdraw 'offensive' television advert https://t.co/AqH7TFRJCA", "LISTEN: Has President Trump Broken the Law? https://t.co/OHsG2Is9Vi", "Selling sex toys in India https://t.co/2YN08wrMPo", "University of Apple https://t.co/BQ7dQXgMY9", "Affordable art https://t.co/gV7rlWD9HY", "LISTEN: Wall Street Update https://t.co/iS5PWiIfSi via @BBCWorldBiz", "TransferWise becomes profitable six years after being founded https://t.co/SzzVBPOypc", "Twitter co-founder Biz Stone to rejoin firm https://t.co/GAfEOwPIb8", "Share sale set to return Lloyds to private sector https://t.co/hrDH5OH4Ds", "LISTEN: UK's Labour Party Launch Manifesto https://t.co/RM3olkZFdo via @BBCWorldBiz", "Sales growth grinds to a halt for TK Maxx https://t.co/3bcIzEHe2A", "Ridicule and condemnation for Chanel's $1,500 boomerang https://t.co/1B6qAHqHo0", "Fresh rail strikes announced https://t.co/le0DpqFkYy", "RT @Theothebald: We also use analogies involving sweets. And occasionally doughnuts. https://t.co/fRpf19deIN", "RT @zsk: Wonderfully weird robot documentary by @janewakefield &amp; @TreanorSarah \nhttps://t.co/GjCcquEtTN", "RT @RebeccaWearn: ICYMI: @BBCBreakfast explores the impact of rising #inflation from a Welsh farmyard https://t.co/RdP98MTwHE", "The challenge of coping with rising costs https://t.co/ffKPk8LyYZ", "Vanguard targets UK personal investors with new service https://t.co/Wr1pCA7gZm", "Manchester United has reported a loss for the first three months of the year as operating expenses soared https://t.co/9DsYSFwQGG", "RT @PeacheyK: Last year property prices in London were rising by 15% y-o-y, but that pace has now slowed to 1.5% https://t.co/5LOVDT6Sim", "RT @matthew_wall: Are DNA-testing kits a key to better health or overhyped nonsense?\n https://t.co/VeLtkr3KBb", "General election 2017: 'We're living on less money now' https://t.co/QRlYRFlk0m", "\"We haven't had a pay rise for five years\". Wake Up to Money heads to Merseyside https://t.co/f4yjB3Vasf #commuterconversations  #GE2017", "Cancer drug price hike company investigated https://t.co/ZUoVw6pBQV", "Greek economy sinks back into recession https://t.co/nmZTjZAcdK", "House prices in UK shift to lower gear https://t.co/MCghY2y6NE", "EU countries to decide on Singapore trade deal https://t.co/c56fi2MjYn", "Disney hack: Ransom demanded for stolen film https://t.co/7GllOhoyQO", "FTSE 100 hits another record as Vodafone rises https://t.co/JCZaZPJM4u", "UK inflation rate hits 2.7% https://t.co/caiTSHGI9B", "Why are so many US stores closing? @SamiraHussain15 tries to find out during a New York shopping trip https://t.co/8Raclp2bWQ", "Vodafone reports hefty loss after hit from Indian unit https://t.co/AHne67Tz7t", "Would you take a DNA test to help you live a healthier lifestyle? https://t.co/yCt1Cn2Nov https://t.co/4v028Pj9J0", "HTC unveils 'squeezy' phone for selfies https://t.co/0dCHwXVYdw", "Are you a \"mucus trooper\"? https://t.co/OGqBBaGxUl", "Ford 'set to shed 10% of workforce' https://t.co/kYfaPDVfNa", "EasyJet half-year loss widens on weaker pound https://t.co/xElaeUfP7X", "LISTEN: Trump 'Shared Classified Information with Russia' https://t.co/OnA1564Ho9", "Banks 'must show action' in fraud cases https://t.co/jf7atOBJ8C", "Staff more likely to struggle to work than pull a sickie https://t.co/9omDys6oGV", "Gene genie https://t.co/HBCAjjl1Aq", "LISTEN: Wall Street Update https://t.co/lQ5vYWDsek via @BBCWorldBiz", "McDonald's apologises for 'offensive' television advert https://t.co/dfSRwfhSHy", "General election 2017: Labour 'plans water industry nationalisation' https://t.co/jDyTiVOJSa", "Uber must return stolen files to Waymo, US judge orders https://t.co/41vtq9eRFr", "RT @BBCRealityCheck: TUC calls for action on falling living standards. #GE2017 https://t.co/zQvOUoQfpp https://t.co/cPpDdbKM1u", "WATCH: @bbckamal looks at the key economic issues for voters at #GE2017 https://t.co/Q1okduvhoe https://t.co/kOy6sk9urr", "LISTEN: Global Cyber-Attacks Slow but Fears Remain https://t.co/EOnXXCSigH via @BBCWorldBiz", "Reality Check: What's been going on with pay? https://t.co/x2fv2IoMDz", "Supermarkets step up wonky fruit and veg push https://t.co/HsCY0vVw0q", "What can you learn from a knight? Meet the boss who lives as a medieval knight https://t.co/7lS03wh3WC https://t.co/ZbdcpCrKeh", "Kelvin MacKenzie leaves Sun 'by mutual consent' https://t.co/F6INawd9qJ", "Noel Edmonds accuses Lloyds of 'foot dragging' over HBOS payouts https://t.co/zu9I3pOJJi", "JP Morgan buys bigger office for 1,000 staff in Dublin https://t.co/6c570aYvOE", "Cyber-attack https://t.co/v7iPMELeYi", "South Africa's Vodacom buys into Kenya's Safaricom https://t.co/uQWYCZ2kj6", "Kamal Ahmed looks at the key economic issues for voters https://t.co/W0Tm89uVxL", "RT @BBC_Capital: When poo means big money: https://t.co/BxcmS72ZJJ   @ericbarton https://t.co/FGn4bv6sh1", "Cyber-attacks from WannaCry ransomware slow but fears remain https://t.co/P1T2VgIejZ", "Oil price rises as Russia and Saudi Arabia back supply cut https://t.co/k3JL5JSN1n", "Lyft strikes self-driving deal with Google's Waymo https://t.co/bNAWbPqMHS", "Reality Check: Why are wages being squeezed? https://t.co/sEYbmmhBVg", "FTSE 100 opens higher but Tui shares dip https://t.co/xtHbnZErfL", "Gambling Commission review hits 888 shares https://t.co/9K7Swpwpm2", "TV dinners https://t.co/n1ixG6BaoK", "General election 2017: Lib Dems would end public sector pay squeeze https://t.co/Q5oPkpeqAd", "RT @ruskin147: Ransomware and the NHS - the inquest begins - new blogpost from me.  https://t.co/mEgJK4zFX8", "General election 2017: Workers' rights protections promised by Tories https://t.co/HLPd63DsIk", "Troubled Toshiba misses annual results deadline https://t.co/mOf1xDC9JF", "AirAsia to launch China joint venture https://t.co/ot47rH7G7I", "LISTEN: Fears Global Cyber Attack Still Growing https://t.co/1Lr5LvDriw via @BBCWorldBiz", "CEO Secrets: 'Make everyone your cheerleader' https://t.co/g4kTebAMKK", "The video game boss who lives life by a knight's code https://t.co/hyYftiDLFm", "UK unemployment rate to rise in 2018, says EY Item Club https://t.co/5M9RBmendw", "Shining armour https://t.co/SX8lX8HoDF", "Ransomware cyber-attack a wake-up call, Microsoft warns https://t.co/w9p10iPErM", "NHS cyber-attack: More ransomware cases 'likely on Monday' https://t.co/4SCojBLvos", "Facebook's Cheryl Sandberg in call to help working mothers https://t.co/UHCgVpn6kg", "RT @dougalshawBBC: Don't try this at home. And don't share this video. https://t.co/PUAQOSICRO", "Ransomware: Cyber-attack threat escalating - Europol https://t.co/EnGKKpEEem", "Toyota 'backs flying car project' in Japan https://t.co/rjQmOfSw5g", "Australian cricketers could strike over contract dispute https://t.co/HB8ACKIW3M", "Battle ground https://t.co/fU1NYJQLb3", "China invests $124bn in Belt and Road global trade project https://t.co/AbvqIXrsad", "Nissan's Sunderland plant hit by cyber-attack https://t.co/WB0u4NOarL", "Tunbridge Wells jobseeker's horror at 'oddball' comments https://t.co/MtDK5AZREV", "Next cyber-attack could be imminent, warn experts https://t.co/Oh5aUncTD1", "Office sauna https://t.co/kz8ZtX6sTU", "A cheaper, tastier way to eat lunch at work? https://t.co/5lArK8OP70", "General election 2017: Council housing increase promised by Tories https://t.co/otdn2tdJQo", "General election 2017: 'Robin Hood tax' on City pledged by Labour https://t.co/5HYlIJR8FG", "Cyber-attack: Europol says it was unprecedented in scale https://t.co/ZMbyGaUxQ7", "Households in South East England told to use water wisely https://t.co/B9nT3fc7NA", "LISTEN: Cyber Attack Targets Global Organisations https://t.co/pBQMcD75A2", "LISTEN: Wall St Update https://t.co/Z6JgGuj4e6 via @BBCWorldBiz", "US retail sales rise as stores struggle https://t.co/kcldK2aWDN", "A series of ransomware attacks have been reported at organisations in countries around the world https://t.co/IzecLgFWAh #nhscyberattack", "Fast-charging smartphones set for launch https://t.co/3UKba7MPTI", "Could this general election be the UK's most expensive? https://t.co/gztdWuWO9u", "Ransomware attacks reported in Europe https://t.co/YBMwgQwwrA", "RT @BBCTech: Ransomware attacks reported in Europe https://t.co/q4lK9QpLJc", "LISTEN: US and China Sign Trade Agreement https://t.co/c3Z7OW81Kp via @BBCWorldBiz", "RT @BBCBreaking: .@NHSDigital @NCA_UK #nhscyberattack - what we know so far\n\nhttps://t.co/M6Yf4lUVlC https://t.co/1KQNDnrYfa", "RT @ruskin147: Getting widespread reports of NHS computer issues, apparently because of a ransomware attack", "RT @ruskin147: Here's what a London GP sees when trying to connect to the NHS network https://t.co/lV8zXarAXS", "Tesco chief executive Dave Lewis sees pay fall 10% https://t.co/hH7I7eg1KY", "RT @BBCNews: NHS England hit by 'cyber attack' https://t.co/cazuN4MJVL", "Can speciality eggs crack the market? https://t.co/XcTmh8Ua2r https://t.co/CmPeRsKEIM", "RT @BBCBreaking: NHS services across England hit by IT failure, believed to be caused by a large-scale cyber attack https://t.co/uc8HCgMtvV", "RT @ruskin147: Reports of major cyber-attack on NHS hospitals - have you been affected?", "Fiat Chrysler recalls 1.25m trucks over software error https://t.co/i2XdW1klN6", "As sure as eggs is eggs? It's not that simple any more https://t.co/TgNjjI9724", "Ofcom opens investigation into the cost of 118 calls https://t.co/vV2p5umr6r", "Improbable boss: Future of games 'very exciting' https://t.co/vHONVuCbEd", "Car finance deals soar to new record https://t.co/G7GVv45TZ2", "Sunburnt apples vex South African farmers https://t.co/aTWL03HHA0", "Togo's student-run chocolate co-operative https://t.co/q3jnnakYB1", "We all have a signature walk but just how can the way we behave help battle #cybercrime? https://t.co/7qplJLMdnZ https://t.co/WDvavXQJwN", "What do businesses want from #GE2017? #WakeUpToMoney spoke to commuters in Newcastle, UK... https://t.co/sETIyFKUYW #commuterconversations", "Firms 'hobbled' by poor mobile coverage https://t.co/dPCLhoKCVp", "Chapter closed? https://t.co/e1HrbGj9BB", "Drug trial results lift AstraZeneca shares https://t.co/q1IaMilqg0", "US and China sign trade agreement https://t.co/Rx8jhZTY1i", "German economic growth speeds up https://t.co/8T0gxps9qv", "Whistleblower sparks Hyundai and Kia recall of 240,000 cars https://t.co/TIhe5EvjUb", "Kushner family business cancels China business pitch https://t.co/vd1VsoL82b", "LISTEN: EU Demand Talks With US Over Possible Airline Laptop Ban https://t.co/IWNIsfWg2j", "What is China's One Belt, One Road? https://t.co/MkWIAChM9B", "My walk, my signature https://t.co/ojsZQOPG40", "Can US retailers keep their doors open? https://t.co/IoMzZvYSc3", "LISTEN: Wall Street Update 10/5/17 https://t.co/eK6RkqFIcL via @BBCWorldBiz", "Snap plunges as Wall Street loses ground https://t.co/DllMoI1zLu", "The 18-year-old murder case cracked by a food vacuum machine #bbcfoodchain https://t.co/U0TWsObvnl https://t.co/yJvGAqfWgC", "Deliveroo overhauls controversial courier contracts https://t.co/2aznmBGi8D", "Drayton Manor death: Rapids rides closed at theme parks https://t.co/et75DpJAoc", "Macy's sales slide stokes fears for US department stores https://t.co/lPvahYNtC8", "Reality Check: Labour and the National Grid https://t.co/e2UoJfpXqL", "What should Snapchat do next? https://t.co/Pl6EHo3iFG", "Labour would scrap rises in pension age https://t.co/4MYQZLg3bU", "German advertisement criticised for using Maori haka https://t.co/FN7dd1t950", "Chinese hackers must pay $9m over insider trading scam https://t.co/8Byo7fmwuX", "European court aide rules Uber is a transport company https://t.co/YEzvk5uYPw", "Sir James Dyson wins vacuum cleaners appeal at European Court https://t.co/TrDNMBWw3s", "Bank of England cuts UK growth forecast https://t.co/DM29eJYXIW", "RT @BBCSimonJack: Labour's draft manifesto through a business lens - BBC News. Some thoughts.  https://t.co/JyOhIrDLIh", "UK industrial output falls in March https://t.co/R9vznnx02U", "Hikma shares hit by US drug delay https://t.co/fkpD9XeK2f", "Nissan reports 27% jump in annual profits. https://t.co/UbQMhhih7K", "Adidas finds buyer for its golf unit https://t.co/B3uOpFoDc5", "BT to shed 4,000 jobs in new overhaul https://t.co/PvDU8Bjej0", "Can corporation tax pay for Labour's education pledge? https://t.co/8l46NzLUXg", "Boeing halts test flight of new plane https://t.co/hQHnXnF3xY", "LISTEN: 11/05/2017 GMT https://t.co/LaKw8r55Tc", "An eclectic entrepreneur in Singapore https://t.co/Tca6rk5oau", "Nine-month stretch https://t.co/tFSOc7H1ou", "Nuisance call firm Keurboom hit with record fine https://t.co/MLQwfGSNb8", "Surveyors predict 'flat summer' in housing market https://t.co/oIDuIgApYY", "National minimum wage increases could cost jobs, IFS warns https://t.co/60oOSO6Lyv", "LISTEN: Wall Street Update 10/5/17 https://t.co/95DRYqwtPn via @BBCWorldBiz", "21st Century Fox profits fall as advertising dips https://t.co/zq36mVx5mN", "Snap shares slide as growth slows https://t.co/inLAVHrCTC", "My pager: The 'in thing' in the 90s https://t.co/xUelvrzHIW", "LISTEN: FIFA: Ousted Ethics Chief Criticises Firings https://t.co/QjfkGb5Bxk via @BBCWorldBiz", "Retro tech: When the pager was king https://t.co/Wyqfd3X4Rq", "Pret a Manger's owner considers a New York flotation https://t.co/oMDZisxOaO", "You're fired! https://t.co/iW32My4h34", "Have you had a starter interrupt device or a kill switch installed in your car by an auto lender? @ reply #BBCAskThis", "RT @bbckamal: Education pledges and corporation tax rises - do they add up? https://t.co/8xWH8uFOT7 My Economics Blog #GE2017", "RT @BBCSimonJack: Barclays CEO on BREXIT - WE SEE NO NEED TO SHIFT BRITISH JOBS OR SIGNIFICANT OPERATIONS ELSEWHERE.", "RT @BBCSimonJack: Jes Staley, Barclays CEO says establishing ring fenced UK retail bank more complicated and more expensive than Brexit.", "Faxes &amp; pagers may seem vestiges of a bygone age, but @Hotters_says finds that some professions still rely on them https://t.co/muL0q663zI", "'The slimming pills that put me in hospital' - aka the perils of taking #fakedrugs\nhttps://t.co/9gPkEfY2DZ https://t.co/uBbadVwVjj", "TalkTalk shares slump 10% https://t.co/9CibdsO1Ee", "Brexit's hard Irish border questions https://t.co/7BWKIVd0YE", "Qantas chief Alan Joyce 'to press charges' over pie incident https://t.co/9LrtVCMq9j", "Lord Derby wins battle with government over 400 homes in Newmarket plan https://t.co/hiB581kiRV", "Barclays boss set for shareholder grilling at AGM https://t.co/5fYx2l6NmX", "Toyota suffers first profit fall in five years https://t.co/H78Xyi7mqc", "Vodafone deal to sell pagers faces probe https://t.co/rOts8XmoqW", "Job losses from Aberdeen Asset and Standard Life deal https://t.co/yNBunS3xl5", "ITV revenues fall 3% as advertising continues to shrink https://t.co/ycWGKEn6Tc", "LISTEN: FBI Chief Comey Fired By Trump https://t.co/n1hlVBDD1P", "LISTEN: Wall Street Update 9/5/17 https://t.co/zotzv3YIOQ via @BBCWorldBiz", "Australia budget 2017: Treasurer unveils big banks tax https://t.co/gdh7CSedJT", "IoD: Investors need bigger say in executive pay https://t.co/HtCxhdm44d", "'I thought I was invincible' https://t.co/gn5RQ3yvHn", "Not research, but 'mesearch' https://t.co/QSuJ2xQvWH", "Walt Disney profits were boosted by Beauty and the Beast https://t.co/c1pQwx1iKk", "Alison Brittain named Veuve Clicquot Business Woman of 2017 https://t.co/jjqdU9OjX1", "Walkers crisps Peterlee factory to close in December https://t.co/xqzw6B4qcU", "LISTEN: Liberal Set to Win South Korean Presidency https://t.co/fKquR7SYza via @BBCWorldBiz", "RT @ruskin147: Fascinating day filming police being trained as cybercrime cops. Here examining crime scene... https://t.co/Vb2YQvsF9Z", "RT @theJeremyVine: Interviewer our own business editor @BBCSimonJack about the energy cap https://t.co/iB1LazDJ9g", "Facebook must delete hate postings, Austria court rules https://t.co/zDWLofuBhQ", "RT @BBCRealityCheck: Up, up and away: is your energy bill heading skywards? BBC Reality Check tests the PM's claim. https://t.co/VXOBUSHx57", "Mistake-fixing start-up Grammarly raises $110m https://t.co/4oOQamkUSR", "RBS cuts hundreds of technology jobs https://t.co/Qhq1twg5rD", "Dove body-shaped shower gel bottles ridiculed online https://t.co/k4cNpUQbtA", "Microsoft makes emergency security fix https://t.co/nq8Shmjoek", "O2 to scrap Europe roaming fees https://t.co/QtY8NWm8HY", "E.On profits hit by UK customer woes https://t.co/ijSEWCJiwb", "Qantas chief Alan Joyce hit with pie in face https://t.co/BiG4YFrTUI", "'Bad work is bad for the economy' https://t.co/XRRZ7dwRjo", "Micro Focus shares dive 9% on HP warning https://t.co/oL0GGFEevX", "Akzo Nobel faces Elliott legal bid to oust chairman https://t.co/Hh37ypUeVG", "China's Alipay takes on Apple in US expansion https://t.co/NJ8H5XR3Cp", "Retail sales 'get Easter boost' from food sales in April https://t.co/LvijzFBttI", "RT @DaveLeeBBC: Can Amazon's assistant stay on top? Gonna be tough... https://t.co/2Vn6H12Rm9", "Kelvin Mackenzie to leave The Sun after Ross Barkley column https://t.co/xbyaXFYFPu", "LISTEN: 'Trump Was Warned About Flynn' https://t.co/SuspE4h4C7", "LISTEN: Wall Street Update 9/5/17 https://t.co/QrFARHA4rA via @BBCWorldBiz", "Sun trap https://t.co/q9kvjAhyoI", "'Block Fox bid for Sky', says ex-worker claiming harassment https://t.co/rJtuEifuDs", "General election 2017: PM vows to end 'rip-off' energy bills https://t.co/WKUH9Tvp7X", "Rupert Murdoch: 'Nothing's happening at Fox News' https://t.co/3JkdX1GhQ8", "Streaming and Ed Sheeran the right tune for Warner Music https://t.co/VztJhHimGW", "Kushner family apologises for mentioning Jared at China pitch https://t.co/4es8JOd0le", "LISTEN: Emmanuel Macron's Economic Agenda https://t.co/L5CQzCGj3T via @BBCWorldBiz", "New rules spark sharp rise in health and safety fines https://t.co/Y7IrZ1iUhR", "Coach bags New York rival Kate Spade for $2.4bn https://t.co/NnkJTTtIm0", "Zero hours workers are 'missing out on paid holidays' https://t.co/MFyWNQgIKy", "General election 2017: What is the pensions triple-lock? https://t.co/EJa1B6j6OQ", "Cloned cars sold in Greater Manchester eBay scam https://t.co/6cN7PsEaE3", "Ofcom to probe excessive directory enquiry costs https://t.co/gw4BfdSaLP", "Guardian Soulmates users hit with spam after data exposure https://t.co/uFoiFOam0D", "Private equity bids $2.5bn for Sydney Morning Herald owner https://t.co/v29yaEJyyC", "Has Facebook profited from fake news? https://t.co/9UrACkvEFC", "FTSE 100 flat after French election https://t.co/RDCxNVMqgZ", "UK house prices in first quarterly fall since 2012 https://t.co/LuGJ4KQVkh", "Macronomics https://t.co/3EWlwkJwZV", "RT @gompertz: House prices stagnating says Halifax. 1st quarter on quarter drop in house prices for 5 years, no monthly increase this year", "British Gas loses more customers amid price cap row https://t.co/yHglUvtn5h", "More than half of UK vapers 'have given up smoking' https://t.co/UeB5M5Qavm", "RT @zsk: Facebook taking out ads in the Telegraph tells you a lot about the age of its UK members https://t.co/vDvSPLrBBe", "Dulux owner Akzo Nobel owner rejects third PPG takeover bid https://t.co/n48Im0yJeQ", "Facebook publishes fake news ads in UK papers https://t.co/AdfRQtv1fG", "CEO Secrets: What I learnt from bees https://t.co/PfFC8CidXe", "Superstar economics https://t.co/JD10kR4suR", "Hanging up the microphone https://t.co/PdDZTvXPwB", "Debit card control lets you 'turn off' card to beat scams https://t.co/jNMraFSK29", "Euro strengthens as 'pro-business' Macron wins French presidency https://t.co/3CZfuiSyoR", "Rich List 2017: Six surprising ways to make money https://t.co/aktQxOQo1y", "UK tourists hit by booking scams up by nearly a fifth https://t.co/kr0vv9QwsR", "General Election 2015: Tax policy expert on Labour's tax plans https://t.co/WmWx7A5mMx", "Automation poses a high risk to 1.2m Scottish jobs, report says https://t.co/ycfk0DD82Q", "Rich List 2017: No Brexit 'chilling effect' on wealth of super-rich https://t.co/l96NqDXBhN", "Breaking brands https://t.co/tT4S3M1iug", "The world's largest artificial sun https://t.co/dmhN3uTcu9", "Election 2017: Labour rules out tax rises for 95% of earners https://t.co/NIBsi6eBgI", "General election 2017: Lib Dems pledge winter fuel cuts to protect pensions https://t.co/gPhwcWLKQD", "The bakers who boogie https://t.co/A5ga7Ttvxo", "LISTEN: US Jobs Growth Accelerates https://t.co/aqRtWJ7SFk", "LISTEN: Wall Street Update https://t.co/mSaj1zgEQA via @BBCWorldBiz", "Dumped by a stranger https://t.co/dEAvoyI05Q", "Debenhams Flowers data breach hits 26,000 https://t.co/8YP71OP2Sa", "Is a dog a man or woman's best friend - in the workplace? @SusastreeterBBC finds out... https://t.co/88HiupalvO", "Pearson: two-thirds of shareholders reject pay package https://t.co/9QAlUy0UUi", "LISTEN: Goldman Boss Warns of City Brexit Risk https://t.co/mCjrTnsCcD via @BBCWorldBiz", "Lost at the airport? This robot can help https://t.co/sii2NqCHp2", "'Eat to extinction https://t.co/vhvPTXk5p4", "What are 'inclusive economies'? https://t.co/rchOL7usyB", "RT @matthew_wall: Watch me! Watch me! How live streaming is earning a small fortune for some but worrying others.\nhttps://t.co/yCWZx4Y0Un", "Government air quality plan criticised as \"weak\" https://t.co/bKMynf5ynx", "US jobs growth rebounds in April https://t.co/ubl8899Xs5", "Johnson &amp; Johnson ordered to pay $110m in US talc cancer case https://t.co/pGRj1NiW6c", "Durban's 'one stop shop' DJ https://t.co/I5ycETPdYA", "Santander faces challenge over fraud losses https://t.co/uFCoqm9fFk", "BA owner IAG hails record first-quarter profit https://t.co/jkAqvM6p1C", "China's first big passenger plane takes off for maiden flight https://t.co/NbfgrwPept", "Uber faces criminal probe in US over 'greyball' code https://t.co/2XpXjnK3lE", "FTSE 100 falls but Pearson boosted by cost cutting plan https://t.co/39nOd8dXJT", "Goldman Sachs draws up Brexit contingency plans https://t.co/TOsd2cujhl", "RT @ruskin147: On @BBCTechTent today meet the robot soon to be your airport guide. Plus two new tech polling ideas https://t.co/fY97qY8WMz", "UK clean air strategy: Government to publish draft proposals https://t.co/pXmZahO3B7", "M&amp;S names Archie Norman as new chairman https://t.co/jLKSeHr24n", "Delta under fire for kicking family off 'overbooked' flight https://t.co/OHL98LujbM", "A tour of China's first big passenger jet - the C919 https://t.co/PGzepoisMk", "LISTEN: Trump Scores Healthcare Victory in House https://t.co/BsV3suLfWE", "Shake Shack shares fall after sales go cold https://t.co/K9PUQQ4tvX", "Hello Arizona https://t.co/JhF0NbAMI2", "Watch me, watch me https://t.co/CaCrP2l9ty", "LISTEN: Wall Street Update https://t.co/D5cwKnCtlv via @BBCWorldBiz", "Oil price tumbles on fears of oversupply https://t.co/Fdjuw6UXn5", "Burberry to relocate 300 jobs from London to Leeds https://t.co/7Lq25p8pPd", "#FidgetSpinners: an autism aid becomes a classroom craze. One seller, who is autistic, explains their popularity https://t.co/LELamvGzqj", "LISTEN: Societe Generale Reaches Settlement With Libya https://t.co/kviJ8m38iW via @BBCWorldBiz", "The Star Wars items worth a fortune https://t.co/StpPdES7jv", "RT @YuanfenYang: I'll be grappling with your economics qs on Facebook Live tomorrow at 11am! @rethinkecon https://t.co/L9QBY78lV4", "Jaeger's former owner: \"I could save it\" https://t.co/yUUqgESuUC", "Adidas shares hit a record high after firm sees sales jump https://t.co/Rs1sUknKHu", "Swiss 'spied inside German ministry' in tax scandal https://t.co/rV9TVdLPAO", "GMB claims ballot 'victory' for Bridgend Lidl staff https://t.co/2uAJ0bOz7U", "New car registrations dive 20% after tax increase https://t.co/pmYdYOCNtT", "Dashboard box encourages cleaner, smoother driving https://t.co/eSIpk4ePsL", "UK service sector growth picks up in April https://t.co/Kgx5FEBT80", "Mortgage approvals dip for second month https://t.co/QBp41ScPOQ", "RT @seanfarrington: Statement from Duff and Phelps, administrators of #BHS, on liquidation of Retail Acquisitions https://t.co/yZuH1NuGMI", "RT @PeacheyK: Time to raid the piggy bank - for administrative purposes, of course https://t.co/lrsdffbOZd", "FTSE 100 lifted by HSBC and Shell results https://t.co/t2By4uf63O", "KPMG's audits Rolls-Royce accounts probed by regulator https://t.co/n3DNYW0qu5", "RT @BBCDouglasF: Good start to the year for Morrison's, amid huge turmoil for retail. \nBlogged:\nhttps://t.co/BYscAxBx45", "RT @BBCDouglasF: Shell benefits from higher oil price than early 2016. (Brent crude this morning at $50.34)\nhttps://t.co/qYIWZh0OxJ", "Morrisons sales jump as recovery continues https://t.co/jUaNhSd1yV", "Royal Dutch Shell sees profits jump as oil price rises https://t.co/cCJaO5Bwe8", "Bombay Sapphire: Canada recalls gin over too strong alcohol content https://t.co/gdZCt3sIY6", "Next warns retail market still 'challenging' https://t.co/WA9gLEkOek", "HSBC profits fall as bank bids to restore flagging revenues https://t.co/qWuB3acNU9", "LISTEN: Insults Fly in French Debate https://t.co/zjPab0LYLG", "New-age storytelling and some breakfast in Beijing https://t.co/VfREqQdzsk", "What would your dream handbag look like? https://t.co/J9HT1UBgu5", "Time to hand in your old paper five pound notes https://t.co/TzCDDt3bIy", "Move over Mulberry https://t.co/ipsw9FSLBv", "LISTEN: Wall Street Update https://t.co/pcrFrYWrzh via @BBCWorldBiz", "Google Docs users hit by phishing scam https://t.co/CaU1c5nFyH", "Facebook nears 2 billion monthly users https://t.co/R0D5z7xQHW", "Lego Batman and CNN star as Time Warner profits rise https://t.co/zINxXtWKF9", "Federal Reserve: US economic slowdown 'transitory' https://t.co/FpyCoPGwxA", "LISTEN: Tallying The Bill for Brexit https://t.co/rHMGgIKNVg via @BBCWorldBiz", "Easter eggs help boost supermarket sales https://t.co/dU0c8vsq9A", "International banks plan pre-Brexit moves from London https://t.co/K1tM1cpfKj", "Volkswagen Group profits soar after cost cuts https://t.co/GOLtjg9tZw", "Marks and Spencer hires Halfords boss Jill McDonald https://t.co/bDg6yxozxc", "Bill Ackman: Donald Trump is good for US economy https://t.co/sxUL0FP1Kx", "LISTEN: Surprise Fall in iPhone Sales for Apple https://t.co/3n7NwqS8P2", "ITV chief executive Adam Crozier steps down https://t.co/4QTavD1dA7", "Sainsbury's and ITV drag down FTSE 100 https://t.co/eqntDU1YEZ", "Sainsbury's full-year profits fall 8.2% https://t.co/Inj2IqA96Q", "China's HNA becomes Deutsche Bank's biggest shareholder https://t.co/jqPpU1nZKn", "Etsy chief executive quits after quarterly loss https://t.co/Z47nBOkpNs", "UK's best and worst cities for 4G mobile coverage revealed https://t.co/1R274Q5RXG", "Scaling success https://t.co/ii3YorVo7I", "Half of us aren't happy to discuss mental health at work https://t.co/6S9VDRooEy", "Apple sees surprise fall in iPhone sales https://t.co/oTfDzEdgSu", "Norway billionaire Kjell Inge Roekke to give away 'lion's share' https://t.co/be815RLSot", "Alitalia's flight path to bankruptcy https://t.co/bjJPA9LGRx", "RT @PeacheyK: Early inheritance, the Bank of Mum and Dad, and the plight of first-time buyers https://t.co/mV9tRWI1mR", "#ICYMI Avocado prices have risen globally but where did the sudden demand come from? https://t.co/Lw09qsgGRM", "US airlines face heat in Washington after passenger clashes https://t.co/vTRtzkHrIt", "LISTEN: Greece Makes Preliminary Agreement With Creditors https://t.co/FW25zrLmWV via @BBCWorldBiz", "Greece makes preliminary agreement with creditors https://t.co/M9EMDgRj96", "Alitalia to enter bankruptcy proceedings https://t.co/FNfVhJucnv", "Are fitness trackers for pets a fad or the future https://t.co/Gw6c7Thv15 https://t.co/7Ej2zOaWV2", "RT @matthew_wall: Pet tech is a booming business. Go figure.\nhttps://t.co/UEYjZXxixT", "@rtaylor1729 Hi Rob, are you able to follow us as we're going to DM you. Thanks.", "Liberty House creates 300 extra steel jobs https://t.co/ItqEMp8qCB", "Parents '10th biggest mortgage lender' https://t.co/P0qDkRbypw", "UK manufacturing growth at three-year high, survey suggests https://t.co/LiPZKUTuRw", "Volvic water recalled in Japan amid plastic fear https://t.co/y64SXGadtC", "Ocado shares boosted by M&amp;S deal report https://t.co/mPp2Gt271o", "RT @PeacheyK: Icymi, how ATMs are planning to survive moves to digital payments https://t.co/5UMx13uQhE", "BP profits helped by higher oil prices https://t.co/YlecehZdsz", "Fyre Festival faces $100m 'Lord of the Flies' lawsuit https://t.co/ng9dCcGTid", "Samsung crane collapse kills six workers https://t.co/HsFxUhxoZb", "George Osborne's first day as Evening Standard editor https://t.co/MGQyFkNLff", "Australian government to build second Sydney airport https://t.co/bcnRwvlBVu", "LISTEN: Tornadoes and Floods Kill 14 in US https://t.co/OkEcTY6xpx", "Smart doggy https://t.co/GFXPmTL7an", "Nuclear oversight needs 'urgent' action, MPs say https://t.co/Q8y9SV3KIj", "CEO Secrets: Ask questions, says Divine Chocolate boss https://t.co/FIWjRrvvpi", "Trump is considering new Glass-Steagall-style bank rules https://t.co/VXGsv5VenX", "Deadline nears for US screenwriter strike https://t.co/TI47PXKb5H", "Dobbies garden centre chain strikes deal with Ocado https://t.co/9HE7figNoA", "LISTEN: France Election: Macron Says EU Must Reform or Face 'Frexit' https://t.co/XVuqO6Nzbm via @BBCWorldBiz", "Twitter signs deal with Bloomberg on rolling video news https://t.co/smBD3mbJ4y", "General election 2017: Tax lock is bad policy, says IFS https://t.co/8T2F5KRu0s", "Can solar help keep Australia's lights on? https://t.co/3hrKNvOnB6", "South Korea shrugs off tension with sharp rise in exports https://t.co/8GCVMddgVo", "Dubai gets own font, but is it your type? https://t.co/5hk8RW9uxC", "Holy guacamole! Avocados at record prices due to shortage https://t.co/9KiWFnsiel", "FTSE firms face pension 'difficulty' https://t.co/MFReMuCLpO", "Rural bus services set to face further cutbacks https://t.co/L9AWDVHkDM", "Labour pledges 'tougher' standards for rented houses https://t.co/pXGUTHKWPq", "On the buses https://t.co/fNMsc6zHww", "The 12-year-old who helps out at the family funeral home https://t.co/6fbCzS5Y94", "US budget: Funding deal reached to avert shutdown https://t.co/OwojM5dvYw", "Lots of updating Word by Dubai civil servants today - told to use new Dubai font in official correspondence. https://t.co/UVf6OhvGsr", "Indians' dreams dashed by Australian immigration changes https://t.co/2kphBkuKfu", "Social media giants 'shamefully far' from tackling illegal content https://t.co/MZ6JKmqZM1", "How tech keeps Diego the dog as fit as a fiddle https://t.co/93iy8bL6rp", "Mr Fixer https://t.co/qF57PZgH7o", "'Brazen' conmen who targeted park homes jailed https://t.co/jXbEjkYRg6", "MPs call for end to 'bogus' self-employment https://t.co/f2KoJZXKlB", "Battery bonanza https://t.co/ggKOeC3Drc", "Swiss 'tax spy' arrested in Germany https://t.co/9eSh3eYGF6", "Tories have 'no plans' to raise tax https://t.co/NXdlMGMKE2", "China factory output growth slows https://t.co/KzIsXhkH0y", "General election 2017: No 'specific' May tax cut pledge https://t.co/cGby4FpoTW", "Ayrton Senna Foundation changing children's lives in Brazil https://t.co/sHKevP9uW1", "EU outlines Brexit negotiating stance https://t.co/M4s0Q4IOnV", "Turkish authorities block Wikipedia without giving reason https://t.co/xaAKl73iah", "May vows to protect pensions from 'unscrupulous bosses' https://t.co/9272c6xy4U", "Triple-lock: Call for pensions policy to be revamped https://t.co/6yNuZ32x0P", "Green heating system accused of causing 'fuel poverty' https://t.co/3S7lZkTEA9", "Hero's legacy https://t.co/ZgmNOpTwu2", "MPs say 'dominance' of big home-building firms must end https://t.co/OIwLAWWW5N", "LISTEN: US Growth Hits Three Year- Low https://t.co/AyjUrwRRJJ", "LISTEN: Wall Street Update https://t.co/tWlkzTiWg4 via @BBCWorldBiz", "Donkeys in Africa under threat as demand for hides grows https://t.co/JlBOPA1bEF", "Trumponomics quiz https://t.co/nQ1KnYBQh3", "No Bank balance https://t.co/mGLuOmo7Rd", "Niger 'cleared' over Areva uranium deal https://t.co/Uz5l4yDxFi", "Brent Delta platform removed from legs https://t.co/zcM96qDdqi", "LISTEN: Bayer Board Defends Monsanto Takeover https://t.co/zFB0ADrMpA via @BBCWorldBiz", "How bluefin tuna went from US town dumps to the pinnacle of Japanese cuisine #bbcfoodchain https://t.co/up0pNf9vQf https://t.co/kU9gOmxB4p", "Qualcomm says Apple withholding royalty payments amid legal row https://t.co/oZ37NSyGm1", "'Fire sale' risk with Bank capital approach, says Vickers https://t.co/eqo8X8dwjr", "Amazon 'style assistant' divides opinion https://t.co/3WeKugm7PT", "NatWest and RBS banking app fails https://t.co/xBE0IO2vxy", "US economy slows sharply in the first quarter https://t.co/qd3HFdP48o", "Top Indonesia phone company Telkomsel's website defaced https://t.co/k4llt5F2Uu", "Barclays pulls FTSE 100 lower https://t.co/gWH6zN4EzH", "Google and Facebook duped in huge 'scam' https://t.co/tjRJVlkYos", "M&amp;S online food delivery service will be no piece of cake https://t.co/AwDmLBuMwP", "Eurozone inflation picks up to 1.9% https://t.co/7GKTxW4NSs", "Fyre Festival turns from 'luxury' to 'disaster' with ticket-holders stranded in Bahamas https://t.co/diIkq877QL", "RT @GuyKilty: I love the smell of paprika in the morning @bbc5live #wakeuptomoney https://t.co/Q1QmCw1gci", "'Rocket man' takes off in flying suit https://t.co/NiRwNJS2vQ", "Somali trader's life in South Africa https://t.co/hMUwAumcH4", "RT @andyverity: If you break it down to economic growth per person (GDP per capita) - growth in Q1 was only 0.1% (ONS)", "#BREAKING: UK economy grew by 0.3% in first quarter of 2017, according to official figures https://t.co/T2EK1OPAx5", "UK economic growth slows to 0.3% https://t.co/aECjszcFpU", "RT @BBCSimonJack: Barclays outlook bright says boss whose own future is under a cloud. My blog https://t.co/YpkXrlHvNt", "RT @matthew_wall: Can the cash machine survive in the age of smartphone banking? \nhttps://t.co/ZNOVW1JPl2", "House prices fell again in April, Nationwide says https://t.co/S0Dyo3jfXg", "Olympus scandal: Former bosses to pay $529m over fraud https://t.co/zJPzVPQ6hP", "RT @BBCBenThompson: Larry our cameraman has a head for heights (we hope) @BBCBreakfast https://t.co/IKgRaXr0yw", "Barclays profits more than double https://t.co/3PlDBVXRj9", "RBS reports first quarter profit as turnaround continues https://t.co/Z4i4KeDiRB", "Can 60-year-olds still run a cool business? https://t.co/hMZOmlKTJk", "LISTEN: Trade Tensions Escalate between US and Canada https://t.co/YZ5T4l3xjr", "No branch? https://t.co/l16m9dmXEO", "TED 2017: UK 'Iron Man' demonstrates flying suit https://t.co/ucAGEaKxEr", "Vauxhall 'reckless' over Zafira fires, say MPs https://t.co/606ErfupJ4", "LISTEN: Wall Street Update https://t.co/CdE28WuvgR via @BBCWorldBiz", "US tech giants post strong quarter https://t.co/qoO1xPWt3y", "LISTEN: US-Canada Trade Tensions https://t.co/rCiJHAGmNJ via @BBCWorldBiz", "Passenger dragged off United Airlines plane wins settlement https://t.co/NEOMYnYfrO", "Is coconut the cream of the milk stars? https://t.co/Kh7ZggzjzT", "BBC exposes flaws in 'world's most secure' email service https://t.co/47ulvAKKgj", "Coconut milk helps Pret A Manger report record results https://t.co/iu3Id1eEli", "Coconut, cows' milk, soya or almond?We're having a mylk-off! #milk https://t.co/UCW4yPKoK2", "Nintendo says Switch will help double profits https://t.co/128NaprmKg", "Uber's booming Egyptian market https://t.co/EcpEI6zw4m", "Dairy wars: Why is Trump threatening Canada over milk? https://t.co/aRGNXS8b8t", "European Central Bank keeps key interest rate on hold https://t.co/JUkU5SEfLP", "Taylor Wimpey apologises in leasehold dispute https://t.co/3liTtyKw1z", "RT @cajuk: The UK goes coconut crazy, says @Pret a Manger https://t.co/sdxFSNPUfG @BBCBusiness https://t.co/EZFCwpJskq", "Airbus profits fall as technical problems continue to hit projects https://t.co/rtgT05fs75", "FTSE 100 falls despite Lloyds boost https://t.co/3ZXrJsErC0", "Lloyds Bank's profits rise despite 'challenging' times https://t.co/0SG0SaRFky", "United Airlines to offer up to $10,000 for forfeiting seat https://t.co/TcQXGC5tkR", "Trump won't scrap Nafta trade deal 'at this time' https://t.co/ETe4uIDrgD", "Samsung sees best quarterly profits in three years https://t.co/8h5fuaFfao", "LISTEN: Trump Seeks Tax Windfall For Business https://t.co/sOSRurRwrq", "A day in Seoul using just Samsung products https://t.co/NnVrc5HBpW", "Job opportunities https://t.co/XHZgnbX3Xy", "LISTEN: Wall Street Update 26/4/17 https://t.co/IKaEWJeVXp via @BBCWorldBiz", "'Pawternity' leave https://t.co/cDC9kaFo1x", "Ebook sales drop as readers favour non-fiction books https://t.co/wlSCidByp2", "TV drama and the weak pound set the scene for holidaymakers https://t.co/9i1DwDlEUl", "US regulator wants to reverse net neutrality https://t.co/Dy04sVXOQK", "Deutsche: Brexit risk to up to 4,000 UK jobs https://t.co/HGDdXjF0KG", "Anne-Marie Slaughter: A year's maternity leave is too long for mothers https://t.co/9VW3j0nmIk", "Wall Street edges down after Trump tax plan https://t.co/uUisbL27o6", "Airbus chief in Eurofighter fraud probe https://t.co/HZEqQxt8Eb", "Trump 'considering draft order to scrap Nafta' https://t.co/TAQag0sOAB", "TalkTalk hack attack: Friends admit cyber crime charges https://t.co/TL6pEzCBqK", "Swinton Insurance to cut 900 jobs https://t.co/tF0JLanFa6", "Sports Direct staff supplier Transline faces administration https://t.co/gYzKSLN9RE", "In the small print https://t.co/dNwuX2k6qn", "LISTEN: Trump Seeks to Slash Tax for Business https://t.co/pKTt5Lunf7 via @BBCWorldBiz", "Barclays boss wants freedom to recruit from outside UK https://t.co/7pLzh5rSOz by @BBCSimonJack", "Hummus crisis? What hummus crisis? https://t.co/CKurX3AMcn", "Barclays boss: Banks need access to talent post-Brexit https://t.co/33pVDjixfM", "RT @BBCNews: Barclays boss sounds Brexit talent warning https://t.co/51uR3f3CCx", "Twitter users up but 'headwinds' forecast https://t.co/0pqvG5UBVP", "Trump seeks to slash tax for businesses https://t.co/mj3gTGEs7H", "Barclays boss sounds Brexit talent warning https://t.co/q2HsZFoiGd", "Football and the UK taxman have had a troubled relationship in recent years https://t.co/md5YVIlFDg", "Santander chief warns on 'changeable' UK economy https://t.co/Vw58HHHsbM", "Isle of Wight Festival takeover bid by Live Nation investigated https://t.co/kAvuPbDjMs", "'Several' football arrests over HMRC probe https://t.co/D6mkG0XicU", "How to make everyone hate you on email... how many of these are you guilty of? https://t.co/sBg9TTjQ3g https://t.co/jfICpVudDh", "Fresnillo drags down FTSE 100 index https://t.co/XOn7KFfBka", "Uber plans to test on-demand flying cars network by 2020 https://t.co/rkFlvFfE1O", "Boohoo online fashion retailer sees its profits double https://t.co/aUsd8BQo7l", "RT @BBCwestcott: BBC News - The drones which help solve air accidents. This was a training exercise....https://t.co/h1AXjQgdFh", "Jockey Club horse racing posts record annual turnover https://t.co/xExqh56UjY", "United Airlines reviews giant bunny death https://t.co/upigvLpyBL", "LISTEN: Paraguay Heist Sparks Deadly Gun Battles https://t.co/4M8pgQBs93", "The drones which help solve air accidents https://t.co/TpJlXJrULC", "Email hell https://t.co/BGbVCWP8lK", "'I see colour' https://t.co/7i9DyWG2No", "LISTEN: Wall Street Update 25/4/17 https://t.co/IGAcxaAQM9 via @BBCWorldBiz", "Has the US started a lumber trade war with Canada? https://t.co/QzRkqRA42C", "Obama criticised for '$400,000 Wall Street speech' https://t.co/JFPmyJkQiB", "Shareholders angry over fake accounts disrupt Wells Fargo meeting https://t.co/PLbsBfbTxM", "Coca cola to cut 1,200 jobs https://t.co/yw2Unj8ssh", "Lockheed Martin profits take fall, despite sales increase https://t.co/sVrmu4bcG5", "LISTEN: What Next for the European Union? https://t.co/EQblsQuidc via @BBCWorldBiz", "Brexit: Labour's Sir Keith Starmer wants talks over customs union https://t.co/UQISV6GE40", "McDonald's shares hit record as investors digest results https://t.co/fQ3m9MIRnS", "Machine learning https://t.co/rMoGlJvYzm", "Marissa Mayer to make $184m from Yahoo's sale to Verizon https://t.co/FxIV23fcQz", "Nestle cuts 300 jobs in north of England https://t.co/owWmPDInGn", "Christian Dior and LVMH combined by French billionaire https://t.co/ijdEKD1dZ8", "Costa coffee owner Whitbread wary over prospects https://t.co/4ExqagjJmy", "RT @matthew_wall: Rushed off your feet? Juggling work and family? There's an app for that... https://t.co/HfP0XgVy8d", "Government borrowing at lowest since financial crisis, says ONS https://t.co/2XZFB20zkv", "FTSE 100 opens flat but Carpetright hit as sales slow https://t.co/cUMifG8dCD", "Can plastic roads help save the planet? https://t.co/hpVJPsgwZM", "Hornby directors defend chairman Roger Canham https://t.co/reTMtJ1r8d", "Are flying cars the future? https://t.co/bbxyBxYEqm", "Government lacks faith in free market, says energy boss https://t.co/4gmmR46qMI", "General Election 2017: Labour to rip up Tory Brexit plan https://t.co/935a5mfajm", "LISTEN: Le Pen Steps Aside As National Front Leader https://t.co/DGQIisLba1", "Diesel vehicles important for UK economy, says industry https://t.co/HXnc2FeWt5", "Lunch-hour hacks https://t.co/tNNRwtkuQt", "Small businesses with EU staff worried about Brexit https://t.co/XVcSoiRKTC", "Wikipedia's Jimmy Wales creates news service Wikitribune https://t.co/G8hkAyODMu", "LISTEN: Wall Street Update 24/2/17 https://t.co/tp4OggJsRe via @BBCWorldBiz", "Missing million https://t.co/kgTB4IhE4U", "General Motors loses Supreme Court appeal over car faults https://t.co/4ZR0wwpMHC", "Peugeot Citroen investigated over diesel emissions https://t.co/PsUUZjfvEr", "LISTEN: France: Macron and Le Pen Face Presidential Runoff https://t.co/hBsvEEPgky via @BBCWorldBiz", "Toy-maker Hasbro revenues boosted by Monopoly sales https://t.co/bQctk2QTTB", "Five-a-side firms Goals and Powerleague in merger talks https://t.co/2TFX8Q4gg8", "\"The most important thing for me was the family.\" The secret to running a successful business. #CEOsecrets https://t.co/TVNlkD6URX", "Explaining energy price cap https://t.co/gHLPktVETD", "Bid for Dulux owner AkzoNobel raised again https://t.co/HKMl6NK0OA", "LafargeHolcim chief steps down after Syria investigation https://t.co/em4zf3zbhp", "RT @BBCDouglasF: Forex assuming it's to be President Macron: sterling down 1.4 cents against euro\n#MacronEconomics https://t.co/wlajl5iMzd", "RT @bbc5live: After midday, money-saving @MartinSLewis will be here to answer your financial questions #5liveDaily https://t.co/XrPdlGFQTb", "#FranceElections What would an Emmanuel Macron French result mean for Brexit? https://t.co/5kXSfafvhj @BBCSimonJack", "Meet the firm that recruits @mrmenofficial characters https://t.co/CscAtJnve7", "Driverless cars trial set for UK motorways in 2019 https://t.co/mL926cSF1n", "Luxury shoe maker Jimmy Choo has said it is seeking potential offers for a sale of the business https://t.co/2xjVUVf0hw", "Family matters https://t.co/pfbnlT1U3q", "FTSE 100 jumps as markets welcome French vote https://t.co/6Wtj8JE4pn", "#FrenchElections: The euro hits five-month high and European share markets rise after the first round of election https://t.co/eCE83NrWvq", "General Election 2017: Energy bill cap 'will hit consumers' https://t.co/KRKhpdIHpQ", "Jimmy Choo puts itself up for sale https://t.co/bXgfh48IxV", "LISTEN: France Elections: Macron and Le Pen in Run Off https://t.co/hzGb7lyXWZ via @BBCWorldBiz", "'You're hired Happy' https://t.co/IEL8HqcGAC", "Geeks vs government https://t.co/rEdzRmGxqD", "CEO Secrets: Put family first, says manufacturer. https://t.co/GDU4eB9SBY", "Tory price promise https://t.co/D8H6lDwr1N", "French elections: Markets sense relief after French vote https://t.co/Lh5RBmhTjp", "General election 2017: Tories to pledge energy bill cap https://t.co/b0W5uFdcos", "IMF meeting drops anti-protectionism pledge https://t.co/XvOdXVaXmw", "Company profit warnings increase on previous quarter https://t.co/tOUlDneji7", "Packing a punch https://t.co/A2vU40RU3h", "Saudi Arabia's King Salman reverses public sector pay cuts https://t.co/BhS6k5Jr4X", "Three apologises after network problems https://t.co/WSM2OscRy3", "Brand Masha https://t.co/sU0V3SZJE5", "American Airlines suspends employee after clash over pram https://t.co/jwzWxVtAzk", "First coal-free day in Britain since Industrial Revolution https://t.co/m4H21CMMSm", "United Airlines to tie executive pay to customer satisfaction https://t.co/q9kZ2ZBgzy", "LISTEN: Last Day of Campaigning in France https://t.co/Kg9eINzkIZ", "LISTEN: Wall Street Update https://t.co/XVQBAE7WFy via @BBCWorldBiz", "Exxon Mobil denied permission to resume Russian oil work https://t.co/ZbEbiDYR5o", "Braced for Brexit https://t.co/oSXd30SFzj", "Key concerns https://t.co/W2Vtnd1LUv", "RT @dougalshawBBC: \"LOL, a rejected take-off would be fun.\" Your doubts about circular runways answered... https://t.co/oLa88woZYu", "Lloyds: Taxpayers get all their money back after rescue https://t.co/dL1jYPRwKP", "LISTEN: French Terror Attack Ahead of Election https://t.co/tk7ZvGUtH8 via @BBCWorldBiz", "UK set for first full day without coal power https://t.co/rgGCUzXavx", "#GeneralElection @PHammondMP hints Tory manifesto may drop pledge not to raise income tax, NI or VAT https://t.co/ZlfB9Ndika via @bbckamal", "The elaborate scam behind the Borussia Dortmund bombs https://t.co/n9UwhZctc8", "Government extends Sky takeover enquiry https://t.co/2YlE5Scqs0", "High heels row: Petition for work dress code law rejected https://t.co/B7Yd4tgjMz", "How a 119% tax on tea imports in the 1750s helped smuggling become a vital part of the UK economy https://t.co/5L4X8dJi9r #nationalteaday", "Is Ghana's economy on the mend? https://t.co/smM6SyRgqD", "Record low rate signals mortgage battle https://t.co/yStev2atTi", "Zambia's DJ academy https://t.co/qziWxkzX7C", "Biggest fall in UK retail sales in seven years https://t.co/tJNQXlic3r", "US discriminating against Chinese firms says TCL boss https://t.co/5TCDiSmTp8", "Sports Direct breaks into US market https://t.co/F0XBcwnfNr", "FTSE slightly ahead in London trading https://t.co/804GYx831o", "Trump launches investigation into steel dumping https://t.co/aP887Y0lFX", "RT @BBCr4today: Who are \"the rich\"? The question these MPs won't answer https://t.co/eAR5XxKd3r #r4today https://t.co/50OlDjAqkg", "RT @BBC_Capital: Is your job totally pointless? Here's a simple method for finding out: https://t.co/heHv0qAMDj", "RT @seanfarrington: Sports Direct buys Eastern Outfitters in the US for $101m https://t.co/22gO7peqAY", "Juicero: Juicing boss defends $400 machine https://t.co/vAIXspmHnd", "Borussia Dortmund bombs: 'Speculator' charged with bus attack https://t.co/KcDYk9SFxA", "Reckitt Benckiser says Mead Johnson takeover on track https://t.co/tHhS3ShEAy", "RT @dougalshawBBC: Circular runways: Your doubts answered by the lead engineer @NLR_NL #tech #avgeek #aviation https://t.co/oLa88w7ozU", "Tesla recalls 53,000 cars over brake issue https://t.co/dtEQvMDcvq", "LISTEN: Policeman Killed in Paris 'Terror Attack' https://t.co/nCSdBEWJIN", "Nasdaq hits new high on tax cut hopes https://t.co/qhswbEOGSJ", "Russia's secret https://t.co/5o0mG7qpNq", "Can China's electric cars kill off petrol? https://t.co/WwhObd9KsO", "Car insurance premiums jump by 8% in the past year https://t.co/VHh0m3rZS4", "UK's online shoppers top global spending list https://t.co/2uMUZcwzpE", "LISTEN: Wall Street Update https://t.co/SC77o9v50A via @BBCWorldBiz", "Barbie out of fashion in Mattel slump https://t.co/vBW9G1f5tv", "Jobs threatened at Diageo bottling plants in Glasgow and Fife https://t.co/vfvxLw0xlz", "Jet-propelled sky taxi tested in Germany https://t.co/0a21yjQrqC", "Harley-Davidson: The 'emblematic' US company https://t.co/Zzr1aHMoII", "Unite 'suspends' Len McCluskey challenger Gerard Coyne https://t.co/hMu9d6q5wi", "Presidential challenge https://t.co/W9kpyLFl0d", "LISTEN: Pakistan PM Survives Panama Papers Ruling https://t.co/76nFAEUzoI via @BBCWorldBiz", "BMW profits boosted by Intel map investment https://t.co/2mAm7lLgx9", "GM says Venezuelan car plant is seized by government https://t.co/Q8GyLAeqA2", "Marks and Spencer to close six stores https://t.co/0nnZbETUK6", "Green Investment Bank sold to Australian firm https://t.co/UNJowkHx7q", "Unilever sales rise on higher prices https://t.co/LOFbreZdee", "Unilever leads FTSE 100 higher https://t.co/Usg2XFetfb", "Debenhams unveils turnaround strategy https://t.co/inRHQzTxpb", "Sky announces HBO co-production deal https://t.co/nXiTLD6g0G", "Credit card with a fingerprint sensor revealed by Mastercard https://t.co/OUUxd6lvDF", "Celebrities warned over Instagram ads https://t.co/LbUKmso52G", "Cycling to work can cut cancer and heart disease, says study https://t.co/Mk3vwxwMj8", "LISTEN: Two Dead as Venezuelan Protests Turn Violent https://t.co/sAV1klc1Re", "The hippo at work https://t.co/lhFHTYXqOp", "Germany's public wi-fi dilemma https://t.co/v6Cp8FS9Jn", "TalkTalk and BT rated worst for broadband in Which? survey https://t.co/Y31qj7ot1G", "Ultrasonic clothes dryer 'halves drying time' https://t.co/5Uwmss3HZ2", "Premier League revenues soar but clubs still make a loss https://t.co/58OiWZiPTv", "LISTEN: Wall Street Update https://t.co/qiUcLKStgE via @BBCWorldBiz", "Fox News: Bill O'Reilly loses job over harassment claims https://t.co/64wLzqaOhE", "Fox News 'to drop host Bill O'Reilly' after harassment cases https://t.co/oQ4j9AFzOH", "Emirates to cut US flights after Trump travel restrictions https://t.co/gHY1o2fUx8", "LISTEN: UK Snap Election Approved by MPs https://t.co/Zj8X51JjSF via @BBCWorldBiz", "Reality Check https://t.co/IHpMEUXd3q", "Virgin Money chief @gadhiaj talks to @bbckamal about depression, mental health and businesses' gender \"dinosaurs\" https://t.co/piGIUG7a7l", "Llanrwst fatal fire: Flames 'came from tumble dryer' https://t.co/MMdqI64llS", "Holiday Inn hotels hit by card payment system hack https://t.co/6HNajD1MR9", "IMF says global financial stability has improved https://t.co/yEMPCHd6mN", "Morgan Stanley profits jump on bond trading growth https://t.co/Qz2EYNmbC5", "RT @BBCNews: George Osborne to quit as MP for Tatton https://t.co/flSKJ5S6Rw", "Financial watchdog to investigate car leasing market https://t.co/VnrLdEPniW", "Virgin Money CEO on her struggle with depression https://t.co/33PjqmQnMp", "Starbucks joins 'unicorn food' craze with new drink https://t.co/JYleOTJOBy", "Energy secretary to 'flex muscles' over rising bills https://t.co/DXOUwkOIQl", "Adidas apologises for 'you survived Boston Marathon' email https://t.co/x0pW89fGLx", "Malaysia Airlines to track planes with satellites https://t.co/WoYsczLsYt", "Tesco to offload opticians' business to Vision Express https://t.co/6AfCjJhjAQ", "'Nearly half' of firms had a cyber-attack or breach https://t.co/Ekpuf2OAbG", "BMW workers in UK strike over pensions https://t.co/HmiVun6xHo", "Burberry shares dive despite sales rise https://t.co/zejfI6X3V1", "It's good to talk https://t.co/CNHCCKHYIt", "FTSE 100 stumbles as Burberry tumbles https://t.co/OqdzEU0KIt", "Sugar sweet for Associated British Foods https://t.co/X6l8y3KaHZ", "Dulux owner reports 'record performance' https://t.co/Qwvy3iniv6", "Baidu to share self-drive car technology https://t.co/5b8YND00Dt", "LISTEN: British PM May Calls Shock Snap Election https://t.co/1bvjA94vp7", "Services matter https://t.co/3brFPGk2O3", "RBS stake may be sold at a loss, chancellor admits https://t.co/NhMDkc3Qw8", "LISTEN: Wall Street Update https://t.co/q6Rb0KS4qP via @BBCWorldBiz", "Zuckerberg addresses 'Facebook killing' https://t.co/NOnt5KgypA", "Next slashes Wolfson's pay by half after profits slide https://t.co/fVWv7qIYNw", "RT @DaveLeeBBC: I'm live-Facebooking (??) the F8 announcements over on the BBC News Facebook page here: https://t.co/OtXc8eSB3t", "Trump order to target foreign worker visa programme https://t.co/st78EvSDbk", "LISTEN: France Looks Ahead to Sunday's Presidential Vote https://t.co/7UbNoCUIQo via @BBCWorldBiz", "#GeneralElection Markets don't generally like surprises, but reaction has so far been fairly calm @BBCSimonJack https://t.co/owDBHmil4m", "How much uncertainty can business take? https://t.co/RvY7hCZfJt", "Loan searches on the internet may 'affect credit rating' https://t.co/4Ul9YYO2xG", "IMF says pace of global economic growth is picking up https://t.co/a7VzumExeM", "Bank of America sees profits jump https://t.co/Jeme6y6J4i", "iRobot sues Hoover and Black &amp; Decker over robo-vacuums https://t.co/S1mIomJm65", "Indian tycoon Vijay Mallya held in UK https://t.co/oc0e0r4mqY", "Food and fuel inflation 'hitting UK supply chain' https://t.co/KxCn8ooru9", "RT @gompertz: Key economic figures announced in June - inflation, jobs and trade - will all be released AFTER the 8th June election", "RT @BBCNewsnight: PM Theresa May announces snap general election on 8 June https://t.co/hISeg7Ae9G", "RT @BBCNews: May to seek snap election for 8 June https://t.co/cjQ8OV78HJ", "RT @BBCBreaking: UK PM @theresa_may announces snap general election\n\nhttps://t.co/JRjQmfCY6Z https://t.co/yZbVqY70ng", "RT @BBCNews: Speculation rife over PM statement at Number 10 https://t.co/sO1KUu7npv", "Financial Conduct Authority concerned over personal debt https://t.co/kHVgrSODdi", "RT @matthew_wall: One dramatic benefit of the connected home #IoT https://t.co/jQqimwjYRk", "Facing the future https://t.co/QcKCYFstod", "FTSE 100 opens lower as mining shares fall https://t.co/K5OgiFYuK8", "Australia to introduce stricter rules on working visas https://t.co/mFlAybmQE1", "Cyber attacks 'hit one in five UK firms' https://t.co/QMhL4mCP8Y", "Londoners work '100 hours a year more than rest of the UK https://t.co/oll0ntlJxX", "LISTEN: Turkey's Erdogan Dismisses Critics https://t.co/e0oyDypzeq", "A bite to eat with one of India's richest men https://t.co/7XgNdWCSfB", "CEO Secrets: Think outside the bubble, says coffee chief https://t.co/9DOok4QqNv", "Guardians of the home https://t.co/HpFtbgr1PF", "Weetabix 'set to be sold to US firm' https://t.co/t3YMAsVv1a", "LISTEN: Wall Street Update https://t.co/cU35zNrvGf via @BBCWorldBiz", "Hove's BN3 postcode the most sought-after for 'young urbanites' https://t.co/5wUBukQqbU", "Netflix claims opportunity 'gigantic' as growth disappoints https://t.co/tSQfljT2Ru", "Brazil's Odebrecht to pay $2.6bn fine for corruption https://t.co/EtkoMwUg4l", "Google takes Android search blow in Russia https://t.co/BI0zxrqNqm", "Internet pioneer Robert Taylor dies https://t.co/pTamMip1KZ", "Hermes begins trial using self-driving robots in London https://t.co/IgCIYJr4mN", "LISTEN: Increased Power for Turkey's President Criticised https://t.co/PSe2M9HLs4 via @BBCWorldBiz", "Netflix looks beyond US as competition mounts https://t.co/ryceMgqTfo", "The Fate of the Furious breaks global box office record https://t.co/9myXn9Sgf1", "Easyjet forces couple off overbooked flight https://t.co/DvP3Fs9Qmp", "Microsoft patched 'NSA hack' Windows flaws before leak https://t.co/ey297olVOT", "Flying car prepares for launch https://t.co/WvCMHiGFYk", "Craft distillers show 'explosive creativity' https://t.co/0RYrKCDZK1", "Brazil graft probe focuses on World Cup football stadiums https://t.co/Y8xK0gplia", "London's 'super sewer' to help stop Thames becoming a toilet https://t.co/OShSn2Yc3O", "On #BBCBizLive today - we're test driving a flying car. We want to know - would you trust one for your commute? https://t.co/W9iKrd034s", "China's first quarter growth beats expectations at 6.9% https://t.co/6bhL7kZYXW", "Cadbury backlash: Is making chocolate in New Zealand worth it? https://t.co/Q3ZHlKZVXk", "United Airlines changes policy after 'horrific' passenger ordeal https://t.co/NUpskbLzVi", "Lloyds eyes Berlin for post-Brexit push https://t.co/8bMNRrbZHA", "Walking dead https://t.co/FtSoX3MBFv", "Industrial strategy 'must help' UK creative industries https://t.co/APiRSKNvVF", "LISTEN: China fears N Korea 'conflict any moment' https://t.co/u2lZmtAMDI", "Care home fees https://t.co/NpR7iLzMkS", "LISTEN: Airbnb Users Burgled After Hack https://t.co/3hba19YlVP via @BBCWorldBiz", "Should Zambia ban food imports? https://t.co/1gFDqLrhnK", "Inside the office where staff bring their dogs to work https://t.co/zSussbVDdO", "Luvo Ntezo: 'A good sommelier is a good storyteller' https://t.co/I69YKOZ27B", "AC Milan: Silvio Berlusconi sells Italian giants to Chinese investors https://t.co/EnAkusFNm5", "Credit Suisse bosses offer to cut their own bonuses by 40% https://t.co/SvlWfSHu2F", "LISTEN: US Drops 'Mother of All Bombs' on IS https://t.co/gVXmdZQoNZ", "Bulgaria's Sunny Beach offers 'best value in Europe' https://t.co/GUvsXp5SCZ", "Trade agenda https://t.co/z6Q3V1jMFK", "LISTEN: Wall Street Update https://t.co/xSbGY9MOW0 via @BBCWorldBiz", "Airbnb account hijackers burgle homes https://t.co/u2DVJoJzD2", "Drax investors rebel on bosses' pay https://t.co/xa4KwaqkZY", "LISTEN: US Dollar Weakens After Historic Shift https://t.co/q5iFh3xXwi via @BBCWorldBiz", "Tesco sorry for Good Friday beer advert https://t.co/wT5lFEbT9C", "Starbucks says Brexit vote partly behind UK profit fall https://t.co/vbneScut91", "JP Morgan Chase first-quarter profit rises 17% https://t.co/IxLmGmgHve", "Oil demand growth slows for second year https://t.co/Gx5uIC1VUA", "Victoria Beckham trademarks her daughter Harper's name in Britain and Europe https://t.co/2CvFZ4ALub", "Sainsbury's pushes ahead with Argos rollout in supermarkets https://t.co/EBrHGYCsBF", "Virgin Trains East Coast staff to stage 48-hour strike https://t.co/QTs2ejBX2m", "FTSE 100 opens lower but Royal Mail rises https://t.co/feoHysFKRD", "Royal Mail to close defined benefit pension scheme https://t.co/RJZnVOx2jn", "Beijing bans property ads promising high returns and good feng shui https://t.co/1bbxY9x0Wb", "Charging Bull artist wants removal of Fearless Girl statue https://t.co/Gq5W0ddC6B", "LISTEN: Rex Tillerson meets Sergei Lavrov in Moscow https://t.co/TN9FUIDs0Z", "UK firms 'struggling to recruit staff' https://t.co/6qHchsAtFs", "Double lives https://t.co/J7RqaVQaxS", "Surveyors get gloomy as property market stagnates https://t.co/Q4pqaVlMRV", "Record company revenues hits new high https://t.co/2bt5qGnkIh", "Donald Trump: China 'not a currency manipulator' https://t.co/m41ivFN9vj", "LISTEN: Wall Street Update https://t.co/8lHwmQWAm1 via @BBCWorldBiz", "EU migrants make up 11% of manufacturing workforce - ONS https://t.co/1BrX89Soab", "Tesla board 'too close to Elon Musk' https://t.co/nOXAqkiGo4", "United Airlines boss interview: How did Oscar Munoz do? https://t.co/iXUFYD6OiJ", "LISTEN: Protesters 'Sick and Tired' of South Africa's President https://t.co/xT9jm4Mu5G via @BBCWorldBiz", "RT @bbckamal: The results will be on @BBCPM with @eddiemair in a few minutes . . .. https://t.co/S6CB7deiyL", "Farfetch aims to end fashion faux pas with new service https://t.co/F0Cc2MhWNA", "Apple takes Swatch to court over 'Tick Different' ads https://t.co/fTcs0gwB7n", "San Francisco's food delivery service by robot https://t.co/pDT6sFAPes", "Vodafone scraps roaming fees in much of Europe https://t.co/E73LEXQOQv", "London 'not the best place' for fintech start-ups https://t.co/O9sghCRSTW", "United Airlines boss Oscar Munoz will not resign https://t.co/1Gwuc0fweE", "RT @brianmilli: wage growth remains a whisker above inflation https://t.co/VPgcMHT5Xc", "Germany's new train firm on track https://t.co/nC7Ei9mbQr", "Students face sharp rise in interest on tuition loans https://t.co/aBb1IueVR2", "Brexit vote site may have been hacked, MPs say in report https://t.co/r0w7w1C4BG", "Akzo faces call to remove chairman in takeover battle https://t.co/h4Bdgj1GGJ", "United Airlines boss sorry for 'horrific' passenger removal https://t.co/7DCMmDipZh", "EDF raises electricity prices for second time this year https://t.co/YnooqpcCy3", "RT @ruskin147: Philip Hammond announces Barclays to open Europe's biggest fintech incubator in London https://t.co/VrQbpOhnSS", "UK jobless rate remains at 4.7% https://t.co/U5ps0ivjkr", "#BREAKING UK unemployment rate remains at 4.7% as inflation starts to hit wage growth, ONS figures show https://t.co/jNN98PSAJe", "Tesco woes fail to dent FTSE 100 https://t.co/A0XGdodNrH", "WH Smith profits rise thanks to travel sales https://t.co/VAmOQGT75u", "On #BBCBizLive: As the boss of United Airlines finally apologises, when have you wished you had apologised sooner? https://t.co/XLtf6EJf32", "Tesco full-year profits hit by fine https://t.co/ed9hkazf6l", "Japan's snack giant Calbee hit by potato shortage https://t.co/VYwzxUoal8", "Can airlines \"bump\" people off flights? https://t.co/UzCSCkqdWa", "LISTEN: US Secretary of State Rex Tillerson in Russia https://t.co/h4TJ4k3pKG", "Lyrics battle https://t.co/5ikAmgJM4v", "Eggs-porting isn't easy https://t.co/El3PpnmJPH", "LISTEN: Wall Street Update https://t.co/3GhqjZCQFO via @BBCWorldBiz", "Bombardier and Siemens 'in train deal talks' https://t.co/QMuwhSba1z", "Canada to tackle overbooking on flights https://t.co/JpC2lNvp0s", "LISTEN: Toshiba: On The Brink of Collapse? https://t.co/K5DwjuY7ce via @BBCWorldBiz", "United Airlines shares fall after passenger removal https://t.co/PVKk21e3Yp", "Imax reveals European cinema expansion plan https://t.co/cNrQ6XMElM", "Firms dispute Jeremy Corbyn's claim they pay bills late https://t.co/m942y8Vk5P", "UK house price growth 'picking up' https://t.co/uCi748hrPp", "Not so friendly skies https://t.co/4gsy4iXKBT", "Troubled Toshiba files unaudited results https://t.co/PJTihVE85c", "UK inflation rate remains at 2.3% https://t.co/ZZx2rBrHgZ", "RT @matthew_wall: Triumph from tragedy: The women entrepreneurs using tech for good\nhttps://t.co/QCNFY5xHYQ", "Government 2.2% savings bond goes on sale https://t.co/cFVX1Tt5AZ", "FTSE 100 opens lower as retail shares dip https://t.co/au68NwPVv7", "JD Sports' profits boosted by fashion for fitness wear https://t.co/90hvoFyCHr", "Amazon's Alexa turns on Ford car's engine https://t.co/orsiA21quE", "LISTEN: Regulators Probe Barclays Boss Over Whistleblower https://t.co/ktbq6NpMb3", "Fujitsu staff in fresh strike action https://t.co/T5dSM9XXqN", "What is behind Toshiba's financial crisis? https://t.co/P3u93pesGI", "Shell admits dealing with money launderer https://t.co/1qYKvfdZjO", "The good stuff https://t.co/9EYndmMMXq", "Making a splash https://t.co/qjEa0ZkiRn", "Broadband prices penalise loyal customers - Citizens Advice https://t.co/sjIqk8HNNZ", "'Lonely life' in Indonesian village where mothers work abroad https://t.co/oE4BQtBTJz", "LISTEN: Wall Street Update https://t.co/DUvH82WtBg via @BBCWorldBiz", "Why was a passenger dragged off a US flight? https://t.co/5jvbdL7PfE", "Why was a passenger dragged off a US flight? https://t.co/LyXiDqVg6z", "Wells Fargo claws back another $75m from former bosses https://t.co/3qgj4qa1of", "Fashion chain Jaeger in administration https://t.co/4VTnRs1qgs", "Toshiba may sell chip business to Foxconn for $27bn https://t.co/iP8spoVixy", "LISTEN: Shell Corruption Probe: New Evidence on Oil Payments https://t.co/nFHuVZXhBc via @BBCWorldBiz", "Unite union leadership election: Who are the candidates? https://t.co/g483GOnAVI", "Rocket launch firm blasts onto Milan stock market https://t.co/474TDBmXCI", "British Vogue: Edward Enninful has been hired as the new editor https://t.co/ovt9AVGEWD", "Want to be a YouTube star? Here are some start-up tips from @The_T at @yogscast https://t.co/7i8Tay4t6D", "First rail freight service to China departs UK https://t.co/1QKvdgtwIN", "New fiver is not so indestructible - if you know how https://t.co/qVPs92NUZk", "The secret recording implicating the Bank of England in Libor rigging https://t.co/S63ihOLJOT", "Scots car firm founder Sir Arnold Clark dies https://t.co/JU26ODh4Z1", "Dallas warning sirens 'set off by hacker' https://t.co/s9l9jRdMDB", "Ukraine's central bank chief resigns https://t.co/HTxi5qY6AO", "'No justification for leasehold for a house' https://t.co/N3c3aTmbzf", "Barclays manager implicated in Libor recording https://t.co/6iSaTjSYk2", "Hi @The_T thanks for sharing your tips for YouTubers #CEOSecrets https://t.co/7i8Tay4t6D #MondayMotivation", "Quebec's maple syrup producers seeking global domination https://t.co/hLYsf5lKSm", "BHP Billiton gains on hedge fund move https://t.co/7xqTCfDFc5", "Travelodge makes more out of business than leisure visitors https://t.co/v10gbgIkqo", "City regulators investigate Barclays boss Jes Staley https://t.co/psNygFx5w7", "Shell move 'could be in breach of international law' https://t.co/yYnkmhtwqC", "Is Muslim fashion an untapped market? https://t.co/sOU8yVOELp", "CEO Secrets: Yogscast boss tells YouTubers 'Do it for love' https://t.co/SfynXHpMoz", "An air traffic control system... for drones https://t.co/T2m4iDi11v", "Cut price https://t.co/agq9RYks8g", "Sparkling success https://t.co/Wp5SVd3vX8", "Libor: Bank of England implicated in secret recording https://t.co/EofrLIBx0P", "Wonga breach affects 'up to 270,000 in UK and Poland' https://t.co/C9nRPDIhQF", "Hijacked ship's crew rescued from pirates near Somalia https://t.co/m98b63ZoeN", "Outlook for City after Brexit 'has improved' https://t.co/AmEy9rdrB2", "Ford sees a future in UK after Brexit, says CEO Mark Fields https://t.co/zyNf2Rjn4W", "LISTEN: Trump and Xi Complete Talks in Florida https://t.co/0FbgAyAEu9", "LISTEN: Wall Street Update https://t.co/aLkyUxmUu6 via @BBCWorldBiz", "Bookies bet on record weekend of sport https://t.co/I1CpxITyS0", "How loud is too loud? https://t.co/BjK3cRQ4cZ", "LISTEN: Protests Against President Zuma in South Africa https://t.co/eqH95wZ7Wc via @BBCWorldBiz", "Greece agrees basic terms to unlock delayed bailout https://t.co/OVrhVpK0dB", "21st Century Fox bid for Sky cleared by Europe https://t.co/XWGd0W511K", "YouTube channels need 10,000 views for adverts https://t.co/LRrJxpF8Qm", "Google adds search results 'fact check' flag https://t.co/1gT3yxTGLB", "Couples hire wedding gift card machines https://t.co/UuivAbFxFj", "US unemployment falls to 10-year low https://t.co/y2SWTX7I8N", "Travel websites ticked off over 'misleading' claims https://t.co/FbXtLtwCKc", "Pound falls on weak UK economic data https://t.co/vUIZHFFErh", "UK industrial output falls in February https://t.co/SThyVtCbIR", "Brexit talks: Mark Carney says financial regulation at 'fork in the road' https://t.co/IQzy7mZgdb", "A week of turmoil in South Africa https://t.co/eiCCYyhO1T", "Co-op Bank receives takeover 'proposals' https://t.co/hdC6Qek1Ln", "Malaysian Grand Prix: Sepang to drop off F1 calendar after 19 years of racing https://t.co/Ik18A6u7mn", "House price growth at lowest for four years, says Halifax https://t.co/4SFSDIwaR7", "McLaren to 3D-print parts at Bahrain F1 Grand Prix trackside https://t.co/h0VCD7yNMa", "Bernard Matthews new owner axes 114 jobs at Norfolk HQ https://t.co/tL4IsjKQAW", "Oil price jumps after US strike on Syria https://t.co/waECPPZ5co", "German Mittelstand wants 'soft Brexit' https://t.co/BLh2utg6M0", "Vaping shops selling to non-smokers https://t.co/0A4Md7fQaT", "Spotify may bypass IPO and list directly on stock market https://t.co/nXFWtpvvCd", "LISTEN: Trump and Xi Meet in Florida https://t.co/aJQYTWlfZj", "India buffalo abattoirs sit empty after government crackdown https://t.co/BFQZ9nGzcJ", "Wall Street closes higher after positive jobs figures https://t.co/Un4VKT5MX6", "Fertile ground https://t.co/bP6rswN7N8", "LISTEN: Wall Street Update https://t.co/rFJFFkFZHO via @BBCWorldBiz", "Why margarine is toast https://t.co/fwjrM0Idkm", "Video game Baftas get underway https://t.co/eclvER9lj3", "Facebook to tackle fake news with educational campaign https://t.co/Q3Qdjebb9X", "Four million leaseholders in England 'at risk from rip-off fees' https://t.co/BpyJaE6lQa", "LISTEN: BP Cuts CEO Salary https://t.co/o3CMAk5Tcp via @BBCWorldBiz", "Advertising fail https://t.co/LKTgtBiinI", "Gender pay gap https://t.co/uNUI25hBnG", "Huawei defeats Samsung in patent battle in China https://t.co/jReIMxAnOa", "Lord Sugar on how to deal with failure https://t.co/w9v04GJgqG", "BP slashes 2016 pay for boss Dudley https://t.co/7c8TLBChUA", "Two Barclays traders found not guilty in Libor retrial https://t.co/8xJGzi5UCh", "Co-op Group boss looking at new markets https://t.co/q6bk2i7IMq", "Flora sale: Impact on jobs in senior management https://t.co/Z58JAwiZXR", "Cadbury 'very proud of role in Easter' https://t.co/rUyXhULhYL", "Heathrow owner halts UK investment over Brexit https://t.co/LplPMmNRAU", "Can you guess on which 'luxury' items we pay VAT? https://t.co/yq29NeCxZh", "Pearson share slide drags down FTSE 100 https://t.co/0JHAqorzIK", "RT @WillSmale1: Is the humble Lada now a classic car? https://t.co/QaZBeR4l41 The latest BBC Business Brain feature https://t.co/CBSRpRqvA1", "The Lada owner who'd turn down a Ferrari https://t.co/fowmVJ6Tau", "Unilever to sell off Flora and Stork https://t.co/kOuZevKlVo", "Co-op Group reports loss on bank stake https://t.co/yDzhwzSUFy", "Call blocking will be given to most vulnerable people https://t.co/kxQAgp8pzF", "LISTEN: Trump Prepares To Welcome China's Xi https://t.co/fou9kDgN0O", "Sir Elton John among 63 new phone-hacking claims https://t.co/vr2Grg7HjC", "Why can't Indians gain possession of the homes they own? https://t.co/hqIBTmAcR3", "Five flashpoints of US-China trade https://t.co/M0DZLYqPkE", "Soviet saloon https://t.co/ZbB6y6TtPt", "Gender pay gaps must be declared by UK companies https://t.co/6RHQ4C0jon", "Banks and building societies snub Lifetime Isa launch https://t.co/XTk9BnWG70", "LISTEN: Wall Street Update https://t.co/05BrTCmDHC via @BBCWorldBiz", "RT @shanaz17: The mug's a bit of a clue but can you guess what it is? #marketing  https://t.co/Cs4RNdGBdh", "Criminal gangs use UK ports to defraud EU customs https://t.co/XP3AAT7njc", "Pepsi pulls Kendall Jenner advert amid outcry https://t.co/4GHTRHNw2Z", "Uber sued by car-share stab victim https://t.co/cpVh5unfLh", "#Cadbury says \"there is no attempt to hide #Easter\", after dropping the word from its annual egg hunts https://t.co/dXY2RDyB8h", "Social media firms faces huge hate speech fines in Germany https://t.co/vAaAaFh38L", "Facebook revenge porn to be blocked from reposts https://t.co/dGXUDj6CFm", "Krispy Kreme owner pays $7.5bn for Panera Bread chain https://t.co/rvwEZTiDT9", "LISTEN: Clash of the Titans https://t.co/FYIGf8JkOJ via @BBCWorldBiz", "Scottish economic output falls by 0.2% https://t.co/8bTT4b4znf", "Bookmakers' software under scrutiny https://t.co/1NyXTScFih", "Should equal pay for men and women be mandatory? https://t.co/sEoVFdTiOc", "Lloyds names locations for 100 branch closures https://t.co/t9Bbk22Vdx", "BMW workers to stage first UK strikes over pensions https://t.co/mg4YtylcxF", "UK charities fined for data law breach https://t.co/hUqBNFbXUG", "Kendall Jenner criticised over Pepsi advert https://t.co/RIrZn1zevV", "UK services sector beats forecasts buoyed by new work https://t.co/mwXsvEO92c", "Record UK car registrations in March https://t.co/vrspIIfdmC", "Work it out https://t.co/7zdObZYpEa", "Driverless shuttle bus to be tested by public in London https://t.co/f5VhWpEeQN", "Kendall Jenner criticised over Pepsi advert https://t.co/5CBIjht5fN", "Mining stocks still driving FTSE 100 https://t.co/Ih69tgY3Sz", "McCarthy &amp; Stone blames Brexit for tumbling profits https://t.co/OZM4hz7WRO", "Galliford Try abandons Bovis takeover https://t.co/kRWFmroeLo", "Brexit: Theresa May suggests free movement extension https://t.co/Ju8YiyJ18O", "PM hints at help for diesel car owners over 'toxin tax' https://t.co/8qOJLnwod5", "LISTEN: Property Buying Frenzy in the City That Doesn't Exist https://t.co/on3I7NCNZ9", "Trump's trade tactics https://t.co/AJS2BkZHvc", "Degrees of fear https://t.co/GojmCq9ABI", "Bed and breakfast? https://t.co/zDoRTGheXn", "High pay eroding trust in business, says MPs' report https://t.co/ZJe3epi6IY", "Ghetto city https://t.co/YHwhD23ngl", "LISTEN: Wall Street Update https://t.co/r0qXj7t5vj via @BBCWorldBiz", "Donald Trump tells banks he will give laws a 'haircut' https://t.co/qIfYrc4kPC", "Who invented the internet? @BBCRoryCJ explains the difference between the web and internet to @bbcaaron https://t.co/z8SWphKwkH", "Tesla passes General Motors as most valuable US carmaker https://t.co/08mLgNG7nH", "LISTEN: UK Considers Leaving EU With No Deal https://t.co/N7nzxdh4qD via @BBCWorldBiz", "Sir Berners-Lee: Did web giant invent the internet? https://t.co/wSeM3C5Grg", "RBS plan faces European Commission investigation https://t.co/UW9ybFJlzv", "Spotify signs long-term deal with Universal https://t.co/lObWUe09NH", "Toshiba forced to buy 40% of UK's NuGen https://t.co/BRNoU5WkmC", "Ralph Lauren to close flagship Polo store in cost-cutting plan https://t.co/00boGdJvdU", "Cost of junk https://t.co/vFuhiMXJ5K", "Pink Star diamond sets new world record https://t.co/QhxgdaYC7a", "Bank still worried about personal lending https://t.co/WoAcStpqRR", "Spanish raids seize Assad uncle's assets in corruption inquiry https://t.co/amCrWBN8Hl", "Fibre broadband advertising to be investigated https://t.co/ilMZOI65NX", "Fashion for gluten- and dairy-free continues to grow https://t.co/t0MKdXPdg1", "Overwatch 'cheat-maker' told to pay $8.6m to Blizzard https://t.co/Iij0WHjQM2", "Warren Buffett appears on Cherry Coke cans in China https://t.co/ZSm7wMvIiG", "Amazon enters office supplies market https://t.co/RoXlSpNuG9", "RT @matthew_wall: How electric ferries are cleaning up in Norway.\nhttps://t.co/plRZNQF1KB", "FTSE held back by new falls in South Africa-linked stocks https://t.co/JDFuzt0Z1a", "Online retailer Asos sees exports boosted by weak pound https://t.co/AXOvw42rmR", "Oath is new name for AOL-Yahoo combined company https://t.co/wwGCoeysc2", "US withdraws funding for United Nations Population Fund https://t.co/GZsrnkr5tR", "LISTEN: International Mine Awareness Day https://t.co/Fqn5mh6y82", "Teslas of the fjords? https://t.co/dERz4AE8zP", "LISTEN: Wall Street Update https://t.co/u6c4pMuuBR via @BBCWorldBiz", "Tesla's market value overtakes Ford https://t.co/dqTvoo5in9", "Could Brexit cause holiday apocalypse? https://t.co/jc9Sf402yA", "Bombardier defers executive salary rises amid outcry https://t.co/4f6OFbk8LW", "LISTEN: China to Build Giant New City https://t.co/dmaBgVDqMU via @BBCWorldBiz", "Clampdown on catch-up energy bills https://t.co/o4O7VM30si", "Aslef members reject Southern deal https://t.co/xdoZTeQHHo", "Wildlife travel agent drops zoo trips https://t.co/v4AsiPoPM6", "South Africa rand sinks further amid concern about credit downgrade https://t.co/rhrD7PldVP", "Xiongan district becomes hot property in China https://t.co/9gCnX0nzu6", "Eurozone unemployment rate drops to near eight-year low https://t.co/wR7t1p1Z0w", "ITV shares dip as FTSE 100 opens flat https://t.co/MI1byPIWnz", "More than 20 million Britons 'physically inactive' https://t.co/7Oy5V88s8F", "China's young locked out of Beijing's property market https://t.co/aMxRrlUNjT", "CEO Secrets: Magnum Photos boss says learn from the next generation https://t.co/W2YuS7rXmO", "BP sells Forties North Sea pipeline to Ineos https://t.co/v36HrfkajU", "Imagination Technologies' shares plunge after Apple ends contract https://t.co/4YnhIUHqZ1", "Meet the 'Grammar Vigilante' of Bristol https://t.co/f8PHp6aQx3", "Reckitt Benckiser confirms review of food business https://t.co/n6sSBSJyC1", "Credit card firms told to do more to help millions in debt https://t.co/5LxbKWQbaZ", "Tesla reports record car deliveries https://t.co/MnQ3JnZCCE", "Tick tock https://t.co/OSciD5sg8U", "Swipe right https://t.co/izxcCNLafc", "Lloyds Bank to shrink hundreds of branches in size https://t.co/ZTz4LQyn8I", "Sir Philip 'favoured' Arcadia pension schemes over BHS https://t.co/thTAKlLvt3", "Ikutaro Kakehashi: Roland founder and music pioneer dies aged 87 https://t.co/OZcu6TJcqy", "US tech firm Xilinx to invest in Edinburgh research base https://t.co/5yz4UrJX6o", "Greens on three-day weekend plans: 'Bold ideas needed' for UK https://t.co/4BsOcuAUXU", "RT @shanaz17: A little tale of tea, taxes and smuggling to enjoy with your Sunday morning cuppa https://t.co/beLdyJuQR8", "Chancellor Hammond leading UK trade mission to India https://t.co/xgki4VY9Hj", "Ford recalls 52,000 F-250 pick-up trucks over park fault https://t.co/6YDn7XPm7Z", "Sports Direct increases Debenhams stake to 16% https://t.co/Xwul9TW9LN", "Black market https://t.co/bIaKAfNT8m", "RT @matthew_wall: \"Urgent payment request\" But is it really your boss asking you to make it? https://t.co/pxsab6Htqi", "LISTEN: Credit Suisse Offices Raided https://t.co/RSimrFzQSr", "Is this the smallest pub in the UK? https://t.co/5lkK0BCXta", "15 changes to your finances in April https://t.co/OCDLqFJJbD", "LISTEN: Wall Street Update https://t.co/Qe6VLVg4Xg via @BBCWorldBiz", "Cash in the pocket https://t.co/kXTOnlyCrR", "Two million workers receive 4% pay rise https://t.co/prc7b9L9Km", "Central banks 'must communicate better to regain trust' https://t.co/EQuUh9s4Kw", "Trump trade crackdown 'not about China' https://t.co/N3iy0RgHmm", "LISTEN: South Africa's Zuma sacks Gordhan https://t.co/ejKoiT0bJ0 via @BBCWorldBiz", "BMW workers vote to strike over pensions https://t.co/6fC8gSAXd2", "Reckitt Benckiser slashes boss's pay by 40% https://t.co/lxiAfbRtMH", "Google reveals latest UK tax bill https://t.co/vITHvpGQZQ", "Retirement villages face crackdown on 'unfair' fees https://t.co/gRzafTnwMY", "Pemba oil and gas - boom or bust? https://t.co/QnMX3hkkMS", "Butlins boss on Brexit concerns https://t.co/UdwgDhMmiI", "Eurozone inflation slows in March https://t.co/OAnkEZK5xI", "Households run down savings to record low, says ONS https://t.co/UwVpgJdPcx", "Crayola is ditching dandelion yellow from its range and replacing it with a new one https://t.co/mCXkotl5E1", "Ofcom moves to cut superfast broadband prices https://t.co/ARpEbUjDXC", "Apple wins Australia ruling to retain Apple Pay dominance https://t.co/HJtx6Uk7ds", "Dutch raids target 'tax evaders' in Europe and Australia https://t.co/RIqygyFuCN", "The robot hand that shadows your movements https://t.co/dl2kqVhxtl", "FTSE 100 slides as Old Mutual shares hit https://t.co/voLkpgd5Xe", "First concrete poured at Hinkley C nuclear power plant https://t.co/G8OwvxKWUC", "House price growth slowed in March, Nationwide says https://t.co/z3KpGhqnck", "The man helping people with autism get jobs https://t.co/fNB8BjBCRJ", "Success for SpaceX 're-usable rocket' https://t.co/FBLR4M6mFH", "LISTEN: Russia \"hijacked\" US Election https://t.co/citKbF87gy", "Five banks are merging to create an Indian super-bank https://t.co/lP7GhMwyN1", "Bogus boss scam https://t.co/AzUk03LMut", "GSK's Emma Walmsley steps into Andrew Witty's shoes https://t.co/37d1OQo5Nc", "LISTEN: Wall Street Update https://t.co/wU2La0m9EG via @BBCWorldBiz", "South Africa's President Zuma 'sacks' finance minister https://t.co/X4aT3W42nY", "Trump's Keystone XL pipeline plan faces legal challenge https://t.co/YzeuMUR1ah", "HSBC extends transgender titles including M and Misc https://t.co/isurilcnmS", "#ICYMI: The dark history of Chinatowns all over the world: https://t.co/PjQBOzWI8j #bbcfoodchain #meetthefoodchain https://t.co/xYO9llivjY", "H&amp;M to launch new 'more upmarket' fashion brand in London https://t.co/e10pCFyLGw", "New John Lewis boss says department store needs reinventing https://t.co/xrvXmCKdPn", "US fourth-quarter growth rate revised up https://t.co/EP24h4RHdU", "Pee Wee Pumps: High heels for babies spark outrage https://t.co/JiuhA48Qkq", "LISTEN: Historic Article 50 Letter Delivered https://t.co/Kt9pAtJm66 via @BBCWorldBiz", "Coffee cup fee could cut use by 300 million, study suggests https://t.co/PdxhahVVYw", "RT @WillSmale1: The wine detective battling counterfeiters https://t.co/F8UPAo3VpN https://t.co/EbFOGonhyD", "FTSE 100 rises as Morrisons boosted by upgrade https://t.co/VjHXTCCoyb", "Oscars will still use accountant firm PwC despite envelopegate blunder https://t.co/4EgsCbAnb8", "Toshiba shareholders angry as chip unit sale approved https://t.co/ZX69P8ws6j", "Lloyd's of London sees limited impact from Brussels move https://t.co/1U1nU38e9w", "Insurer Lloyd's of London confirms new Brussels base https://t.co/w0V3qz8b5a", "LISTEN: UK Begins Brexit Process https://t.co/oyOXVir7Mo", "Wine detective https://t.co/CFQuyjwaHI", "LISTEN: Wall Street Update https://t.co/RYKmFYxj7C via @BBCWorldBiz", "US shares stable ahead of Fed speeches https://t.co/3aelu8krqK", "Insurer Lloyd's of London 'to open Brussels office', say reports https://t.co/JGVH176zcj", "Vauxhall drops FA home nations football sponsorship deals https://t.co/JKDmN9DL8H", "Samsung Galaxy S8 and S8+: First look https://t.co/LRfRGzamTw", "Samsung Galaxy S8 hides home button and gains Bixby AI https://t.co/f849h5jVHB", "RT @bbckamal: PM @theresa_may has explicitly linked economic deal and security. How will the EU27 respond? #Brexit", "RT @bbckamal: Pound up slightly against Euro, 1.5c #Brexit", "RT @BBCSimonJack: Clear message in PM's A50 letter seems to be WTO rules is not OK and implementation/transitional agreement very important.", "Topshop loses managing director to The White Company https://t.co/8BehyWDCpN", "Jared Kushner's family firm ends investment talks with China's Anbang https://t.co/NXQ7AZEjEg", "Pensioners' life expectancy falls back https://t.co/KVKZkUmREt", "How will the Port of Dover cope with Brexit? https://t.co/PtDqPKAUYD", "UK-German stock exchange deal blocked https://t.co/V7RX34EZwd", "FTSE 100 rises as Brexit looms https://t.co/T3u8ojTTbu", "Reality check: Your Brexit questions answered https://t.co/YkeRn7CZs8", "What are the key issues for Brexit talks? https://t.co/pFW5tkwT4R", "Toshiba's Westinghouse 'files for US bankruptcy' https://t.co/Oxqf7246Fe", "Police investigating 'human waste in Coca Cola cans' https://t.co/mE4XKtDmJt"]}