{"dethink2survive": [".@clodogg and I are doing a nu-rave half hour DJ set at a friend's wedding tonight. Quite pleased with our DJ name: Guest-icicles", "@allan_howe I do like it as a kit, though it makes us look like the bad guys", "The Mercury shortlist is a bit 'your boyfriend', isn't it?", "RT @Cheapshirt: This is a petition for A4 bread \n\npls rt", "RT @RealBobMortimer: PANTS! https://t.co/22B7yIURco", "RT @keef1985_: The big fella https://t.co/vupPPhJSUS", "They wanted Ronaldo. They got Ronald. https://t.co/HKMYYidyGa", "@katiesol New dungers! Did you like it?", "\"It's so sunny, let's go for a picnic\" \"oh\" https://t.co/MvOuFkSn2x", "RT @Jenny_Trout: My daughter watching the #DoctorWho announcement. #doctor13 #DoctorWho13 https://t.co/eX0w1rW4E9", "@merlinjobst @JackMerlin I'll have it if Jack doesn't want it as a wedding present", "*spends all Saturday doing gardening and DIY*\n\n*record scratch, freeze frame*  \"So, you're probably wondering how I ended up here...\"", "@katiesol @harrietgibsone Crowd were OK for me - great for last 30 mins. Apart from one guy shouting 'you're just a shit John Legend'(??)", "They're printing Frank t shirts as you order them https://t.co/jzKwYHlGzu", "*FINALLY GET TO SEE FRANK OCEAN TONIGHT KLAXON*", "@SteveJonesPA 'I'm ready for your love'", "RT @PrayForPatrick: new burial is great tbh https://t.co/V0Q2hxGNaI", "@katiesol All of these threads has just made me remember this 'campaign'. It still makes me cringe https://t.co/ZlJ91o35Tz", "I went to watch Arcade Fire at York Hall last week. Here's a boxing analogy filled review for @LondonInStereo https://t.co/qNxYv4Lyz6", "McDonald's, but in East London, me cooking everything and everything XXL https://t.co/ZwJRJRnjNJ", "Lots of summery, Friday vibes on the new Cut Copy song https://t.co/7SDr50EDnS", "RT @jntod: WHERE IS THE OXFORD COMMA AFTER ANGRIEST https://t.co/oKFLkz28h4", "RT @joelgolby: siri, show me the worst sentence https://t.co/1WnXzUnd7K", "If you're hungry and Passionate Poultry is fully booked https://t.co/1qg1K68NRE", "The BBC coverage of Wimbledon is feeling very 'millennials' https://t.co/CzTddH7Vrz", "Arcade Fire being Arcade Fire AF in a boxing ring https://t.co/dAXGOveIhe", "@MattLangham Gannbatte! (That's one of the only words I know)", "RT @cookywook: Somebody OUGHTA GO BACK AND READ THE FIRST WORD OF MY TWEETS FOR THE LAST WEEK.", "hello it's me (the worst person in the world) https://t.co/6CXfDK31Rc", "Tastes a bit stale, flat and past its sell by date, tbh https://t.co/Mwm2iG5yFB", "True story https://t.co/unaL92xcKQ", "@McCormickDaniel Didn't think we'd reach Peak Dan Mac quite so soon", "New song is as weird, wonderful and brilliant as usual too https://t.co/09QBEbc580", "The cover for the new Liars album is really something https://t.co/BkX0U9kVe8", "My morning has been spent with this beauty https://t.co/KND14nmJRw", "@LondonInStereo There's also the ace Mura Masa on the cover for issue 50. 50! A massive well done to @JessPartridge for that milestone.", "I had a Waxa-chat-chee with Katie Crutchfield for the brand new issue of @LondonInStereo https://t.co/ZlyBoo5CId https://t.co/OvJs1oZSYU", "Crappuccino https://t.co/WtjMkNfFk6", "RT @HannahMGeorge: You know when you read a news article and think 'fuck me that would make a great film' https://t.co/Ln8XmhEDLU", "@mochacker It sure is! The new songs sounded so good.", "RT @immolations: if anybody wants a sneak peak of tomorrow's hot takes https://t.co/hAOT9qocoy", "Got to see my favourite band play the Pyramid stage so, yeah, I had a pretty good Glastonbury https://t.co/8Z8xawqRQ7", "Very happy about this https://t.co/2eN6Fn0oC9", "RT @mrdiscopop: Stormzy's verse on the Artists for Grenfell single is so moving. https://t.co/2oZHmVGCZb", "Love these Alex Norris 'Oh no' comics https://t.co/I5T6n9xYJW https://t.co/vFT274Vjk0", "@McCormickDaniel Get a Simba one mate", "Understanding today's youth https://t.co/B3Q8NHzxgL", "@fooishbar Haha, I will let you off today because I am sweating out of my eyelids.", "RT @HistoricalPics: He truly was a man ahead of his time. https://t.co/WO9cpsjhyg", "https://t.co/BeQWUD8S55", "RT @krystalbepsi: This twitter UI update is great https://t.co/KOhzzRNTpl", "@EngancheMaxey Meeting in mediacity for the day job - then back to Liverpool for the weekend", "Enjoying Shaun Ryder doing the announcements on Manchester trams https://t.co/YOMZ5jm5jn", "This comeback album has a strange cover https://t.co/5VSQbqZwM9", "Spent my Saturday in the sunshine at the fairground getting sunburnt and reviewing Gorillaz' #DemonDayz https://t.co/hV8NW2ER8j", "Labour surprised everyone and now Frank Ocean has actually played live. It's a Friday for miracles. https://t.co/7phihExGBa?", "https://t.co/RK12BnXrWO", "RT @KieranHarris7: If Theresa May was a meal deal https://t.co/Hdfk0YHYI1", "RT @britainelects: Holy shit.", "You never really hear the term 'proud Tory' do you?", "Just saw a 'Cock Piss Tories' sign in Stoke Newington. #election", "I'm glad that Virgin Media have given me the very specific timeframe of 'between 7am and 9pm' when they'll be calling round today.", "Geri Halliwell doesn't look too good https://t.co/ShdTbTDjai", "RT @joeheenan: Mike Oldfield's difficult second album https://t.co/PLOY4GxeFl", "Another Primavera done and done. Highlights: Grace Jones, Skepta, Sampha, FlyLo and Teenage Fanclub.", "Finally made it to the amazing Bowie exhibition. Wore a Prince t-shirt by accident. https://t.co/K4EBqwLobc", "RT @mermatriarch: A BIG MUSHROOM DOESN'T COUNT AS A BURGER https://t.co/UwduElBxPK", "NEW @LondonInStereo with the ace Young M.A on the cover. And I reviewed the seriously good Chastity Belt album https://t.co/GOte3ewXL5", "Covfefe and TV", "@deeneys Ah thank you! I'm a big fan of yours too :)", "Katy Perry into The National is the dream https://t.co/NzqzbiEtIl", "A final shout for my piece on 10 years of All My Friends (and me getting old) https://t.co/EPvpE1IZ8q", "RT @skynewsniall: Bold strategy https://t.co/f3M8HUBtep", "@AndrewAHannah Very Day Today that but wasn't it?", "Very strange line of questioning from Paxman - doesn't seem to understand how a party comes to decide on policies.", "Weird how Hallmark's IttyBittys share the same social and economic outlook as Tories https://t.co/fhBdoVXam2", "Big fan of Skepta's 'stopping the fuckery' manifesto https://t.co/P8cMJm5epq", "@Leftofthedial15 Thanks! can't believe how much I still listen to this song", "@LondonInStereo tbf if I'd included a Stewart Lee reference in this, it would have been the most on-brand piece I've ever written.", "@_rachelgrace Well, I do like the national. Just thought as it seemed so likely he'd pull out they'd have a better contingency plan.", "RT @JamesLUFC: The best article ever written. https://t.co/D27PUDiZ9w", "Just paying Jamie XX to stay and play another day doesn't seem a very inspired replacement for Frank.", "This wedding band have just gone from Moves Like Jagger into Place Your Hands like it's nothing", "Draw me like one of your... https://t.co/I4hqRza0px", "beautifulweathertodaybeautifulweathertodaybeautifulweathertodaybeautifulweathertodaybeautifulweathertodaybeautifulweathertodaybeautifulweath", "RT @pipterino: loving the new Belle and Sebastian album cover https://t.co/8Qy0MPxk0c", "RT @saladinahmed: when you start to feel OK for a minute then remember that we're all fucked https://t.co/z6UeOOCEZZ", "@michelle_amaria @kevinmorby @MarvelousCrane Did you press the 'Look up' option?", "Current mood: #lufc https://t.co/WmiWZUhypc", "Yes, it's a beautiful day today. No, it's still not OK to wear flip flops to work.", "RT @Thumbsuk: Still one of my favourite Twitter moments. RIP Roger Moore. https://t.co/BBS6vOyvDQ", "RT @wtvrkatelyn: How amazing is social media https://t.co/7IoycnAjGZ", "RT @laurenduca: Got this from a 23-year-old Manchester resident. Take a moment to read it? https://t.co/Xviju8rYzG", "10 years to the day since I first heard this song https://t.co/rfNV1J8ccR", "RT @johnb78: https://t.co/ISBYosLEqF", "My highlights of a brief trip to Great Escape: Julie Byrne, Pavo Pavo, John Grant(!) &amp;, most of all, Sampa The Great who was really... great", "I can confirm. https://t.co/KbLuOawaYi", "This Friday afternoon enjoy Shakin Stevens attacking Richard Madeley and getting him in a headlock https://t.co/uaxBGkn4bb", "RT @BATHSmusic: slap me at the popcorn calendar https://t.co/TjjGffFKLR", "@cduncan86 Is that rain or tears on the bus home?", "@annarosekerr Haha, hap-penis birthday. Does that work?", "Avocados: the biggest threat millennials have ever faced https://t.co/xRdKdGQPFE", "@jamiemilton_ I know :(  And no one comes out of it very well.", "This, on how the Strokes, and the New York rock boom, went bust, told by them, is sad &amp; fascinating at the same time https://t.co/nnOfCKuHDT", "@MattLangham Matt, it's Matt.", "Seeing the National 2 days before my birthday. Lovely.", "RT @SteveSnooker: https://t.co/3c8J1RmJK5", "\"Well, the Jerk Hut called, and they're running out of you\" https://t.co/xAb3EHpzSI", "RT @darrenrichman: Get you a man who can do both https://t.co/iTE3Fl4srT", "A new Cornelius song makes a very good start to a Friday morning https://t.co/7ZnIxT9L3O", "Finally, a manifesto I can get behind. https://t.co/PPdn6kBzY7", "A really interesting chat about the record here - lots of guitar solos apparently: https://t.co/ROsZvPqGfe", "@mattpgreeny Playing Manchester in Sept too. They'll be a few songs out before then I reckon.", "@vndrlyl Might try to go to all 4 shows tbf", "@JamesParrish @mrchristr @AndrewAHannah 4 nights at Hammersmith Apollo the week before my birthday. See you all there?", "@AndrewAHannah Definitely - and we all know Alligator is their best album so I'm very excited.", "You'll be extremely surprised to learn that I love the new National song https://t.co/ERHixMb28B", "RT @SarahFoxes: Quick while we don't have a FBI Director, copy all the VHS tapes you have! No one can stop you! https://t.co/zxUvnPWMtW", "Best new music from Gorillaz: https://t.co/boeYFU2iYY", "Can't wait for the new tracks Bernie Sanders is going to drop at Brixton Academy https://t.co/ccxJLayYSO", "RT @TheNational: Sleep Well Beast. https://t.co/3IpxpigJlj", "Two guys off their faces at Westminster. 'Do you know where the Big Dave is?' 'Big Ben?' 'Yeah, that's the one!'", "Just found out that @MichaelCragg went to Rowans with Perfume Genius and my jealousy levels have gone into overdrive.", "I knew LCD and Grizzly Bear wouldn't let me down. https://t.co/S7TvEUn0TN", "RT @pitchfork: Finally! Here's @LCDSoundsystem's new song: https://t.co/WBBUcj35nb", "Falling a little bit more in love with this Aldous Harding song every day https://t.co/JT6IFvy8i5", "RT @ginarush: jesus christ chad https://t.co/gdhLWw0FpM", "RT @jmsclee: Attract the bourgeoisie to a secluded island, then starve them to death and attack them with wild dogs. Ja Rule is a genius.", "Fyre Festival sounds fun. https://t.co/43bs7JJxrM", "RT @davidallengreen: A superb comment on Brexit at my post at https://t.co/Ftvy2Xj1sj https://t.co/8CLjy6trRy", "RT @gosailthesea: rt if you'd call your friend just to tell them that potatoes came to japan in 1600 https://t.co/BkuKmsBUQS", "Really happy that Say You'll Be There-era Spice Girls is influencing '17 fashion shoots https://t.co/lUz6ovFCSq", "EDAMDMA https://t.co/Vxbury4FSD", "Sufjan's voice on this new song  https://t.co/hhs2yC6WQB", "RT @JordanUhl: @realDonaldTrump when everyone at the party is talking politics and you don't know what to say https://t.co/2XcG7fOuwe", "RT @ericallenhatch: Wow... rewatching Lost In Translation, and I have to say it holds up surprisingly well https://t.co/PyEspac286", "@vndrlyl @michelle_amaria She's a charmer", "Highlight of the weekend was definitely when @michelle_amaria greeted me with the warm words \"You have loads of grey hairs coming through.\"", "RT @kendricklamar: https://t.co/yRJKuUM8TH", "I sometimes wonder why everyone is getting in my way and being louder and more annoying than usual. Then I remember I have a hangover.", "Just finished S-Town and, you were right, it's tragically brilliant.", "@vndrlyl I think now you've heard it you should treat the whole office...", "@chris_mandle Andrew Garfield looks like a more attractive Andy Murray there.", "RT @ImogenRW: On a day of general perturbation, I bring you a French bulldog, skateboarding in Clissold Park https://t.co/rLHTcbY1ji", "We're in Helsinki and staying in the most hipster Airbnb in the whole world. #finlads @ Helsinki https://t.co/PBqeF0oI9Z", "@helenmeissner1 It's definitely true - I just didn't think it needed stating in 2017", "@bearcavingamy It's crazy, isn't it? I've never heard of this before", "Huge if true https://t.co/Gd0llnZZPk", "@gemtriesharder Oh yes! I might just spend my whole weekend in saunas.", "@nickw84 Well, I do like pancakes. Thanks!", "@Shaun_The_Tides Thank you - I am definitely going to pay this a visit.", "@flyingnelly I am not sadly :(", "@gemtriesharder That looks awesome - think I might just spend my whole weekend in saunas.", "@sockformation Amazing - thank you. I like the sound of that deli.", "@nickw84 Amazing. I am definitely doing this.", "I am going to Helsinki and Tallinn this weekend. Any recommendations very much appreciated.", "RT @JulieALindsey: So much this I'm dying https://t.co/X5VwxNeYcW", "@GavGavGavin1 The best place in the world. Say hello to it from me!", "Kendrick taking on all the big themes. God, Love and, on the last track, Coronation Street. https://t.co/iME2wAVCkK", "I mean, I don't have a cat but...", "I've just woken up and I've already received the most important email I'll get today. https://t.co/06wCYhAgcx", "RT @GrrlGhost: Memories Of Butter. https://t.co/b5dFGiIAzV", "RT @Sylvestinh0: Yer da's at the football https://t.co/dOc6qOKySe", "I see Harry Styles has been listening to a lot of Aerosmith, 80s stadium rock and, er, Embrace.", "@joeparry @timjboddy Boddy and Parry sounds like a great centre back partnership.", "RT @ira: When the cops come and you only got Coca-Cola in the fridge https://t.co/GWWO67bkMm", "RT @dandouglas: fuck off only Weetabix is allowed to be in landscape https://t.co/yTUGpnqR8A", "On about my 50th listen of Humble this morning https://t.co/lIJv0Tqdah", "@tokyorav Can't stop listening to it.", "@mattpgreeny I will be watching her. But not Ed or the Foo Fighters. If The National and Radiohead Clash I'll be annoyed.", "@MichaelCragg Love the phrase 'monkey tennis thinking'", "@mattpgreeny Are you going for resale?", "@mattpgreeny Yep, was going to let it go but have now changed my mind.", "Go get it. https://t.co/NW4WxcodJn", "My Glastonbury ticket decision just became a lot easier. The National are playing https://t.co/9Luy9XXm8y", "friday night v monday morning https://t.co/dRM1S3QiGK", "RT @MundialMag: It's got the lot, this. https://t.co/r7TvD81CjB", "RT @witchyhellbroth: i am YELLING https://t.co/KyRWx8i4Bo", "Tory escalator https://t.co/OS7r6ELoGM", "RT @EamoV1: The greatest news story of our time https://t.co/x9HLrxjxKb", "Jarvis on Thursday. Damon and Noel last night. Really should get to a Rick Witter &amp; the Dukes show tonight to complete the set.", "Del The Funky Homosapien, Pusha T, Danny Brown, De La Soul, Noel Gallagher and, er, Jean Michel-Jarre.", "Gorillaz - with a million special guests - were incredible last night https://t.co/rO2mPdPsCu", "I spent an evening in Room 29 with Jarvis and Chilly Gonzales for @guardianmusic https://t.co/P8G6MaUaGz", "@joelcrookes haha, amazing", "This is probably my favourite Jens Lekman song ever now https://t.co/zQFg4hpgfg", "A simpler time, when the Levellers had their own 24 hour infoline for all your Levellers-related news https://t.co/ivGDC1AzoM", "The best festival line-up I've seen so far this year. https://t.co/mqNUEdE6op", "Just been looking at the Mother's Day cards and apparently mums like a glass of wine, flowers, and nothing else.", "RT @seanspicer: come on @target -- just realized the two gallons of milk you sold me expire tomorrow", "Apologies for slipping into Lithuanian there. https://t.co/Mw20MVhDnW", "Perfume Genius genius https://t.co/uaIL9VI7WF", "RT @James_Riach: 1996, a simpler time https://t.co/hDpidAVqNX", "This interview with Andre Agassi, my favourite ever tennis player, is great: https://t.co/Pql0YkupOB", "Without permission https://t.co/7Zzgq2QSbp", "@__jordan haha, if it was a disheveled, dead eyed version of me it was almost certainly me", "RT @KieranCanning: Compare and contrast...\nhttps://t.co/fDgZ4XjILO https:/\n\nhttps://t.co/Cr86PJzTuN https://t.co/8dPcqM4gna", "RT @dylanhm: Today in 'Most Leftist Thing of the Day' we have this fabulous little gem. https://t.co/Dur2WpsGr6", "RT @FreshLee_Baked: Not all heroes wear capes https://t.co/4d0zwFhxo9", "What, your shop is only open 24 hrs a day? https://t.co/sPuiGXabfD", "RT @jennpops: Fr. John Misty looking like Jim McDonald... https://t.co/wC8wii9DtI", "Rio carnival was one of the most bizarre and brilliant things I've ever done https://t.co/cZBjMNrifh", "Spoke to one of my favourite frontmen of the last few years - Tim Darcy - about his solo album for @LondonInStereo https://t.co/YuVqJUSIsD", "Moving to Iceland https://t.co/tLtn1upbVk", "RT @dannywatty: Mick, it was just a pun, pal https://t.co/LdhV6r5Duo", "RT @BeardedGenius: Trump supporter feat. Dido https://t.co/ZgfIwvuzDz", "HEALTH are giving away their Disco3 remix album here if you want to do something good with your Sunday morning https://t.co/hnwBkEgf3q", "I just found out that John Bercow's cat is called Order, which is great.", "RT @memeprovider: quality content https://t.co/q1N2H8XQTQ", "Sexx Laws into Bathroom Gurgle is our slickest move so far.", "#limpindie https://t.co/tlxhZebZgX", "@katiesol @Dave_Rowlinson I will be playing Limp Bizkit and the National", "@katiesol @Dave_Rowlinson is a pro at this", "Love this new Desaparecidos track https://t.co/olc6Nac9RP", "Who needs music PR companies?", "There's a guy on the tube wearing a tshirt with a screengrab of his own YouTube music video on it, with 'Check it out!!!' in size 50 font.", "(Via @bestfitmusic) https://t.co/Zw0rywNtUk", "RT @BretHart: Me or @KimKardashian? #whoworeitbetter https://t.co/dwsKxRg0SI", "@Dave_Rowlinson he's right about Snodgrass though", "There has just been deafening drilling AND bagpipes being played outside my office for two hours. My two favourite noises.", "@AndrewAHannah @PhotoSonny @eatingsoho hahaha, I am in the 90% here", "@eatingsoho @PhotoSonny good hashtag, poor opinion guys. Cold sauce on hot food?", "Loyle Carner has opened a cooking school for kids called Chilli Con Carner. Top class punning.", "@DarrenMaskell that's what they want you to think", "TOMATO SAUCE SHOULD NOT BE KEPT IN THE FRIDGE YOU LUNATICS https://t.co/Yz0Gn0WdqI", "This is a new song I like very much from Kane Strang https://t.co/yLP8CaNCfT", "Nick Cave is playing London on my birthday. What a day. https://t.co/eIv1oPzG1M", "@jamiemilton_ @EOTR Yeah - a few acts there I'm hoping it means there are new albums coming. Hello Perfume Genius!", ".@EOTR does it again. Father John Misty. Perfume Genius. Car Seat Headrest. Jens. Lucinda Williams. Girl Band. https://t.co/wmpP0zwJ8P", "This sentence is perfect: 'Dougie Poynter loves reptiles, Tom Fletcher loves space, and they have a shared obsession with poop!'", "Just discovered Dougie and Tom from McFly write these books https://t.co/XysnHYqHmQ", "This site lets you you mash up 2000s hits, so you can basically be Girl Talk https://t.co/XIVl63lFda (via @LondonInStereo)", "RT @chrisapplegate: PARKLIFE https://t.co/g59ysxyv74", "#ImwithNicki https://t.co/1XfzMM7Ct6", "Music journalism seems to have changed quite a bit imho https://t.co/hVtdyWGgRd", "Happy Saturday https://t.co/udYyacdboy", "RT @Brohan_Cruyff: don't think this is supposed to be a joke, so this dude accidentally did the funniest tweet ever https://t.co/Pcy1hBHgTe", "Can't stop laughing at Bridget Christie describing Gove interviewing Trump as like 'Penfold interviewing some jelly' last night.", "@McCormickDaniel Can you sign this copy of your album for me please? https://t.co/jD1jDmppUi", "Big fan of this new Future Islands track https://t.co/8spPNZLTim", "@stejvic I should really have @'d them in that tweet to give them a gentle nudge", "I am seeing Radio Dept at last tonight and my ears will finally hear this live https://t.co/jYZRPCxP6N", "I find I tend to vehemently disagree with people's political views on Facebook if their profile picture is just a motorbike.", "Look at Jens on the front of the new look London In Stereo! https://t.co/Znv6qwINUL", "RT @NYTWA: BREAKING: NYTWA drivers call for one hour work stoppage @ JFK airport today 6 PM to 7 PM to protest #muslimban! #nobannowall", "It's Saturday and I get to see two of the best live bands around -@girl_band and @shit_rock - so that's good, isn't it?", "@Wolf_of_Gwladys @mrwayneg amazing. I'm in", "And I got to call someone in the crowd a 'wag' because, apparently, I'm an 18th century duke.", "Last night's @lambchopisaband show, Prince cover and all, was a delight. My review: https://t.co/TlrsMOMnY2", "So it looks like Calvin Harris and Frank Ocean have made a song together https://t.co/9Jfj9xYldX", "Factory Floor performing a live score to Metropolis at the Science Museum is going to be epic https://t.co/Z8E6HgSnGm", "@joeparry so sad it clashes with EOTR :(", "Really good long read on Wiley's turbulent genius by @danhancox https://t.co/LEp4y4jPFk", "The connection is made https://t.co/O6CGY9DZEU", "@SamCahalin Thanks! Cannot believe this was 20 years ago.", "@jamescoventry Haha, it is a pretty rude title. My auntie refused to buy me a Fatboy Slim album for similar reasons.", "Just bumping this if you want a Saturday morning read. #Beetlebump", "RT @LukeHaines_News: And this is from the man who was A &amp; R for Menswear. https://t.co/XT9zw4uhHf", "@joeparry From tiny acorns/Fred Perry t-shirts... as the saying goes.", "@joeparry I still need to give you that t-shirt you wanted", "Includes Woolworths, The Chart Show, Pavement, Top of the Pops and, as those imply, the realisation of how old I am.", "New Arcade Fire + Mavis Staples is great https://t.co/nlTb4b17KJ", "I'm listening to Grizzly Bear and eating some Flamin' Hot Monster Munch and I couldn't be happier right now to be honest.", "NEW GORILLAZ https://t.co/4LnUv0RbLo", "'You vs. the guy she tells you not to worry about' in a tour announcement https://t.co/zIpMlFSg9N", "Michael-Flatley-set-to-dance-for-Trump-at-inauguration-website-re-direct-of-the-day https://t.co/0mcBXIGzeB", "Saw Daniel Kitson do a work in progress show last night. If you can go, go. Particularly liked his 'Gender is a spectrum' football chant.", "Shockingly, May's announcement is not the most alarming of the day https://t.co/bmOTacuV9K", "RT @JimmyDonofrio: Young Pope you're crazy dude they'll never buy it https://t.co/JzwF0PPhwh", "RT @sebpatrick: Loving Juventus' tribute to one of the classic albums of the early 2000s. https://t.co/SvR6wSY8fD", "That is all my interests in one dream.", "Don't wanna be one of those 'dreams people' but last night I dreamt I played ping pong on a table with a roast dinner on. Gravy everywhere", "Found out The Thrills' So Much For the City album cover was shot here so it's also musically, culturally and historically significant.", "It's ok guys. We are in Dungeness and it is Instagram heaven. https://t.co/82njV36hrY", "@allan_howe @Morts_7 @leedsspares @TheSquareBall ah damnit, I'm away then.", "My gf is taking me away for a surprise weekend. No clues where it is but meeting at the Megabus depot. Twitter, my safety word is 'coconut'.", "@timjboddy Happy birthday Tim Boddy!", "Donald Trump is currently listening to The Hidden Cameras https://t.co/VSwmuRxcUA", "RT @Mnrrnt: \"Not now Gary\"\n\n#TubeStrike https://t.co/M4fdZKw5LM", "@mrchristr I've already booked tickets for Thursday. Hopefully won't be hungover.", "Primavera just got even better - the Bowie exhibition from the V&amp;A starts in Barca a week before the festival https://t.co/JzMBaysSjW", "Tomas Brolin For Soup #FootballerBands", "Watching the 5 years Bowie doc last night just reminded me that a bit of mystery is a very good thing with pop music.", "RT @therealmikedean: I AM MOT A SOCCER REFF U LIMEY FUCK. DO YOUR RESEARCH. https://t.co/P2lSYXKBLU", "@cduncan86 @MarthaDIY @guardianmusic Thank you!", "My review of the brilliant and blistering show from @MarthaDIY last night for @guardianmusic https://t.co/eFoGZwh6Xl", "15Peter20? https://t.co/0BlEpQtHC8", "Jens Lekman and a steel drum and already 2017 seems a million times better than 2016 https://t.co/CNqOGNTM3e", "RT @PigsAndPlans: here's the matrix lobby fight scene but with soulja boy's gun sounds https://t.co/0cIrcQepOP", "The Car Seat Headrest album featuring Dido lyrics always throws me.", "Happy new year from dentists https://t.co/1bQx5gwzPK", "RT @sionytom: Spectator in the hat has only just noticed that christians Fuchs name sounds a bit rude. https://t.co/vsQVo8BW4V", "Wonderful words by @timjonze on the part music plays in our lives, a Smog song &amp; the birth of the lovely Romy  https://t.co/MteYu3UyvM", "RT @shatbeef: paul mcartney's son looks like thom yorke having an allergic reaction to a bee sting https://t.co/YqhwDkIIS4", "Close your eyes (and count to four all) https://t.co/UwakOJN02P", "@tm_spencer Sadly not, though I really wish it was.", "Is everyone having ice cream for breakfast?", "RT @MichaelAHann: The email from George Michael to @shattenstone that ends this piece is amazing. https://t.co/Yq9RyAM4PK", "RT @julianstockton: Couldn't put it better myself. Goodnight George you have been loved. https://t.co/laIX0EhmTb", "Just brought this up at the table and my mum looked up, asked what we were talking about and sighed, 'Ah, the c-word!'", "RT @itsa_talia: what if I told u the night before christmas &amp; the fresh prince theme song have the same cadence https://t.co/Z3QjWqXWHY", "@Dave_Rowlinson just hoping my mum doesn't insult every one of my brother's wife's family today", "One year today https://t.co/cskqjsaWf0", "Never a truer word spoken https://t.co/Qq8ZufU8di", "Merry Christmas. RTJ3 is out! https://t.co/mO2IGKvD6C", "RT @aBobRoss: Your graphic designer: \n\"So what do you want the slogan of your pizza place to be?\nYou: https://t.co/dchodlQAUs", "RT @Jerxme_Tee: You vs the guy she tells you not to worry about https://t.co/IPfSEFYKip", "@AndrewAHannah I know, but still, just don't like reading that sentence.", "Will 2016 stop ruining everything please https://t.co/RnXsL3gQVs", "@Wolf_of_Gwladys haha, I take it you don't agree?", "Don't @ me (please) https://t.co/Pc1FMYKnzg https://t.co/oye4Y0rcOB", "Best thing I've seen today - Sufjan Steven reviews The Revenant (via @timjboddy) https://t.co/hnp49rcBGg", "Can't believe Jonathan Franzen has guest aggregated a Clickhole article https://t.co/BcXQBh7Pi9 https://t.co/JLoCl9jH2K", "It's time to decide on the worst album title of 2016.", "@CreateSpark yeah! I'm excited to hear it.", "Just booked my flights to go to Rio Carnival. Now just need to decide on an outfit. Like for left, RT for right. https://t.co/J6ZcrfASYN", "RT @billyfatzinger: This Bon Iver guy's voice still sounds like a bunch of Christian saxophones.", "The best TV moment of this, and any other, year. https://t.co/vCaOlTvrZ0", "Something 4 the Weekend (S4W) #SFAOK https://t.co/4PgynsRQeS", "@HanrattyDave These are good https://t.co/GcoNQRhDPS", "Spoiler: it's Oasis and the Stone Roses. https://t.co/qix7LRXNld", "I get to hear one of my favourite ever albums in full tonight https://t.co/nVoyPf6Sdp", "Vinyl sales overtake sales of food https://t.co/CnH3KKqth6", "WHY DID NO ONE TELL ME THIS HAD BEEN CANCELLED? https://t.co/iMliPD2e0L", "RT @TechnicallyRon: Time reveal their Person of the Year https://t.co/7G090CpFLW", "RT @MatCro: Is it spelt \"dyed\" or \"died\"? Either way, I'm afraid your cat is a different colour. And not alive.", "New, gorgeous Grandaddy https://t.co/eo30rJKoUZ", "A pretty decent setlist, that https://t.co/kJHMXybjvG", "I wrote nothing for this issue so you're pretty much assured it's the best one of the year.", "It's December so enjoy the @LondonInStereo new music extravaganza bumper issue, featuring the ace Gaika &amp; Cosima https://t.co/IJVoFIF46p", "Off to see The Cure and Twilight Sad tonight. It's going to be a Goth Christmas for me.", "@Dave_Rowlinson The NSPCC says 'No'.", "@oswaldgutenberg I thought we played well. Should have at least scored. Mainly just happy we didn't get embarrassed!", "I have to say, I'm really glad @Dave_Rowlinson's rapping is getting the props it deserves now. https://t.co/jVMdEBBmgC", "@StephanieFlooks Yep, both first weekend of June next year. :(", "@swjharris :( https://t.co/Bk99gZ35wW", "@mrchristr Yep. First weekend of June for both. Rubbish!", "@bearcavingamy I have everything crossed for that. Would be amazing.", "We can definitely shut 2016 down now that we know Kate Bush is a Tory.", "Lovebox and Field Day have smashed it with their headliners. Though Field Day clashing with Primavera is not the one.", "If more than 2 people look at me slightly weirdly on my way to work I'm always convinced I've somehow become a meme.", "All the heroes are slowly dying. https://t.co/FWXTniDdft", "@williamggrant You must be loving the new xx track!", "RT @charltonbrooker: 2016 Wipe increasingly resembling a vertical cliff face with no footholds.", "He is the worst.", "Martin Shkreli is actually live streaming that Wu Tang album https://t.co/ZKMU5XTnDj", "So David Bowie was the only thing holding this whole damn world together all along.", "Seriously, can this year get any worse? https://t.co/NxlztCQ0mD", "The overheard and out of context pig comment I heard made it into Time Out https://t.co/3nO7RIlR7c", "Basically on stage with the gospel choir for 'Ladies and Gentlemen, we are floating in space'. https://t.co/WcVmmk6Swu", "Something I wrote about Elza Soares https://t.co/V4MfdGJ1S9", "So I have a new favourite ever video https://t.co/N7tYUKbz1n", "RT @Travon: Just saw this dude in a diner and I want to be his friend. https://t.co/ZfMiUI8cEy", ".@Dave_Rowlinson We've just played Grandaddy, All Saints, LA Priest, Diana Ross and Kanye. Consistency is key.", "Just no. https://t.co/s6BiiNe3u5", "Remember, remember, it's me and @Dave_Rowlinson playing bonfire bangers at the Old Blue Last tonight. https://t.co/lKB94qHbI9", "RT @DaftLimmy: I work well in a team but also own my initiative. I like cycling, camping and socialising. https://t.co/hnhHnTOjF4", "@JackMerlin @BuzzFeedNews This guy", "RT @craysounds_: HAHAHAHAH \nU MEAN LIKE REGULAR FUCKING HEADPHONES https://t.co/8wMIfYW9ZY", "@michelle_amaria @vndrlyl Hahahahahaha. No way.", "@SimoneSkilbeck If only. Denim dickie bow.", "@vndrlyl Exactly. Thought it looked OK, then realised I'd made a terrible mistake.", "I should add: not a denim cap. And three different colour denim, if that makes it any better.", "Somehow worn triple denim to work today. https://t.co/S94CAkCuyX", "White men don't win enough awards, that's what I've always said. #Bono", "RT @AndrewAHannah: we are all Bono. #weareallBono", "RT @imchriskelly: Hillary's emails would literally have to say this for it to be a close call. https://t.co/i46k3XeArh", "Really enjoyed Simple Things, especially Charlotte Church singing 'Hometown Unicorn'. My review: https://t.co/wmw99hpX7i", "RT @AmznMovieRevws: Oasis: Supersonic. #Brexit https://t.co/F86P6Z1Q4A", "RT @HistoryToLearn: A divorcing couple in 1999 splitting up their Beanie Babies on the floor of the courtroom https://t.co/GJwEj2d0tg", "Are the eyes of the cat in today's Google doodle supposed to look like the Wu-Tang sign? https://t.co/67qw3NMfx3", "The new @LondonInStereo only has The RADIO DEPT. on the cover! And loads of other wonderful things. Go read: https://t.co/155KPm5vJm", "If you're going to be a troll, you might as well be in it 100% https://t.co/bay6D08cQ6", "@TimeOutLondon \"I'm following a pig on Instagram.\" #wordonthestreet", "Traams are on fire at the moment https://t.co/bpjuFtcjGj", "The @LondonInStereo track of the week by Off Bloom is a belter. https://t.co/YMOaPd02r3", "Love this article about Trump appearing on Saint &amp; Greavsie 25 years ago to do the Rumbelows Cup 5th-round draw https://t.co/86aiVAdpGP", "A lovely new Shins song https://t.co/kg0yfpqHXx", "@williamggrant https://t.co/0pKLnm2SRp", "RT @enhughesiasm: DRESS UP as \"Brexit\" this Halloween by abandoning all your friends and then shouting at them to keep buying you drinks.", "RT @DisOrientFC: DisOrient are A-League champs once more after drawing 2-2 with Alyth. A first title for @dethink2survive as captain", "RT @jayckb: It's nice to see someone not on their phone for once https://t.co/g6u0wm8zcw", "Yes to this debut Allison Crutchfield single https://t.co/CAZcyGM6Fr", "NEW RUN THE JEWELS https://t.co/WG61o1f9xO", "Pitch for Black Mirror: I'm writing the show but am actually within a show writing about the show, within a show about a dystopian future.", "RT @ch000ch: me: (wakes up from a coma) what year is it\n\nnurse: tbh u should go back to your coma", "RT @rihanna: The Sun Newspaper is like a fuckin ass hair, full of shit!!!!!!", "RT @Unnamedinsider: Prince Harry shows support for 'rapidly shrinking' Mick HucknalI https://t.co/aJEL6SZoQo", "Japandroids tonight. This song still bursts with all the things that make them great: https://t.co/AmiOEQxobP", "Lyrical highlight: calling Trump 'a Fascist bottom-feeder'.", "A Le Tigre pro-Hillary Clinton song is here https://t.co/pn1g4GvrIu", "RT @feelwelcome: Theresa May Face Generator (Tap to stop) https://t.co/fwDMZVovgl", "Amazing https://t.co/YefG4EeV5Z", "A bit obsessed with these new Traams songs https://t.co/cEVChnUEp2", "Finished Hypernormalisation. Parts of it were fascinating but I found the general hypothesis a bit of a rehash. https://t.co/BZnQWGELoC", "@MichaelCragg @chris_mandle Happy birthday!", "Very happy that Bowie's When I Met You is so good (51 mins in here) https://t.co/TS1GTicToh", "Brexit has been simulated in Football Manager 2017 https://t.co/JuSuYVfOn5", "'Anti-Trump songs' is becoming a genre now, isn't it? Here's a good one from El Vy anyway https://t.co/rsXesTi6ez", "Finally, a programme ready to tackle the big issues that we face today https://t.co/4iS0UG6E93", "@gemtriesharder ok, there are some exceptions", "#brexit https://t.co/H4aUmUMmYY", "If I could go back in time and destroy one thing it would be auto-tune.", "Which is this by the way: https://t.co/PUeYqd5mhi", "#theinfinitemix exhibition was one of the best things I've been to in a long time, especially the John Giorno poem https://t.co/5f9KPyuevF", "RT @GeorgeTakei: If you ever wonder why sexual assault victims don't come forward, just look what's happening now to those who do.", "This Radio Dept. album is a lovely thing you should listen to: https://t.co/za1FamX2Po", "#Brexit https://t.co/KtsArlJPB8", "@LucieGraces All my fingers and toes are crossed", "Going in on this Sufjan vs Drake mash up album, Six Swans: https://t.co/0ChkU4ikO3", "Listening to Black on Both Sides and getting very excited about Friday's show https://t.co/jzIpRF6rqf", "Heartwarming story of the day: Boy opens message in bottle but finds note from men 'out our nuts on cocaine' https://t.co/ub3z9Gv13T", "@williamggrant I thought I had the deciding vote?", "So the three best albums of the year are Beyonce, Frank Ocean and Danny Brown, right?", "RT @tristandross: we are living through time trumpet https://t.co/IP7EpuqPpC", "RT @__jordan: best bullet pointed list i've ever seen. congrats to all involved https://t.co/MMkbYJnMSL", "@ryanjohnbutcher Thank you - all luck and a new iPhone. The licking makes it.", "Josh Widdicombe's head has been surgically attached to Stephen Merchant's arm for the new Crystal Maze https://t.co/EoLktlKeHJ", "The most fun I've had at a show all year. Mykki Blanco https://t.co/vZmtepDPJD", "New Radio Dept. track sounds a bit like the Pet Shop Boys and is amazing https://t.co/n1r2bQYrMI", "Well, @Dave_Rowlinson's out of office message is bang on brand. https://t.co/nagPbisAAH", "The crescendo of this song from Moses Sumney is amazing https://t.co/3IPLbGVwuG", "RT @michaelgove: Mrs Brown's Boys #puregenius", "You should get your eyeballs on the new London In Stereo. https://t.co/19WkfV1a5G", "I reviewed the Hamilton Leithauser + Rostam album for @diymagazine. In short, I liked it. https://t.co/6YuhPeH6za", "Current mood https://t.co/EvP5gNQhqh", "This is right up my street: Mclusky/Future of the Left lyrics as brand slogans https://t.co/BUsXlq6Ls3 https://t.co/op2q3L5f5W", "Vole Edmonds https://t.co/mPSF8OboSq", "Spiritualized are performing Ladies and Gentlemen We Are Floating in Space at the Barbican. Hold me. https://t.co/xXUZsOwikf", "Hello! On my birthday too. https://t.co/ggJwlRGp7w", "Thanks to @GoldFlakePaint for introducing me to this Hello Shark album. On my fourth listen today. https://t.co/9Jn82EdIAv", "#3AlbumsThatChangedMyLife https://t.co/7iJuj2W9GP", "@ginandconnick they're real friends, I promise", "'Stillness Is the Move' is still pretty much perfect https://t.co/IB7pvLaI4B", "Very into this new Dirty Projectors track https://t.co/Mu9lCnMc5Y", "I've just eaten a mince pie. My body is very confused about what month it is.", "@katiesol I've been thinking this recently.", "Joey was charming, open &amp; excited about the new record, so it was sad to hear he'd checked into rehab a week after we spoke.", "Had the honour of speaking to the @PIXIES for @diymagazine - one of the most important bands I've ever heard. https://t.co/01GcMzD1rY", "IMPORTANT NEWS https://t.co/0M5VXgN1nb", "RT @clolilo: #brangelina https://t.co/ANCu2z69O6", "@Gemolo_Gemma Yes thank you! I nabbed one. Did you?", "@gdpreston I can't wait. Never seen her live before somehow.", "@BenSTravis Thanks! I've nabbed myself one. Can't wait.", "@gdpreston Thanks - think I'm sorted now", "Unlikely as it is, if anyone has a spare ticket(s) for Bjork tomorrow at the Royal Albert Hall, I'm desperate to go &amp; will buy them from you", "A stranger just stopped me outside Tesco to show me a new five pound note. I've never seen a happier, more excited man.", "@JessPartridge @Dave_Rowlinson I wondered why every song sounded like Ned's Atomic Dustbin", "@katiesol One of the major benefits of having a large head is VR headsets I think", "The Bjork Digital exhibition was genuinely, jaw-droppingly brilliant. Immersive, inventive and disorienting. https://t.co/wEvh6hqQXa", "A reminder that, although I love Damon, he doesn't half talk crap sometimes https://t.co/tv6I6xBHLZ", "My favourite bit of the Limmy show was the whole crowd screaming 'Kill Jester' for about 5 minutes.", "I can never unsee this https://t.co/c6d80eMJ7g", "On a day when it's 25 degrees in the middle of September I feel like Anohni's album about climate change should win the Mercury", "@tweetstanwilson haha, it was indeed me. Where were you sitting?", "RT @shit_rock: New Christian Fitness album released now https://t.co/yuOoJRgxXB 'it's great' me,'buy it' me again, 'what's that?' a squirrel", "THIS MUST STOP NOW https://t.co/DGXG9BDoPm", "RT @RR_Robbie: You vs the guy she told you not to worry about https://t.co/aRsqtFPE7o", "German court deems Berghain 'cultural' space along with theatres and museums (vs closing Fabric) https://t.co/qao3tcTLXJ", "Breaking: David Cameron to be new lead singer of Whitney.", "RT @joelgolby: no better headline/lead image combo happening today, give up https://t.co/jeTZ2rhHDe", "Stewart Lee: \"the fully formed satires fall out of the satire engine &amp; thunk down on to the content conveyor belt\" https://t.co/VWE6lmL3j3", "Low doing a Christmas show at Union Chapel will be pretty damn special.", "RT @mindykaling: \"feat. Sean Paul\" are my three favorite words in the English language", "@_rachelgrace ah! Didn't realise that. Hope you enjoy the terrible photo of me to ease your hangover", "I was there https://t.co/LlSjyEwO6p", "RT @keewa: Capitalism is just incredible https://t.co/1hbTbCXijN", "Union Jack playing 'only British music' and 'supporting new British talent' like Biffy Clyro and Richard Ashcroft https://t.co/bjsbBNnCNa", "@harrietgibsone That's exactly what I felt like when I talked to her.", "This song https://t.co/b3uQFc5gAe", "Well, I don't think I could watch that film again but it was tender, funny and emotionally shattering. The music sounded brilliant too.", "@AndrewAHannah #nailedit", "@AndrewAHannah It's got to be Alligator for me.", "@strawlou Don't worry, there will be too many tears to tweet.", "Staying true to my personal brand today and listening to every National album in reverse chronological order.", "@LukeTurnerEsq Maybe they blow up all these locations once they've tracked them down?", "It's the Nick Cave documentary tonight. Not sure I'm going to be able to cope.", "Want to buy all of this David Shrigley stationery https://t.co/CxNVDwXT6u https://t.co/jXBxpSWFPe", "@williamggrant I LOLed at this this morning.", "Was this the real reason Fabric was shut down? 'Operation Lenor' and a cash-strapped council and police https://t.co/PymYtyxJWP", "@katelloud Is Tea-totalers a pun or a typo?", "RT @driscolltheque: Biography of Tim Westwood reads a little bit like it was written by Tim Westwood. https://t.co/pEPPwCLWgS", "Whoever came up with the name 'Bjork Scratchings' for a club night deserves some kind of award/biscuit.", "@whattheel On your birthday too! (Happy birthday!!)", "The big issue that really counts in 2016 https://t.co/z9ttTH57hC", "Got to hear one of my favourite songs of all time live for the first time last night, so that was nice https://t.co/ZHrZmK1wnO", "Just catching up on my emails... 3 nights of this? https://t.co/IQX83LsWfJ", "Sparky's Dream into Everything Flows into The Concept. Teenage Fanclub were awesome last night. https://t.co/9KN1auADL8", "Time to dust this one off and use it again https://t.co/lrEyE1nKYd", "It's nearly time for End of the Road! https://t.co/2wmhuPkHXS", "#Regrets https://t.co/uLWwVfNlL3", "@derekrocks it is not, sadly", "Who wants to hear All My Friends as a lullaby? https://t.co/ovMc5XAD8V", "Amazing new HEALTH song right here https://t.co/XkkBsyiAuO", "RT @amoozbouche: How To Talk To A Woman At An Owl Sanctuary https://t.co/yainRLamFz", "Listening to Sufjan this morning. https://t.co/itZPK0GRjA", "Job interviewer: Where do you see yourself in 5 years?\nMe: https://t.co/jz0MlEEls4", "@sophiepenrose You made it! That's such a good photo.", "NEW @LondonInStereo! Stunning shots of Mykki Blanco &amp; I chatted to the amazing Jenny Hval https://t.co/C6SfBgf14b https://t.co/Pt49UVkKai", "OH GOD (or lack of God) https://t.co/EMX77IsXhR", "@mrchristr I have not. Might have to check that out next.", "About 30 listens in to Blonde now and have fallen hard for it. Definitely one of those 'repeated listen' albums.", "Just watched Finding Vivian Maier - what a brilliantly fascinating story.", "This new one from Angel Olsen is a sublime piece of dusky beauty https://t.co/MzFdmWO365", "Has anyone written a think piece on the JME/spoons battle yet?", "How 'The Millennial Whoop' sound is showing up in every popular song. You'll never unhear it after this https://t.co/QkPtB019b6", "@sophiepenrose It's near Piccadilly, just a small exhibition. Really good though: https://t.co/Ta3cXN1b43", "RT @cursedimages: cursed image 321 https://t.co/BlJcf98Cqo", "Love this picture of Bowie https://t.co/imv5qFWkgy", "RT @ltsChuckBass: Everyone: \"I don't want summer to end\" \n\nMe: https://t.co/3Ej2NQN1es", "Last night I slept walked into a wardrobe. How's your bank holiday weekend going?", "@oxfamgb love them - they're all great designs!", "RT @jimwaterson: Rejected pitches: Photos Of Len McCluskey Improved By Mclusky Lyrics. https://t.co/SBeTHfrG0w", "You can get the Unknown Pleasures album artwork as a Christmas card from Oxfam this year https://t.co/cpQaPPYkLV https://t.co/pxWY9O0CnS", "Who wore it worst? https://t.co/5B0fmcp0tg", "This will be happening to me at their show tonight. https://t.co/qFykO95OHB", "Just remembering #Susanalbumparty. Halcyon Twitter times.", "@harrietgibsone Guest ale: Geller Artois (sorry!)", "My ears are enjoying this new Chromatics song: https://t.co/vSuEApYn8l", "@katiesol That's the only one I'm interested in seeing tbh. But I really want to go.", "If you read one thing today make sure it's this sublime review of Steve Bruce's (yes, Steve Bruce's) novel, Sweeper https://t.co/O3Mh3HAT30", "Morning! https://t.co/k1trKHcqgD", "People who swing their arms vigorously when they're just walking normally are probably the worst people in the world, aren't they?", "Grandaddy are still brilliant https://t.co/1KftEm1SDy", "NO AGE ARE BACK https://t.co/z8NR8Je1QU", "Interesting: Universal reportedly outlaws streaming 'exclusives' after Frank Ocean release: https://t.co/LwDflDtzL4", "I like it but I think I only understood about 42% of what was happening in Mulholland Drive tbh  https://t.co/fQ0BwE5Kx0", "Happy Grandaddy day everyone! https://t.co/IvYLp3LviC", "RT @ClashRobin: So: https://t.co/NYLwh3AwjP https://t.co/l4lOQNj8hY", "Just glorious. https://t.co/EGFDAgQZT0", "@derekrocks @Grandaddy @Dave_Rowlinson @gemtriesharder I will be there. And I cannot wait.", "This is a brilliant piece of writing https://t.co/vn5XtL5QKH", "#Monday https://t.co/swmlsY0Dzn", "I'm guessing Sleaford Mods have already written a song about Wimpy?", "After Kanye's McDonald's poem, I'm waiting for Kendrick to spit about KFC. https://t.co/CPzeggk1ji", "My mum just handed me a block of Red Leicester as I got on the train back to London. She knows me so well.", "These targetted ads are getting more intrusive https://t.co/5Kns4gkYYM", "@timjonze Incredible race - complete control", "Just bought this. Low key build up so haven't heard much news about this guy. Excited to hear the album. https://t.co/1TWFnUhmBy", "@ryanjohnbutcher and that", "Imagine buying this on vinyl https://t.co/sjV8JztYB0", "@cduncan86 that one great song", "@McCormickDaniel I have no cartilage in my left knee from playing football. My knee always hurts", "Listening to Grandaddy, talking to @Dave_Rowlinson &amp; @gemtriesharder about Grandaddy &amp; getting excited for seeing Grandaddy live. #Grandaddy", "Going to gigs is good for you, apparently: https://t.co/UvGjqtW3q0", "@jonadowning Hmmm, a cool little boutique shop called, er, ebay", "I have a new favourite tshirt https://t.co/WFXGb7ywKO", "RT @trouteyes: White riot, I want to riot (ping)\nWhite riot, a riot of my own (ping) https://t.co/E70bTo1GHJ", "So my brother @Dr_Laffy_Taffy performed a 10-man synchronised dance at his wedding &amp; it's made it into @LivEchonews https://t.co/nNKYUh1Z0H", "Really excited about this Mos Def/Yasiin Bey show with Hypnotic Brass Ensemble https://t.co/nco1ULEdOM", "https://t.co/nXtTOhlQGg", "Well, it looks like we've reached peak Corbyn news https://t.co/N8Q5twrPYu", "RT @WholesomeMeme: https://t.co/DYOBF02xAF", "Headline of the day: 'Chips thrown on car in Frome near Bed and Breakfast'\nhttps://t.co/9GAEjbtooz", "Yr bf's #fav7films\nThe Fast and the Furious \n2 Fast 2 Furious\nTokyo Drift \nFast &amp; Furious \nFast Five \nFast &amp; Furious 6 \nFurious 7", "#fav7films \nPolice Academy\nPolice Academy 2\nPolice Academy 3\nPolice Academy 4\nPolice Academy 5\nPolice Academy 6\nPolice Academy 7", "@katiesol Can't believe Kelly Clarkson hated Since U Been Gone :(", "This is really good, Kate is right. https://t.co/vNvCGVyb89", "It's my mum's birthday tomorrow &amp; she'd like nothing more than Frank Ocean's album to be released for it https://t.co/7RJAuWljxT", "Daily Mash: 'Friend with spare gig ticket wants full price for it' https://t.co/Hju2729WHt", "@shornKOOMINS It always seems to come down to the fact he doesn't smile 24 hours a day. FFS.", "#TheDream Couple have Greggs-themed wedding after falling in love over a steak bake https://t.co/SV8b3ICBug", "Another reason why I think Andy Murray is great: https://t.co/l9taV9L72A", "@DannyWrightUK Ah no, you really don't want to hear me sing!", "@DannyWrightUK haha, I realised. Was worried I hadn't rehearsed for these shows!", "RT @DannyWrightUK: I'm going to @dethink2survive at Dog &amp; Whistle Pub in Hertford, United Kingdom - Sep 15 https://t.co/XT52YcoSK0", "@vndrlyl I did! A few big plot holes but it looked amazing and the kids were perfectly cast.", "@john_freeman_ yeah 8 episodes. It's about to get very interesting in episode 5!", "Finally finished Stranger Things. Life can recommence.", "Did you know Justin Bieber played the alien girl in Stranger Things? https://t.co/IOFFqBnKxu", "@McCormickDaniel Need to do a photo comparison tweet really.", "Has anyone started a band called Farage's Moustache yet? https://t.co/TVPhjKiIaZ", "@MattLangham Matt-aland", "Lambchop's new 18 minute long single is wonderful https://t.co/gPssyOunES", "@gemtriesharder @Mkboxx Please investigate this https://t.co/yWDD4St0ti", "@jamiemilton_ Trying but failing to make it a pun with Vampire Weekend", "@mrchristr happy birthday!", "Hello, it's me https://t.co/cq2e1kggV4", "@jackanori Haha, they are disgusting. I hate to imagine what 'meat' it is.", "@jsdwrds https://t.co/SE8hDtEXd0", "Food wise it's hard to believe I didn't vote Leave really. https://t.co/ZecGdKB51O", "@JackMerlin @kriislavin @Dave_Rowlinson I went to a pitch black album playback last night too.", "@S83bai I'm in just from that paragraph alone.", "RT @FacesPics: Plant giving other plants a speech https://t.co/eJjEVyh4yd", "Quora remains the weirdest thing ever. https://t.co/ZYBa4R7pe4", "Now Stormzy has announced Pogba I hope The Pigeon Detectives announce Joleon Lescott signing for Leeds", "@strawlou Hahaha, it's a story about Mike and his pretentiousness when it comes to food. I will tell it to you next time I see you.", "#InternationalCatDay https://t.co/ljepkMOz7R", "And now they're touring, playing Fuzzy Logic and Radiator in full: https://t.co/L76xVKOA0q", "Super Furry Animals remain brilliant. https://t.co/44FjBKygF6", "Caught By the River has the most number of picnic blankets of any festival I've ever been to.", "Elliott Smith would have been 47 today. I still remember the first time I heard this song, it still breaks my heart https://t.co/UHNt0icF0G", "At fucking last. https://t.co/y9LIjgBAsw", "I've given up and am just listening to Channel Orange and pretending it's a new album.", "https://t.co/gT3jGNcpda", "It's your man @JackMerlin being interviewed in The Guardian: https://t.co/7m3ebmXSOc", "Just remembering my favourite ever TripAdvisor review https://t.co/tHCDyqF6iM", "@merlinjobst Merlin?", "I went to see Ghostbusters last night and I thought it was very good. Particularly liked the My Cat/Mike Hat joke. #filmreviews", "Half a good list for the #MercuryPrize which inevitably means the half I don't like will be the final 6. https://t.co/9FzYdmpYqE", "Me, to people creating Instagram Stories: 'I would very much like to be excluded from this narrative.'", "Looking at the stage times for @VisionsFestival and getting excited. Especially Cate Le Bon and ESG in a church! https://t.co/D1trlhLKzs", "@harrietgibsone Haha, my head looks strange there. Who are you spying on me for?", "The Nick Cave film looks like it will be unmissable https://t.co/c6EB4Fu7iM", "Now Frank's album is coming, can we have a new St Vincent record next please?", "RT @lunarnomad: I'm fucking dead https://t.co/axs6785Fx4", "@StephanieFlooks Really?", "Fortunately Warpaint spent more time on the music than they did for the title of their new song, called New Song: https://t.co/UtDjWBO5Lq", "Frank Ocean is my favourite internet troll https://t.co/Mu9BBXwZOf https://t.co/bAeX0B5QJP", "It's August, the month when Gold Soundz should be on near constant rotation. Especially if it's sunny &amp; you're drunk https://t.co/1TdZgsA2wq", "@mrchristr I just drew a Venn diagram and it's just a circle.", "Frightened Rabbit covering Mistaken for Strangers ticks a lot of boxes\nhttps://t.co/MDnN3hkNeA", "The results are in and the top 5 'most metal words' are burn, followed by cries, veins, eternity, and breathe https://t.co/hkazBsetI4", "Decided that this is one of my favourite songs ever https://t.co/2DLKjwCOSR #newmusic", "@AndrewAHannah I need to hear this", "Preparing for giving my best man speech at my brother's wedding tomorrow by learning from the best https://t.co/t6wymKgF2U", "@jamiemilton_ They needed to add a deeper, terrible voice to the mix.", "@shit_rock Haha, I made that tshirt myself sadly. I should have sued the Klaxons.", "Remember that time I was 11, wore a tshirt with my own name on and looked like I lived in Dalston? https://t.co/YBLWlpjN3c", "@jeres That's a fantastic bit of writing", "RT @clommy: Sia's apathy in writing for other artists is my favourite thing ever https://t.co/KVdokfFECi", "RT @GenerationFGod: 8  things that satan uses to enslave you and destroy you: https://t.co/qZGIXVYlLe", "'Martial unfollows Man Utd on social media because of shirt number change' is a very modern headline", "RT @diymagazine: Here Comes The Bride - @BatForLashes, interviewed: https://t.co/i1ASbJwl3M https://t.co/WPe7fD5yui", "Kind of wish this was literally true https://t.co/5t6KF1BZ5p", "@PhotoSonny he's such an irl troll", "@StephanieFlooks icona pop!", "Best comment at the DJ booth last night: \"Are you playing this stuff ironically or do you actually like this shit?\"", "*bump* we're playing The Rakes", "The Man-Machine: A man in Florida has changed his name to Kraftwerk https://t.co/TYH7PC365H https://t.co/xb3cw6rSct", "@AbiWilks FFS. 'life wasn't interesting enough'", "@HanrattyDave Yeah, that album was a joy. His voice gets me every time anyway but the Sinatra style to some of it was great.", "My favourite Clickhole article so far. https://t.co/x4LzEVCcU7 https://t.co/G93a9plLgV", "Love this new Hamilton Leithauser + Rostam track: A 1000 Times https://t.co/w8PZxb25lp", "@cduncan86 @charlieashcroft Sadly not. Heard QPR tickets are quite pricey too?", "@charlieashcroft @cduncan86 Ooh was tempted by this. It's the same day as Visions, right?", "I reviewed Lovebox for @diymag and basically just talked about how much I love 'All My Friends' https://t.co/ZbCrCCAHf3", "RT @raubrey: It's hot and nothing hits the spot like a refreshing bottle of ketchup. It's the Lilt of condiments. https://t.co/9RetHR47Ue", "RT @lachancenaomi: Wow more plagiarism from Melania https://t.co/oYee2VzYKt", "#Brexit https://t.co/48nh1Ur9Tb", "@katiesol https://t.co/s6DIJRNwN9 !!!", "Nick Clegg recreated Carly Rae Jepsen's 'I Really Like You' to make Lib Dems look 'fun' #cleggyraejepson https://t.co/s6DIJRNwN9", "@gemtriesharder I'm so jealous. Saw some pics of last night's show and it looks amazing.", "#neverforget https://t.co/fPis3bloC7", "If you're near Old Blue Last on Friday, @Dave_Rowlinson &amp; I will be shutting up &amp; playing hits.  Press shot attached https://t.co/hoQGDANHua", "@BuckinghamAlice I went to a wedding last week where they did that and it was the best thing that's ever happened.", "RT @FootballCliches: 100% tuning into this, @BBCRadio4 https://t.co/zCskEqcKaZ", "@MattLangham yep, it is. An inspired choice. Love him.", "The first single from it is lovely too: https://t.co/q3uOlvl98a", "Headline of the day: Man gets new job, drinks six pints, wakes up on 75ft high glass roof https://t.co/e75NwOjll5", "Just discovered that Sharon Van Etten has covered Do U Realize? and it's as sad and beautiful as I could have hoped https://t.co/syDcm4v67f", "@catherinegee I'm very much a traditionalist when it comes to Soreen.", "@cduncan86 I would give anything for a vienetta right now", "@AdamEdwardsNEA The best thing since sliced...", "What I really need: an ice lolly. What I'm having: a cup of tea and some Soreen.", "@katiesol https://t.co/TFsflRNUV2 ?", "In complete disbelief that Taylor Swift has been outed for not telling the whole truth and manufacturing shock. https://t.co/91tl9sW1vy", "@Dave_Rowlinson @_rachelgrace Looking forward to the review", "Always wanted to write sleevenotes for a record and I got to do it for my favourite festival. Thanks @EOTR! https://t.co/2uv2j0VMUk", "Rest in peace Alan Vega https://t.co/99KDwwh9jX", "@_rachelgrace I sure am. It's going to be emotional!", "Just put some wine in my Nutribullet. #LCDSoundsystemday", "Lovebox update: a man with a colander on his head looking very happy.", "The National have done another Bob's burgers song: Bad Stuff Happens in the Bathroom - https://t.co/pp0FuYlmiR", "The @supportactuk launch party was so much fun last night. Biggest thanks to @Wyldest, @DreamWifeMusic @DagnyMusic &amp; @commoonicate", "@gemtriesharder @katiesol @sockformation @mrchristr It's Koko. That smell.", "@lukeyw1987  You think he can't go any lower and he always proves you wrong.", "If you want something inspiring to watch after all the terrible news, this film for the Paralympic Games is great: https://t.co/2LQYYXJcBN", "RT @paulsinha: I can't imagine anyone is looking forward to Rio 2016 as much as Simon Le Bon's accountant.", "One for fans of walking stick-related football puns https://t.co/IFRLHFa6iW", "See you tonight? https://t.co/wK2dhkyXE9", "@NeilBopperson @LondonInStereo Ah thank you! It was such a good show - just what was needed.", "Come and party for a great cause. #norequests https://t.co/WHlB5xwn6s", "Deptford Goth has released a new song under his own name, Daniel Woolhouse, and it's beautiful: https://t.co/80JQPoJOTQ", "RT @SamCoatesTimes: Our new prime minister https://t.co/duZqz4N3hG", "When Big Sam inevitably becomes England manager I am officially done with this country.", "@S83bai That's a very good point.", "@gemtriesharder The full gamut there. I'll ease in with the first question.", "@AndrewAHannah oh I'm definitely asking that", "@katiesol Space currency is currently stronger than the pound", "I am gong to a dinner with an astronaut tonight. What question should I ask him?", "RT @MichaelLCrick: Bewildered Jeremy Corbyn lookalike berated by protestor outside Labour NEC meeting https://t.co/Jo7ByFpMak", "Went to see Beck what seems like an age ago. He offered the crowd back rubs. Wrote a review for @LondonInStereo https://t.co/zMmTTPxrLt", "With every political story that emerges I keep coming back to this article https://t.co/hrIAWpCUgI", "@joeparry furnished. But bring your own Nutribullet", "I've finally just clicked with this ANOHNI album and now I can't stop listening to it.", "@annarosekerr stop stalking me! I didn't see any of the fire engines. What happened?", "@chris_mandle It's so good. And makes me realise even amazing writers get doubts about what they're doing.", "Great 404 page on the Lib Dems site (via @dansmythphoto) https://t.co/viw4vol75R https://t.co/nCecfTWeYj", "Finally, Finsbury Park, Dotori and Rowans have made it into London's Best Bits in Time Out. https://t.co/dp8UXDJgZx", "A great read for Seinfeld fans: How the show's funniest moments came to life \nhttps://t.co/MJgzPHQP3m", "You thought things couldn't get any worse? You thought wrong. Very wrong. https://t.co/iInkWU9uE3", "Oh god, I just found out the Red Hot Chilli Peppers were originally called Tony Flow and the Miraculously Majestic Masters", "@gemtriesharder ... Is that a compliment?", "@gemtriesharder please add Alex James' remix of bugman", "All 4 French players in this doubles final are wearing Lacoste. I like to think if it were an all British one they'd be decked out in Jacamo", "There's nearly a good tweet in there somewhere.", "Beyonce is at the ladies' singles/single ladies final at Wimbledon.", "RT @idilsukan: I wish Ian Duncan Smith would just call it vagina like a normal person https://t.co/RqUoeQQMY4", "Interesting new alt direction from Leeds. https://t.co/XDdgsyTynU", "Oh god  https://t.co/NdMnfJmwyo", "@gemtriesharder We met him at Eurodisney with his mum and dad 20 years ago and my Coronation Street-loving brother got a photo with his mum", "@Batlovers Ah rubbish. I'm going to blame the Mac's autocorrecting function for that one.", "There's loads of other great stuff in there: MO on the cover, Christine and The Queens, Weaves... Basically, go and read it.", "I talked love, tragedy and Tinder with Bat for Lashes for the new @diymagazine https://t.co/SebdPSu4Yj https://t.co/J3pgICF1BG", "These pictures of a 6-year-old Ugandan boy seeing for the first time https://t.co/gGXqKDrb3g https://t.co/BtCAX7tXJT", "RT @AnaOpp: Basically this &amp; don't you ever Theresa Bae me. https://t.co/8OFkufLVex", ".@mrTonyLaw said some very funny things about orcas and trampolining last night.", "RT @parliawint: https://t.co/i8hRzFRbZB", "RT @joewellscomic: It's like the sun doesn't realise that the internet exists.  https://t.co/P8RZEsBCBE", "@gemtriesharder Yes to the first, no to the second. That word makes me feel nauseous.", "@michelle_amaria Come on MK, you're better than that.", "Yeah OK, this new Pixies song is pretty good: https://t.co/ayzLN9gbIc", "@ClashRobin @leoniemaycooper Oh really. That makes me happy.", "That's put me off my cornflakes https://t.co/qIbty2qV6I", "\"A LAST NOTE FROM YOUR NARRATOR. I am haunted by humans.\" #ChilcotsLastLine", "We wait 7 YEARS for this insight? https://t.co/WmB6UU0Oev", "@Dave_Rowlinson @gemtriesharder Haha, that's just reminded me this happened.", "@katelloud Amazing. I hope it still has pride of place somewhere in your room!", "@MichaelAHann Wow", "@katiesol @AndrewAHannah @strawlou BRB, I'm just writing a song called Trotsky in Leather", "'Bucolic socialist with improvised elements (like jazz).' #same https://t.co/tq226w4PM0", "@gemtriesharder #keepsake", "@AndrewAHannah This is amazing and sad all at the same time.", "@AndrewAHannah Hahaha, about what, dare I ask?", "@stuheritage @katiesol @sockformation Frasier finished in 2004. I don't understand her point.", "Fallen down an Amazon wormhole and stumbled upon this https://t.co/i5vvo146Kr https://t.co/KxuNDndweg", "Farage to be the next host of Top Gear? Featuring only British built cars.", "Don't really ever need an excuse for this song but seeing as it's today... https://t.co/xqQRB3B1Vi", "I saw Beyonce and Massive Attack this weekend, but the best performance was definitely @PhotoSonny singing Maps to @laurendown", "An incredible show from boss Bey. https://t.co/JWB8EdnJhN", "@chris_mandle I bought them off someone off Facebook on a whim. But there are tickets at the box office I think. Get down here!", "I hope all 1,476 collaborators on Lemonade join her on stage. Although I'd settle for just Kendrick.", "I'm hungover so have just bought tickets to see Beyonce tonight. Feel better already.", "RT @iainduff: The proudest parents in Wales tonight https://t.co/1V3oB1abuh", "It's @laurendown and @PhotoSonny's wedding day! And what a day it's going to be.", "Never loved Massive Attack but they were amazing tonight. https://t.co/yD3PX0teJd", "Hyde Park is like a post-Brexit wasteland with fake Spanish named bars we're no longer welcome in.", "RT @daniel_barker: I'm not ready for another referendum. https://t.co/LOJ62r1kPP", "@joeparry Me! (I hope it doesn't rain)", "100% pop banger from Dagny here. https://t.co/02A7p3HrjO", "@RickSkilbeck I'm very tempted by this tbf", "Sometimes I wonder what dogs would say if they could talk https://t.co/WCk2ly4i15", "@musicismyradar @gemtriesharder @stejvic Yeah, it's a pretty emotional listen for me.", "@gemtriesharder @stejvic @musicismyradar Yep. It's amazing.", "The best thing you'll see today: Nigel Farage with bass guitar https://t.co/5LwMO9K8YS", "RT @parliawint: https://t.co/tr3vCRcmCV", "So Boris is going to wait for all the shit to hit the fan and then be the saviour in a couple of years. What a sly coward.", "RT @aliceisms: 2015 politics: ed miliband eats a sandwich a bit weirdly\n\n2016 politics: everything is on fire", "Gove versus Johnson: \"the worth of boast worlds\".", "RT @jessbrammar: #prayforrupert https://t.co/qKnPUmZFOI", "Lovely photos from @timjboddy and there's also a great, powerful piece by @_rachelgrace on guns in the US. Go and read it.", "NEW @LondonInStereo. I spoke to Mr. Metronomy, Joe Mount, about '08, not touring &amp; Kendrick. https://t.co/PXn5sPh2Q3 https://t.co/U3aMGPvq6V", "https://t.co/LVUp0TAtX6", "I wrote about the referendum, the refugee crisis and why we decided to start @supportactuk for @guardianmusic https://t.co/BRl34sBEXe", "Sometimes it just takes a tiny, 45 year old Scientologist playing a greatest hits set to make you smile again https://t.co/KIVjE5D80u", "RT @matthaig1: There's a thing I still don't understand about Brexit voters. https://t.co/pA8yc4arMb", "What the hell is happening? https://t.co/QasTqdDEaZ", "Listening to Beck all day and then going to see Beck play those songs live tonight. A very Beck-shaped day.", "@katiesol I don't get Blood Orange full stop", "The only funny bit of this tweet is the idea of buying a DVD.", "Just bought the DVD of the Euros highlights - England: the Wastemen Generation", "@SimoneSkilbeck he's now shadow chancellor because of his economic know how", "Now is the time for Big Sam to take his rightful place as both Prime Minister and England manager.", "I can't think of any possible candidate for the job.", "@timjonze which player? Mike would win", "Or something like that.", "That's why dumbs lose to Iceland.", "@timjonze disorient are better than England", "RT @PoliticalAP: SK: Where's everybody else?\n\nJC: They've... gone... to... Longstanton Spice Museum https://t.co/yJVtBnfywc", "@AnantNaik Can't believe Home only got 10%, 0% and 0% tbf tho", "England V Iceland tonight. If only it were Scotland and we could see this happening again https://t.co/5Z4tteOJ94", "RT @helenpidd: Giles Coren's mum writes to the Times to complain about his reporting https://t.co/fKtRD1QvuC", "I'm watching LCD on the iPlayer and can confirm All My Friends is my favourite song ever.", "I just got round to reading Aziz's piece on Trump and it's as good as everyone said https://t.co/lnKtC1yabB", "The U.K. right now https://t.co/jtUClSAe0B", "Just been cheered up by hearing an American pronounce Lewisham, Lewis-Ham", "RT @alexsmith1982: Wonderful (via @jessicaelgot): https://t.co/Z5Z5FpRx76", "British Lose Right to Claim that Ameicans are Dumber https://t.co/ZwgbMxXFHH", "RT @AndyMcCrimmon: https://t.co/WtdvRtObEz", "This is why we can't have nice things https://t.co/SogSY86IKn", "Today is a day for listening to Yankee Hotel Foxtrot on repeat. Current mood: https://t.co/xTzCmE7gVt", "@kathrynXYZ Yeah, so good. Loved that they played 'This is just a modern rock song'. Were you standing?", "https://t.co/MAqxkjQqpk", "RT @bskipper27: NOT NOW DOROTHY PERKINS https://t.co/Nnb0b4sfxC", "Who's in for this? https://t.co/zbKnodA4jS", "@kathrynXYZ How good was it!? If only today wasn't so shit.", "Can we all chip in and buy Bernie Sanders for Labour?", "And now we'll get Boris as PM. OH GOOD.", "RT @5carab: I guess British pensioners hate foreigners more than they love their grand children. #EURefResults", "It's started already.  https://t.co/owxtZjXJDp", "Devastating news. Sorry to all the people who have woken up feeling a lot less welcome in this country.", "I went to see FKA Viet Cong, now Preoccupations, for @guardianmusic https://t.co/cTsULhTbvL", "@JackMerlin Did he mean 'cocks' or 'cooks'?", "Look at that awful weather. We could do with it being easy to access cheap travel to warmer countries, couldn't we? Get out and vote Remain.", "@Dave_Rowlinson @gemtriesharder @LucieGraces Let's have a referendum on which B&amp;S album we keep. I'm listening to Fox in the Snow", "@gemtriesharder @LucieGraces You do love disenchanted ponies and circuses.", "@LucieGraces @gemtriesharder I do think it's a great album though", "@LucieGraces @gemtriesharder Even for B&amp;S We Rule The School is so timid and fey. Also never liked My Wandering Days", "@LucieGraces @gemtriesharder It's not", "@LucieGraces You and @gemtriesharder are definitely wrong but I appreciate your efforts. Tigermilk is patchy.", "Daniel Kitson's fantastic email about Europe also let me know he's on a Wikipedia page of Recluses https://t.co/6MZCpUI4Ub", "RT @caribouband: Hey UK, I'm voting Remain. Hope you do too. https://t.co/7Ol6zsSiNh", "Lots of great people, venues and promoters involved and it will hopefully make a real difference. Find out more here https://t.co/9XCiELCmJA", "Tonight I get to take my mind off the referendum by seeing Belle &amp; Sebastian play their best album in full. https://t.co/0jqFnXU1Ko", "Just put my cross in the Remain box and am now eating a French Fancy. I couldn't be more EU right now.", "@Dave_Rowlinson You have to be out to be In", "Please vote for hope, collaboration, peace, travel &amp; free mobile roaming charges. Every vote counts. Remain. Defo. https://t.co/v1jpmOVWs6", "Well, this is all very exciting football playing, isn't it?", "RT @danielmaier: BREAKING POINT. https://t.co/9ypmHwy8vV", "@vndrlyl I have to file my review by 9am so hopefully I won't be doing that as well. See you l8ter", "@vndrlyl It's a good 'un. See you tonight?", "Tonight Preoccupations, tomorrow B&amp;S doing If You're Feeling Sinister. If we announce we're staying in Europe on Fri this will be an A+ week", "RT @rhodri: I think we need to fight back with some misinformation of our own. It's the only way. https://t.co/Wq07bynkfO", "@gemtriesharder https://t.co/3sSRGxwLZQ", "@harrietgibsone I love it when he starts laughing. Ah really, did I ignore you?! Soz! Have a great, dry-as-can-be Glasto!", "@harrietgibsone https://t.co/zHr5hIXkll", "@swjharris I think something to do with this https://t.co/NpW5fjlxO7", "@Dave_Rowlinson KeiTha?", "This https://t.co/u3EcjuhgLL", "Another London music venue is under threat. Sign here to try and protect Passing Clouds: https://t.co/uCPgWnXXAU", "Everyone please put this on repeat all week https://t.co/esLTkzilxp #IloveEU", "#Breakingnews https://t.co/hJN4jvWmik", "Has anyone ever seen Stephen Ward and Ed Droste in the same room? https://t.co/qkbW28PhwH", "RT @ericabuist: I think we can all name a few newspapers who swear by this handy colour-coding chart. https://t.co/BpaujGBS4s", "This is good. Call Your Nan and get her to vote: https://t.co/QidaToNTqL", "I was so tired this morning I tried to hail the train as it came into the station.", "@katiesol Should have put a winky face on that tweet really", "@katiesol Worryingly I think we might have very similar mid-year lists.", "Jo Cox's husband's words are heartbreaking https://t.co/qUAmNnz2wu", "RT @sunny_hundal: Did a lightbulb just go off on the Britain First Facebook page? https://t.co/a9nwWrtuxN", "@gregory_wells No, definitely trying to bury that news.", "ATP is finally no more https://t.co/IPDA9GM7Yb", "TBF to Joe Hart, he had some shampoo and Doritos on his gloves.", "I'm half Welsh so am currently wearing a half and half kit, waving a half and half scarf and shouting 'Come on Bale and Rooney'.", "@HanrattyDave It was SO good. And they looked like they were really enjoying playing too.", "Wolf Parade were amazing tonight. 'I'll Believe In Anything' sounded especially huge and joyous.", "The only picture you need to sum up today. https://t.co/yWKd8z3OIh", "@gemtriesharder https://t.co/D2bY7vuQYQ", "My attempt to have a gig-less week has been thwarted by the chance to see the mighty Wolf Parade tonight.", "@LucieGraces Why have I only just seen this?? :( Completely forgot the shows were this week. Great show?", "Really interesting interview with Wiley in Time Out about why he fell out with Dizzee https://t.co/RPeN2FHCe6", "@StephanieFlooks I know. There was no sarcasm emoji to add to my tweet though :(", "I've just crunched the numbers on my Twitter timeline and it's an astonishing 100% #remain vote. All good guys. No need to worry.", "Q: Was @williamggrant falling in the mud the highlight of Field Day? A: Yes, it was. https://t.co/DqfvtkfC0I", "I hope this happens to David Guetta in a minute https://t.co/AmmaNNqIpt", "@gemtriesharder Mitski, Beyonce and Last Shadow Puppets", "How can anyone be confident about England's chances when Phil Jones isn't in the squad? https://t.co/KiqbDKdwvy", "Good Friday listening: BOYS NOIZE x HEALTH x EMPRESS OF - STONEFIST RMX https://t.co/zeJpNw3SfG", "Would you ever have predicted that the cover of NME would be 100 'sun wearing shades' emojis? Actually... https://t.co/uHbHanvJME", "But not as good as 'One team, three colours and millions of hearts beating for Romania!' which sounds like the title of an emo album", "Albania's Euro 2016 slogan is 'Feels so good to be Albanian!' which is excellent: https://t.co/ZTvWkr2Uli", "You can now stream my favourite album of the year so far: @mitskileaks - Puberty 2 https://t.co/AiYdzJyp5l", "#Remain https://t.co/6u9e0CAcaR", "I've just seen a mobile toilet company with the strapline 'The ultimate in luxury'...", "@willjennings80 tbf I'd prefer that to coconut tea.", "If I asked what Gareth Gates is doing now &amp; you said \"Creating Cuppanut, Coconut Tea without the Tea\" you'd be right https://t.co/j7WnYKCa20", "@katiesol I screengrabbed it off a setlist site, Kate. Stop busting my balls.", "@basementfever A really weird (terrible) typeface.", "Realise this is 5 days after the event. And obviously I was shouting 'Play Creep' all the way through the set.", "Radiohead's setlist at Primavera was pretty much what I would've chosen them to play if you'd asked me beforehand https://t.co/u7m84rc2J4", "Got Sweden in my Euros work sweepstake so will be acting like Zlatan for the next three weeks.", "@SimoneSkilbeck But I saw Rick and Steph! Were you definitely there?", "LCD, Radiohead, PJ Harvey, Brian Wilson, Suuns, Floating Points, Julia Holter, Animal Collective... Primavera you did it again.", "@mrchristr @gemtriesharder @katiesol great to see you too!", "The new Beck track sounds like about 20 songs in one and it's great https://t.co/zvjjBZXYJA", "@AnantNaik haha, me too. I'm actually in stanstead spoons right now! See you on Wednesday!", "@mrchristr ah awesome. Is that at the festival? Can't find a link for it.", "@mrchristr ah when's that? I only get to barca on Wednesday so miss tomorrow. And yes see you there!", "Flying to Spain this morning for Primavera. If anyone needs me I will mostly be dancing like this to LCD https://t.co/Lmd9yFEnLi", "All the new stuff sounded great and Idioteque, Nude and Paranoid Android were amazing.", "First time seeing Radiohead at their own show last night. They didn't disappoint. https://t.co/KHrj2agzbO", "@StephanieFlooks https://t.co/MbfFjmLJ4U", "I am eating chicken nuggets on my own in Camden. I have made some bad life choices.", "Been transcribing all afternoon and would, once again, like to apologise to anyone who ever has to hear my voice.", "Reviewed @YumiZouma's joyful, dreamy debut for @diymagazine: https://t.co/cAU1KnwFl9", "RT @GayRodney: truer words have never been spoken https://t.co/q1cJ8UBEJt", "@cduncan86 amazing news! Congrats.", "Sums: @whitneytheband + Clapton FC + Rowans + @LondonInStereo = The Dream. Read the interview here: https://t.co/Qbi7LbINC2", "Sun's out, new London In Stereo's out. https://t.co/ya8n9Tj3BJ", "Tried to find the words to describe why @BrianWilsonLive playing Pet Sounds meant so much https://t.co/OOpOgJk2th", "Just say no kids  https://t.co/jVOMm3CWQR", "But what if you've never been to a rodeo before?", "RT @Chet_Faker: ok @SoundCloud https://t.co/px4W4EgLyd", "RT @tompeck: Meanwhile, over at Brexit Concert HQ... https://t.co/JLXy9zeeUV", "@Kevind04 Hmmm, I'd recommend Beach Slang, Floating Points, Kamasi Washington, Methyl Ethel... it's such a great line up this year!", "@Dave_Rowlinson That's booked in.", "@tristan_bath Going as a regular punter this year as have reviewed the last few. How about you? Are you arriving for that first LCD show?", "I emailed @Dave_Rowlinson about free pizza and beers 10 minutes ago and he hasn't replied. SOMEONE PLEASE CALL 999.", "Last night Suuns just reinforced that they're one of the most visceral, brilliant live acts around. Can't wait to do it all again at Prima.", "Today is a great day: Factory Floor are back: https://t.co/jwbHtPBUfm", "@gemtriesharder Where's the Oh God Yes option?", "The final piece of evidence that I disagree with all of Sol Campbell's opinions https://t.co/U4qpb2ETnL", "@strawlou I could have died Emmylou!", "@shit_rock @joeparry I felt as I'm older I could make the joke. And now I've just been uninvited from Joe's party.", "@joeparry @shit_rock Not for long though! ;)", "@joeparry Who even are you Joe Parry?", "Wild Beasts are back and they are sounding sexy https://t.co/OeOMXAA3H0", "Man who has never left Huddersfield thinks Britain should leave the EU https://t.co/PbxRSBpaqz", "Great Escape mostly reminded me how much I love this track by @sego_music https://t.co/0ngzC59cEP", "@gemtriesharder @sockformation @AnantNaik @katiesol @StephanieFlooks @__jordan I want to see GOAT but then am free to request Mr Tembo", "If you were undecided on what way to vote... https://t.co/SSQb35e0O1", "@katiesol Classic Solomon", "Life goal achieved: hearing Brian Wilson perform Pet Sounds. https://t.co/WK8BDEGrj1", "Highlight of the Great Escape was obviously watching Craig David sing his own name over the top of Sorry by Bieber. https://t.co/OV6ipZQ8u8", "Margot Robbie makes a great Patrick Bateman https://t.co/hwv1UUfOom", "Awesome is indeed the word https://t.co/pvBuLBpRW4", "Headline of the day: https://t.co/hFUQ6H1WE2", "RT @NoContextLouis: https://t.co/Eh3R0BDNek", "@miss_archer You get your paws on it here https://t.co/lkEeMzLDiw", "@gemtriesharder That was my TGE 2015 highlight tbf", "@michelle_amaria deal", "@michelle_amaria I'm there and will be drinking but am not pretty.", "@gemtriesharder Don't worry, the cowboy guns are ready.", "It's nearly time for #thegreatescape. #Neverforget @Dave_Rowlinson https://t.co/7FX8XrIJ0V", "It's a big day in the world of cat litter scooping https://t.co/oTjgiM7TOf", "@Dr_Laffy_Taffy See you at the wedding BALLBAG", "@timjboddy @adm_bn Say what??", "@onwardolympians I'm enjoying it", "Important announcement https://t.co/siFll1h7ri", "It's an honour and a privilege lads. https://t.co/G4AzHgESQD", "RT @JamesLiamCook: A pivotal moment in World War Two https://t.co/J4djlVs8PK", "This new Sampha track is very good, isn't it? https://t.co/IuJdorb4Th", "@naomicmiller It was so good!", "Bat for Lashes' performance was very special last night. More wedding themed concept shows please.", "@Mkboxx Happy anniversary you two! @gemtriesharder", "@katiesol You've proved that song title wrong then...", "Very excited to see Bat For Lashes tonight, the person who has written my favourite song that is also my name https://t.co/O4LY67hMhi", "Monday work tip: as long as you don't leave a fake bomb in the office you're 'exceeding expectations'", "Love the Ukrainian version of Mrs Brown's Boys. #Eurovision https://t.co/Tzoh4VwnL4", "RT @Naylorben: I hope the UK wins so we can get Philomena Cunk and Barry Shitpeas to host. #eurovision", "Quite enjoying this Swedish Flight of the Conchords version of a Eurovision song #eurovision", "Think I've done this wrong. 30 minutes before a suit fitting for my brother's wedding and I've eaten a steak pie and an iced bun", "@McCormickDaniel I know, it was a terrible joke sorry. I agree with you. Except maybe not wilshere", "@McCormickDaniel where's Walcott?", "RT @davelozo: IF MY SON GETS KICKED IN THE SHIN AT SOCCER HE IS GETTING HEROIN DON'T TELL ME HOW TO RAISE MY KID https://t.co/vBYChbujJ1", "RT @NoContextLouis: https://t.co/1oA76QCtAY", "So, Lady Gaga will play Cilla Black in a Dionne Warwick biopic. https://t.co/AktbyeCJch", "Praise be. An ace new Super Furry Animals song is here to soundtrack your Friday: https://t.co/Gj86cwnmM5", "I've been working on a remix of the new Stone Roses song all night. What do you reckon? https://t.co/a2sq3C9lb4", "See Ian Brown got a 'My First Big Book of Rhyming' for Christmas.", "RT @trouteyes: LAST NIGHT A BIDET DRENCHED MY WIFE", "When will someone give a voice to white, right-wing conservatives? Please.", "#oppressed  https://t.co/Z2GC5nyWzt", "@musicfansmic I could imagine that being shouted at the end of Losing My Edge.", "@musicfansmic I'm half Welsh so I'm getting half the lyrics done.", "Wonder if Nicky Wire ever thought he'd get to write the lyrics 'With Ashley Williams, we can win any fight'? https://t.co/Vi5BhjoP2m", "Love the bit when Mix Master Mike comes in on the new Metronomy track https://t.co/Ydxw2ziu4m", "@katiesol Also, are we going to see Craig David on the Thursday night?", "@katiesol How come you're missing the Saturday?", "Current mood https://t.co/37Nus6Gmfd", "RT @janhopis: don't fancy the UK's Eurovision entry this year https://t.co/V8S6sCY6ri", "Just booked my big holiday for the year. Now I just have to wait until November.", "@strawlou Bloody hell", "I hope everyone enjoyed the British summer at the weekend.", "RT @danielmaier: All right mate, give it a rest. http://t.co/fInNqqxJeF", "#hottake 'Reminds me of Kung Fu Panda' https://t.co/w4RiBnzF0X", "RT @ElectricSkylab: 1) Avenged family\n2) Immediately party https://t.co/ffVDB3rjA7", "@whattheel I'm a bit worrried it harms the smaller, more 'leftfield' acts as it becomes a popularity contest. We'll see how it pans out", "RT @whattheel: @dethink2survive \"and the winner of the 2016 Mercury Prize is..... Boaty McBoatface!\"", "So fans will now vote on the top 6 shortlisted albums for the Mercury Prize. What could possibly go wrong? https://t.co/f2B1R9HYLq", "RT @DaftLimmy: Lovely weather we're having. https://t.co/6NQ1ObPOHJ", "has anyone ever thought these rock stars who wear sunglasses indoors just have really bad hay fever and are hiding their red, puffy eyes?", "True Love Waits, hey?", "RT @amy_wood: Sex and the City is a fantasy show about a woman who only has to produce one piece of content per week", "RT @emsler: Philomena Cunk on Shakespeare is a thing of absolute beauty. This is such a perfect, perfect joke. https://t.co/ECKJFXv0m5", "Surely they're releasing it on Sunday to annoy music journalists who now have to work?", "Currently writing my review based on what I think the record will sound like so I can get it out first on Sunday.", "I know we've only heard two tracks but this is shaping up to be my favourite Radiohead album https://t.co/2WMTUB9L5w", "@stejvic @timjboddy @adm_bn https://t.co/nBvLbQ7AHx", "@timjboddy @adm_bn The Bill Murray burger at Lucky Chip?", "I went to see Ought last week. Reviewed it for @LondonInStereo and tried to explain why I love them so much https://t.co/BZs7KLtK7B", "@williamggrant TBF the Hall and Oates cover at the end lightened the mood.", "Still trying to untangle my mind after Tim Hecker last night. I think it was good, but it was the most oppressive show I've ever been to.", "I am very happy there is a horse called Clem Fandango. And he won! https://t.co/IvcLknpg1C", "Come and edit my typos pleas. https://t.co/LqVxLRe5yh", "RT @Stormzy1: Beg no one vote for this Zac Goldsmith bruddah he seems like a proper pussyhole", "At this minute I'd vote for the mayor who could sort out my hay fever.", "Find u a man who can do both https://t.co/64nJWzvv4c", "Really like these new print ads for The Guardian https://t.co/1Rb82RmwH6 https://t.co/4aOoP8HKZK", "@Dave_Rowlinson @JackMerlin You better save me a goddam fudge", "@JackMerlin Ah, I hope you've got a good celebrity to do it.", "@JackMerlin Are you the voice of the audio download of your book?", "It's your man @JackMerlin on Woman's Hour talking Man Up (27 minutes in) https://t.co/7GlaQzQUfd", "@StephanieFlooks I was so excited when I was told", "@gdpreston @alcxxk I'm very sad I didn't make it to those shows. That's why I'm clinging on to this.", "@matthewjh Oh, that's very disappointing. And, yes it seems beyond homourless in its satire.", "Getting quite excited by these Talking Heads to reform rumours https://t.co/tAAuB7p63p", "Pitchfork really going in on Radiohead.", "Has anyone managed to combine Radiohead and Leicester City in a thinkpiece yet?", "Big release day: who's done better?", "The actual new Radiohead song is really good https://t.co/wJd5rCrOn1", "@katiesol If only Nina Persson had gone...", "@katiesol Please tell me it's about cardigans?", "Unfortunately, ticket prices have been set at the combined age of the acts playing https://t.co/63kdWelh0M", "@gemtriesharder Just saw this after I'd tweeted. Stop coming up with ideas before me samways.", "I have the EXCLUSIVE on the new Radiohead album artwork https://t.co/1Eby5GN6j8", "RT @footyroom: Mark #Schwarzer is the first player to win 2 consecutive #BPL titles without playing a single minute! https://t.co/DNtrsXMW56", "@Dave_Rowlinson Oh god", "@McCormickDaniel ... and you always wear top hats", "@McCormickDaniel Also, White Hart is 50X better than those other 2. Clapton Hart is the worst too - I saw a man in a top hat in there once.", "@McCormickDaniel Big win, well done.", "By The Sea is on my birthday this year and the line up is great. Let's all go https://t.co/rFbDrWOvL4", "@McCormickDaniel Just for once I'd like you to tweet about something you love Dan", "It's called Bing Bong and it's out May 13th https://t.co/WxnIe01fs8", "Great news to wake up to https://t.co/kDWJSvjsZl", "RT @MrObviousOwen: Leicester City have won the league. \n\nThat means they are Premier League Champions", "I enjoyed Demolition. Jake Gyllenhaal was able to pull off the clunky metaphor. Plus: bonus points for lots of Sufjan on the soundtrack.", "@timjboddy where the hell is that from??", "@ZofiaMS It's the Pick Me Up design fest at Somerset House. It's the last day today though. :(", "Hello, it's me https://t.co/WtYE8mQIbA", "@SimoneSkilbeck yep! I liked the Modern Toss one. what one have you got your eye on?", "@JoshAndDashes there were people in tents yesterday. All very serious.", "Radiohead have just deleted their MySpace and Bebo pages. I think the album is about to drop.", "Playing guess the record at Secret 7\" https://t.co/MKn4pLOUyH", "Spending Sunday morning with my star-shaped Sufjan vinyl. https://t.co/UJZdP4V9RG", "I just bought a year's worth of hayfever tablets. How are you celebrating the May bank holiday weekend?", "I love the fact that Stewart Lee's new tour is called Content Provider. Although he's stolen the name of my autobiography.", "@cduncan86 I'm not sadly. Yeah, we should all throw beach balls on the pitch and see what happens.", "@cduncan86 And going to the Charlton game?", "RT @JackBaker1311: Friday https://t.co/0ZT3xUHIQu", "@Getintothis Definitely. That voice could send you to sleep as well.", "@oswaldgutenberg Haha, those first three/four albums still stand up as some of the best. And The Man Don't Give A Fuck is always amazing.", "The wrap is not quite so impressive, and probably means a lot fewer people picked up a copy https://t.co/a8ckgqk0gX", "I really want to be best friends with Gruff Rhys. How do I make this happen?", "Oh https://t.co/n4t7djRtuJ", "A last minute ticket to see the Super Furries in Cambridge has made my Thursday 178% sunnier.", "#ViewsFromTheWickes https://t.co/XSWF8pJ2ms", "@Dave_Rowlinson This is my favourite tweet of the day. Sorry.", "@katiesol @LondonInStereo I'll admit Cardi-gannets was a lowpoint", "@katiesol @LondonInStereo Cardi-gang?", "That's a good cover. https://t.co/nn4qKg26eP", "Headline of the day: Man punched in face 'for looking like Shia LaBoeuf' https://t.co/8olCkWXTWb", "@danieljharvey Haha, it's good to know I have an audience.", "@katiesol @LondonInStereo Just on my way to pick one up. We could do a podcast?", "@katiesol @LondonInStereo We need to get the 'Kate's Cardigans' monthly feature going.", "Chatted all things Japan with @goldpanda for the cover of the new @LondonInStereo https://t.co/EPAu8AjQ1q https://t.co/du8AlJyAYm", "@John_Ashdown @JackPittBrooke Market Road near Caledonian Road has a good 3G 11 aside pitch that I'm sure you must be able to hire", "@gemtriesharder Oi!", "Really zeroing in on my 'late 90s indie, Mansun, Drake' demographic here.", "@gemtriesharder Done! Only messed it up 3 times as well.", "#ViewsFromThe6 https://t.co/N9Ipxg2CiQ", "@gemtriesharder Aha! Thanks. I want to do something with that Mansun album. Bit niche and probably already been done tho", "@gemtriesharder I wish I could do photoshop", "@tomdefeat Yeah, seems quite selective in the bits of the album he's talking about.", "If someone has tweeted their own name today you should probably unfollow them.", "RT @Cain_Unable: Remember when Dennis Waterman ruled England from 1553-1558? https://t.co/gihJjgUdfH", "@williamggrant https://t.co/rL00H0Y9mN", "Pretty special getting to see Slow Club drink margaritas and sing new songs in a vintage clothes shop. https://t.co/aKjELFtPVJ", "Thought of the day: 'To perform like Linford, you've got to think like Linford: PMA' https://t.co/gzruqtg9KX", "Really, really need to see Christine and the Queens live. This is very good: https://t.co/vyh5M6UmPm", "@gdpreston Such a great track. They played it pretty early too. Was sad to miss Meilyr - how was it?", "RT @richardmoore73: Wow - front pages of The Sun and The Times: no mention of Hillsborough https://t.co/C9jfNIQYzz", "Off to see my favourite band of the last couple of years tonight. #Ought", "Kate Bush on Prince. https://t.co/ZHR84gJTNf", "@Kim_Penelope Just snowed a bit over my office not far away (near the Old Blue Last)", "@gemtriesharder I see what they've done there. And it's awful.", "So Prince has made it snow in April. https://t.co/G7ZwPFF2eC", "Also, NEVER BUY THE SUN", "It should never have taken 27 years, but at least justice has now been served https://t.co/wVjHgWx3EV", "Jamelia takes down Piers https://t.co/TiJpU5d82k", "@hummusandpizza Think that means you have to join the Cheeky Girls", "Depends who you say hello to probably. https://t.co/A3EEqpphLH", "@gemtriesharder How dare she put activism over being an entertainer.", "Yes! Stop using whilst because you think it sounds formal. 'Ten everyday grammar mistakes you might be making' https://t.co/3zqp9WTzGX", "A crazy golf course designed by Paul Smith, Tom Dixon, Zaha Hadid and Mark Wallinger https://t.co/hgA0XjUnqR", "@gemtriesharder Also love: \"Middle finger up, put them hands high, wave it in his face, tell him, boy, bye\"", "@gemtriesharder That whole song is just brilliant", "I keep wondering what the conversation was like between Jay Z and Beyonce yesterday.", "@supermodernista https://t.co/jrtqi1ptn9", "No they don't. https://t.co/cAU5l7BsEm", "@MattLangham They couldn't have made up how bad Ewan McGregor's music journalist character was.", "Also looking forward to Miles Ahead 2: the Miles Kane years.", "Just watched Miles Ahead. Ridiculous and entertaining, but surely Davis' life was interesting enough that you don't need to make a story up?", "@gemtriesharder aha! Presume that type of thing explains quite a lot of the credits on the album", "I know it samples Led Zep but Don't Hurt Yourself sounds like a Battles song at the start.", "@gemtriesharder I can't hear it at all though. Is it just the 'material things' line?", "@MichaelCragg @AndrewAHannah maybe he played the air horn?", "Also, the writing credits for Hold On: Diplo, Ezra Koenig, Emile Haynie, MNEK, and Father John Misty and it takes 'that' line from Maps.", "Six songs into Lemonade so far. Spectacular so far. Jay Z doesn't come out it *very* well, does he?", "Had my first ever Nutribullet and now ready for a day of Margate and then @usuckclub tonight", "Remembering this headline today https://t.co/eBGVCQLHGD", "RT @70s_party: Just the five bottles today, thanks https://t.co/xCefslMag0", "\"We should either re-name the colour purple 'Prince', or retire it completely\" A fitting tribute from @thomasahannan https://t.co/QfmbS7Holj", "@MattLangham Jeremy Clarkson is going to live forever, isn't he?", "Amen to this: 2016 to end early https://t.co/is9PDyTcJk", "Every tribute piece should begin 'I was dreaming when I wrote this, forgive me if it goes astray' #RIPPrince", "I feel so lucky I got to see him at Electric Ballroom a couple of years ago. Already one of my most cherished shows, it means even more now.", "Just going to put this on repeat and pretend it hasn't happened https://t.co/YPlxDEmDr9", "@thomasahannan Oh god mate. Hope you're ok.", "Fuck. Not Prince. Fuck.", "I DON'T WANT TO EAT TWO TRACKER BARS TO GET A DOUBLE DECKER, GODDAMIT https://t.co/pX69iUDWHM", "\"When I met you I'd never tasted pasta or baguettes\"", "Amazing: Gruff Rhys has made a new song #IloveEU https://t.co/esLTkzzWoX", "So Viet Cong are now called... Preoccupations https://t.co/svsSkJDHCJ", "So happy Fuck Buttons are back in the studio. I was listening to Olympians in the gym the other day &amp; literally felt the endorphin surge.", "@bearcavingamy yeah it's pretty close to where I'm from. Such a sad situation", "A Levels are 'financially unviable' in Knowsley. https://t.co/bccYvXef3U", "RIP the brilliant Victoria Wood. She was a constant part of my childhood and an incredible talent. 2016, what are you doing.", "@michelle_amaria Pardon? https://t.co/hNDNZXZzVm", "Listening to a lot of Electrelane today. Can confirm: songs still sound amazing.", "@katiesol @usuckclub Did 'thing' help with the results?", "I need the answer to both of these. https://t.co/e1ctRE5WJS", "RT @GerryAdamsSF: Sometimes it's hard 2 b a woman.", "@spinal_bap @tomdefeat @katiesol Really enjoyed your review btw!", "@tomdefeat @katiesol I read that and couldn't believe it. Surely someone from the NME was there?", "I didn't realise Barry Hogan hated The National so much. https://t.co/TtDbmHMOI9 https://t.co/nlOyNQ80wB", "RT @RyanNewYork: My friend's mom doesn't know how to screenshot so she did this. https://t.co/2auLR81xBb", "@gemtriesharder All of them look great except for An evening with John Lydon.", "Very excited about seeing Mitski playing the best album I've heard this year.", "@sockformation These guys deserve some recognition.", "I'm very happy with the Run The Jewels t-shirt I've just bought. https://t.co/OQDkPNsCuK", "Glad to see Biffy Clyro on the In New Music We Trust stage at Radio 1's Big Weekend.", "Daily Mash headline of the day: Failed musician wants you to know how amazing settling down is https://t.co/qIaBmhv0wi", "@Dave_Rowlinson The involvement of James Franco was putting me off, but it was very good.", "I started watching Freaks and Geeks for the first ever time last night so at least I didn't waste my weekend completely.", "@katiesol @tomdefeat who's been the highlight? (Except the Netflix marathon)", "@tomdefeat yeah, hope they sort it out but doesn't sound like this weekend has gone too smoothly", "This was the tweet https://t.co/Q5BfaEGF4E", "@JoshAndDashes https://t.co/iuPcbnHZI8", "@musicismyradar https://t.co/IhdKvQ9ey3", "So no ATP next week then... https://t.co/bWzk4wVqYo", "#blogready https://t.co/aMLUeBVdQY", "Axl Rose &amp; the Jing Jang Jong #ReplaceAFrontmanWithAxlRose", "RT @Skepta: NEW SKEPTA #Man \n\n#Konnichiwa the album May 6th. https://t.co/xS16MRQHLi", "Cannavaro as the new Leeds manager? Looks like more theatre at Elland Road next season then.", "Please visit https://t.co/RyzwTeukaG It's worth it", "So LCD covered Heroes at Coachella: https://t.co/qmzwtexLAE", "I got to speak to Soweto Kinch and write about music and self identity for the fantastic Barbican Music Box project https://t.co/ya3uZzSNbQ", "Yes to this DJ Shadow and Run The Jewels collaboration: https://t.co/vZJgUqgchL", "A special moment:Scott from Frightened Rabbit sang Keep Yourself Warm from the pulpit &amp; the whole crowd sang it back https://t.co/36P3aCEICZ", "@MattLangham I need to listen to that. Thanks for reminding me.", "Really excited to see Frightened Rabbit tonight. This new album is making my heart quiver in the same way Midnight Organ Fight did.", "I spoke to the wonderful Cate Le Bon for @diymagazine about Crab Day, BANANA! and comparing love to a coathanger https://t.co/m7QF88iCg9", "@katiesol I felt pretty ill after that tbf. I think McDonald's will be trying to understand a spike in sales in Hamburg too.", "@katiesol I had 35 over the weekend.", "Big Moon. Big fun. https://t.co/VMEY4vpt6i", "@gemtriesharder @katiesol Hahaha. That episode was so good.", "The Onion have gone too far this time. https://t.co/MoQ9acpxlx", "@katiesol Pressed enter too quickly there. I thought everyday meant run of the mill. And every day means happens every day.", "Seeing the Avalanches twice in a week will be nice, won't it?", "@AndrewAHannah It never gets old. Might listen to it again now actually.", "@eriktmpls Got it in one!", "My favourite ever album was released 11 years ago today.", "@basementfever I will see you at the gig though. It's been too long.", "@basementfever Just the gig I'm afraid. Got a footy match beforehand.", "@basementfever Hiya!", "He's right. I was there. Left footer into the top corner. https://t.co/yGrkcfynbS", "#NationalGrilledCheeseDay #NationalPetDay https://t.co/QZJGKsATSZ", "Also, decided I'm going to start a bad tribute act called Tim Heckler. Open for bookings immediately.", "Talked about Iceland and the 'starkly beautiful wilderness' in my review of Tim Hecker's new album for @diymagazine https://t.co/pFyGZgVy1R", "But seriously, think this is their best album yet so go and listen to it.", "Reviewed the ferociously brilliant Future of the Left album for @diymagazine, because of course I did: https://t.co/pj1FeBBrvR", "@harrietgibsone Can you change the date to May? https://t.co/n9ubLC4IPT", "@Tomas_Doyle Lana Jal Fre-zi? (sorry)", "If you only read one story today read this series of tweets by @JoshRaby - The Milkshake Story. https://t.co/wBbDU1X8X7", "@Dave_Rowlinson Sophtware Slump m8.", "@Dave_Rowlinson I'm sad I'm not going to be at this show.", "Remember when Boris Johnson said this about the 'heroic contribution' of the super rich? https://t.co/tVbbUyemBp https://t.co/Mx6pVEtlAi", "RIP Howard Marks https://t.co/VOXemMgXdq", "@JessPartridge @Dave_Rowlinson I think you and Brian need to sort this out between you.", "I'll also use this opportunity to apologise to the Hamburg taxi driver I insisted I sang Ocean Drive by the Lighthouse Family to last night", "Was having a great weekend until I found out Brian May claims he invented the term 'selfie stick'.", "RT @DaftLimmy: .@David_Cameron Yer da.", "Staying in a hostel in Hamburg that used to be a recording studio the Beatles played in https://t.co/ODCac9gwf4", "RT @johnprescott: When I met Damon Albarn I kept calling him Damian. #indieamnesty", "@Dave_Rowlinson Incredible times.", "Went on holiday to Norway with @Dave_Rowlinson two weeks ago. #indieamnesty", "I was waiting outside Woolworths before it opened to buy the debut Placebo album. The lady in the shop was very confused. #indieamnesty", "@mcandidate I bought the second album too. God.", "@williamggrant This can't be true", "RT @BRyderJones: Was in the coral #indieamnesty", "@MattLangham @gemtriesharder Really like the alliteration too", "I (whispers) had a signed copy of Up All Night. #indieamnesty", "Interviewed Dominic Masters from The Others. Said \"I really like the album\". #indieamnesty", "@Rarham @Dave_Rowlinson said that as well. Might have to visit.", "I'm off to Hamburg tomorrow for the weekend. All recommendations greatly appreciated.  (NB. It's my brother's stag do)", "@mrchristr I'm Wright and I'm right.", "DJ Trapped in a room with Jack Whitehall and the smell of mackerel  https://t.co/wDLmIuaQgY", "@Dave_Rowlinson @joeparry @gemtriesharder I did buy it. You can't say no.", "@Dave_Rowlinson @joeparry @gemtriesharder I bought that Bravery album to my shame. Still Honest Mistake was brilliant.", "Now waiting for the Landfill Indie revival.", "And, everyone's already mentioned it, but this: https://t.co/6MS5TuRPb0", "\"The entire trajectory of Razorlight might be a Freudian illumination of male sexual insecurity\" Borrell on top form https://t.co/l8RBHgm4o1", "@michelle_amaria such a snide MK", "@Tomas_Doyle I reckon it might be 'what's your favourite song off the album?'", "Music fact of the day: Tim Hecker quit Christianity following a sermon about God disapproving of jeans https://t.co/s7IUmSzum4", "I've got a new strike partner for tonight's game. https://t.co/2d3ogSqV5x", "I really like this song but am still slightly disappointed Jason McAteer and Robbie Fowler aren't in the band https://t.co/2OW4AWymYf", "@lisaannejenkins Thank you x", "The sun is shining. Listening to the summery Whitney album on my way to interview the band Whitney. A good Sunday.", "RT @CodPodPod: Is Danny Wright in prison yet? #GTFC", "I'm a man who divides opinions https://t.co/49uKZGJjmK", "RT @CalW12: Danny Wright is class", "What have I done? https://t.co/bZvmnt4PRm", "@gemtriesharder @JackMerlin And don't forget about Chris Martin.", "RT if you're listening to White Town - Your Woman on repeat and not watching Taylor Swift fall off a treadmill. #NewMusicFriday", "@strawlou I wanted to start a Rakes reunion story but not sure people care enough :(", "Has anyone done a Frank Ocean album April Fool's yet?", "RT @ftbllrswanimals: Joe Allen on the front cover of Chicken &amp; Egg magazine https://t.co/LuJNgrw0x4", "Finally saw Spotlight last night. Danny's film review: ***** depressing &amp; inspiring in equal measure.", "RT @Andr6wMale: #sadnessinhiseyes https://t.co/D9LkoFKom9", "GO READ: Explosions In the Sky. Me reviewing Suuns. And @michelle_amaria on diversity in the music industry. https://t.co/BogXXLwuZx", "Some very good words on music criticism by @ClashRobin https://t.co/f2qud8dyxT", "@katiesol @sammymaine Sadly it wasn't. Do you do that too Sammy?", "@emmaggarland That's OK - completely agree with your piece too. And we all know White Town - Your Woman is the best British song of all time", "@emmaggarland haha, thanks for featuring me ;)", "My favourite person I've met this year is the one who kept talking about memes but pronounced them Me Mes.", "'72 ways to talk about Carly Rae Jepsen' including 'the interrobang in a world of ellipses' https://t.co/vQquhUU9AT", "Are you a grammer pedent? This might be why https://t.co/LNfH5vnpks", "@chris_mandle Carly Rae Jepsen, the interrobang in a world of ellipses", "@emilyrocks Really?? Maybe their votes were more varied so it dropped songs down the list?", "Your boyfriend just voted for his top five British songs of all time https://t.co/JzhivWyxAJ", "@gemtriesharder They just said only London date I think", "@HuwNesbitt I mean it's not amazing but LCD, Skepta, Grimes, Little Simz - some pretty good stuff on there.", "Glastonbury 2016: some very good bands, some terrible design work. https://t.co/jBGGdpkfu2", "@Dave_Rowlinson I was just thinking exactly this", "Love this A.K. Paul track:\nhttps://t.co/J7ZZm1lc2X", "Bought an Odeon Limitless card this weekend and now plan to see every single film released in the next 12 months. Except Batman V Superman.", "That's a pretty, pretty, pretty good setlist. https://t.co/w70nCkfD0I", "Just went to see High Rise. It laboured its point at times but looked stunning. And the soundtrack was great.", "Behind the decks as @katiesol DJs at @sockformation's leaving party. https://t.co/DMFdwf7DKk", "@Banananey world love Kanye to be in goal in the second half tbf", "@AnantNaik You're in! Let's discuss it tonight", "My new band is called Michael Stipe's Beard https://t.co/n9X1e99MhF", "@katiesol add mitski and this to a Spotify playlist", "Douglas Coupland at the Whitechapel Gallery for Easter. Generation Eggs. @ Whitechapel Gallery https://t.co/6DTYv2OJ1l", "RIP Garry Shandling. The Larry Sanders Show was a brilliant, unique show ahead of its time.", "When will someone write a think piece on Willennials? https://t.co/zOMYoyC5AN", "The fact that he has his own turn says so much. Just one of the very best. https://t.co/k0GrO1TsQo", "Go and listen. It's very good. https://t.co/8VoR6ZHZTY", "Just watched this 79 times and my mood has improved 156% https://t.co/Xcqdk7kTZi", "Going to have to look up some more synonyms for 'dreamy' to describe new Whitney songs https://t.co/lkwxfJ2MtB", "RT @TheGreatHumbug: Manic Street Preachers tried to warn us, but we didn't listen... https://t.co/rmQmSLP4Fz", "While I was in Oslo we went to the Nobel Peace Center. This 1909 quote from Ernesto Moneta feels very relevant today https://t.co/ozcImfM15d", "@MichaelAHann Thanks to my dad taking me, mine was The Kinks.", "Happy birthday Damon. https://t.co/6XHKSzJGa1", "@alimkheraj this is brilliant, and glad to hear things are getting better", "I think @Dave_Rowlinson had a good day https://t.co/VEH7SqAkJi", "Today has been 10/10. Bergen to Oslo taking in fjords, snow-topped mountains &amp; eating hot dogs. https://t.co/8ZalgaRNhP", "Yes https://t.co/PILxEHPK4X", "@adm_bn it certainly is. And now I'm tweeting this from up in the air. Amazing scenes.", "Boarding the plane to Bergen and they're playing Beck's Morning. Good start to the holiday. #indieplane", "@strawlou Going to the strongrooms with Dave and Gem after work if you need a wine fix?", "@strawlou Hahaha. Love jammy dodgers, hate red wine? Love red wine, hate me?", "Drinking a glass of red wine and eating a Jammy Dodger. I think that just about sums me up.", "Who killed the music genre? A great piece by @Popjustice on the 'genre-less generation': https://t.co/0XJppKVX7w", "I mean, really, please don't do it, but I guessed someone would have already tried to.", "Now Radiohead are back, has anyone made The Life of Pablohoney mash up album?", "Just proofread @LondonInStereo with Jurassic World on in the background, so if there are any errors please blame dinosaurs &amp; terrible acting", "'This is what the Night Tube looks like with just clubs on'. Er, where's Rowans? https://t.co/Nqxk5HbqJc https://t.co/4jIImdhMbr", "@gemtriesharder @AndrewAHannah Let's do a podcast at TGE. Might watch the doc tonight actually.", "@michelle_amaria  Liverpool produces the best", "What a front page. https://t.co/wgB3ZL6ZGa", "RT @SimoneGiertz: I made a robot to help me argue on the internet https://t.co/NxpXhk0NMM", "beautifulweathertodaybeautifulweathertodaybeautifulweathertodaybeautifulweathertodaybeautifulweathertodaybeautifulweathertodaybeautifulweath", "@teletextpage152 And don't forget the store Woof Trade.", "Jodie is so cynical. https://t.co/gGva9yNOd8", "@emmaggarland Hahaha, this is bringing out the very best in people", "@fishplums Yep. I forgot to put the inverted commas on news there.", "News story of the day: East London fox 'tried to pull my trousers off' https://t.co/yGNkCFKrAM", "'Your 20s start out like a Tom Hanks movie, then the cracks start to appear' (Road to Perdition + Turner &amp; Hooch) https://t.co/i3jIU2ta89", "@katiesol do it!", "So the Drive Like Jehu ATP has moved venue to Victoria Warehouse in Manchester.", "@PhotoSonny Interesting. Did they say how they found new music?", "@JonCovell Haha, amazing", "In music news today... https://t.co/YafyYgy0f4", "@McCormickDaniel @ginandconnick I don't. https://t.co/PV8KlTS0QZ", "@McCormickDaniel @ginandconnick Do you own a 15\" canvas with your own face on?", "@McCormickDaniel @ginandconnick Oh. I'm out of the running then.", "@andywelch81 Bertie's voice went right through me unfortunately. Though definitely the most likeable character.", "@vndrlyl When he got angry about the girl not writing down his rubbish ideas in the script meeting I wanted to hit him.", "@McCormickDaniel That's very cheap", "@katiesol You kind of watch it on autopilot - it passes the time but not great by any stretch.", "Finished watching Love. Was I meant to hate Gus as much as I did? He was like a 2D Big Bang Theory character put through an indie filter.", "Which one of the three days at the Roundhouse will Radiohead play Creep?", "@gdpreston I would even go to Koko to watch him play that", "@ginandconnick It's a good template to follow.", "@Sophieg0ld_ I can completely understand that. I'm home alone so have locked all the doors and windows. That ending really freaked me out.", "I just watched Kill List for the first time so won't be sleeping at all for the next four months.", "@williamggrant stop trying to outdo Leeds", "Sun is shining. Animal Collective on. https://t.co/RfkqMvagME", "'It makes me feel physically sick ' Stewart Lee listening to \nThe Rise and Fall of Ziggy Stardust for the first time https://t.co/AgkGM5G9xo", ".@gemtriesharder introduced me to this today: putting 'Walk of Life' by Dire Straits over the ending of every film https://t.co/lqbFywzFOQ", "@timjboddy I'm so ill", "You'll often catch me wondering if 'Fight like me Da, as well' was an inspired ad-lib by B*Witched's Keavy Lynch or if it was always planned", "@gemtriesharder that's not bad!", "Here's a handy list of the worst MPs: https://t.co/ZVC1abUMgI", "@lhrlls Think it's steve.davis@technosnooker.org but not 100%", "@katiesol I will tell you all about it tonight", "@katiesol It will be like the Michael Jackson cape I made a couple of years ago.", "@katiesol You've done that yourself in Microsoft Paint haven't you?", "@lhrlls Can we get Steve Davis to interview Oneohtrix??", "@LucieGraces YES! And Liverpool v Man U is on so kind of match beers.", "Spend your lunch reading about Steve Davis' encyclopedic knowledge of techno and his DJ Thundermuscle set at Bloc https://t.co/vxYPQ60m5f", "@dandouglas Ah sorry, just agreed to buy two others. Thanks so much though!", "I will now be going to see Grimes. Thanks for all your support.", "@Twickets Thanks - I was too late though :(", "If anyone has a spare ticket or two for Grimes at Brixton tonight I would gladly buy them.", "Chairlift brought the tunes and a great light show with them tonight. https://t.co/F73saWnylB", "@timjboddy YES! Wetherspoons all day breakfast with extra bangers.", "@LukeTurnerEsq The whole album is incredible - but that's definitely the high point.", "Chairlift live tonight so Moth is currently on repeat. Can't wait to shimmy to this https://t.co/5Drmqy1H7T #shimmy", "The next poet laureate has been at work in Old Street station https://t.co/eg5FSV1YMa", "@musicfansmic Don't even want to click the link", "@Dave_Rowlinson I might do. It's the only thing I enjoy as much as being creative.", "I'll take it. Something about Game of Pricks? https://t.co/SJayqjRTPR", "RT @Herring1967: I am so tired. I've been doing this since 6am. Let me sleep idiots.", "@Dave_Rowlinson @Tomas_Doyle the worth of boast worlds.", "@Dave_Rowlinson I think you're right", "If you only have time to look at one bizarre stock photo today I would suggest this https://t.co/cRPTWLLfOw", "@andywelch81 You've just thrown away millions!", "AND STEWART LEE. What a line up.", "@AndrewAHannah I can't wait", "Does it get dreamier than Teenage Fanclub, Local Natives and Broken Social Scene?  https://t.co/dDFYvxdHXf", "Now Kanye has declared CDs dead, I can't wait for the 2019 CD revival when everyone fondly remembers them and says they always loved them.", "RT @BillOddie: SIA. Bet you've seen her, with the black and white hair? But have you heard her? Powerful powerful singer /songwriter. SIA.", "Yeah, my Sunday night thoughts are dull and about average Belgian footballers, what of it?", "Idle Sunday night thought: No one seems to say 'he's gone on a Bosman' anymore. Jean-Marc's legacy has already been lost.", "RT @TheToddWilliams: Okay, now he's gone too far https://t.co/DPM7mbpfVG", "Enjoying this https://t.co/aJgM4Oe3zb", "@katiesol stop subtweeting me", "@gemtriesharder Kendrick?", "NEW KENDRICK ALBUM. WHAT A FRIDAY. https://t.co/ATnrsqjiS3", "@joelgolby I think I may take the plunge this weekend", "Best ever #bbcqt audience question: 'Do the panel watch the Internet?'", "@melstarsg haha, very true.", "Whenever I'm looking for political insight I look to Jermaine Jenas.", "@wrongpop Yes very weird! And the acting is so odd.", "Just watched The Lobster. I think I would have chosen to be a Chaffinch. Or a Tibetan Wolf. One of the two.", "@stejvic WOW", "@sockformation I voted for the leader sorry", "@scotscribbler @diymagazine deal", "If anyone wants to fly me to NY to review this ... https://t.co/r6MqTlsvT5", "Sorry, I should have caveated that with 'if you want a really terrible joke that will ruin your business'", "@supermodernista Black heart? Brewdog??", "RT @theQuietus: Stewart Lee is \"in the same boat as everyone else\" about his ATP weekender: https://t.co/TMbmokNLcw https://t.co/Zi5O3JrOm1", "Great cover. https://t.co/mSW9t9VcDN", "New Mitski is very special https://t.co/jQOW2p9jbf", "@diymagazine It's not me, is it?", "RT @TheMichaelMoran: Taking no chances, the Aussies. https://t.co/P7fMSxTQOt", "@emmaggarland Congrats!", "Ah, he meant July 2016 https://t.co/CoZR9NmnLr", "So the Last of the Summer Wine &amp; Only Fools and Horses theme tunes are the joint 13th most popular funeral songs: https://t.co/QyES4jEGlP", "@joeparry I would have preferred him and Lee Chapman to have played tonight", "@joeparry Is this because Leeds lost 4-0?", "Everything about the cover of Ray Parlour's autobiography is perfect. https://t.co/xKMu0m1OBF", "@supermodernista @ginandconnick Haha, maybe this is a big performance art piece?", "@ginandconnick @supermodernista ATPeed off", "Instantly decided I want anyone except Arsenal to win the league now. https://t.co/emvPn4nVtN", "RT @Rattlehead81: His arrival was foretold in the ancient murals! https://t.co/Vfb1ptTAQg", "RT @richardajkeys: Turns out he's not such a bad guy - nor is Sepp!! #beINSports https://t.co/sxj2tRuIV5", "@McCormickDaniel @gemtriesharder ? https://t.co/dbgXN4fENg", "@McCormickDaniel I'm really not sure. It still keeps me awake at night.", "@McCormickDaniel Don't make me come over there McCormick", "@gemtriesharder I think you've beaten me there, tbf", "Spending these precious extra 24 hrs of 2016 by enjoying a dead leg, accidentally rubbing Deep Heat in my eye &amp; spilling tea on myself. HBU?", "RT @TransferSite: RKO! https://t.co/GCfcMsCRCV", "@timjboddy Haha, you're welcome!", "Just found out the original Bieber lyrics were \"Is it too late now to say sorry? cos I'm missing more than just @timjboddy\"", "@katiesol I've just listened to it ten times", "Daft Punk Unchained is definitely worth your time if you want a peek inside those robot masks:\nhttps://t.co/VLU025bu1Z", "@natashadaniels so good! Light show was unbelievable", "Have you ever seen John O'Shea and Paddy McGuinness in the same room?", "Every band featured on Soccer AM sound like they've been created from discarded scraps of the SHINE compliation CDs. https://t.co/3hfb60NOvK", "Jamie XXcellent https://t.co/BCrF8dgdJR", "@joeparry @michelle_amaria Don't worry about me - I just got home for the end of Pointless &amp; I'm eating a fishfinger sandwich. I'm beaming.", "@supermodernista @stephenackroyd @musicismyradar I was thinking Adele. Surely she deserves it?", "@michelle_amaria @joeparry your 4 exclamation points imply you think I'm serious????", "@joeparry @michelle_amaria you two guys are a bunch of jerks. I'm sad now", "@joeparry @michelle_amaria I'm watching you parry. I know it'll still be great. it's just... Such dull choices.", "@LucieGraceFace oh yeah, I always forget that bit", "The only thing more white and middle class than this line up is me.", "Muse AND Coldplay. Good god.", "Hoping for a steel drum extravaganza from Jamie xx tonight", "Zeroing in on my target market. https://t.co/wFxBHsEuaY", "NEW LONDON IN STEREO KLAXON. (In which I review the new, and possibly final, Iggy Pop album.) https://t.co/2NZ4cXUolT", "@MattLangham It's actually BOGOF", "Just saw a guy having a pack of Space Raiders for breakfast in Shoreditch, and now I have a new life coach.", "Here's an almost indecipherable clue about where @Dave_Rowlinson, @JessPartridge &amp; I have booked to visit next month https://t.co/T7g7f3JOne", "Mothers were very, very good tonight. https://t.co/iaPThi2hgT", "@nickw84 Haha, that might be the most Craig David thing I've ever seen", "@stejvic @sockformation @charmada I'm furious over here.", "Can't wait for Craig David at The Great Escape. #eatcleantraindirty", "RT @teletextpage152: Nominative Determinism strikes again. https://t.co/ftiNQmqT6Z", "@gemtriesharder You're thinking of 'poor content'", "I never thought I had anything in common with Michael Gove but I too hate quiche.", "@Wolf_of_Gwladys I stand by the fact I think it's a great album", "@gemtriesharder A rough translation of the album title. (I just read the press release.)", "New Japan-inspired Gold Panda is very good: https://t.co/9P8sjYs5so", "@gemtriesharder Ganbatte, kudasai", "RT @XANAXKARDASHIAN: Drake in every music video https://t.co/VRaUQ8p8UZ", "All Saints haven't lost it then https://t.co/sqO5lkQb9l", "@AnnaHMeredith haha, thank you for helping me follow my dreams", "If I ever fulfill my dream of becoming a pro wrestler, Nautilus by @AnnaHMeredith will be my entrance music https://t.co/GWL8CXLbU4", "@fooishbar I hate Paul Merson", "@katiesol You made me remember this https://t.co/AmmaNNqIpt", "If Monday was a free kick https://t.co/aqzbVjm9bS", "@katiesol NOOOO! He's exactly the person I want to avoid", "@katiesol I feel like I saw All Saints live on Saturday night. And I don't like Little Mix *runs and hides*", "@katiesol Can I just arrive for the headliners and leave straight after?", "If you meet me, please say this to me https://t.co/KdUNOBFRiO", "@mrchristr \"There wasn't anybody who wouldn't say 'that's OK'\"", "@AndrewAHannah Definitely. I remember buying them and thinking they were the oddest and most amazing records I'd ever heard.", "Richard Ayoade on Time Trumpet talking about music in the early 2000s. Could be about any period of music really: https://t.co/QzbJovTtxE", "For all those people who've been waiting to see Drake perform Hotline Bling at a Bat Mitzvah, the moment has arrived https://t.co/UrPmMuejnt", "RT @timchipping: I'm worried about Iain Duncan Smith's wave. https://t.co/nw50QOJPxn", "@Dave_Rowlinson King Damon https://t.co/9ovIPVUc5i", "@katiesol I just had the best bloody nap", "As this album was released ten years ago today, a great excuse to share this beautiful song by Liars https://t.co/FjD6VJoJMD", "RT @joemuggs: Thankyou @TechnoDads for bringing this into my life. https://t.co/sveOGxryXq", "Getting the Saturday party started by playing EL VY at the wrong speed. Think I'm on to something. https://t.co/aaMR4TdotD", "RT @EamoV1: when i close my eyes this is all i see https://t.co/TxB7jKKThR", "Going to karaoke tonight. Really hope they've updated it this week so I can do 'I Miss The Old Kanye'.", "@emilyrocks so good hey?", "RT @Classic_picx: Kurt Cobain would have turned 49 today. He's pictured here with the rest of Nirvana in 1993. https://t.co/B6L7eEFCj0", "Going to add 'listening to Teenage Fanclub on the bus' to my list of hobbies.", "Me, leaving work right now https://t.co/h8S7ceAK81", "@katiesol deal. Such a great line up.", "@katiesol Pitchfork festival!", "And now a beautiful new song from Bat For Lashes too https://t.co/TlfA4DRsuN", "@katiesol She should work with Sigur Ros.", "@katiesol Take it you've heard this before? https://t.co/gOmGSkEpqd", "Friday Frightened Rabbit day. New song - Death Dream https://t.co/G4j0uq7Zhs", "Lou Reed and Elvis Presley rubbing sholuders with Kevin Federline and Nickelback https://t.co/aigrNhu9Jz", "Really 'digging' this new Holy Fuck song. Reminds me a little of Liars, which is always a good thing: https://t.co/WPdbY9JeCS", "@paulbridgewater Haha, I did not know that. Amazing. But very sad I can no longer buy any.", "@matthewjh  \"Now that's settled then, fuck off.\" is an amazing way to sign off.", "@gemtriesharder OK, that's quite good.", "One of the best things from Vic and Bob's show on Tuesday was remembering Geordie Jeans: https://t.co/qzqiiKy0GI", "Humans are rubbish #133673: 'Dolphin Dies Being Passed Around For Selfies' https://t.co/RTpymqLYZq", "You can now read Panda Bear telling me \"We wanted to make music that sounded like cavemen\" online https://t.co/4muhFNVQET", "@joeparry @chris_mandle Raffles = ROFLs (don't actually know what I'm saying)", "Ratboy definitely looks like a character from Neighbours. https://t.co/WD349fIbxU", "@gemtriesharder Yes! Bollards! Stairwells! Also loved the Geordie Jeans video.", "I can now say I've beckoned down the Dove from Above. All is ok with the world.", "It's nearly time https://t.co/OzIzjnQb1H", "Really on board with this: 'We Must Stop James Franco' https://t.co/CBT6PuWrOh", "@timjboddy @joeparry Smoulder Wolf is my secret name for you Joe.", "Me IRL https://t.co/vtT7jSU6Fe", "@michelle_amaria 'Shall we go to In N Out?'", "Coldplay headlining Glastonbury. A song and an album from 2014 winning Grammys for best of the year. What is progress?", "@michelle_amaria And now Coldplay headlining Glasto again. Bloody hell.", "Just said this when I came in to work this morning. https://t.co/3VzsSOVWAK", "RT @Seinfeld2000: I Love Seinye\nhttps://t.co/ZFgzv13PDK", "Oh... https://t.co/fg0K8s6naV", "@katiesol (I have no idea what it means) And now I do it's gross: https://t.co/kXWTFplU49", "@katiesol Bit disappointed you didn't know what hyperkeratosistic meant tbh", "@sophiepenrose Just a stream of the record - I'm reviewing it. (spoiler alert: it's really good!)", "Currently listening to a new Iggy Pop track called Sunday. And it's Sunday. #mindblown", "@S83bai Oh it's real https://t.co/zXXZ9b70sz", "https://t.co/3Nwa2Fs5zm", "ICYMI: Last night on Lip Sync Battle it was Johnny Vegas vs Vic Reeves and Johnny did I Can't Feel My Face: https://t.co/k7hnVeI1MX", "Your Friday hero everyone https://t.co/6Mczrys5hN", "My dreams are coming true. https://t.co/3YeU6vqZzf", "@harrietgibsone So good. You going to the Moth show?", "Can't wait for next week. https://t.co/Pi0bqWc2f4", "@matthewjh That's my worst nightmare. I feel your pain.", "One of my favourite Kanye quotes and photos. https://t.co/J2UZEWlgVi", "King of the trolls https://t.co/hNtLbLZ1v0", "Remembering this from Clickhole https://t.co/nLlzpzSjgQ", "What's going on? https://t.co/nTGTrPzllO", "RT @JamesBlunt: I'm officially handing over my Cockney Rhyming title to @Jeremy_Hunt", "Sad? Just remember the world is 4.543 billion years old &amp; you managed to exist at the same time as the selfie spoon https://t.co/fXi9DTDye1", "RT @AbeBroman: https://t.co/uWy8L7mMKv", "@MattLangham Hey! Not all of them are shitty.", "Field Music were exquisite last night at Rough Trade. So tight live. And a great cardigan. https://t.co/2E5VHcTqYa", "@mrchristr Was just thinking the same", "How are YOU going to build up your personal brand TODAY?", "Someone please buy me this. Thanks. https://t.co/BG4yyUkGtX https://t.co/2IOkd6XM3G", "@MichaelCragg Glad she highlighted the word 'truth' there", "@katiesol Ah, DB. Seventh most googled musician in the UK last year. Was that just you?", "@katiesol What does it measure on the emotional richter scale?", "RT @sanglesey: Brilliant reason for being unable to play in a Scottish Cup game https://t.co/cLypq6r3rp", "It's #twogigWednesday: first up Field Music and then MMoths. Not bad at all.", "@Laura_Scott Oh wow - that sounds amazing! Even better than an LCD gig...", "@stejvic WOW! Love the Leadmill.", "Caught By The River Thames festival ticks a lot of boxes: Low, Super Furry Animals... and Chris Packham: https://t.co/HC2x7VEltG", "Harry Hill on \"the dance of love and how marriage - and babies - ripen\" is very good: https://t.co/oTUGWHLIls", "@Laura_Scott Ah rubbish. Can you not make Lovebox? How long is racing season?", "How long before he says he's been hacked? https://t.co/VYDV2a1gq9", "@Dave_Rowlinson @basementfever come on lads.", "Just found out Daniel Bedingfield was the seventh most googled musician in the UK last year.", "This is really great: the first single from Let's Eat Grandma - Deep Six Textbook https://t.co/WagagdLru7", "My summer plans so far just seem to be me chasing LCD around the continent.", "\"A lot of this album was created eating Yoshinoya\" I love To Pimp A Butterfly even more after this oral history: https://t.co/xcYnlGWFmb", "@hayleycampbell I can never get that to work.", "Look! It's the 'rejects' @sockformation and @AnantNaik starring in Time Out https://t.co/jQ1zGUcpUg", "@gemtriesharder @JessPartridge will be happy", "@sockformation Dotori?", "This seems to be a running theme with Coldplay https://t.co/O2c4EXLswn", "@PhotoSonny @laurendown Get ovary it. (sorry)", "\"The Swiss city of Lausanne has banned outdoor silent discos, saying that they are too noisy.\" https://t.co/3Vw01M9AQK", "@gemtriesharder @katiesol Donald Trump, Chris Brown and Arnie for me.", "@katiesol @gemtriesharder I was imagining Vic Reeves saying it in the ERANU voice", "@gemtriesharder @katiesol Solomars would be a good surname", "Fair play, good pun. https://t.co/M5CLuR20el", "Remember when we just used to choose our friends based on their Klout score?", "@gemtriesharder @Dave_Rowlinson er guys, it's Four Thousand Seven Hundred and Sixty-Six Seconds", "@williamggrant @thepigeonpost can't believe your number 17 scored", "@S83bai words AND friends", ".@Dave_Rowlinson just played the word LOLZ in our Words With Friends game. I think I'm done, guys.", "@katiesol @gemtriesharder And Archer", "@LucieGraceFace it is, in fact, a truth!", "Because she gave it away for free, maybe? https://t.co/wnABqiotV5", "Just found out !!! are supporting themselves on tour, doing Stereolab covers and calling themselves Stereolad. #ladsladslads", "@harrietgibsone Wow, that's certainly a song title to conjure with.", "@cduncan86 What a goal. What a team. I've just let it play on and got all the 99/00 season highlights. Now feeling nostalgic and sad.", "Definitely my favourite ever passage of football https://t.co/HN98jvrzSx", "Great times. So full. https://t.co/Fh9fpZlDva", "JOHNNY BORRELL ON 'THIS WEEK' KLAXON", "@ginandconnick @JessPartridge @bearcavingamy @Dave_Rowlinson Crust Fund", "@gemtriesharder Rick's got more important things to do than make some Pad Thai.", "Should have said I was tongue thai-d there, shouldn't I?", "Today @gemtriesharder suggested a Shed Seven themed restaurant called Maximum Thai. There are no words.", "You can watch every single episode of '120 Minutes' on this site:\nhttps://t.co/5VJYz1ihCw", "Having far too much fun on this site https://t.co/VKiyqpIx3p https://t.co/DBqIFCR8Fg", "Only at Leeds (number 1,459695) #lufc https://t.co/5u0fXtpAvE", "Working on my Alan-Partridge-as-a-music-journalist  shtick", "A lot of people ask me what type of music I like. And the answer I give them is always the same. 'I just like great music.'", "Best new music: Kazoo Kid (Trap remix) https://t.co/aSZSIjNoVg", "@katiesol @MattLangham I'm not sure that proves he's good.", "@gemtriesharder Just Googled ska punk bands and they had the funniest name. https://t.co/6ibSQ2tCWu", "@gemtriesharder I know for a fact you love Big D and the Kids Table", "@McCormickDaniel Think you'd love them tbh", "Is there a more off-putting phrase in music than 'guitar virtuoso'?", "@katiesol @PracticeUK Goddammit. And You Will Know Us By the Rail of Dead?", "@katiesol Train", "@McCormickDaniel Peak DMc tweet that.", "@williamggrant All Saints and who else?", "@danielross85 I like how it feels their sound is slowly disintegrating into these weird, amazing noises album by album", "#BatmanvSuperman doesn't look quite as dark and gritty as I thought it would https://t.co/iIqzq1FUcb", "New Cat's Eyes reminds me a little of Magnetic Fields which is a very good thing https://t.co/I8QTX04bUx", "@_rachelgrace haha, no worries. Think I was on another planet", "@katiesol What was the top answer?", "@StephanieFlooks haha, I saw. I couldn't make the shoot :(", "Just look at that. https://t.co/KU4RP1VeqA", "Happy Groundhog Day https://t.co/0dT6w9wDQH", "RT @joshgondelman: In honor of the 20th anniversary of \"Infinite Jest,\" I will pretend to have read everyone's \"Infinite Jest\" tweets.", "Can't stop thinking about the woman on Take Me Out on Saturday who said she dipped chicken nuggets in her porridge for breakfast.", "@LondonInStereo In Finsbury Park. By my house.", "@LondonInStereo Bedford Tavern please", "@Wolf_of_Gwladys Ah! The magic ingredient.", "How did Jim White and a tie become a thing??", "Just remembering how much I love this song https://t.co/uxeIZhQyYe", "RT @KagroX: The Republicans haven't got a single candidate who could survive a Willie Wonka factory tour.", "Friday, mate https://t.co/OawZzXKVgg", "My current favourite song now has a video: No Crying In Baseball by Mothers - https://t.co/hI7de8j4bi", "New @diymagazine: I spoke to Chairlift and tried to find some words to pay tribute to Bowie. https://t.co/SNFQCfNahZ https://t.co/iVMpmOhP70", "We talked about cavemen, cubism and pop-up books. And @lucytakesphotos did some amazing work with the photos.", "I spoke to the incredible Animal Collective for the cover of the brand new @LondonInStereo https://t.co/sEzKybtclv https://t.co/XrTRW1n9aE", "@curlywand @NIKEiD They're great.", "So, I'm getting the train back from Primavera to London. Could be interesting.", "Happy birthday Joey Fatone Jr!", "@basementfever @michelle_amaria Macklemore vs Iggy Azalea?", "@adm_bn @michelle_amaria Apparently - for a few years. But can't find anything about it online really. https://t.co/BJoLo5Pgrd", "@michelle_amaria Oh yeah, that was big. Punches and everything. Can never imagine Kele and Simon Amstell dating either.", "@MattLangham You've got yourself a feature.", "RT @a_cochran: This guy is having the worst day https://t.co/r8Ab9ponP8", "This new Massive Attack song sounds like most Massive Attack songs but it's still pretty great https://t.co/In4tvNUG5N", "@Dave_Rowlinson Don't stop believing Dave", "Oh, to be this happy in January https://t.co/GNSmDyroXj", "@kashnaik But also: point taken.", "@kashnaik And that is why Queen are the worst band in the history of the world.", "@gemtriesharder Who?? Too young to remember either of those sry.", "https://t.co/nOBAZD9rQf", "@katiesol @usuckclub @sammymaine 'Guaranteed'?", "Think when Rihanna comes up with actual lyrics for Work it'll be great.", "@mrchristr @aimilewis1 Yeah, congrats (also: can I come to Roskilde please?)", "Has anyone ever resigned from their job using the Notes function on their phone? https://t.co/FbKclxUhtI", "@Getintothis Only a couple of hours ago I think. SO good live - makes me even more excited about Primavera.", "I love Suuns. And Suuns have got an awesome new song to listen to: https://t.co/ERnyiZQpBi", "@michelle_amaria That quote can't be real?! Really?", "Looks like I'll be going to Lovebox for the first time then.", "@AdamBuxton how about using the premium jars for discarded tea bags? https://t.co/1tlG6o8K6r", "Never thought I'd get to see Harry Hill singing the Chucklevision theme tune while spelling out Boko Haram with his body, but now I have.", "@MinnieVaughan Oh god", "Huge if true: A protester is accusing Ted Cruz of liking Nickelback https://t.co/IkXvogYN1C", "Can't believe Kanye's cover of 'Bohemian Rhapsody' didn't make it on to SWISH.", "@RichCosens Complimentary Kit-Kat, sir?", "I get to see Harry Hill live for the first ever time tonight @TheInvisibleDot's 25th birthday bash. I'm very excited.", "@Dave_Rowlinson Amazing.", "A fitting tribute to one of my favourite Eastenders characters. https://t.co/uGgOTTgPSb", "@paulbridgewater every single word is perfect", "#Headlineoftheday: Drive-by yoghurt attack on crochet teacher's haberdashery leaves her shaken https://t.co/j9Ng3NHgIU via @paulbridgewater", "This beautfiully hazy new song by Whitney is perfect for a lazy Sunday morning https://t.co/zI7CtiFk5B", "RT @NickMiller79: Quite worried about Steve McClaren https://t.co/8DUrBTnD8b", "@SimoneSkilbeck @StephanieFlooks @gemtriesharder I just don't like them. I'm not going to stand in the way of your enjoyment  though.", "@gemtriesharder @StephanieFlooks If there's nothing else on I'll come and heckle.", "@Dave_Rowlinson I feel even worse that I didn't meet you for lunch now.", "Welcome back, PJ Harvey. https://t.co/kZFSpVz46w", "@SimoneSkilbeck @Dave_Rowlinson You really do love Rick don't you? ;) I've no idea. I really want it to be true.", "@alcxxk Yeah, that was definitely the worst one. Springsteen one is great though.", "Love this: Bowie doing spot on imitations of Springsteen, Iggy Pop, Tom Waits &amp; Lou Reed singing Absolute Beginners https://t.co/7jOlm9GjdI", "@gemtriesharder @Dave_Rowlinson Thanks guys.", "Sorry everyone. https://t.co/skjF2MA0Ji", "RT @TheAnimalVines: Cat realizes the horrible mistake it has made. https://t.co/JhjZ4Tcomn", "Thanks to @RickSkilbeck just seen that Society Fun Lie are high up on the bill. Which is an anagram of Since I Left You. Avalanches?", "@adm_bn @stejvic @MattLangham But, Brian Wilson doing Pet Sounds! &amp; Animal Collective would headline most fests. I'm just excited I think", "@adm_bn @MattLangham The whole line up is amazing though right? Can't think they'll be anything to touch it.", "@CitizenMeh Just got my ticket. SO GOOD.", "@sockformation You do have to come - not far from Lisbon really?", "And Shellac are playing. Who would have guessed that?", "@sockformation Just one of the best things I've seen.", "LCD. Radiohead. Not too shabby  https://t.co/cbdVTHdhnl", "Who would come to my and @gemtriesharder's club night where we just play The Rakes' 'Work, Work, Work (Pub, Club, Sleep)' on repeat?", "Thanks to my Dad, The Kinks at Southport Theatre was my first ever gig.", "Enjoyed reading this: How we made Waterloo Sunset with Ray Davies https://t.co/33mXFt9W3B #bestnewmusic", "@mattwilde81 Yeah I only started last night and am 6 episodes in already.", "@JamesBarker82 yeah in addicted already. Might have to take tomorrow off.", "I'm watching a new show called Making A Murderer. Anyone heard of it?", "@ellieellieellie @granitetide @sockformation @hatwell I've always used a spoon. This has changed my world view.", "New Kendrick-featuring Kanye is good #musicreviews https://t.co/UZ2arkxGjp", "@michelle_amaria You're an MK Don.", "RT @Telegraph: Jeremy Corbyn won't name his cat and instead simply calls it 'the cat' https://t.co/BFkbH8Cbze https://t.co/HKJcLb5Swv", "Studio Brussels have officially registered a new star constellation for Bowie and you can add your favourite song https://t.co/N0pgUcJO7X", "Alan Shearer is sat next to Ed Sheeran at St James' Park. Can you imagine how dull the conversations will be?", "Best thing I've heard in the queue for the Bowie night so far. \"I hope they play 'Waiting for my man\"", "Tonight I'm going to a Bowie club night with lots of my best friends. I apologise in advance for any #lyrictweets", "Wolf Parade officially back and playing London in June. I'm off to listen to Apologies to the Queen Mary on repeat. https://t.co/aItSa7620N", "\"A touching example of the kindness and selflessness you can find in nature...what. God. Oh god no.\" https://t.co/SSshnALIzP", "RT @psmith: *** PEAK TELEGRAPH REACHED *** https://t.co/gfirfbrS6c https://t.co/jrzgqMm0Sj", "@Wolf_of_Gwladys Yeah, he used to play there but was too skillful (and made too many mistakes) so now plays right mid/wing.", "@Wolf_of_Gwladys He's good,, if a little lightweight. Definitely not a right back though.", "What year have I woken up in? https://t.co/t67Yp3Sojn", "A touching NME cover this week https://t.co/dsBdFxyxgC", "Oooh, some good news. It looks like Wolf Parade are coming back https://t.co/JhaXJSrsTV (via @JackMerlin)", "@JackMerlin This makes me very happy", "Hey, all north London dwelling, ice skating Bowie fans - this is perfect for you https://t.co/nNj94qhwmP", "RT @0point5twins: According to its film certification, Home Alone is \"Parental Guidance\", but if anything it seems like the opposite.", "@MattLangham @gemtriesharder I was going to put a winky face at the end of my last tweet.", "@sankles Raunchy, Steinbeck/1930s reworking of Friends?", "@MattLangham @gemtriesharder my DJ sets are pretty legendary.", "@gemtriesharder So, so good. Next DJ set will just be that.", "You can now hear my favourite song off the new Chairlift record. It's called 'Moth To The Flame' https://t.co/5Drmqy1H7T #banger", "RT @ben_machell: To be fair it sounds like he was  https://t.co/21KT2iwqPy", "RT @WWEUK: Ahead of the show, @MilesKaneMusic met with #NXTChampion @wwebalor at the @ssearena\n\n#NXTTakeOverLondon https://t.co/mWedT0Ukh7", "Members of The National and Beirut have a band called LNZNDRF and this sounds like a great, lost New Order song: https://t.co/jWENnLndkc", "RT @chazrf: https://t.co/mVSMllCXvI", "MPs have spoken. England now has a new national anthem. Ladies and gentleman, I give you Vanilla - 'No Way, No Way' https://t.co/xam2NX9VeC", "@HanrattyDave Yeah doesn't build up in their usual style but it's made me really intrigued about the album.", "A touching (and funny) Bowie tribute from TV On The Radio: https://t.co/6pVhNbSEMk", "@sockformation @vndrlyl @bloatyhead I'd be pretty happy with that", "@LucieGraceFace BOOM", "@LucieGraceFace I don't know Lucie. What's white, black and red all over?", "@timjboddy Making the jokes better. They're awful. PS Q: Who is a Penguin's favourite pop star? A: Seal.", "Dream job: writing the jokes on the back of the Penguin bar wrappers.", "@michelle_amaria https://t.co/ClV3rEHFvt", "Bowie currently at 1, 2, 3, 6, 7, 10, 16, 17, 21, 23, 24, 28, 30, 34, 39, 42, 46, 53 &amp; 54 in the iTunes chart.", "RT @LukeTurnerEsq: Also, @juderogers informs me that the last account David Bowie's Twitter feed followed was God. Amazing.", "EL VY cover Let's Dance live in tribute to David Bowie https://t.co/NQTEIBjcjE", "New Explosions In The Sky reminds me a little of Battles and early Foals. And I like it. https://t.co/abtlDyzFAa", "ICYMI", "@gemtriesharder told you!", "Just watching Five Years and remembering what an amazing song Speed of Life is https://t.co/fqX0jpt7PU", "Tomorrow's Guardian. https://t.co/mzZN2Vboin", "Heaven loves ya. The skies part for ya. https://t.co/BGWZnHl4l2", "@Dave_Rowlinson A very good decision.", "Why would you bother writing this today? Why? (I know the answer's 'because you're Julie Burchill' but still) https://t.co/DoWA9yDNvE", "RT @emilyeavis: The best performance the Pyramid has seen https://t.co/bejHki7drx", "As long as there's sun\nAs long as there's rain\nAs long as there's fire\nAs long as there's me\nAs long as there's you\n#Bowie", "Just thinking about how ill he must have been and the strength it would have taken just to make Blackstar - never mind how exceptional it is", "Let's just all listen to every Bowie album today and celebrate the fact that he was the very best. Devastating news.", "Last Shadow Puppets have been shopping in the Sports Direct sale https://t.co/AOxmhLg2mA", "Love this b-side to Meilyr Jones' How To Recognise A Work of Art https://t.co/iLmR0rS6z3 (via @MattLangham)", "RT @StefSimanowitz: Cameron is a pie goes viral #cameronisapie https://t.co/KPtYhi0t6p", "This new Animal Collective album is basically the album I've always wanted them to make.", "RT @TriciaLockwood: Just discovered this stunning short story in my drafts http://t.co/T4RPbUjr3R", "Three brilliant hours of Stewart Lee at the Southbank last night. \"James Corden liking me? That's like a dog listening to classical music.\"", "Best new music. Best new song title. Childbirth - 'Siri, Open Tinder' https://t.co/SDhVFHhrn9 (via @sawn_off)", "@matildaledwards Haha. No - I just really don't like Muse. Think the other ones sound interesting (there's a Blur one!)", "Happy birthday Sean Paul!", "@timjboddy @vndrlyl Luckily my worst one is just nodding like a dog all the way through so I can't see that when I'm transcribing.", "Just when I thought 2016 was going well I have to transcribe something and listen to my own voice.", "RT @AmazonUK: White Toilet Brush And Holder... https://t.co/qltURYWiJH #AmazonReviews https://t.co/LsYd3cLPlw", "@john_freeman_ Yeah I had a quick chat with her last night and she was lovely. They were great - Manchester will be ace.", "Dilly Dally were blisteringly good last night. Here's my @guardianmusic review: https://t.co/zgDrWIsrN6", "How to ruin your child's life https://t.co/QsLcQLawdZ", "Happy 69th birthday Dave. https://t.co/xVAxGzkiep", "New Yeasayer. Yay!sayer, more like. https://t.co/BdU9RA4usb", "@gemtriesharder Heard it now. Good describing.", "@JackWilson89 I'm going to see Dilly Dally tonight who sound a bit like the Pixies", "@chris_mandle Fork My Lunch?", "@gemtriesharder Mike", "@gemtriesharder Gotcha", "@gemtriesharder #musicjournalism - I can hear it in my head already", "RT @phlaimeaux: most specific fancy dress shop ever https://t.co/B1OEZ8H6zo", "@gemtriesharder Can't open Spotify at work :(", "@joeparry Hiya", "Watching this Sufjan-soundtracked video of last year's @EOTR fest is making me so excited to do it all again in 2016 https://t.co/SgtEbVrdkl", "I listened to the David Bowie album and wrote this review for @diymagazine https://t.co/vNAG3VeHbW", "And there's nowhere for me to put my Ginsters pasty, is what I'm trying to say.", "The fridge at work is like a giant Jenga game of salad-containing Tupperware boxes. #January", "Well, my year has been made already... https://t.co/NQr4VqHRWJ", "\"Thousands are watching a livestream of a puddle in Newcastle.\" So many football jokes. #lads", "@ChristinaMcMc Easter starts earlier every year. Looking forward to the John Lewis Easter ad though.", "@gemtriesharder I might set up a bot that sends the Creep tweet to all Radiohead fans and see if one explodes.", "@gemtriesharder I've seen Radiohead do Creep live and that's their best song so... #trolling", "@gemtriesharder I'm not. I'm using the internet to state my opinion. That is my right goddamit.", "@gemtriesharder Take Radiohead off that list and you have yourself a winner.", "@coralamberrr Eugh. Surely we're a few years away from most people owning wireless headphones?", "@coralamberrr WHAT?", "'What?! No Cut Your Hair?' I picked my ten of the best Pavement songs for @guardianmusic https://t.co/8AdzrkAfb2", "@katiesol Thgt u knew about tech stuff m9", "@katiesol https://t.co/BBcng7NJtf", "He seems so heartfelt and genuine in everything he does you have to believe the next record is going to be great.", "James Murphy explains LCD reunion in detail: \"If you feel betrayed, then i completely understand that.\" https://t.co/qWtFkbGZrM", "@katiesol @chris_mandle I only use theTwitter app so can't do it", "@katiesol @chris_mandle *muted*", "@gemtriesharder Are these your three Sounds of 2016?", "@andywelch81 @harrietgibsone Can't wait for this!", "@gemtriesharder Best kind of chat tbh", "@gemtriesharder Don't really like how they haven't bolded the articles.", "@StephanieFlooks But... how did you know?", "LCD and Sufjan on one day? Get me to Coachella. https://t.co/GTgpy4Jxmk", "Next series of The Thick of It is reality TV. https://t.co/Bh0NJAVtfa", "@merlinjobst @katiesol He only starts on Wednesday. We were just having a chat about our plans.", "@katiesol @merlinjobst Oh that guy, he's just a man I've paid to follow Merlin around.", "@Andr6wMale Thought this might help https://t.co/UonrpJ000f", "@sockformation That sounds awesome! Congrats. Such a beautiful city.", ".@LondonInstereo have made your Monday a little brighter by putting their New Sounds for 2016 playlist up: https://t.co/a5aPNQhJqw", "Love January when all the predicted Oscar winning films come out at the cinema. Spotlight, Room, Joy, Dirty Grandpa...", "Just watched Still Alice and now I'm an emotional wreck.", "@joeparry @katiesol SO good. How did you get them??", "@ginandconnick I just want them to play Primavera. And tne inaugural DannyWrightFest in Finsbury Park.", "Oh and they've signed a lucrative, multi-million dollar offer with AEG Live.", "More LCD news: they'll 'headline several other prominent music festivals across the US, the UK, and Europe'. https://t.co/9JNfsEHEBk", "The 'skill' of pretending to play the saxophone. Reckon I could do that. #takemeout", "Thanks for all the kind words about this guys.", "'Morning Fatso, happy new year.' Matt Berry does Happy new you: https://t.co/kOnb5y1k56", "@MusicGob Thanks! Glad you like it.", "@AndrewAHannah Cheers man! Was a bit nervous about putting it up but resolutions and all that.", "According to Medium it takes 8 minutes to read, so even if you hate it you haven't wasted much of your day.", "If you're into depressing but hopeful short stories, I've written this. It's called Filters. https://t.co/HA7AjIihL3", "RT @colmtobin: Eleanor Rigby, \nTweeted a selfie at 7pm, New Years Day,\nNobody faved.", "I just had my first bath in two years, and listened to Joanna Newsom, so I've basically nailed all my resolutions already.", "All I want for 2016 is for a new LCD Soundsystem album, world peace and assistant referees to give the benefit of the doubt to the attacker.", "@sophiegold_ happy new year btw", "@sophiegold_ didn't mean to 'like' that", "@basementfever herbs, peppers and mushrooms - I think you'd like it", "@stejvic @katiesol herbs, peppers and mushrooms ffs. Going out with a bang", "Someone's just phoned into the local radio station to tell the DJ what's on her 'New Year's Eve' pizza.", "Excited to head to the last ever night at @thekazimier tonight. Going to be a pretty special way to see in 2016.", "@gemtriesharder This is Happening. (I don't know)", "@gemtriesharder LCD Soundsystem?", "Brass Eye or real life? Jedward are standing up to terrorism with a tour of airports: \"Everything will be okay\" https://t.co/xwJpbyeXTy", "@michelle_amaria Spotify has just told me that you were listening to Freak Me by Another Level at 3am. Well played.", "@Shinybiscuit Just subscribed to it :)", "RT @FACTmag: Hear a clip from Run The Jewels 3: https://t.co/Y85n0Jg7Sd https://t.co/C2BbxnDJ71", "@PhotoSonny they're Giant er... OH GOD NO", "Great diagram showing Indonesia is planning a prison surrounded by crocodiles &amp; piranhas. https://t.co/F8Alb4qRtG https://t.co/lb5A9hpOw7", "@danieljharvey WOW", "@NatashaHeasman Good point, well made. And going on past form you will save a LOT of money.", "@NatashaHeasman dry January? Hahahahahaha", "@michelle_amaria @McCormickDaniel put that on a tshirt", "@McCormickDaniel @michelle_amaria I'm using my family as a content farm", "@michelle_amaria @McCormickDaniel wasn't making a judgement call. Merely an observation", "@michelle_amaria @McCormickDaniel feel like Michelle might not have spoken to her family the whole time", "Van Gaal went with Ocean Colour Scene https://t.co/bkINgFR2qR https://t.co/58yG3tOFZN", "RT @ilikemints: did... did a rottweiler write this http://t.co/cmK7icX2J7", "RT @themichaelowen: Christmas is underrated. Best day of the year by far. #Family", "@katiesol @gemtriesharder @MattLangham WHAT", "@gemtriesharder haha, yes. Just joking with you.", "@gemtriesharder you've just told all your followers...", "@rey_z @Dave_Rowlinson can't wait for 2k16. Got some great content planned", "@timjonze hook?", "@Dave_Rowlinson it's mad! The families are loving it here though.", "@rey_z @Dave_Rowlinson oh god!", "@vndrlyl @Dave_Rowlinson been laughing for about half an hour.", "The one day of the year when I regret only owning tight jeans and not a pair of stretchy velour sweat pants.", "And they're playing Coachella. Omg. https://t.co/6dy2SAI6pn", "All I asked for for Christmas was an amazing new depressing LCD Soundsystem Christmas song tbh", "MERRY CHRISTMAS, THERE'S A NEW LCD SOUNDSYSTEM SONG  https://t.co/hYbT0P1xXX", "@Dave_Rowlinson Not very much, considering it was his specialist subject on Mastermind. Pointless on now!", "@Dave_Rowlinson I knew more about West Ham than Kriss Akabusi", "Uh oh, Badly Drawn Boy is on Mastermind and it's before the watershed.", "Just finished work for Christmas and everyone on my timeline seems to be drunk already.", "'The cheapest flat in London' ie a shoebox in Clapton https://t.co/NKSGvhkxpt", "Forget Rihanna, marketing and headline-wise, is there a better day for Eve to drop a surprise new album?", "@aarora17 No pro account any more. Seemed like too much effort for too little reward.", "Happy Festivus, for the rest of us. https://t.co/N91lEyqCnZ", "@musicismyradar I have not but that is now on my post Christmas list.", "@ilovealcopop @rhirhilee84 LEEDS!", "@gemtriesharder @mrchristr Oh... I was just saying what I'm doing now. Are they lyrics too?", "@mrchristr @gemtriesharder \"Spend my time watching Top Gear with my trousers down / Covered in Sudocrem and talking to myself\"", "@mrchristr @gemtriesharder Best lyric is obviously: \"NUUUTTTTTTTEEEELLLLLAAAAAA\"", "@musicismyradar Ah, wish I could watch the whole thing again as if I'd never seen it.", "I interviewed the one and only MATT BERRY on his musical upbringing for @diymagazine  https://t.co/tdOvnxm5hc #yesIcanhearyou", "RT @ruinedpicnic: \"What's your name, son?\"\n\"Uhhhh...\" [looks at cop's shirt pocket] https://t.co/zhgzInhIAT", "How I'm going to end all conversations and arguments from now on: https://t.co/zcrueiq3p6", "Or just, you know, look at this https://t.co/UrU8hYHvUd", "@StephanieFlooks A Visit from the Goon Squad", "Because you need more lists, if you scroll to the bottom of this page you'll see my albums and tracks of the year: https://t.co/7VJRu7RUHU", "@katiesol I did put forward a pretty persuasive case.", "@katiesol Well, I'm listening to Grimes.", "From Slimming World to Global Cement, The Guardian let other mags have their say on their album of the year: https://t.co/4A1WEX6EEa", "@Dave_Rowlinson @gemtriesharder You're like the opposite of Fran Healy", "@Dave_Rowlinson @gemtriesharder But I had torrential rain when I went :(", "@gemtriesharder Primavera Barcelona (probs)", "My favourite song (and dog) of the year https://t.co/jHGKTcPhRb", "Last Night I Dreamt That Somebody Loved Tea https://t.co/FV3abwYOFS", "@Dave_Rowlinson @emilyrocks @JessPartridge @gemtriesharder I got my haircut this morning &amp; had to stare at my own withered face for 40 mins", "Christmas drinking game: drink prosecco or champagne every time you see a picture of prosecco or champagne on Instagram. Then post a picture", "@chris_mandle if she said pig would he order bacon?", "@gemtriesharder @katiesol Has that hashtag been used before?", "@michelle_amaria @ginandconnick I'm currently re-recording Shed Seven's classic Chasing Rainbows to Chasing Content. To get more content.", "@ginandconnick @michelle_amaria Come on Michelle! Can I premiere it on my Twitter account?", "Have Viet Cong got a new name yet?", "There's a new app that translates your voice into emojis https://t.co/MWZQEBeSF0", "@MattLangham I never think of it as that arch - because it's so brutally honest as well.", "Some wonderful words from @MichaelAHann on Carrie &amp; Lowell, number 2 in @guardianmusic's album of the year list: https://t.co/qVhG0x0GqI", "RT @ironsoap: Same, kid, same. https://t.co/gjR3V2Wf3J", "@gemtriesharder @Dave_Rowlinson @michelle_amaria https://t.co/IvjBMXWbtE", "Best new music. Interesting new direction. https://t.co/fZiceR85xp", "A really interesting and touching interview with Lowell Brams about Sufjan and the album: https://t.co/dCj5LwvfhO", "Today the highlight of my day has been buying this print https://t.co/p9sOY1LR9Y", "@gemtriesharder Ought - Beautiful Blue Sky?", "@vndrlyl @michelle_amaria I remember the smiley face email. I think that's what started all this.", "Yesterday I had a cocktail which boasted 'tastes of tobacco, leather and peat'. They weren't lying.", "@michelle_amaria @vndrlyl What have you done with the real Michelle? That old brick phone was your USP", "I never knew how to eat a fish finger sandwich until I read this https://t.co/GFLzrG0ocq", "Is there any ad idea Joe Hart would say no to? https://t.co/YtMkd3P2FN", "@NatashaHeasman :) https://t.co/vIfHqzs2dH", "Watched the Seinfeld episode when they start eating chocolate bars with a knife &amp; fork and think that'll be what happens in 2016 in E London", "@AndrewAHannah @gemtriesharder I'd love a festival that was called Something Nordic. I'd  like to do Oya or WOW.", "Just had a dream James Murphy called me to chat about cats. #exclusive", "@timjboddy Solpadeine", "@katiesol @gemtriesharder I've been thinking a lot about this show recently. Loved it as a kid: https://t.co/hj1kU1hS5X", "@katiesol Definitely @gemtriesharder", "RT @Tomfoins87: Garry Monk always looks like he's trying to smell the back of his own head https://t.co/81ZOTMoTX9", "Clickhole, I love you. 'We Asked 22 Librarians About The Most Italian Guy They Ever Had To Find A Book For' https://t.co/2D5wJPLcWh", "@stejvic @John_murphy1 Oops - sorry. It was really good though.", "@Rarham Amazing", "@emilebernarduk Yes! Great shout. I think I'll turn this into a coffee table book.", "Wu Tang are the best: The contract stipulates Bill Murray can \"attempt one heist or caper to steal\" the album back https://t.co/MD2t9VLJa1", "Finding these Angela Merkel puns a lot funnier than I should https://t.co/O2pOlH1jh6 https://t.co/6x36eGhmCF", "@vndrlyl I wasn't 100% convinced by all of it but there were definitely some amazing moments.", "Where shall I meet you @Dave_Rowlinson? 'I'm in the Good Mixer.' Of course you are.", "@NeilAWood See you there (of course)", "@gemtriesharder Oooh, that looks very good.", "Quora question of the day: It seems that I am good at nothing. Am I destined to become a mediocre person? https://t.co/g18B18RxRZ", "Greavsie West next, you mark my words.", "Didn't realise Kimye were such big fans of this show https://t.co/sy19f3qOHK #jokes15hourstoolate", "Music fact: there have now been more cover versions of Hotline Bling than there are people in the world.", "@The405 @timjboddy The Body by The Boddy.", "@The405 A bit upset @timjboddy didn't review this tbh.", "RT @ClickHole: Pavement Fans Rejoice! Stephen Malkmus Announced That He Is Touching A Guitar Right Now https://t.co/FSLL3drmjl #ICYMI", "@AnantNaik @tash_wynarczyk @helenlawson7 @sammymaine @StephanieFlooks I really, really, really like Yule", "Carly Rae Jepsen is the first in my new series 'Pop singers who look like they're celebrating a goal'. https://t.co/ZbMlttoZJa", "@sammymaine  @AnantNaik https://t.co/jW4i0uuwLo", "@aimilewis1 @florencevc Whoop", "@florencevc It's going to be so good.", "@MattLangham Dammit good? Or dammit bad?", "He asked for No Surprises. Hahahahaha. https://t.co/Ru0Ejys6Vd", "My name is Danny and tonight I'm going to see Carly Rae Jepsen.", "RT @Tighe_er: This is even beyond a make u think joke https://t.co/UsjYmHKzuq", "@katiesol I hope East 17 are playing", "'The notes, which feature the head of Iggy Pop, can only be used once.' #chrismorrisquizday", "@Dave_Rowlinson autocorrect mate?", "I think Jon Hamm wearing a cardboard Lovejoy mask in Toast is my TV highlight of the year.", "@cohenburg @mickeylove24 that does look a lot like his nappy", "'This toilet is for massive babies only.' https://t.co/oI3F4uqo4A", "RT @DanielBedingfld: Yolo is carpe diem for wussies?", "@ClashRobin People love a #beef", "Bill Murray + Phoenix + The Beach Boys = a Christmas song I can get on board with: https://t.co/6R2MfJqhCk", "@fightwithcrayon Haha - amazing. I was only in the pity for the last two songs sadly. I'm too old for all that.", "He's a nice guy really, OK? https://t.co/yHgAMg6yiC", "@Dave_Rowlinson @PhotoSonny @laurendown @JessPartridge https://t.co/upn3U5eUrM", "@Dave_Rowlinson @PhotoSonny @laurendown @JessPartridge Also https://t.co/pUKrLcVPgk", "@gemtriesharder Middle finger emoji", "@wrongpop Indeed I was! So good, hey?", "@Dennynews It was just a one off for charity sadly - but there's a new FOTL album coming!", "Mclusky were so good last night you'd make one of their songs your Twitter username https://t.co/nLbARJ0Bs6", "RT @lexkelandjun: Never been more ashamed of being British in my whole fucking life. And we've played Ibiza with The Enemy.", "@joeparry @Dave_Rowlinson @_rachelgrace @merlinjobst @ddancarson @michelle_amaria I'm going to be with Joe so I'll need a half too", "I'm going to a Chris Morris-themed quiz on Sunday. So tweet lots of quotes from his shows at me so I absorb them all. (I may regret this.)", "\"We are the mop bucket of indie rock.\" A lovely chat between Matt Berninger and Lauren Mayberry about fame and music https://t.co/AKdl1qJwPV", "@PhotoSonny @laurendown @JessPartridge @Dave_Rowlinson Jesus Christ guys. Saturday? https://t.co/xpeUQdWqQG", "Are we witnessing the birth of Lad-fitti? https://t.co/1sH3wZdwac", "MCLUSKY TONIGHT. CAPS LOCK.", "RT @dril: its fucked up how there are like 1000 christmas songs but only 1 song aboutr the boys being back in town", "Since no one I voted for are 40-31 I'm guessing my list has been accepted as the definitive top 10 of 2015: https://t.co/BSav2Z2fT9", "@katiesol Sorry about that", "Have The Corrs been cryogenically frozen for the last 15 years? They haven't aged at all. https://t.co/QZFNkkDIGh", "Let the celebrations begin! #cheeseworldcup https://t.co/oaEKOTW8Qs", "WOW. WE DID IT CAMEMBERT-IANS! What a competition. I dedicate this win to the cheese purists. #Cheeseworldcup https://t.co/5S0PWJ0UBA", "@PhotoSonny And thanks to @PhotoSonny for putting on a fabulous tournament. Great cheeses all round.", "@PhotoSonny This isn't a victory for me. This is a victory for cheese purists all around the Twittersphere. Thank you for your support.", "@vndrlyl @coralamberrr We're losing guys. Call all your friends and family (with twitter)", "EXCITING NEWS: A new Future of the Left record. Get your copy and help @shit_rock reach the target on Pledge Music. https://t.co/IxG7vQS4rk", "@gemtriesharder Now you're just trying to troll me.", "@gemtriesharder In Japan I ate these all the time. It takes me back.They were simpler, more cholesterol-ridden times https://t.co/NtqwhmIxa6", "@mrchristr @gemtriesharder When the cheese dust has settled I can think more clearly. At the moment my mind is full of Camembert.", "@gemtriesharder Deep frying (the best!). In a sandwich. I like it in its natural state too. AND YOU CAN DIP BREAD IN IT.", "@gemtriesharder *Block* We're not voting about pizza here. We're voting about cheese.", "@coralamberrr YES!", "@PhotoSonny God. I can't take this.", "I want to hold this aloft tonight. https://t.co/gYTnfl7Reb", "Currently trailing 47% to 53%. Let's correct this. Let's make cheese history. Let's crown Camembert cheese champion. https://t.co/CQJS2wfrzd", "RT @figgled: The dawn of December 1st arrives. \nThe door of Michael Buble's cage is unlocked.\nHe flinches from the light.\nIt is time.", "The new Animal Collective song is a very good Animal Collective song https://t.co/XmUEcrdq9U", "@gemtriesharder I'm never coming to one of your cheese and wine evenings.", "@gemtriesharder Thx (please vote for me)", "@gemtriesharder This tweet seems so sad now. Well played though.", "@gemtriesharder I feel my victory may have been karma for #Pineappleonpizzagate", "OH MY DAYS. IT'S THE CHEESE FINAL. COME ON TEAM CAMEMBERT.  https://t.co/CQJS2vXQHF", "There have been 151 votes and it's 50/50 - I obviously don't understand Maths.", "One hour to go. I Camembert the tension - please vote my cheese into the final. https://t.co/QuKa3KCGpT", "New @LondonInStereo with Loyle Carner on the cover and words from me about Open Mike Eagle, Allie X and Santigold: https://t.co/4alhHL0q9u", "@StephanieFlooks I've got no nails left.", "@gemtriesharder @PhotoSonny I suppose anything goes in a semi final. I'm just disappointed", "@gemtriesharder @PhotoSonny there are some outright lies in this tweet", "Semi final! Cheese. Me versus @gemtriesharder. Camembert has to win. https://t.co/ncfqS8WLxU", "Some sage advice there Denmark. https://t.co/VzVqc9MLik", "Quarter final time  https://t.co/jI2hCR2U3r", "@PhotoSonny https://t.co/4QuThiKq4d", "Bit in love with our Copenhagen Airbnb apartment https://t.co/ljzOhk5HI4", "Just had my first mince pie of the year. It's not even December, what am I playing at?", "@PhotoSonny @_marksalmon I nearly wrote 'Come on Camembert fans'. That would have been a mistake.", "Let's do this Camembert fans  https://t.co/rLWP2AyPC3", "@KamillaHannibal Thank you! Though you might have some good recommendations :)", "@PhotoSonny @gemtriesharder @Dave_Rowlinson Along with De-Hey-ser and Monkey Gone to Hey-ven.", "@PhotoSonny @gemtriesharder @Dave_Rowlinson Probably my favourite Pixies song.", "@gemtriesharder Can't open this in work but if Kula Shaker aren't on here I want to know why.", "@eatingsoho I'll wait for Mike to take his first - he needs it for a new canvas.", "This evening I'm flying to Copenhagen for 48 hours. What should I do?", "RT @DisOrientFC: #History https://t.co/s9hOxQQoGo", "PJ Harvey at Field Day has made my day.", "RT @imbadatlife: unmute this vine immediately https://t.co/WW3Dwbm92B", "Though the woman in Argos pronounced it 'dick-a-phone'.", "So excited about an interview I'm doing tomorrow that I just bought a new dictaphone.", "@gemtriesharder @katiesol Definitely yes https://t.co/hU6Llu5cEf", "@Soph_Gordon Yes! It looks like Camembert is going through, We can do this.", "@katiesol @PhotoSonny @gemtriesharder @Dave_Rowlinson @Mkboxx Seconded. Amazing.", "@gemtriesharder @Dave_Rowlinson @PhotoSonny @Mkboxx Best parmesan: https://t.co/2bgXVzg9hf", "@gemtriesharder @Dave_Rowlinson @PhotoSonny @Mkboxx Parmesan smells of vomit and is the worst cheese.", "Vote for me. Vote Camembert. https://t.co/LxTisw79t0", "Today I could have attended the premiere of the Blur doc with @Dave_Rowlinson. Instead I'm in Slough. The world is very cruel sometimes.", "Never forget https://t.co/ibomnTW4Zk", "@Dave_Rowlinson @gemtriesharder They're what I'm calling my first three children.", "@gemtriesharder Alley X", "Well, this ticks a lot of boxes for me. https://t.co/xozxNwKVGk", "Really need this, please @asthmatickitty, thanks https://t.co/j0eZ1xFYAm", "@timjboddy @michelle_amaria Maltesers are lovely. Why would you waste them like that?", "@gemtriesharder what does it even mean? Does it just say Happy Birthday in the middle after that?", "RT @steveplrose: Front page vs the actual question https://t.co/I8ksB03pGz", "@katiesol @Dave_Rowlinson Scrabble is timeless Kate.", "Still getting over the fact that Missy Elliott gets her hair done every other day https://t.co/f4UWovjKd5", "RT @philib57: https://t.co/ZTNXNIbAd4 https://t.co/hq7L0NkvPZ", "@PhotoSonny @JessPartridge @Dave_Rowlinson Camembert", "Adele's original tracklisting https://t.co/JxRq2zym21", "RT @diymagazine: Benjamin Clementine wins the #MercuryPrize 2015. Here he is leaving the ceremony, looking happy. https://t.co/EBj22GeaIv", "@EngancheMaxey John Scales? Peter Fear?", "Out of all the Tory Party idiots Philip Davies seems by far the biggest (Exhibits 1&amp;2) https://t.co/0sHF2389mt https://t.co/PG6Vid8kPc", "After listening to the new Bowie song five times I can confirm: I like it https://t.co/2mQJJf07Op", "@katiesol For sure. He did it because he 'saw some mates come in half way through the show'. Amazing!", "Hotline Bling Crosby https://t.co/gpMICZJNg0", "LA Priest had the audacity to play Oino twice. The most fun I've had at a show in a long time.", "@ginandconnick That's a long session", "@gemtriesharder the band?", "@essikert Good to hear. I can't wait!", "@gemtriesharder U ok hun?", "@williamggrant We can recreate it ourselves afterwards", "@michelle_amaria #dontsstopbelievingholdontothefeeling", "Excited about seeing LA Priest live for the first time tonight. I know he won't but hope he does Fantasy Black Channel in full as an encore.", "If you couldn't guess the album's called Blackstar https://t.co/zXRFAMXcoG", "It's like they reached inside my head and found the worst collaboration I could ever think of https://t.co/zTFeaB4yYb", "Happy #InternationalMensDay and #WorldToiletDay everyone.", "@yatesyman It is indeed. A great episode too.", "So happy to have Toast of London back in my life.", "RT @ClickHole: We typed this, it flew up to computers, then down to your screen. You gotta admit, technology is amazing!", "@NatashaHeasman But you drank that coconut juice so your opinion is invalid.", "Never been happier I don't like Bounty bars. https://t.co/D2Eqs95Qvm", "RT @soundmigration: This. Is. Brilliant. https://t.co/UFuoflvrE1", "Here are those words. My @floatingpoints review for @guardianmusic: https://t.co/xHRB3oITef", "Looked up the word 'enthusiastically' in the Thesaurus today and one of the results was 'like the dickens' so look out for that phrase soon.", "That Floating Points show was so incredible I'm finding it difficult to find the words - which might be a problem as I'm reviewing it.", "What is the actual point in remaking Memento? https://t.co/NHSWTLAuiQ", "Thanks to @sockformation for pointing out that Neville Southall plays Fishermen # 2 in Sharknado 3 https://t.co/vJ2vxI4WgH", "@sockformation Thank you!", "@emilyrocks @diymagazine I definitely know whose side I'm on! (Yours and New Order's)", "ONE MAN BAND?: WHEN GROUPS LOSE THEIR SENSE OF SELF: I wrote this for @diymagazine  https://t.co/kvixwmEoOf", "@michelle_amaria I know. I already regret tweeting that.", "What about Jazzy Jeff?  https://t.co/EOQuF6VZKT", "@gemtriesharder That 1975 interview in the Observer yesterday was pretty interesting. Nearly made me want to listen to them.", "Watched Inherent Vice last night. The two best things about it were the costume design and Joanna Newsom.", "@michelle_amaria amazing! Who is time tho really?", "RT @SexualGif: a mosaic of donald trump created from over 5,000 dick pics https://t.co/xfZ19yT4yh", "Starting my Sunday with Oneohtrix Point Never's 'Garden of Delete'. Here's my review for @diymagazine: https://t.co/7YnPtJJEo6", "I want to make a Blur based one called Sharklife which features sharks who rudely awake you on a Wednesday.", "Just watched Sharknado 3. Now watching Raiders Of the Lost Shark. Jumping the shark.", "RT @RicTurner: Nail &gt; head. Shame this sort of thing will be drowned out by the shite that crops up on FB. https://t.co/WJaAm3vhru", "It's 2015 and people are still wearing bubble jackets.", "Julia Holter was very good tonight. And she loves sandwiches. And Jimmy Page was standing in front of me. All in all, 8.3/10", "LONDON DOESN'T NEED ANY MORE LUXURY FLATS.", "Idea: build clubs in luxury flats so the building of luxury flats doesn't mean all these great ones have to shut https://t.co/t19GzdMJpV", "@joeparry @michelle_amaria A-meh-zing more like, amiright?", "@michelle_amaria 'Bulldog skateboarding through 30 pairs of legs'?", "What type of Thursday are you having?", "Happy Thursday, Missy Elliot is back. https://t.co/JhWH87gocn", "Tonight I get to hear one of my favourite albums of the year performed live. https://t.co/jHGKTcPhRb", "@Dave_Rowlinson Oh god. Do I know them?", "@gemtriesharder Locked in. Nice soundtrack", "iTunes terms and conditions turned into a graphic novel: https://t.co/Xwr48GpAv5", "\"I started Mongolia's only record shop by accident.\" https://t.co/TSAnKHzK3j", "@gemtriesharder thank god for that. But also why? In my top 5 songs of all time I think", "@gemtriesharder gutted I missed it. Did she do Good Intentions Paving?", "@williamggrant Can you please make a mixtape called 'Netflix and Will'? Ok. Thanks, bye.", "@coralamberrr @MasterofNone Just watched it now - so well, and skilfully, done.", "@gilescottle Just watched it - amazing!", "Think I might have surpassed myself in the boring tweet stakes there.", "No matter how many times I write the word 'yacht' down it always looks wrong. Not that I write it all the time but, you know.", "RT @Seinfeld2000: what if curb your enthusiasm still on tv? https://t.co/ii6S9kIMug", "@LondonInStereo Bounce House", "Just watched the first episode of Master of None and it was everything I hoped it would be. So good.", "@melstarsg Patrick Bateman", "DJing at a friend's 30th birthday tonight. Just downloaded this https://t.co/znkQ349xJV", "This short story by @shit_rock is very much worth your time https://t.co/XgQFFLmRJ4", "At last we can get the real issues out into the open. It's taken too long: https://t.co/hOgMsjuTad #crispaddiction", "@coralamberrr This is definitely going to be my weekend viewing", "@Dave_Rowlinson I have great medicinal qualities", "RT @porksmith: https://t.co/qxtEDgXBMq", "The perennial question remains: why isn't Noel Gallagher's music anywhere near as entertaining as his interviews? https://t.co/ce9RbPaOWt", "Read what I said. This is a stunning record. https://t.co/4pKkBhpGlm", "Can't wait for the fay, whimsical 'Blue (Da Ba Dee)' cover on the next Christmas ad.", "@McCormickDaniel You love phone snatches", "@Dave_Rowlinson @merlinjobst @JackMerlin https://t.co/UaTxGx14Sx", "@Dave_Rowlinson @merlinjobst @JackMerlin Wait, I thought they were both in N America? I'm sick sorry &amp; will be at home doing lemsip shots", "@Dave_Rowlinson Dinerama?", "@gemtriesharder @sockformation Make a life-size tiger out of bread?", "Went to watch Bond last night. It made me laughed in quite a few scenes. Not sure it was supposed to be funny though.", "@gemtriesharder Quiz Phair", "@williamggrant It is.", "@michelle_amaria @timjboddy https://t.co/ew9YS8I9HP", "@michelle_amaria I had a few letters 'printed' on Channel 4 teletext's Planet of Sound music pages. My name was Dan the Autonomous.", "@musicfansmic @michelle_amaria This is what the Heart icon was created for.", "Two months ago I hated bananas. Now I can't stop eating them. Is this the most boring early midlife crisis ever?", "RT @BoJackHorseman: no Todd we cannot start listening to Christmas music.", "How's everyone celebrating #NationalSausageWeek?", "Being a Leeds fan https://t.co/yNh5JBsVT0", "@benwiggs @gilescottle great to meet you too! I'm sure we'll see each other at a show soon enough!", "RT @GelasticGoGo: Your tweets are getting funnier. Trouble at home? *hugs*", "So Sufjan covered Hotline Bling https://t.co/u31qbWKCtZ", "@amberlav it could be a great day for Australia", "Democracy doesn't work people.", "@gemtriesharder I hope you're happy with yourself.", "This is exactly how I felt when the Tories won the election. I've been let down. https://t.co/nm28Rc6mEk", "@stejvic @adm_bn @timjboddy It's Yes with 51% with 14 minutes to go. Get your friends (who hate pineapple on pizza) to vote!", "@gemtriesharder @Mkboxx You are not all the people, Samways. This is a democracy. A pineapple on pizza hating democracy.", "@Mkboxx @gemtriesharder If there's some way you can change your vote, 'No' will be in the lead.", "@Mkboxx @gemtriesharder WHAT!? This is outrageous. There might have to be a recount here. I'm setting up an official investigation.", "@stejvic @adm_bn Good to see we're all in agreement. I can't vote though :(", "51% yes vs 49% no. One hour left. Only you can decide.", "RT @saladinahmed: This letter to children's author Jack Prelutsky is one of the best pieces of fan mail ever. https://t.co/wbaf2HHZr7", "Last minute Halloween costume idea: https://t.co/GTrUEukyRT", "YES! https://t.co/6tOwlAPjtx", "New screamy Grimes https://t.co/QwF8xTEry5", "And I reviewed the stupendously great Joanna Newsom album. So you can read that too.", "You'll oneohtrix point never guess who's on the cover of the new London In Stereo... https://t.co/PExsu5cYwr", "55% 'God no', at the moment. My faith in humanity has been restored.", "@vndrlyl I know. And I'm not even allowed to vote on it so can't change the %s", "@robleedham @gemtriesharder I completely disagree. But that's what makes the world go wrong I suppose.", "@Dave_Rowlinson Just answer my poll Dave", "Do you like pineapple on pizza?", "The world is divided into two types of people: those who like pineapple on pizza and those who think it's an abomination.", "@ClashRobin 'Mizzy Night' (Mischief night) in Liverpool.", "Don't think anyone got this/it was a terrible joke.", "@matthewjh Yep, and it's about drugs.", "@gemtriesharder @katiesol @Dave_Rowlinson @sammymaine Stel#fox", "@Dave_Rowlinson Hmmm, potentially. Can I review the Blur doc too?", "@andywelch81 Worth a watch then? I'm open minded. I think I'm worried because I love the book so much.", "Although it does open with my favourite song of all time.", "Is Kill Your Friends going to be any good? I'm worried it's going to be terrible.", "@swjharris Now you mention it, I did start to have a craving for some delicious, thirst quenching Heineken.", "I went to watch @BATTLES last night. Once my ears had recovered I wrote about it for @guardianmusic https://t.co/Z60PmMApIk", "@tommw @sockformation @sammymaine Ah, it's that time of year for the faked up Primavera posters.", "@michelle_amaria See u there", "You should really listen to this https://t.co/gKg5CWMbRl", "After Chris Morris was there last night I'm now trying to guess which random celebrity will be at the Father John Misty gig with me tonight.", "ICYMI: https://t.co/IrNZIV7cRu", "And he did a cymbal solo https://t.co/ksc7HwrbAN", "Awaiting Battles, and that cymbal. https://t.co/o9r0JkGq5h", "Marketing idea for Fray Bentos: Meats by Fray.", "RT @LettersOfNote: Jonathan Swift attempted to kill the word \"banter\" 300 years ago. He knew what was coming. https://t.co/inxaMyagoy", "GET WELL SOON BOB https://t.co/yPesUNkfuK", "RT @Unnamedinsider: This new series of Frasier looks a bit dark https://t.co/UDIFciZzN6", "This is my jam. https://t.co/5CmWEzXlUD", "Also, having lived with the new Deerhunter album for the last two weeks I can confirm it is sublime.", "SO many good shows coming up. This week it's Battles -&gt; Father John -&gt; Destroyer.", "@sockformation", "Oh good, it also gets dark at 5pm now.", "Back from an amazing two weeks away. Adele. Grimes. I can't eat meat anymore. Did I miss anything else?", "@firesuiteband @diymagazine @EL__VY You won't be disappointed.", "@williamggrant Klopp, I think.", "Spoke to Brent from El Vy, didn't I.  https://t.co/1BQjrOX0rO", "Been confused all morning because these banned hoverboards aren't hoverboards.", "@katiesol I'm going to say that all the time when I'm there", "Flying out tonight for 2 weeks in Mexico, Belize, Guatemala &amp; Colombia and currently desk dancing to this https://t.co/5FTPbtiPWu", "Terribly sad news about Carey Lander. Her inspiring campaigning will hopefully help many in the future. https://t.co/qAGnVaMBRH", "I have been listening to, writing about and reading up on Pavement all day. It's been a good day.", "@killthedramaken Sounds good! I will DM you now.", "Is debating what the term 'indie' means the new 'guitar music isn't dead'? http://t.co/JyedQ8TUP9", "This is Low. Beautiful, beautiful stuff. @ Roundhouse https://t.co/sS9SKchcXa", "One of my very favourite bands, Low, at The Roundhouse tonight. It's going to be pretty special.", "Never thought the tune from Freed From Desire by Gala would make it to the terraces of Clapton but it sounds joyous #nonleagueday", "@McCormickDaniel @michelle_amaria I did beat you at the billet though", "@michelle_amaria yep, I beat @McCormickDaniel there a lot", "@michelle_amaria crooked billet", "Headline of the day: That Time Prince Menaced Michael Jackson By Playing \"Aggressive Slap Bass\" In His Face. http://t.co/BBw0Sg1UOQ", "@gemtriesharder New nickname? Sammers?", "Dreams crushed in seconds  https://t.co/KQ2WM1qh7l", "@HanrattyDave oh...", "What? What!? Arggghhh http://t.co/2DBBlXj5aS", "The Waste Land remains my favourite poem. Followed by Danny Dyer's Reflective Haikus https://t.co/Dk12RgjiNF #NationalPoetryDay", "Top examples of #topbanter at the Tory Party Conference http://t.co/xVkZZU4Gs5", "Another Beach House album already... https://t.co/BwhZNsnk9R", "#cake #GBBOFinal https://t.co/FFQts2YsjS", "Currently being hypnotised by this ace new Tortoise track https://t.co/AalRHtKShj", "@merlinjobst @McCormickDaniel You could be talking to either of us", "@merlinjobst @McCormickDaniel I certainly could. That was basically an admission of guilt, Merls.", "@McCormickDaniel @merlinjobst You also f*cked a pig, right?", "RT @RichieMcCormack: Wondering how Klopp will juggle the Liverpool gig with releasing that EL VY album http://t.co/d1BqGZYYoS", "Tonight is a 25p burger from Byron and seeing Girl Band at the 100 Club. Tuesdays don't get much better.", "#sphincterpreservation https://t.co/AQETyHpig9", "Has anybody heard about this- they just tried to charge me 5p for a plastic bag in the Co-op! It's chaos in there.", "This new Annie track is really, really good, isn't it? https://t.co/cLI3JpKJp8", "RT @GoonerTalk: Thierry Henry's reaction after he hears that Brendan Rodgers has been sacked. https://t.co/RiU6NMsM7q", "@Stephen_Bevan haha - God, I wish they'd let me know I was going to become famous", "Playing footgolf today, then going to a Britpop night. Trying to stay completely on brand.", "Cats In Kimonos Are A Thing In Japan http://t.co/4koFegM1nc http://t.co/pUYYvhfGHt", "'We are looking 20p in the 10p mix.' Sleaford Mods time.", "Great Friday afternoon tune this: Lxury &amp; LA Priest - Show https://t.co/5fA1UPKPXX", "@gemtriesharder You'll have to hurry - it's the last weekend.", "@gemtriesharder I'm going to Dinerama :)", "I am off to eat this tonight. I guess 33 is the year I get fat. http://t.co/SFHQTN5p66", "RT @Alby: Jesus Christ, Party Cannon. We've been through this! http://t.co/WEZRkcvieF", "@gemtriesharder @katiesol YES IAN!", "@gemtriesharder I always imagine your dad is called Vinny.", "@aimeecliff This is still my favourite JD joint though https://t.co/uRwxac7lPh", "@JackMerlin Amazing - congrats!", "'DECEMBER 15: Paul Hollywood releases a Christmas single as a Tidal exclusive.' @Popjustice predicts Q4 in music:  http://t.co/sznz1tfzqk", "@michelle_amaria Please bring it to me (warm it up first though)", "@michelle_amaria U OK hun?", "@mrchristr @sockformation I hate fig rolls with a passion so it made me happy. They're like dog biscuits.", "@sockformation Thought this would interest you: http://t.co/EzXj8L1TYs (completely agree with no. 1)", "@jd_psychocandy It is indeed.", "Great Britain needs Great Banter http://t.co/ERfomGbILQ", "@Unofficial_Phil It was indeed. And thank you!", "After my birthday yesterday I am now the proud owner of a towel with a picture of my own face on it.", "RT @goulcher: STOP EVERYTHING TODAY IS CANCELLED I'M CRYING   (via @Sam_Watson) http://t.co/iLYntOrQH7", "@StephanieFlooks Thank you! x", "Never been a massive Daughter fan before, but this new song is spellbinding: https://t.co/7AXoeDR0FA", "@mrchristr @chris_mandle @katiesol All aboard! Cheers Chris!", "@chris_mandle @katiesol That means a lot Chris. Thank you.", "@williamggrant Thanks WG!", "@katiesol Thank you! And great hat! His sartorial choices are always spot on.", "@Dave_Rowlinson I'm now the same age as Jebus was when he died.", "@HanrattyDave Haha. That's great. I remember having my first letter published on the Channel 4 music pages. A proud day.", "Yes. https://t.co/3yBeqC7k4G", "@merlinjobst Are you top of Google for 'Merlin Dieter Jobst'?", "This guy. http://t.co/anMXwi6SKX", "@StevenALaw Oh, it's on.", "@tokyorav Loved Bamber Boozler.", "I don't think anyone has loved anything as much as I loved teletext. #internetghetto", "A song by FlyLo, Shabazz Palaces, Thundercat and George Clinton could only be great, couldn't it? https://t.co/wmqo2vrC7x", "@katiesol @clash_music @gemtriesharder Definitely my favourite band of the last year or so (along with Girl Band)", "@gemtriesharder @katiesol Guys, he's an alt-rock star not a piece of meat.", "Totally flabbergasted by this news. He seemed such a stand up, trustworthy guy http://t.co/aBHxMWjQvM", "A cracking new track from Hamilton Leithauser - My Reward. That voice. https://t.co/homR4NZuQW", "@emilyrocks Still the best album ever made", "Listening to Alligator again. Reckon this could be the millionth time.", "I think today we have definitely reached peak old band reformation.", ".@dmgarrigle's pointed me in the direction of this from Buzz from the Melvins about how the film is '90% bullshit' http://t.co/IPYeJy8rsp", "Little Simz! New @LondonInStereo! Read it while it's hot. https://t.co/pbKEkx4AHY", "Watched Montage of Heck last night. Some of the home video footage was heartbreaking.", "@basementfever that's a good Jake May tweet", "@SimoneSkilbeck @RickSkilbeck A brick is currently on its way towards your head. (Not really I don't care that much.)", "I'll tell you what's a great album. Tender Buttons by Broadcast is a great album.", "@RickSkilbeck That's what I think. And our 'goal' could easily have been given. Our CBs are ridiculous.", "@RickSkilbeck You're welcome.", "@LivingSocialUK Hi.I bought a shirt 14 days ago &amp; told it'd take 12 days to deliver but it's still not been sent out. Could you check for me", "Just saw an ad I wrote on in the break of Sky Sports News. #lifegoals", "Eric the bird is king of the lads https://t.co/Knhw43y4CW", "@Dave_Rowlinson You deserve a burger later", "RT @Seinfeld2000: i know when that jerk store bling http://t.co/OiAeKxtWHk", "Favourite chant at Clapton FC so far 'David Cameron, he fucked a pig'. #topical", "Little Simz is a very special talent, isn't she? http://t.co/ukZEJZ028u", "True or false: Tom Waits?", "I like this new Father John Misty song but it's up there with the Manics for lyrics that don't scan: http://t.co/yLcvyvEJI1", "You can now download Meow The Jewels for free. Cat-urday morning. http://t.co/qHRBHMxl8a", "Beirut: all about that brass @ Church of St John-at-Hackney https://t.co/jbpM6mbyJo", "@emilebernarduk good to meet you too! See you there", "RT @CourtNewsUK: London Zoo monkey expert guilty of glassing meerkat handler rival in Llama keeper love triangle", "The Pope is releasing an album of Arcade Fire covers http://t.co/TXuz5baeJb", "Tonight's Beirut show at St John At Hackney Church should be pretty special.", "@musicismyradar @sammymaine @gemtriesharder Maybe we should play music in the background as we're interviewing so we have a soundtrack?", "Two of the very best albums of the year are released today. Julia Holter and Girl Band. Go and buy them.", "One thing I've learnt from DJing/life: All My Friends is the song that brings everyone together.", "@gemtriesharder I'm hanging out with Dave R, let's just say that", "@gemtriesharder you want to see the LIS DJ booth!", "@michelle_amaria Sa-Lad Days", "@cohenburg I want it", "@michelle_amaria @Dave_Rowlinson As much as I can grow in a 9 days. So not that much. But I'd still call it a beard.", "@michelle_amaria @Dave_Rowlinson I've also kind of grown a beard by accident. It's going to be a great night.", "This new El Vy song is absolutely beautiful, up there with any National song: https://t.co/0wJlELOtdc", "@michelle_amaria @Dave_Rowlinson I couldn't not, even if I tried. I'm just a showman. (But probably not.)", ".@Dave_Rowlinson will also be doing live lounge-jazz covers of Father John Misty covering Ryan Adams' version of Taylor Swift's 1989.", "If you like steel drums &amp; slow jamz then Jess, Dave &amp; I will be DJing for @LondonInStereo at East India Youth's show at The Garage tonight.", "This Morrissey novel sounds like everything I hoped it would be ie ridiculously awful http://t.co/jvbSXNLxBW", "@gemtriesharder @LucieGraceFace @Dave_Rowlinson @LondonInStereo I just don't want to be Louis https://t.co/zZLDtA6KkI", "@gemtriesharder @LucieGraceFace @Dave_Rowlinson @LondonInStereo tbf it was mostly cos Dave is Harry &amp; I don't know the rest", "Just discussing with @gemtriesharder which writer for @LondonInStereo would be which One Direction member.", "Listening to lots of the Pixies-ish magic of Dilly Dally today http://t.co/a3Gp89SCGL", "@michelle_amaria isn't FJM taking the piss out of RA though?", "Father John Misty doing a Velvet Underground-y cover of Blank Space wins tonight https://t.co/JG2OZJVOGZ", "Of course this had to happen. Cassetteboy - Gettin' Piggy With It https://t.co/EJCzyY3idH", "New Joanna Newsom is a lovely thing for a Monday morning: https://t.co/tSiTte3E9q", "Woke up and thought the Cameron pig story had been a surreal, trippy dream. But wonderfully, no.", "'David Cameron once put his penis in a dead pig's mouth' is not a sentence I ever thought I'd read.", "@Dave_Rowlinson sort it out", "Viet Cong are changing their name http://t.co/7wz4VCbgnI", "I'm just by the Pound Shop - does anyone want a weird picture of Jesus? http://t.co/DikkHmXIh8", "I really like how 'World War Pt. 2' by Autre Ne Veut starts a bit like 'Climax' by Usher https://t.co/xVxLbLSZjZ", "Surely the hashtag should have been #NMfreE", "RT @itsKamaKazi: I hope Ahmed walks back into that school like http://t.co/zrJwmqjDBl", "I, for one, am very happy Rihanna is on the cover of NME. Though I think she now legally needs to change her name to Rihanna Gallagher.", "@NeilAWood I completely agree.", "Just a gentle warning not to put Sky Arts on now... Especially not in HD http://t.co/Agxjjw1f9f", "@andywelch81 Only end of series 1 so far. Probably have finished it all by next Sunday I reckon", "@andywelch81 It's brilliant. The good thing about getting to it so late is I can now binge on loads of episodes.", "I've just started watching Archer and now I don't know why I haven't always been watching Archer. #aheadofthegame", "@cohenburg what a few days in politics", "Good luck to all the teams today in @bsm5aside tournament. Let's go @guardianmusic! #respekknuckles https://t.co/Af3mLBO9XO", "A Whitney Houston hologram is touring the world next year: http://t.co/EkFPNMTvVM", "Corbyn is leader https://t.co/005rCgo8hi", "@michelle_amaria @TomMehrtens 'The Spa on Drugs'", "It's Friday, ladz. https://t.co/VgM2EZu4bp", "@basementfever Yeah I think so. But it *could* be true which is depressing enough", "@sebulous No think it's a joke. But the fact it could be real is pretty sad.", "Living room to rent in London: 'We will still eat in there, so we have put a tent in for privacy' http://t.co/qGmJ2Y8aey", "Go and listen to the new Ought album. SUCH a great band https://t.co/EiAGcdTISq", "@ddancarson Looking forward to Sunday now", "Reviewed the new PiL album for @diymagazine. If you only listen to one song listen to Shoom: ridiculous/incredible http://t.co/yeFM2X1Eku", "@stephenackroyd @diymagazine @bsm5aside Just seen this. Going to try and swap shirts with @musicfansmic - they're lovely", "It's James Murphy / 2manydjs / Despacio In The Jungle day.", "RT @junayed_: .@MelanieLatest http://t.co/XIsSsfjJzx", "@ddancarson @bsm5aside The Sky cameras are already there.", "@ddancarson See you in Group C!", "@swjharris Thank you", "@AndrewAHannah Aw, cheers man.", "George Osborne is GQ's Politician of the Year http://t.co/kFS1TETxsM", "@sammymaine Thank you! Really appreciate it.", "@oswaldgutenberg I like to enjoy the difference between the portrayal of The White House in WW and in VEEP.", "@GoldFlakePaint Aw, thank you. And really great review of the show.", "I just wanted to say thank you to everyone for all the kind words about this. It really means a lot.", "RT @EdmondsHair: Martin Keown http://t.co/8PL23Tiohn", "@katiesol @StephanieFlooks @gemtriesharder I like his jacket.", "Sufjan played my favourite song of his at End of The Road. Spine-tingling.  https://t.co/Ps34C5IZRN (via @sammymaine)", "@Dave_Rowlinson @JessPartridge I'm playing football. This could end terribly", "Also: listen to the album because it's genuinely stunning http://t.co/Qpff6Vdh58", "During the interview Alan also gave some of the best relationship advice I've heard: http://t.co/UVhwx74rI7", "I spoke to the brilliant Low about relationships, Yeezus and their new album Ones And Sixes: http://t.co/NL6fhn3SBP", "@merlinjobst I know. Scandalous. We just drove past it instead", "@merlinjobst we just did that too!", "'I just went to End Of The Road.' 'In Dorset?' 'Yes, I'd recommend it to anyone.'", "@johnthebeeler my pleasure. Was difficult but really glad I did it.", "@katiesol ah thank you. Was really hard to write but I'm glad I did it", "@stejvic thank you!", "@katehutchinson Thank you.", "The most personal thing I've ever written: about losing my Dad, Sufjan Stevens and how music can help you cope: http://t.co/ddXe2XwYT8", "@OwenCollier This is spooky. You saw me didn't you? I was also playing the recorder.", "I don't think the sentiment of Home by Warsan Shire can be repeated too much http://t.co/8R0XVrbHqV", "Sorry to everyone on the train to Old Street this morning for being that guy with the massive rucksack and tent.", "Oh god Sufjan. I'm an emotional wreck. What a show. @ Royal Festival Hall https://t.co/mDZqo5Cjsb", "@timjboddy @StephanieFlooks Might join you guys (if that's OK)", "Alan from The Rakes is now a computer programmer http://t.co/2rhcq3EwUk", "@Dave_Rowlinson WHAT?!", "@John_murphy1 See you there. Are you at EOTR too?", "Sufjan tonight. Then Sufjan on Saturday. Not sure I've got the emotional capacity to cope.", "The amount of amazing albums out in September is ridiculous: Girl Band, Julia Holter, Ought, Low, Youth Lagoon, Battles, Little Simz.", "@sockformation The opposite always happens to me :(", "Just watched this on repeat for about 20 minutes http://t.co/Jejkk16tQ1", "@McCormickDaniel @gemtriesharder @merlinjobst I made it all!", "@gemtriesharder @McCormickDaniel @merlinjobst Thai Chilli, of course.", "@gemtriesharder @McCormickDaniel @merlinjobst I just had a pasta bake and a family bag of Sensations. #FinsburyPark", "RT @HeartofFire: Who doesn't want a special relationship between Corbyn and Kanye in 2020?", "Only 25 minutes into Whiplash and I already feel completely on edge.", "'Daniel LaRusso is a violent sociopath who picks every fight in The Karate Kid.'", "This is excellent: The Karate Kid: Daniel Is The REAL Bully https://t.co/YVCDhWgdxU", "I think we all know the big news of the day is that Paul Konchesky has opened a pie shop. http://t.co/sqWLOm127N", "@Dave_Rowlinson https://t.co/a2okL23P3e", "And, if you're after any more Sunday morning reading, here's an interview I did with Beach House for @diymagazine http://t.co/cT0hoRlbqZ", "While I was away the new issue of @LondonInStereo came out. Battles are on the cover &amp; I review Girl Band's debut LP: http://t.co/I1GjZYL26t", "FYI there is a 'Carling Pub' in Alicante airport. It shows La Liga games from a decade ago. And serves Carling.", "Does anyone want me to live tweet The X Factor without actually watching it?", "I've been in Alicante airport for 7 hours now. I feel like Tom Hanks in that rubbish film where's he's stuck in Alicante airport for 7 hours", "@gemtriesharder hello. Do you know any football scores today please?", "@emmaggarland just about to read it. Good?", "There's someone at Luton airport taking a picture of the Frankie and Benny's sign. One for the album.", "Off to Alicante on holiday tonight &amp; my mum just uttered the most chilling sentence in the English language: \"The villa does NOT have wifi\"", "'BA reported record sales on 1st-class flights out of London. &amp; none at all coming back. One Direction went on a US tour &amp; never returned.'", "Don't know why I'm surprised but this is an actual article in The Daily Mail http://t.co/R03JDVOI6u", "You should listen to this new Destroyer record tonight, you know. http://t.co/DuTQBjyftN", "So it was all an elaborate ruse leading to this...  https://t.co/Bf4VK2eU54", "@williamggrant 'The Prince of BeIn Sports.'", "Ever wonder what Richard Keys is like in the comfort of his own home? Wonder no more. Let him show you his Doha home https://t.co/YrhgpQLyEL", "@SimoneSkilbeck tbf, that whole album makes me weep - and I could only really choose one.", "I wrote the about the 10 best Beck songs for @guardianmusic so you, Twitter, could tell me how wrong I am: http://t.co/jFXqpyGxje", "@gemtriesharder Snap", "Just seen in Shoreditch http://t.co/7Gj5A4nsqz", "@LeahEnganche Haha, yep. In case someone stole it (!?)", "The mid-70s LA drug-fueled lifestyle is going to be interesting: academic to spend year as Bowie's many personas http://t.co/b4a8QlATJd", "@oswaldgutenberg @MattLangham tbf, I was 8 and my dad made me go with him so can't take much credit.", "@MattLangham The Kinks *smug face*", "RT @rhysjamesy: 'Umbro' is named after the response wearing it gets from your mates.", "Twitter, you are right. The new Deerhunter track is great https://t.co/ECzg2PUsWc", "@WillyDean TBF, the first Sea Nazis album is seminal.", "Very proud of Liverpool today. #GetInTheSeaNazis https://t.co/mPuKjpRZpK", "Corbyn went for Forest Swords https://t.co/K3UA5eOh5L", "Start your weekend right and buy/listen to the new Christian Fitness album, 'love letters in the age of steam' https://t.co/DvEz4GP5hy", "No veneer in 'ere", "Very much enjoying Donald Trump enjoying shoegaze https://t.co/IVuuHTPBOc", "@merlinjobst #stressbiscuit", "There is a Ned Flanders-themed metal band called Okilly Dokilly http://t.co/aEqTOA4GDT #GreatCostumes", "If you didn't do well in your A-levels don't worry. In 10 years we will all have been enslaved by our robot overlords so it won't matter.", "Love you Japan: Wakayama Electric Railway Co. has appointed a second cat stationmaster http://t.co/EBwBVeueXP", "\"When a man is tired of crisps, he is tired of life; for there is in crisps all that life can afford.\"", "RT @HolSmale: Mum asked what a Twitter favourite \"meant\", so..... GOOD LUCK MUM. http://t.co/w5QU26s6XF", "@mrchristr I have not. And I will, thank you. And a very happy birthday to you too!", "And they were very funny. I probably should have mentioned that.", "Read this article on the best stand-up shows to stream on Netflix and watched Todd Barry and Eugene Mirman tonight:  http://t.co/xMqDWN6oqW", "Probably a million years late on this but I love this Yung track https://t.co/bXMPRYC68D", "The new Girl Band b-side is called 'The Wrath of Nick Berry' if you needed any more reasons to love them.", "The Alan Partridge joke that still baffles Chris Eubank http://t.co/fB91rYU7tw", "@aarora17 He's amazing (I hugged him at his show on Saturday as he walked through the crowd)", "RT @KasaiREX: taylor swift reminds me of a villain from one of the bring it on straight-to-dvd sequels", "Oh hello new Joanna Newsom, I've missed you https://t.co/QrupCAxl2F", "@gdpreston Think I got quite lucky with that. Although didn't enjoy the fact that Oval Space was the hottest place in the entire world.", "Visions was a lot of fun, wasn't it? I wrote this for @guardianmusic http://t.co/8L92OmV4e2", "@LucieGraceFace It was pretty good actually, although cringed a little at the talk about Twitter and Vines. You'll feel better tomorrow!", "I thought I was delirious but, no, I have just seen an ad for a programme called Abz on the Farm (yes, Abz from Five) http://t.co/TOmoQEMeNs", "@LucieGraceFace Some sort of bloody hero, that's who LG. Now watching Chef. How's your day been?", "@TPOEblog That's commitment to culture and exercise.", "Just went to the gym: one man was reading a book on his exercise bike, another was on a hands free call on the X-Trainer. What's happening?", "This Is My Jam will be no more from September (though tbh not sure how many people were actually still using it) http://t.co/enOWvkTzRI", "I would not score any goals if my manager inflicted Kasabian on me: http://t.co/caanAAkyJQ", "Just hugged Shamir. #lifegoals", "@paulbestfit girl band!", "The new Snodgrass https://t.co/ytKbblpPqr", "@mrchristr I think you've made a poor life choice there tbf Chris.", "It would really make my day if Holy Fuck played this https://t.co/huRuZPjMoD", "How I'd like today to go: watch England win Ashes, watch Leeds beat Burnley, watch Girl Band rip my ears off, watch Holy Fuck make me dance.", "@jd_psychocandy I am not a monster, sir.", "@MattLangham @adm_bn I feel like Double Decker (along with a Boost) feels more premium than a Toffee Crisp.", "@katiesol They're ok. They always taste a little stale, like they've just gone off though (?)", "@sockformation @MattLangham Haven't had one in ages. Might have to give it a go this weekend.", "Double Decker = best chocolate bar. (Yes, I'm tackling the big issues on a Friday afternoon, what of it?)", "@MattLangham @sockformation It was strange but fun. Like walking through a mist that makes you drunk.", "@sockformation @MattLangham I just had a Double Decker and decided it's the best chocolate bar. I thought you two would like to know.", "Tonight is @DaftLimmy's Daft Wee Stories at Union Chapel. Will try to stop myself just shouting 'Kill Jester' at the stage.", "@musicfansmic Big fan of your work JM", "Enjoyed just seeing some staff working at Itsu collect their Domino's and run back in with it #eatbeautiful", "Looking through the @VisionsFestival line-up and it's looking great. But no mention of where they're showing the Leeds v Burnley game?", "@Horacio_vhr Haha - you look better in it than me. Where are the designs from Richard and Sam?", "Just wanted to say: CRICKET!", "Going to absorb alcohol through my skin and eyeballs tonight and I'm Not Sure How I Feel About This: http://t.co/yblyLvlp5z", "Thank you A Winged Victory For The Sullen and Nils Frahm, that was spectacular. https://t.co/Qs6EbT1DYe", "Headline of the day: 'Noel Edmonds says death doesn't exist and 'electrosmog' is more deadly than Ebola or AIDs' (Cc: @chris_mandle)", "Big thanks to @RickSkilbeck - I owe you some peanuts.", "Tonight I'm braving the tube strike to see Nils Frahm and A Winged Victory for the Sullen at the Royal Albert Hall. Definitely worth it.", "@NatashaHeasman Hahahaha. Haha. Don't make me laugh.", "@NatashaHeasman a little thing called class, Heasman.", "Watching BoJack Horseman, eating ice cream straight out of the tub. #life", "@michelle_amaria I've just been eating out of the tub", "RT @sleafordmods: I don't mind hipsters. They are better than lads or comedy mods or hardmen who have done 6 months bird", "@MattLangham Don't. They're definitely my least favourite.", "@MattLangham 30 Seconds To Mars", "Listen to Battles playing a live session of new songs here: http://t.co/LKKKj7Ca73", "@joeparry Don't make me fight you Joe", "The National's Matt Berninger and Menomena's Brent Knopf's have teamed up as EL VY and sound like a funky National: http://t.co/ptG9l5N0NZ", "@thomasahannan are you sleeping at work?", "RT @postmodernemo: http://t.co/49Qys2R7S8", "Sounds like they went through a lot making it too: http://t.co/ltyBfOqsgu", "So glad that Girl Band have created an album that more than meets all my very high expectations. Challenging, funny, brutal, brilliant.", "\"I'm feeling quite tired. I might have an energy drink... wait. What is that... NOOOO!\" http://t.co/6EWjUfY1tu", "RT @CrayonToCrayon: 'Bulgy and Tough' - A retrospective of David Bowie's crotch through the ages. http://t.co/SfjOhC0Xoe", "They just played Wearing My Rolex in Rowans. Does life get any better?", "@matthewjh I was flicking through my iPod and their unwieldy name caught my eye", "I'm listening to The Cooper Temple Clause's debut album. AMA", "@gemtriesharder Give me ten minutes. Where shall we go?", "@gemtriesharder I could do a quick drink if you fancy it?", "So, this Frank Ocean album. Only 10 hours to go Frankie.", "@williamggrant http://t.co/JzspxburjR", ".@timjonze's interview with Blur is an eye opening read. I never want to play the Punching Game: http://t.co/u8IZsmgrlk", "@AndyVale I've resolved to slide through every doorway I enter today", "Every single Kramer entrance, in order. You're welcome: https://t.co/5L0KajZvZn", "Ought are fast becoming one of my favourite bands. New song Men For Miles is great: https://t.co/wEU5e4YKRG", "RT @AmznMovieRevws: The Shining. #tbt http://t.co/Cn1dt4IZXj", "YOU NEED TO LISTEN TO THIS  https://t.co/LbD2yRRJId", "RT @DisOrientFC: DisOrient are A League champions for the first time http://t.co/89vnZIktuk", "@strangedog Well, it was very efficient...", "I think the guy who just cut my hair might have been on speed.", "#believe https://t.co/6k2QL1Z5bx", "@JackMerlin Thank you kind sir. Very much enjoying your work too. Glad we made this the #swearyissue", "Quality photos by @timjboddy too http://t.co/Qg1EmSMMhO", "The mighty @_HEALTH_ are back - and I had the pleasure of interviewing them for the front cover of @LondonInStereo. http://t.co/gIRi881j91", "\"I don't believe a word about him being involved in corruption. Sepp Blatter deserves a Nobel Prize,\" ... says Putin. Well, I'm convinced.", "I'm listening to Oh, Inverted World for the first time in a long while and it still sounds pretty much perfect.", "Hello @getinthesea, there's something for you here: http://t.co/4Y17o6vBIg", "RT @ariscott: \"What should I write on this sign for avocados?\"\n\n\"Just make something up.\" http://t.co/R28fbR4VwB", "Haruki Murakami Reviews: The UK's Top 20 Singles for @theQuietus http://t.co/na0rEm8xzo", "Overheard comment at Borough Market: 'Fuck you and your lactose intolerance - let's just get on it'.", "This picture of Billy Corgan at Disneyland is everything you could want on a Saturday morning http://t.co/90LlPdzQm3", "Tumblr of the day: Why I deleted your band's promo email http://t.co/EibO5Kr6Sl", "Just received an email telling me that I've tweeted. So that's good to know. http://t.co/mERgnovEJA", "@_rachelgrace I go instrumental. Explosions in the Sky or A Winged Victory For The Sullen.", "This piece by Mark Steel on Jeremy Corbyn and Labour Party is great: http://t.co/U3VlyVe7z6", "RT @ddavidrenshaw: In 1995 Peter Stringfellow sent NME this letter. Turns out he was more of a Pulp man. http://t.co/kTCKkYSztE", "RT @GreggsOfficial: We hear that #JakeGyllenhaal likes to go HAM on a Greggs when he's in London. #Southpaw http://t.co/9lWGJC1VGI", "@gdpreston A dulcet Lancashire/Liverpool voice will work nicely.", "So please adjust the voice you read my tweets in accordingly.", "Highlight of the week: @katiesol, on meeting me for the first time, saying 'You're a lot more northern than you seem on Twitter.'", "@Dave_Rowlinson @gemtriesharder @LucieGraceFace My mum read one of my reviews once and said 'What the heck is krautrock?'", "My mum is coming to London for the weekend tonight and I seem to have only planned one thing to do. Any suggestions on what to do?", "RT @corbynjokes: Yo mama so old that she's really going to struggle with social care provision from her criminally underfunded council.", "@williamggrant Ought!", "@S83bai I'm interested to see how they turn what are, by their nature, depictions of one feeling into characters. But I suppose that's MrMen", "The end is coming. http://t.co/Tq13Ppf3IH", "And now I can't stop listening to Atlas. Obviously.", "This shortish doc on Battles is very good: The Art of Repetition https://t.co/uh541pEuJt", "@MichaelCragg Exactly. These niche award categories get no recognition any more.", "All this VMA chat and no one has mentioned that Carly Rae Jepsen's I Really Like You wasn't nominated at all.", "RT @FelicityMorse: This is what I imagine would happen when you try and write a Guardian comment piece drunk http://t.co/0CUxOIyHIY", "@Dave_Rowlinson But at least you were having great fun last night.", "@gemtriesharder I can't listen to it any other way now.", "@paulbestfit right? It just seemed so patronising and ill researched.", "@michelle_amaria Thanks for the insight Michael", "@paulbestfit It's the worst book I've read in a long time.The metaphor at the end is horrifically bad - keep reading just for that", ".@marcrileydj I'm glad Fat Harry White got to feature on the new Tame Impala album https://t.co/5qJvTEwuLr", "Tonight is Cut Ribbons and Colleagues at Birthdays. It's free. There are Lucky Chip burgers. Why wouldn't you come? https://t.co/T5AXVyZnpc", "@TomSSatchwell oh god. That's the worst", "Just saw a real human man actually wearing a t-shirt that said 'Snitches get Stitches' on it.", "RT @SimpsonsQOTD: \"Y'ello? You'll have to speak up, I'm wearing a towel.\" http://t.co/OypHdrPLqx", "RT @HYPEBEAST: When there's 11 days left in July. #FrankOcean http://t.co/toCAMFVAac", "This guy got 'Skepta' tattooed on his pelvis so his girlfriend dumped him (via @emmaggarland) http://t.co/tcgCu7hbke", "@camille_thomas Hey, my Aussie accent is a solid 8/10!", "I just had vegemite flavoured chocolate. It's not as bad as you would imagine. IT'S EVEN WORSE.", "Just come to work and found out about the fire at Dinerama. Such sad news http://t.co/Ye3txkqsVB", "RT @shit_rock: Just stuck the single (*cough**double-cough*) on bandcamp. https://t.co/sdUJT50RYV Album to follow soon-ish.", "This is true. https://t.co/hvN8F0NVtm", "Transcribing an interview at midnight on a Sunday is not the one.", "If you didn't watch the David Bowie: Five Years doc last night, I heartily recommend it: http://t.co/c5MLqSEei7", "@joeparry That basically reads like a IT'S SAD WHEN tweet", "RT @AndrewBloch: Phil Neville attempts to tweet in Spanish. Makes an unfortunate translation error. http://t.co/rA43AGOSfD", "Can't tell if these words off Currents are the best or worst lyrics ever.", "'Someone said they left together\nI ran out the door to get her\nShe was holding hands with Trevor\nNot the greatest feeling ever'\n#lyrics", "Apropos of nothing, here's a shovel being dropped that sounds like the start of Smells Like Teen Spirit https://t.co/JkCPaLNvYf", "RT @robmanuel: Any speculative types want to speculate why Rupert is picking a fight with the royals? And why now? http://t.co/3Ie8vYnuKX", "So Marshall are releasing a phone... http://t.co/qbJplBM1u1 http://t.co/xsnpgTD8nM", "@AndrewAHannah As if YHF isn't top Andy!", "@sammymaine @katiesol Haha - I might write about this in the comments of the article.", "What a way to start your Friday https://t.co/V0WCawbN4w", "@gemtriesharder what do you know...?", "@katiesol Don't. Please. I need this album.", "@tommw Haha - I wish. Though I will feel pretty smug if I'm right.", "Where's this Frank Ocean album then? Shall we start a sweepstake? I'm going to predict July 23 at 5.57BST", "A heartbreaking read: Twice a month 2 Japanese men put on scuba gear &amp; go diving, looking for a wife and a daughter http://t.co/aLgoiWwl4j", "I have Battles back in my life http://t.co/cVh5OY1oLL", "@aimilewis1 I'm intrigued by the 'secret missions'.", "My thoughts are with Nick Cave. Such tragic news: http://t.co/aevnndY3Qe", "@aimilewis1 yes!", "Mhairi Black writes with as much common sense and passion as she showed in her maiden speech: http://t.co/TvB5Xskcu5", "RT @_MikeEdwards: You what m8 http://t.co/M8CQfxMe2P", "@mandapen I'm not sure how it happened - here it is http://t.co/EjmC6lCpkW", "Still trying to get my head around the fact that Ezra Furman was on Channel 4 news tonight.", "Never really 'got' Tame Impala before. But this new album. Oh boy. http://t.co/ZYuyItprQP", "@AlejaDC I know - I can't wait! Only have 24 hrs in Bogota - what would you recommend to do?", "Rashly decided to get over 2 days of rain by booking a trip to Mexico, taking in Belize, Guatemala &amp; Colombia. Any tips please let me know.", "RT @timjonze: Why can't rock'n'roll's old guard handle Kanye West? http://t.co/HmeqQPlZXK", "Have you ever thought Djokovic looks like a trendy Tim Henman?", "Shit. De La Soul are DJing.", "Tonight: Dave Chapelle's Juke Joint complete with Stevie Wonder's backing band. In Willesden.", "@McCormickDaniel who's crispy? I was in the coral mate", "@McCormickDaniel what's happened here? Have you gone mad?", "Celeb spot: just saw the lead singer of The Wombats carrying a large cuddly toy giraffe through Stoke Newington.", "@SimoneSkilbeck Ah - I didn't get sent that :(", "@SimoneSkilbeck I have not! How can I hear such a thing?", "Currently listening to Miles Davis improvising on LCD Soundsystem thanks to @tokyorav https://t.co/zX7cMc3zyP", "Just been perusing the (great) new Leeds kit on the site. Which #fullkitwankers actually buy these? http://t.co/y1D65NwxoI", ".@NeilAWood has gone and done a great song: https://t.co/38eouzjR8f", "Last night was a lot of fun http://t.co/u0sVhtTrrA", "We just played Mr Tembo. Scenes.", "@merlinjobst I hope this girl covertly follows you on here.", "Tonight I'm DJing at Koppaberg Forest with @Dave_Rowlinson &amp; @LucieGraceFace. Expect lots of Jens Lekman deep cuts and *maybe* some Blur.", "@Dave_Rowlinson Don't worry, I also beat Mike 6-0, 6-0, 6-0 at tennis. I was just on form yesterday. Back to normal today.", "@chalravens That's sad to hear.", "I should probably clarify that it was me playing tennis, not Clive Anderson, as that shoddily composed sentence implied.", "@SongbyToad yeah not great phrasing that was it! He walked past me while I was playing tennis", "Clive Anderson just walked past me playing tennis in Highbury. Trying to think of a good Whose Base Line Is It Anyway? joke.", "Julia Holter is back with a big, beautiful burst of loveliness (and a very cute dog in the video) https://t.co/jHGKTcPhRb", "So Girl Band's debut album is out just in time for my birthday. Lovely (abrasive) stuff. https://t.co/Ylvq3mfsUw", "Oh yes: Father John Misty Says New Album is Written, Isn't About Love http://t.co/OXiakzFqrh", "RT @amateuradam: Some sickening facts about tube drivers. http://t.co/s59Vmr1lVS", "Dave Chappelle was like no comedy show I've seen before. Couldn't imagine Russell Howard with a hype man.", "Ought have made some sounds that I like with their new song https://t.co/M6U8NtzNKt", "@StephanieFlooks @Dave_Rowlinson Tried Great Eastern Street on the off-chance - no joy.", "@StephanieFlooks @Dave_Rowlinson I'm 2 minutes from one so will check at lunchtime. #yalldoomed", "I remember once, falling asleep, stood up, dressed as a cowboy, surrounded by Japanese salarymen. Waking up from that was quite a shock.", "@Dave_Rowlinson yes! Let's avoid the strike by eating Blur ice cream.", "I used to love watching (and doing) this in Japan. The Japanese practice of inemuri and the art of the urban nap: http://t.co/Jld6PkRdso", "I've made a playlist of my favourite songs of the year so far if anyone is into that kind of thing: https://t.co/l6lYDMv9v8", "Greece says sorry to the European Union with a present of an enormous wooden horse: http://t.co/0MiqFFtUWC", "@gemtriesharder @MattLangham @stejvic Loved Ordinary Boys at the start. Pretending they liked Will Self. Then going on CBB.", "@MattLangham @gemtriesharder Did you know Hard-Fi sold out Brixton Academy five nights in a row?", "Who are you?\nI'm the enchanting wizard of rhythm.\nWhy did you come here?\nI came here to tell you about the rhythms of the universe.", "If you're doing anything at 11.02 on a Monday night it should be listening to the new Christian Fitness track https://t.co/d8lYeH97Ty", "I just remembered I'm going to see Dave Chappelle on Wednesday and I'm very excited.", "@williamggrant https://t.co/KtJtwEXNYX", "Damon Albarn carried off stage by security at Roskilde Festival after refusing to end five-hour set http://t.co/cpPfhdTeMs", "RT @Pinter_Quotes: The forces against Left are very great and very ruthless. By the Left I also mean, incidentally,  the poor.", "The Watershed category can only be shown after 9pm #shedoftheyear", "That's not a shed. THIS is a shed. #shedoftheyear", "@SimoneSkilbeck If it wasn't a Monday I would defintely come but I have something I can't get out of. I'm gutted.", "Just eating raspberries and ice cream and listening to Tame Impala's Let It Happen on an infinite loop. You?", "The bass from the soundsystem at Wireless is making my room shake.", "It's the day Will Smith invented America. Happy #IndependenceDay everyone.", "RT @phlaimeaux: Serena Williams nickname should be 'Tennisy' Williams", "This is great: Ezra Furman on how his ambiguous approach to genre &amp; gender shape his performance http://t.co/DALJk53YFG", "Chris Simpson's illustrations basically nail the creative industries: http://t.co/XIb2ra85DJ http://t.co/i1NlrCAnej", "I had a dream last night I bought some Alphabites. My subconscious is so crazy it's untrue.", "Such a harsh way to lose - but that team should be very proud of themselves. #Lionesess", "'Bros' by Wolf Alice on the World Cup semi final show. Worth staying up for on its own.", "@merlinjobst I blame the heat. And my massive fingers", "@merlinjobst bake some bread instead?", "I like to imagine that Debbie Harry and Sufjan Stevens are having a joint birthday party today.", "Really need to visit this huge, inflatable bouncy castle sculpture of Nicolas Cage in a Cage http://t.co/77lATmLGkE", "@supermodernista I'm very jealous. What was the capacity? Looked tiny", "Can't believe I missed that secret Beck show last night. The setlist looked incredible,", "If I was Prime Minister it would be the law that if the weather's like this you must play Northern Lites in every office and school.", "Lesson learnt today: don't wear a light grey t-shirt in this weather.", "Last night I spent an evening of music &amp; poetry with Beck, Thurston Moore &amp; Simon Armitage. Here's the review http://t.co/cS2HOpAYDg", "Here is that poem - so good: http://t.co/kJgXjtN3yL", "@rosbadger Found it. It's Paper Aeroplane: http://t.co/kJgXjtN3yL", "@rosbadger I'm not sure sorry! Tried to find it online last night but had no luck.", "Simon Armitage's poem tonight at the Barbican was brilliant. Beck and Thurston Moore were pretty good too.", "@McCormickDaniel bloody hell. Wishing you a speedy recovery.", "@McCormickDaniel Woah - what happened?! I hope Thursday is still on!", "Has Gareth Gates announced his collab with Young Fathers yet? We all know that rant was a PR stunt guys.", "@Dave_Rowlinson @thomasahannan I was making a joke about you two", "@thomasahannan @Dave_Rowlinson Make your own joke up guys http://t.co/QDy35hLbyv", "Looking forward to Beck's evening of music and poetry tonight although not really sure what to expect.", "Finally had a tweet featured on Buzzfeed. Finally made it http://t.co/0Mbh9bCSBG", "#Lionesses", "@gemtriesharder so you can delete it?", "I thought I was the greatest living rockstar on the planet?", "This set is everything I love about Kanye. Ludicrous and brilliant. (And what people who don't like him hate.)", "Best BBC Kanye subtitles so far:\n\n'To all you liggas you cabinet handle.'", "RT @Gareth_Gates: Watching Glastonbury... Bands like 'Young Fathers' offend me. Is this talent? Is this musicianship? No. It's shit.", "RT @ClickHole: #LoveWins http://t.co/2h6TSkAq7F", "Glastonbury revellers, I'm going to see my cousin ordained as a vicar in Bangor today, so who's the real winner?", "Can't believe Hot Chip did Dancing in the Dark into All My Friend. Amazing.", "It's times like these I'm so glad the red button exists.", "New @LondonInStereo is here! I spoke to the fabulous Ezra Furman &amp; he said some great things. Read those things here http://t.co/pa5125PeXd", ".@NataliePrass was superb tonight. It's so good when a gig shows you another side to an album you already love.", "@NatashaHeasman yep. It was pretty great", "@Getintothis they covered janet jackson's \"anytime anyplace\" then Ryan stayed to do Violently. So good", "@brucedaisley @chris_mandle what Bruce said. Also the fish tank metaphor at the end is the clunkiest thing I've ever read", "@chris_mandle I hate that book so much", "Just Jessie Ware AND Ryan Adams on stage with Natalie Prass there.", "I think their number 38 remains my favourite.", "Right, so this has happened. Someone has ranked all 168 Seinfeld episodes: http://t.co/YhWNBp5MLI", "Very much looking forwards to the soothing sounds of Natalie Prass tonight. https://t.co/QRKCQfiAcu", "Ooh, Morrissey's let himself go. Ratko Mladic's let himself go. Mark Lamarr's let himself go.", "@KrisDeSouza Terry Christian's let himself go.", "I'm actually very excited by this. It covers nearly all my interests. By which I mean music and Stewart Lee.", "The Fall to play 37 times https://t.co/NFiIJI2qqe", "Basically, yes http://t.co/hseRHDSgiF", "@hjasnoch Er, I'll say yes! And blame a lack of sleep.", "Went to see Blur at the weekend. Enjoyed it. Wrote these words: http://t.co/rlA7CnRrp9", "Subject line of the day/year http://t.co/rF6VOwMKQi", "@supermodernista Just about found my shit again now. What a show. (and great photo!)", "'@Dave_Rowlinson - the indie Keith Lemon.'", "RT @getinthesea: GET IN THE FUCKING SEA http://t.co/Zv6UNfdLUL", "If you can't handle me at my Crazy Beat, then you sure as hell don't deserve me at my This Is A Low. #blurday", "RT @LUFC: BREAKING: The club are pleased to announce that David Hockaday has been appointed the new head coach of Leeds United #lufc", "Looks like there will be never be another new Pavement album (probably a good thing) http://t.co/NtBMathNR7", "@ellieellieellie Rocking this look https://t.co/lcYCdp127o", "Julian hair update from Hyde Park http://t.co/atfVXPwjJ3", "New York City Cops was riotous fun though.", "The Strokes seemed a thousand times more engaged and happy to be there than at Primavera. Shame the sound was so muddy.", "Beck's party set tonight sees him maintain his place as my favourite tiny Scientologist (sorry Tom).", "@Wolf_of_Gwladys ah it's been deleted - what did it say?", "@gemtriesharder I reckon they might be slightly different times so you can see a bit of both. I want to see a bit of Sleaford Mods b4 Sufjan", "All I'm hoping for tonight is that Beck plays Debra #IsaidladystepinsidemyHyundai", "The Strokes were so bad at Primavera I'm tempted not to watch them. But I'll give them another chance. Mostly to see Julian's hair again.", "Watching Future Islands, Gengahr, Beck, Hinds and The Strokes in the sunshine isn't a bad night's entertainment.", "There are many reasons to vote for Jeremy Corbyn but the most important is that he lives on the same street as me http://t.co/Yuh8ZHS6qS", "@john_freeman_ I've never been a fan (too overblown for me) but glad someone new gets a chance at headlining a massive festival.", "@gemtriesharder Viet Cong surely", "@annaebyrne haha - that's what I'm on the look out for, so I can begin my own private investigation agency.", "RT @granitetide: I would walk 500 dogs and I would walk 500 more", "Probably should stop reading people's phones over their shoulder on the train to be fair.", "Took all my will not to correct a lady writing a personalised Father's Day card on her phone who didn't put an apostrophe in 'sons hero'.", "@adrian_read thank you! A bit of recognition. I might pay to use it as a #promotedtweet", "Don't worry Michael Eavis, don't worry Glastonbury goers, I have a plan: http://t.co/JAp8ipPOHq #foodfighters", "So @dmgarrigle has signed our team up for The Crystal Maze. Let's do this. http://t.co/mSYvQjtAdy", "@JackWilson89 I will see you at both!", "I'm in https://t.co/blpZVKt1se", "An interesting insight into Damon Albarn working on his Alice in Wonderland musical http://t.co/2tBy0F226u", "Will anyone ever pay full price for a Hyde Park show again now this has happened 2 years on the run?", "@sockformation glad they've massively inflated the prices again this year so this has happened again &amp; ripped off people who paid full price", "@robleedham I can't actually, I'm home next weekend. Which makes me doubly disappointed!", "Can't believe Taylor Swift is sold out already. http://t.co/fFg5E5BkP5", "@NatashaHeasman stop making up stories about what you're doing!", "It's the BIG game tonight for FC Soccerball http://t.co/ixsMffMIiD", "Beck's just made a summer smash https://t.co/VLGUwuWxYe", "@williamggrant That's probably the best start to the week you can have.", "You should listen to this. https://t.co/4TLM08IkBS", "Matt Berry saying 'Cheeky Nando's' as a monkey is basically everything I need. http://t.co/NiNnIBjlz8", "No #content is left in this Twitter account overnight.", "Can't find anyone using the #goodbyeandytownsend hashtag. #thanksfortheinisights", "@Dave_Rowlinson @merlinjobst @JessPartridge @laurendown mwahaha The Muddler!", "RT @sidtrotter: I bloody LOVE The Libertines. http://t.co/NiEXxaZJx1", "Liars doing a cover of Bjork's Army of Me ticks a lot of boxes for me: https://t.co/LacerrF3dr", "The snippet of this new Beck song is making me pretty excited. Bringing the funk back: http://t.co/u16mYTPPkh", "Dreams can come true: St. Vincent will make you a mixtape http://t.co/q5CYp7cQvi", "RT @RealBobMortimer: https://t.co/bcCCy2no6Z", "Public warning: there is a man playing an accordion outside Exit 2 at Old Street station.", "RT @DaftLimmy: Check out Daft Punk's new single \"Get Lucky\" if you get the chance. Sound of the summer.", "Doing Friday lunch right http://t.co/SjUwKXK6M0", "@gemtriesharder @MattLangham @stejvic TC sensations, Doritos cool original, P.O. monster munch, salt &amp; vinegar anything &amp; plain Pringles.", "@gemtriesharder @MattLangham @stejvic Thai chilli Sensations need to in this list somewhere", "@Unofficial_Phil with no lights on? Dans la maison?", "Who wants to grab a Hooch later, put on our Kappa tracksuits and Kangol bucket hats and watch TFI Friday? #itsyourletters", "@williamggrant Excited for TFI Friday Will?", "@gemtriesharder @Dave_Rowlinson alwight mate. Fackin lush yeah", "@gemtriesharder would you rather have the neck of a giraffe or the trunk of an elephant? #gemama", "Dream come true, guys https://t.co/XwatukiUTg", "@Dave_Rowlinson I'm running a tight ship over here buddy", "@Horacio_vhr No I hadn't - lovely stuff! Hope all is good at AN HQ.", "Been learning sign language for the first time today. Gold is definitely my favourite word to sign so far.", "Good Shoes on in the pub I'm in. I've travelled back in time some how.", "@emilykimber I guess, but if the Afternoon sex?;) one was a genuine offer it's creeps me out (but makes me laugh at the same time).", "@emilykimber I thought I did until I read some of the texts that followed", "@MattLangham @gemtriesharder @katiesol Now we work near each other can you bring me some nice chocolate? Not Hershey's. Thx.", "Can't stop staring at #cubedogs http://t.co/e9caF3QpSC", "HEALTH did a one song encore of a one minute blitzkrieg noise blast and finished at 10.15. Love those guys.", "@Dave_Rowlinson @gemtriesharder will be there about 8.45 gem", "@Dave_Rowlinson @gemtriesharder hey subtweeter", "RT @robdelaney: IMAGINE being British &amp; not knowing that the NHS &amp; the BBC are the only things protecting the UK from being a grey Florida.", "@chris_mandle I had velcro school shoes right the way through primary school quite embarrassingly.", "@chris_mandle Laces?", "@stephenackroyd Oh god. The fact he looks a tiny bit like me is freaking me out", "Introducing my new band AtlasApolloBloomNomadParadoxMoonHazeZeroGhostIndigoAtlasAtlas https://t.co/05yHhEJPAf", "@NatashaHeasman Is this in focus? #poorlighting", "@gilescottle #businessmanatthemonkeyonsen Probably not to be fair", "@NatashaHeasman It's photography, you wouldn't understand.", "HEALTH live tonight and they've treated us to a new song as well. Tuesday is going to be good. https://t.co/D2FPek7zWb", "Also, probably the best picture I've ever taken http://t.co/yUMcES7jq2", "This BBC nature programme on Japan is making me miss this moment from a month ago http://t.co/GHU86QMeY4", "@williamggrant @basementfever @joeparry I'm a fan Jake", "RT @diymagazine: Is Kanye West's #SWISH coming out tonight, perhaps in line with the iTunes Radio launch? http://t.co/fbvHxZvuz9", "Half way through the year and so many albums that I genuinely love already. Father John Misty, Sufjan, Kendrick, Blur, Bjork, Ezra Furman...", "@simonesw Did Ride play? It seemed like there was a Northern Uproar tribute band on.", "Dressed in completely inappropriate clothes for 24 degree Field Day but on my way. Look out for someone dressed like Bill Hicks.", "RT @MrDDyer: My nut cannot and will not ever be able to deal with this........ever. http://t.co/dmPRIEHsQB", "@timjboddy they all seem to be from different parts of England. And Simon is from a place that doesn't exist", "Got excited because Frasier is on. Then discovered it was an episode with Daphne's family in. The worst.", "It's the weekend! And my mind is all like... http://t.co/6Do4bNWVRb", "@joeparry Oh hello there Joe", "FYI good day to walk about in the sun with the Jamie xx album in your ears #foxtons #summerbangers", "Headline of the day: Fall lyrics 'hard to hear', says judge in copyright case http://t.co/fK1U9lfRcB", "RT @HeardinLondon: And the winner for the best graffiti of the day goes to... #Hackney http://t.co/n92TQGYAVC", "@MattLangham Definitely. I only have grapes. Red grapes at that. :(", "@MattLangham #lovinglife", "I'm interviewing Ezra Furman today. I think we could be best friends.", "I've just found out about the BACON BOWL and now my life will never be the same again https://t.co/StLetNVzje", ".@timjonze on all the best bits (and there were a LOT) from Primavera https://t.co/77o4ZsXHm5", "The new Beirut song sounds like Beirut and I like Beirut so that's nice isn't it? http://t.co/0PI1jmTIsf", "Barcelona sun, bands and beer &gt; London grey clouds, Piccadilly line for 29 stops and ennui.", "@katiesol ah that would have been nice. I'm pretty sure you need a wristband but not 100%", "@katiesol isn't she just on at Barts tonight?", "@LiorPhillips what! What are you doing today?", "Also: can we just take a moment to contemplate Julian's hair please http://t.co/AAkTyA66mr", "I also enjoyed getting in my indie time machine for Interpol &amp; The Strokes though it makes me feel so old that they're now 'nostalgia' acts", "Sleaford Mods and Caribou were the highest of highlights of the last day of Primavera. I really want to do Sleaford Mods karaoke.", "Go and read this. I reviewed the LA Priest album and there's loads more music goodness in there https://t.co/36dXAvxuOV", "New Pornographers -&gt; Patti Smith -&gt; Julie Ruin -&gt; Belle &amp; Sebastian -&gt; Sleater Kinney -&gt; Run the Jewels -&gt; DFA79 -&gt; Jon Hopkins. Wow.", "Although watching Battles in the hidden Heineken stage felt like being an actor watching a band in The OC. #brandedcontent", "Top 3 bands at Primavera last night: Panda Bear, Viet Cong and Battles.", "Primavera apartment view. http://t.co/iHTg2Hr2Qp", "RT @superfurry: The @guardian picked their 10 favourite #SFA tracks - AGREE?\nhttp://t.co/orDbKlQHke", "What a start to the holiday - I'm only on the same flight as @sockformation and @AnantNaik. #primaverasound", "This is a very good album https://t.co/2dy1AYsL1X", "@musicfansmic Well, thank you very much.", "'I've always had delusions of grandeur.' I spoke to Dan Bejar/Destroyer about his new album for @diymagazine http://t.co/bp6F9O0vbD", "Station to Station at The Barbican looks very good indeed http://t.co/lwjjot7Tyq", "All I want in my life is a tiny horse http://t.co/FjegtUMDiI", "@joeparry I do love the fact you're on the Greggs mailing list", "Strangely addictive: Watch a piece of meat swipe right on Tinder forever http://t.co/OLy1GUwAIo", "@joeparry Happy Birthday! Have a sausage roll on me. x", "There's a new team in my five aside league called FC Life Vibes and I can't tell if it's the best or worst name ever.", ".@HearNoEvilFest ended with All My Friends &amp; people running round the dancefloor high fiving each other. What a day. Thanks to all who came.", "I said no requests https://t.co/RAOGlL4fb3", "I wonder if anyone has just played the whole of Carrie &amp; Lowell as a DJ set yet?", "If anyone is coming to @HearNoEvilFest get ready for me to drop some #sadbangers from 2pm onwards", "Hangover level: getting emotional watching Three Men and a Baby", "Ezra Furman is my spirit animal. https://t.co/VfUHTgeOd2", "Somebody call the police. @Dave_Rowlinson stole my bank card last night.", "GET IN THE SEA (CAPTAIN) http://t.co/ahZZFYhC0G", "@Anne_L_Kershaw It's really well done. I won't say anything else in case I spoil it!", "Listen to all the bands playing here https://t.co/y9nYr6Vd0k", "@musicfansmic Say hi to Liverpool for me.", "Still reeling from the final Mad Men episode. I thought the final scene was perfect. What am I going to do with my life now though?", "World leaders as hipsters... http://t.co/btY5n12cGj http://t.co/IVv19jEXKe", "@Dave_Rowlinson we all need a Mike", "@McCormickDaniel @gemtriesharder Raisin' your game", "This by @joelgolby on all the different type of friends you have is spot on: http://t.co/a9npkseQCF", "@sockformation @MattLangham @gemtriesharder @stejvic I think we might have just jumped the Revel shark with that comment Tim", "@MattLangham @gemtriesharder @stejvic @sockformation the thing I don't get is the malteser is the best so why not get a pack of maltesers?", "@Dave_Rowlinson I just had a family bag of them to myself too!", "Tonight is beer, jerk chicken and a Tei Shi show. That's what I'm talking about. https://t.co/Rs7nLR91xW", "Tumblr of the day: Modern day Mad Men http://t.co/NeT9j6D3xr", "Get down to @HearNoEvilFest this Sunday. Bands &amp; comedians in a brewery. All for charity. http://t.co/dWNuz1eoWX http://t.co/uqJZbNpj1H", "@sockformation @MattLangham @gemtriesharder Gem is 100% correct. Fruit and chocolate do not belong together.", "Mad Max Posters improved with Daily Mail comments http://t.co/Z6oja3xQhm", "@AndrewAHannah Still recovering from the weekend then?", "Just printed off (I know, I'm a caveman) Primavera clashfinder andhave started to get excited. Run the Jewels followed by DFA1979.", "'Gu admitted to the theft, explaining that he \"really liked eggs\".'", "'You can't make an omelette without breaking* some** eggs' http://t.co/cbRoKxbAin *stealing **1,000", "Bully's 'I Remember' is only 1.48 long but every second is perfect https://t.co/CzAGhS3mqi", "I concur 100% https://t.co/cpnA0mG3yf", "RT @Arr: I clicked \"Get Tickets\" and was TREMENDOUSLY FUCKING DISAPPOINTED http://t.co/FtCXKQG9yF", "@timjboddy have you used the line 'are you Tim Boddy ready?' yet?", "This is very interesting about the relationship between Sony and Spotify: http://t.co/9tdUYNCjJ3", "@katiesol @sockformation Every year I've been the forecast has been wrong. And it's really hot in Spain at the moment :)", "This guide on how to write an Alt-J song is pretty spot on: https://t.co/4bs9Sms2JT", "You can now order Domino's in the US just by tweeting the pizza emoji. Such danger. http://t.co/KmafFjpZ2M", "The only thing that would get me to a gig the Monday after The Great Escape is a secret Viet Cong show. http://t.co/RaJ9tluZFl", "*Spends all day trying to avoid Mad Men spoilers*", "This song soundtracked one of my dreams last night and I woke up remembering how much I love it: https://t.co/BdPtULo4iV", "RT @IndyFootball: Phil Jones makes sliding tackle - with his face http://t.co/dbaGdBu5oW #MUFC http://t.co/a5JDKzgdfF", "And Bully of course. They were amazing.", "Great Escape highlights: Girl Band, Tei Shi, Blanck Mass, pinkshinyultrablast, Ho99o9 and falling off my chair (not a band).", "@Dave_Rowlinson @AndrewAHannah @gemtriesharder I'm now @ home. Crying", "Pinkshinyultrablasting the cobwebs away http://t.co/nyis2oWXtj", "Bully are brilliant http://t.co/lc3r2jT6u4", "Listening to Bryan Adams 'Summer of 69' in the Pav Tav #tge15", "Happy The Great Escape day everyone.", "After so many bad 2 piece guitar bands emerging this year I'm listening to No Age to remember they can still be amazing.", "I very much enjoyed slapping Michael Gove in the face http://t.co/2oy89YnXvo", "@LucieGraceFace piranha 3DD is now on channel 4. I watched about 30 seconds but couldn't watch any more", "'A shoal of ravenously carnivorous fish invade an adult-themed water park.'", "@StephanieFlooks I really liked it, especially the crescendos. I would lose rhythm so quickly if I was involved in it!", "Bryce Dessner and Richard Reed Parry's Wave Movements was spellbinding. The perfect way to end a great weekend. http://t.co/Z1nHSb60Hk", "Listening to this in the sunshine and it seems pretty pertinent right now http://t.co/uZBBl3ky7D", "The big question about The Great Escape this year is whether I'll try &amp; roll @Dave_Rowlinson into the sea again https://t.co/7FX8XrIJ0V", "Tonight  I will see Steve Reich's Drumming and Richard Reed Parry and Bryce Dessner's Wave Movements. Pretty excited.", "Every time I listen to Aqua Profunda! by Courtney Barnett all I can hear is the Only Fools and Horses theme tune https://t.co/5MXubvF6Oz", "At a party last night we all got asked to pick one song. I think I made a strong choice. https://t.co/yvJ4JKAu3G", "Aston Villa take the lead in the David Cameron derby.", "On the 14.23 bound for East Grinstead. Feeling very Damon right now. http://t.co/w91UNFEp2R", "@Dave_Rowlinson @gemtriesharder SFA OK", "RT @getinthesea: GET IN THE FUCKING SEA http://t.co/CWqBcgqOwO", "@Dave_Rowlinson @gemtriesharder Going to go to Vauxhall for one and then come after that.", "RT @davidschneider: How can the Tories have won? We did so many tweets and photoshops. I just don't get it. #GE2015", "@gemtriesharder Let's get drunk tonight", "RT @nadiakhomami: Welcome to the next five years.  https://t.co/OA7TA3nxUG", "Of course my train is delayed this morning.", "What a terrible day. Hearing this song live tonight is going to mean even more. https://t.co/HgXcSJDfeA", "RT @JackPittBrooke: 1-0 lads, park the bus.", "Please.\nYouGov Exit Poll:\nCON - 284\nLAB - 263\nSNP - 48\nLDEM - 31\nUKIP - 2\nGRN - 1", "Shall we all leave the country now then?", "@sockformation Oh hiya Tim!", "Imagine if the Tories are no longer in tomorrow AND I go to see the Super Furry Animals. Imagine what a day that would be.", "Forget about the election debate, the verdict is in after I saw Slaves last night: http://t.co/pXsZuKpbSM", "Voted Pirate Party, obviously.", "Just voted. If you care at all about the less fortunate people in our society you should too.", "@victoriaparkey @MattLangham I'll stick to my Kinder Bueno", "@BarbicanCentre How different is your mindset when you're composing to when you're writing National songs?  #AskBryce", "The @BarbicanCentre are doing an #AskBryce Dessner Q&amp;A at 4pm. So all you National fans should get involved.", "\"The worst chocolate bar is Cadbury Flake because it crumbles easily. If I touch chocolate I feel dirty.\" http://t.co/EVbKJNxkuD", "Just emailed @Dave_Rowlinson to let him know I was 'really digging' a new album I was listening to. #musicjournalismfrom1978", "@_rachelgrace Haha - not sure whether this is a good thing but I'll take it.", "My work here is done  https://t.co/teZuwgLXak", "Hey, it's Justin Timberlake as a depressed lime... https://t.co/FO6WmE1zCe", "RT @MaryRiddell: I am a diehard defender of our free and brilliant press, but some of tomorrow's front pages mark a bleak day for journalism", "If nothing else, this should get you to vote. Coalition proposals to cut welfare for sick, poor, young and disabled http://t.co/aOB0ig8zkS", "@_ChloeGreen_ That, in turn, just made me laugh out loud in the office. This is turning into a vicious laughter circle.", "If anyone is finding Tuesday hard after the long weekend, I recommend a dose of DBP's website. Always perks me up http://t.co/oOod7Cgtcp", "@thomdenson 8.7", "Blur doing \"Tender\" with Jimmy Fallon... https://t.co/wGXqkQzblF", "'Every copywriter thinks they're Shakespeare.' 'It's something to aspire to.' #MadMen", "@spiraltastic I've been asking myself that all day", "@gemtriesharder Friday is going to be so good", "I walked through Camden AND Oxford Street today - I deserve a Duke of Edinburgh Style award for not having a breakdown.", "@jackanori would love it! Thank you!", "@McCormickDaniel Love Ola. Great lad, top player.", "@Dave_Rowlinson @StephanieFlooks Good hand that", "@Dave_Rowlinson @AndrewAHannah Hello!", "@LucieGraceFace May is looking pretty super too, to be fair.", "I had a chat with @bopenglishmusic about his amazing album &amp; why he had to finish it before the bills got too high http://t.co/amYspcodux", "I would give April a rating of 9.3. Well done April. #bestnewmonth", "Best anecdote ever: Placer County Man Punches Bear In Face To Save His Dog https://t.co/eNP5j6a03z", "If anyone has invented something better than a cup of tea and a bacon sandwich on a Friday morning, I have yet to discover it.", "@simonesw I thought you were 24?", "So apparently I only have another 5 months of listening to new music. Better make the most of it: http://t.co/d8lKNdgGEb?", "Cameron calls Miliband a joke. Here he is taking a question from a member of Geordie Shore sitting on the toilet https://t.co/w5HhpFDvET", "@williamggrant Well, sorry I sent you that email", "@jd_psychocandy I really like it - it's like a brief history of all their albums but somehow fits together really well. And Ong Ong is ace.", "@McCormickDaniel Duke's Brew &amp; Que in Haggerston.", "In 6 hours time I will be eating this. Can it be 6pm now please? http://t.co/NQgirrSt7I", "This LA PRIEST album is going to be SO good: https://t.co/GlRPYFcB4K", "@LucieGraceFace French la I'm pretty sure", "Tumblr of the day: Comment is Weird http://t.co/bxULOCbBiB (via @kathrynXYZ)", "Surreal headline of the day: Bittersweet 'tribute' commemorates woman who died and squashed her dog http://t.co/TdUvA3qcur", "Oh!bergine http://t.co/O6C2zKl8rb", "Loving the funky jangle of this new Unknown Mortal Orchestra track https://t.co/kaoop3Y24e", "Aptly listening to 'There Are Too Many of Us' this morning as I crammed myself into 3 inches of space on the Victoria Line.", "@Wolf_of_Gwladys Both great albums. But they're very wrong.", "@merlinjobst Bring it Jobst.", "@merlinjobst Leave London?", "RT @DMReporter: COMMENT OF THE DAY: #JusticeForPhilip http://t.co/5sqQUfsSev", "NEW @LondonInStereo and Wolf Alice get to grace the cover for a second time. Read all the words here: http://t.co/d6MrsImkmY", "The history of the poo emoji is actually really fascinating http://t.co/6gSbDxrsg2", "The @VICEUK Guide to Mental Health is important, insightful and very much needed http://t.co/lbZN2hvrSO", "@_ChloeGreen_ Oh god", "@jackanori @Dave_Rowlinson Ah, no worries. But yes - rugby tackle or clothes line them please.", "@jackanori @Dave_Rowlinson Could I get one too? (sorry for being a cheeky bastard - will pay for it obvs)", "Happy Monday. Here's what happens when you put a tortilla on a record player https://t.co/ftJERj0KdJ", "'We went out on a bender of beer &amp; LSD &amp; to this day I can't remember who came up with the name' The SFA doc is ace http://t.co/Cc72QYTcDV", "Cheering at the marathon, eating a packet of Bourbon biscuits. #fitness #running", "In a pub and they're playing Just A Minute in the toilets. I can out middle class anyone.", "@Dave_Rowlinson @gemtriesharder Whenever I say Ong Ong I pull an imaginary lorry horn.", "@gemtriesharder Love everything except maybe New World Towers. Listening to Ong Ong with the sun out is all I ever need really", "I knew wearing my HEALTH t-shirt to work would do the trick. NEW SONG https://t.co/PrHrMq7jDR", "Clickhole's surreal oral history of Mad Men is the best thing you'll read today: http://t.co/JliKrpJX8d", "Happy St George's Day http://t.co/8GdFIJpjDx", "@ilovealcopop See you there", "Forget about Grant Shapps for a minute: 'Dog 'takes control of tractor' &amp; drives it on to motorway' http://t.co/ksFksJxRdC", "@McCormickDaniel I'll speak to someone and see what I can do.", "@McCormickDaniel up to much at the weekend?", "Really enjoying this American Wrestlers album: http://t.co/EGYbUVd6Ck", "@marlowwinter Woah - that first episode was quite the headfuck.", "The Blur album is streaming, your Tuesday is saved: http://t.co/BM0iyJpgcA", "@coralamberrr And you're going to Sheffield. Everything is great.", "Just starting on the final episodes of Mad Men. Hold me.", "@Dave_Rowlinson @joeparry @timjboddy @michelle_amaria Always the way mate. I go where others do not dare.", "@timjboddy @michelle_amaria @joeparry Ah no, I thought I'd come up with a new thang there. I will work on other lookalikes.", "Has anyone ever seen @joeparry and Todd Terje in the same room?", "RT @cooledmiliband: Ed Hogan #HellYesEd #CoolEdMiliband http://t.co/s5YIJIrVDq", "Tumblr of the day: TELL US YOUR STORY: All the brands that want to hear your stories. http://t.co/lcHsKHLvw5", "@joeparry Grecian 2000 is also just called 2000", "This Sizzler ad from 1991 might be the best thing ever. It makes me feel proud to be American (and I'm not American) https://t.co/vsbqjzouIO", "@gemtriesharder Ragu (I like this game)", "Delighted to confirm Colin from Mull Historical Society is playing @HearNoEvilFest. Get your ticket, it's for charity http://t.co/Y5Yn8LY2tG", "Hey lady on the train eating your way through a whole block of cheese, I like your style.", "My Terracotta Heart is a bit of a beauty isn't it? https://t.co/XQMtupYCTB", "@sockformation I wondered what they were going to do when that closed. Obviously realised it would have been chaos.", "Never really need an excuse to listen to @wolfalicemusic's Bros but there is one anyway - it's been remastered: https://t.co/7MjeWIe7c0", "Can't believe my favourite album ever is 10 years old this week http://t.co/GPUPVnNyVm", "@Dave_Rowlinson fyi I'm back tomorrow", "@Dave_Rowlinson Dave, GET TO JAPAN NOW http://t.co/kvjA5YRPxu"]}