{"melnyczuk": ["I love not being in the UK", "This is the worst scripted episode of GOT ever. It's so so so badly written.", "4 mins into GOT and I know why they call her Arya, cos she make you go AH YEH!!", "I really wish Americans knew Human Rights laws as intimately as a lot of them seem to know gun laws :/", ".@piersmorgan hey man got something for ya https://t.co/s1RPaIURmb", "there's too much music.", "my career peaks as a photo I took ends up in a meme. https://t.co/26o9evcw4B", "page 1, result 1 https://t.co/a3OmLxV9El", "@fnstudio @GoldsmithsUoL hey, did you ever find out why?", "It still takes the same amount of passion and drive to make something truly special.", "The digital revolution of access to filmmaking just proved that people wanna make the same unimaginative films that were being made before.", "https://t.co/TmETWL9I5r", "Real progressive of you @leonrestaurants not at all a jerk move. https://t.co/GREn1jkfIN", "artworks that don't work.", "weird obscure prolonged beef.", "@romarsuperstar don't make kids do weird things.", "They have made a kids version of The Voice. This is so fucked up.", "Learning to code has been the single most rewarding thing I have ever done artistically.", "warm bed of familiar energy.", "hi res png of a rock.", "https://t.co/q6kOTSkmPw - Google APIs Terms of ServiceLast modified:... https://t.co/U54BDTsVpj", "https://t.co/MvoKmiwsv1", "Boatlyf https://t.co/iww56DJ3ni", "https://t.co/TZLSLBAyoh", "RT @cushbomb: Hey guys?\n\nGuys?\n\nGuys?\n\nHey guys?\n\nYou think Bernie might've won?", "Snap election! Then Corbyn wins in a landslide, and seeing the stars align, moves to abolish the monarchy. The people cheer, credits roll.", "Then the Queen dies and a heartbroken Gove says he it isn't right for him to lead a gov without the monarchs blessing...", "Best case scenario: may wins but quits due to election disaster, so Gove takes over...", "https://t.co/BpPMp0IGeV", "https://t.co/QBfCmWKma1", "I would like a crash course in plant care pls", "RT @GusTheFox: Good. They shouldn't be fucking selling it https://t.co/o2Cp3j7YKH", "Remember, May wants to take away your pension.", "The 12th can't come soon enough", "Speaking of mummified corpses, how old is Tom Cruise and what happened to his career?", "*of lorries.", "when are we gonna finally admit that this country is full?", "do we even have any idea how many lorries come into this country, hidden in the backs of other larger lorries?", "just because our politicians aren't brave enough to say it, doesn't make it not true.", "this is exactly why we need tighter controls on the numbers of lorries coming into this country.", "not all lorry drivers are terrorists but all terrorists drive lorries.", "If fruits really wanted to be eaten more then they would evolve to compete with the contemporary snack market.", "https://t.co/I0I5tbFvvn", "@realDonaldTrump you're right, this is why need tighter van ownership laws.", "and now the country waits for @KTHopkins to be a cunt solely to promote her personal brand of being a cunt.", "I'm starting to think the word 'documentation' means nothing at all.", "RT @Julie_Johnsoned: https://t.co/yyQdvJmnoz", "RT @larrymatovina: HELP ME PLEASE. A MAN NEEDS HIS CLIMATE PROTECTED https://t.co/rbPCL2ocI4", "this is all getting a bit fall of rome.", "after my morning covfefe, that ends my morning tumblr dump.", "https://t.co/ae7TXb0AXh", "https://t.co/RUCMdFTnOr", "when I am sad my friends buy me chocolate and this is let's me know they're my friends.", "RT @robmanuel: Theresa May follows 0 people. Says it all. Not listening to you or me. https://t.co/x78ICqK1Zi", "You place your belongings inside and hope they stay dry. A kayak is therefore full of hope.", "In a kayak you can feel the cold water but it is a distant knowing. It is implied.", "I want to paddle a kayak a long way", "Ambient live coding", "RT @MrMichaelSpicer: In the UKIP manifesto. Wow. https://t.co/lBwbm8601l", "I write like a beast from a fold-out couch.", "https://t.co/m4lakbC29T", "Mass education sucks.", "Designers also trade in storytelling. The elements we must master are not the content narratives but the devices of the telling~Michael Rock", "Tates got some dope books right now. https://t.co/ly18qZkZb0", "This town is gonna drown.", "So tired that, if someone were so inclined as to throw an object in my direction, I would just fall backwards without objection.", "Watching a geezer harass a stranger about the finer details of McGuyver.", "Thinking less about content of form and more about the form of content. Flow and structure are forms in themselves.", "RT @annaleszkie: GIRLS DON'T HATE BOYS\nGIRLS HATE HEGEMONYYY", "so Natwest Peckham is another of the fuckboys who say they'll call you but never do.", "if @NatWest_Help are always experiencing higher than normal calls, does that mean they sometimes unmake calls to balance the average?", "This was seemingly, her sole contribution to the women's movement.", "Thatcher spent 11 tireless years trying to teach us the simple fact that women are just as capable of being despots as men.", "It's infantilising and demeaning to say that a woman can't be evil or to say women are unable to be fascists who should never be elected.", "Safe to say the cabs I leave in the dust aren't worth the road they trample on.", "I should maybe get one of those creepy track my ride apps to see how fast I'm actually going.", "@vanessaptrsn a bicycle and a strong desire not to miss a train can be a powerful thing.", "Hey France, could not put a Putin stooge into yet another seat on the UN Security Council, and also stop actual out and out fascism pls.", "Just got from Nunhead to Kings Cross in half an hour pew pew!", "https://t.co/08o6HEULqJ", "https://t.co/L75JhjHC1k", "Oh look, #eveydaysexism", "2nd talk this week name checking Hito Steyerl *high five emoji*", "\"The labour of permission, not just taking\" - Erica Scourti", "If the world we experience is constructed by language, then photography needs the same translations we live everyday.", "Have always been compelled by the parallels between photography an poetry.", "Exploring the link between photography and text down at @Tate", "balding hipsters.", "\" Human\nanimal are distant animal who communicate through the\nforest of signs. \"", "This poetic labour oftran lation i at the heart of all learning.", "https://t.co/9LItBl70G0", "I am glad of other people doing things so I don't have to.", "well done france you dumbkopfs.", "https://t.co/efJ8136DwV", "RT @HilariousEdited: hey @pepsi that shit is not working https://t.co/uivauKixUR", "this is not good.", "I take back all my lamentation of OSX's drag and drop bullshit now that I can't find my keyboard.", "Fatigue", "RT @Teddicchi: I'm never leaving twitter. https://t.co/k07XABgeds", "RT @HealthUntoDeath: I see Brexit's already not going as planned. https://t.co/TZs1m6nPV1", "eating only apples.", "Last night i fell asleep in a pile of chocolate.", "Doggo's inna basket. https://t.co/rCedTCY5YL", "@cyber_god_314 suck a dick you cuck", "https://t.co/9WHaBTAZBF", "when ppl say \"conservatism is the new counter-culture\" I wish I could live in that alt reality bc here the conservatism pricks are winning.", "The term \"sore loser\" is undemocratic and frankly fascistic. You can only be a sore loser in a game. This is not a game.", "THIS MOTHERFUCKER IS THE EXACT MOTHERFUCKER I WANTED https://t.co/6XzLlpFzhF", "Shrimp meatloaf is the stuff of nightmares.", "I dated a writer once, and I never read anything she wrote.", "Man that chapter Joan Didion wrote about The Doors. My god!", "RT @prttybadtweeter: this is as patriotic as I've felt in a long time https://t.co/yiVxd8semM", "RT @foreigncorr1: Trump's speech in front of the CIA is frankly off the radar https://t.co/olA8tfxy4c", "windows 10 is so needy.", "Don't debate anything if you can't empirically test it, aka, you don't have a voice if you can't afford to fund science research.", "RT @Peston: The view from here, and the view from there, of @theresa_may https://t.co/OjBC2tmr04", "Meaning &gt; empirical data", "Interstellar is such a wasted opportunity of a film.", "RT @cafedotcom: We're \"all\" going to \"die.\" https://t.co/CQJLvvdb7z", "\"War beaten back by apocalypse.\" -- Susan Sontag", "Reading philosophy is the act of admitting your not as smart as you think you are.", "would you begrudge a man his christmas ham?", "RT @sam_kriss: i can't think of a demand more utterly tedious than universal basic income without collective ownership", "So I'm watching pitch perfect for the first time and I guess I'm late to this party but why is she using traktor like that? What?", "RT @rey_z: please please do not hesitate to use these services over christmas if you need them https://t.co/bo2SMcdzy4", "RT @DMReporter: TERROR: Do these photos prove the Berlin attacker sneaked into Britain disguised as the Queen? https://t.co/wyFeU0kF7E", "pretty sick that despite how white Star Wars is, people say \"but all the aliens\" &amp; just openly admit they think PsOC aren't human. fuck you.", "All I want for Xmas is someone to have endless conversations with about left-wing politics, film and art.", "No one wants to be the one with the book.", "GOV INTERN: Mr Vice-President-Elect, Mr Trump is dead!\n*jumps up, fur on end*\nPENCE: Then I'm the King of the Cucks!\n*Flies up chimney*", "I'm writing the first draft on an essay on technocapitalism in Google Docs because fuck my data-footprint.", "its sickening how few films are made by women. it's fucked up.", "this year's xmas ads are as weak as the economy.", "who's afraid of the big bad number?", "Make Existential Boons Bourgeoisie Again https://t.co/OQXtfxjTrt", "binary. https://t.co/VXfESrVpXk", "lol @ US imperialism spending the entire post-war period trying for worldwide free trade then voting Trump cause \"China's taking our jobs\".", "I am learning to work with in tech so now all your bots will think to follow me.", "anticipated, and, therefore, managed.", "So, if you think about it, the flat-eathers are right.", "This is done by the same mechanism that allows post-modernism to reduce all meaning to abstract points on a fictional horizon.", "To construct a linear perspective, the curvature of the earth is forcibly negated.", "RT @SenSanders: Where'd you get your PhD? Trump University? https://t.co/P5Ez5fVEwD", "@charlotte_dann just do what mother nature is telling you to and put you hands and feet inside a small incision in yr abdomen.", "Lol @ govs confusing \"the banking sector is the engine of the economy\" with \"give the banks whatever they want and they will make you rich\".", "RT @mollysoda: #YesAllMen https://t.co/gensqghC7f", "@charlotte_dann men value their extremities.", "go be amish ya luddite.", "@maywaver I thought pickup artists was that stupid games kids play where you throw a deck of 52 artists on the floor?", "praise the lord for youTube 2x speed.", "look to physical real world phenomena; another cup of coffee perhaps", "RT @frankieboyle: You've got a torture camp in Cuba https://t.co/Y494VJ0NMD", "give strength to me to wake in days like this and hold out for a sensation that, even lost, can still give focus and drive and purpose.", "it's hard to make and do.", "\"ugh poetics is such a pretentious and inaccessible term, I know I reference batman\"", "\"Is this your brother betrothed to the queen of Illyria?\" The app prompts \"but I have only a sister\" you think analysing the profile photos.", "imagine if you will an app called Twinder in which you only swipe to find the long lost sibling you were separated from by a storm at birth.", "@Film4 well now hang on a minute!", "Can I legally change my name to be the same name I have now but written all in capitals?", "What's the point of making things if you never help anyone else make things?", "just keep dumping.", "my kingdom for a mouse.", "@DeplorablePolls SPEAK ENGLISH", "@DeplorablePolls that's five words.", "RT @spodermenpls: obama: fer fuk saeks https://t.co/10KE0zsfAv", "the clean version of Anywhere But Here by @KillerMike is a surreal censorship-led trip through American priorities.", "You can say all you like that Brexit and Trump are different, but they happened from the same damn wave of colonial intensity.", "four steps forward, trump steps back.", "RT @LaurelHalo: Adam Curtis https://t.co/24OiqfufMm", "Time to experience the dawn of all-out war. You betcha. #2016 https://t.co/ZsDd9yr2b8", "RT @GuardianUS: Trump leaves the stage to \"You Can't Always Get What You Want\" by the Rolling Stones.", "Hang on are you trying to tell me you don't plan every moment of your life in advance?", "how does one learn to poetry. the applications are innumerable; the absence real.", "@sam_kriss https://t.co/0VhSwilLLe", "that's not innovation that's a hoover stuck to a razor.", "let's play the wellness game.", "RT @cafedotcom: Halloween is in 2 days! Here's a great way to let people know you're insufferable to hang out with! https://t.co/wrhKu7azta", "Yay, @facebook/@NSAGov listened to my constant whinging about how I only wanna use facebook for Messenger.", "@PhotoSonny @VirginTrains Do you get its funny because there was that big news story earlier in the year in which someone lied.", "@PhotoSonny I think you're making all of this up. @VirginTrains, please release the footage.", "this is my fav new zach galifianakis character. @Apple #appleevent #appletv https://t.co/xwpLIZUeE8", "i like that the macbookpro has made it screen just a line above the keyboard. change the world.", "I like the vlog that goes outside.", "Lads lads lads! https://t.co/rHj3XVOj1F", "RT @cafedotcom: We're sorry but this is the single funniest thing to happen this entire election. https://t.co/dY7TQ7cfUo", "Also, Tom Hiddleston is the worst actor working today.", "I love it when the hero in a blockbuster does as much if not more damage than the antagonist because it shows the capitalist model in action", "busy taking sharp edges out the sky.", "Love seeing bloggers/columnists having a personal spat through their thinkpieces like they're in the slomo scenes from Raging Bull.", "Be sure to buy the audiobook of The Tropic of Cancer read by Miranda Hart.", "I'm really glad I renewed my passport like a month ago so it will still say European Union on a red background for the next ten years.", "There are two lads here watching an instructional video about how to make money using free bets with online bookies. Just get a job, guys.", "@sam_kriss I can help you shop for turtlenecks", "Also https://t.co/i2rfRfUhXF", "Stockholm you're killing me", "@sam_kriss isn't that every night", "This morning I rode on what is a strong contender for the world's smallest man-powered ferry.", "How can you know you truly even like music until you dance to Abba and Robyn in actual Sweden?", "https://t.co/NS438DAmEL", "Just wandered through a caravan park that was populated by a dozen accordion bands. The soundscape was insane.", "IMMA BE AN UNCLE", "Party hostel how do you work?", "@sam_kriss basically the architectural equivalent of drawing dicks on things.", "Like, actual surfing https://t.co/dGKvbV7OHx", "I went to a park today and there were people doing cosplay on land and people surfing in canals.", "If Munich were anymore chilled it'd be cold.", "Would a comical hat make you more likely to talk to someone ?", "This trip has been populated by nuns.", "Just tried to order a flat white in Basel and it all got a bit Larry David.", "Milost.", "Tis Tradition. https://t.co/9YDqb1el40", "RT @Mangal2: This isn't British politics.\n\nThis is an Etonian version of Takeshi's Castle.", "RT @Number10cat: On reflection, Ed Miliband really didn't look all that weird eating that bacon sandwich: https://t.co/lGpplKz4PN", "Is David Miliband Azor Ahai?", "https://t.co/3VE7usEJPj", "\"George Eliot and Voltaire: Brexit Ghosts 2.\" https://t.co/YgS0MMo9MB", "the Instagram habits of other people.", "yup https://t.co/d6B0yMz5HQ", "RT @mossless: Re: #Brexit https://t.co/ncuT8GnWV5", "@rhianino that it's full of Leave voting swine with no discernible accent", "@rhianino no an actual northern accent unlike Cheshire", "@rhianino in my head I'm talking in a very slow, sad northern voice that sounds weatherbeaten and tired", "@rhianino when ppl say Japan feels futuristic I didn't know this is want they meant", "@rhianino yes there are problems all over. This is what a crisis of the left looks like. I'm very sad. Sorry if I seemed shouty.", "@rhianino I'm just venting because it's nice to talk to a lovely intelligent person on a day as unsettling as today", "@rhianino but I think to ask for exception from those portrayals because L'pool/Leeds are progressive ignores big problems in those regions", "@rhianino my point isn't that I think northern cities should be ignored. I think they need to strengthen and engage with their surroundings", "@rhianino but when the population of LDN is almost twice the population of Yorkshire I can see why those small progressive hubs get ignored", "@rhianino I don't think northern cities are regressive, and the portrayal of them as such is unfair yes,", "@rhianino but this wasn't FPTP, though it's being covered and announced as such. So my point is, those northern hotbeds aren't big enough.", "@rhianino disagree all you like, but until we devolve power to such cities they aren't going to grow in influence no matter how progressive", "@rhianino but they remain too small. The progressive politics isn't pervading enough through the surrounding areas to achieve mass support.", "@rhianino I'm referring to the portrayals and realities of northern and nationwide cities vs London. Some are strongly progressive sure,", "@rhianino progressive politics in other cities is sadly a bit niche within the regions those cities represent", "@rhianino its fucked up that our country is London focussed but it's the case we have", "@rhianino but the truth is, like in the general election, they just aren't big enough to affect any change", "@rhianino but their numbers were clearly not significant enough. The two largest voting blocks were London and Scotland.", "@rhianino yeah but the other places won't be in the UK much longer.", "I'm looking down the #IVotedLeave hash &amp; all I want to ask each user is: Why do you hate this country? Why do you want to see Britain fail?", "There's nothing patriotic about turning your country's economy into a kingdom of dirt.", "Recession autocorrects to \"Tears soon\"", "To those who vote Leave, I hope you lose. And if you don't lose, I hope you lose your jobs in the following recession.", "@thwphipps @sam_kriss he voted for that ducking bird sanctuary.", "The pound's going over the white cliffs of Dover.", "RT @sam_kriss: fuck", "Well these cats are certainly IN these boxes https://t.co/eqqvKM6Ka0", "Came to a pub with cats to soothe my referendum anxiety. #votein #Remain https://t.co/4yVzvZnTXl", "RT @DIMBLEBOT: THE AUDIENCE APPLAUDS THE SIDE IT ALREADY AGREES WITH #BBCDEBATE", "RT @DIMBLEBOT: \"CHILD-FREE TAX CARE\" #BBCDEBATE", "https://t.co/o8TlvcelpW", "RT @neiltyson: In any election, there are only ever two kinds of voters: those who are informed and those who are not.", "rolling with the ex's.", "@helelyos is the shadow saluting or pretending to shoot itself out of awkwardness?", "Here's a photo of me posing as my mum in a photo I took of my mum. @valerimelnyczuk https://t.co/1H1DuvYgmj", "This show is really happening.", "RT @internetofshit: we can still stop this https://t.co/Lr3FDKc5r3", "RT @extinctsymbol: South Africa Just Lifted Its Ban on the Rhino Horn Trade: https://t.co/KkSRMv9FUL https://t.co/MNrJHn8vSx", "https://t.co/VqhIvooOBN", "I would like to sleep.", "Grilled cheese is like cheese on toast if cheese on toast were actively trying to kill you.", "I'm a pretty nap orientated person.", "Remember, Eurovision is only as dumb as football.", "@p_h_jones what about the google maps?", "@nicoledandy bloody Mancunians.", "Sat listening to Strangers and I'm just yelling \"I LOVE YOU LEA THAU\" at my headphones.", "I only just noticed HP Lovecraft has the same first two initials as me. The H even stands for Howard.", "RT @extinctsymbol: Sickening moment customer finds deep-fried chicken head in his meal: https://t.co/7bfNPtWU38 https://t.co/cJ2O6xEejw", "@louleeleiloo it can be followed up by Russel Brand's \"I'm a bigot pretending to be intelligent but girls like me anyway\"", "https://t.co/RgAywbtHCh", "First day wearing em and I spilt coffee on my new white trainers.", "I hate cars.", "https://t.co/gn0FThQhSR", "Here's some stuff from last summer. https://t.co/rSblTc7PYa https://t.co/CaUTdBbZfs", "When people talk about \"racial purity\" all I hear is \"centuries of incest\".", "Today I managed to resist eating an entire cheesecake by myself. I feel like this is progress.", "Too much sugar and not enough booze.", "All I want is a warehouse and friends to fill it.", "https://t.co/Z11mbl5ucq https://t.co/0bDEYkltyn", "headaches within headaches.", "Saying a prayer to saints Marker &amp; Godard.", "https://t.co/D6W2fTxgI0 https://t.co/oMExk4uSZ7", "one of my fav things bout goddard is his use of type. https://t.co/voewLb65tM", "RT @crispinbest: a binary we can all believe in https://t.co/gOm1AhknhP", "fuck the sun. https://t.co/4ovyPp6gK5", "and the worst part, as ever, was Domhnall Gleeson.", "I watched Frank last night and aside from being a fun movie the best part was when Frank's mother says \"if anything it slowed him down\".", "https://t.co/TI3CY09mgY", "In town playing \"Cosplay or Hen-do?\"", "new: https://t.co/6AnhP1mfhN https://t.co/JLT5SAEE3k", "Look bland get blam'd.", "Pranks are the only true Australian art-form.", "https://t.co/DahGbEeXkN", "https://t.co/DFz4AomPrw https://t.co/ENBjG6P3Hd", "mood right now. https://t.co/Pikl5Lzb6D", "Look at his butthole.", "@vanessaptrsn it's this game where you try to entice cute cats to come play in your garden.", "@vanessaptrsn totally, have you played it?", "Take me where the sky is biggest.", "The Mushroom War did wonders for her resume.", "Fact of the week: this girl singing in mid-00s chrimbo trash is Marceline the vampire. https://t.co/ueSQKP1dng", "I WANT MORE BEE AND PUPPYCAT.", "Time is a construct. Tell it to my ageing aching bones.", "https://t.co/Wpl5CBghhQ", "This film seems most fitting today. https://t.co/8ERZDEZfzh", "RT @ryanbassil: Need some solace from this week? Donald Trump is 69.", "@jrgdutton it's how he'd want to be remembered.", "69 is the new 27.", "https://t.co/qF44A7WC6k", "my favourite number is worlds' favourite number.", "The treatment of drug addiction and overdose in Sherlock is just heartless.", "RT @BoysByGirls: This water is challenging.", "RT @RatKing: 500 dollars a month isn't gonna bring those lobsters back  I'll tell ya that .", "RT @billwurtz: japanese is a made up language. japan made it up", "RT @ProBirdRights: hoo hoo hoo look it me santey look i beard i jolly give me cookies", "RT @rtnekoatsume: https://t.co/x9IIImDRmn", "This biopic of Hunter S Thompson is weird. https://t.co/d8FnJXoFfQ", "RT @Rosa_Martyn: why are running shoes so ugly I just want some black ones https://t.co/TuBYxCbO1D", "This train goes to Poland?? https://t.co/VMAMlYw9DJ", "@melnyczuk: My least favourite thing is people who claim the socialist elements of our country are due to capitalism.", "The Midlands. Bigger than you think. https://t.co/FVPPwmhpnw", "This wet floor sign is fucking genius. https://t.co/Fqco1fmaEy", "track of my day.// https://t.co/C3v28W7BNi", "https://t.co/7206Ge2bbN", "2016 ..&gt; https://t.co/aEoU2jXg0h", "Saul Leiter. https://t.co/yo91WGNpNs", "Caulfield. https://t.co/w7zK8AkP3I", "RT @peopleofprint: Tropical poster https://t.co/WLzJvzjiUz #DeptStoreLDN https://t.co/38ViTBIfq2", "I don't understand. I don't wanna understand. https://t.co/J4uxfhSINU", "why lag why?", "@Rosa_Martyn do mine pls pls", "I haven't tweeted anything in a while.", "RT @whattheel: This is absolutely the end of me today. Howling. https://t.co/BcNJsAFQnQ", "Time to bounce, said Zebedee.", "RT @wolfpupy: corn chips get their shape from the famous triangle", "I look forward to David Cameron saying \"if it weren't for austerity there wouldn't have been a Turner Prize winner this year\".", "The wikipedia plot synopsis for Force Majeure is written like a kids book. \"Mats is elated. Tomas is sad. Mats advises him to scream.\"", "Fuck you advent.", "Would a human toilet be a suitable substitute?", "I need some gloves just to wear while I'm sat at my computer for hours blocking up my circulation.", "The Mail On Sunday's front page can go straight to hell. I will burn any copies I see and I implore you to do the same.", "https://t.co/fRu1yqoo3b", "Pets are weird.", "Logenberry sauce you know you're the one. It's always been you.", "I DONT GIVE A SHIT BECAUSE IM NOT FRIENDS WITH TENNESSEE WILLIAMS.", "RT @wolfpupy: reached the limit of what you can do with imagination? why not try occult dark magic", "https://t.co/iJu9ViVlT1", "https://t.co/Ni9oZK8MXq", "GWR has free wifi and doors that only open from the outside.", "I should remember not to eavesdrop on people because it's frustrating as hell that they look at you like you're crazy when you then join in.", "GREAT NEWS ABOUT THE TAMPON TAX", "@ace_jace I should use that more but it's such an unruly beast!", "@ace_jace ironically enough this photo was taken as part of a last minute railcard application.", "So much fun I have a nosebleed.", "This is the last ever photo of me whilst still 25. https://t.co/YPqfkhrH7w", "How dare all these people be angry at a party that are day by day actively making their lives harder. How impolite.", "RT @getfiscal: #victory http://t.co/UYa6bfBTHZ", "When I shit gold I shall buy this. https://t.co/A8Fzvb625h", "Please please please let me never join the ranks of the silent commuters who flinch when a stranger asks them about their day.", "I want to know what the leaders of the ginger community are going to do to stop radicalisation.", "Basically, after the past two weeks I'm just already too excited for @charltonbrooker's end of year wipe.", "RT @charltonbrooker: Promo poster for Black Mirror: The National Anthem (2011) http://t.co/BUjplHrSkd", "Stupid fucking Rugby bastards.", "This guy has gotta be my least favourite guy of all the guys who drive the 76 route.", "I just accidentally stepped on a huge majestic slug and I reckon that's the closest I'll ever feel to the sensation of treason.", "I'm sat behind a guy who just pretended he didn't know what spotify is.", "RT @MentalHealthRR: UK Labour Leader Corbyn Creates Mental Health Minister Position http://t.co/ZxIr3MWH6f http://t.co/nbT7fODgnI", "Chronic exhaustion is my new high.", "Will you leave me be so we can stay true to the path that you have chosen.", "Do you know who else poured state money into infrastructure to fix an economic cataclysm? FDR.", "http://t.co/wgWDHbexGV", "@PhotoSonny http://t.co/H8B7LC9jKo", "Imagine writing for the Daily Mail. Imagine being a full on Nazi in the 21st Century.", "Coldplay are so innocuously offensive. Like creeping dread.", "Neu Kunst. http://t.co/dxSqEx7GFU", "http://t.co/t7XQbYFsVI", "RT @ulrikebiets: http://t.co/VlNUFttJhB http://t.co/472RNYt8R9", "RT @shutupmikeginn: When you say, \"women aren't funny\" all I hear is, \"smart women elect not to spend time with me\"", "Soon. http://t.co/eygqMvHnTr", "Soon, I may have to start lying about my age.", "Life is full of regrets. Like I regret not beginning to shoot black &amp; white film about 20 years ago.", "I miss London.", "If you don't put all your eggs in one basket then you have to carry two damn baskets.", "@thomasahannan just write Jeremy Corbyn 4 times.", "This era is dumb.", "I'm a warrior. I'm a worrier.", "Corbyn uses patience and policy and honesty and humanity and the Tories don't even know where to start with that.", "Cooper is coming out to say she'll use petty personal attacks but that is the Tory A-game. She will lose at that every time.", "What good is covering your back when you have a season PM to debate against? Why use the same failed tact again.", "Non of the those three can even stand up in front of a crowd and make their views know. Burnham is only out in front because, y'know, sexism", "Everyone keeps banging on and on and on about how unelectable Corbyn is but not about how utterly unelectable Burham, Cooper and Kendall are", "Michael Foot lost in '83 so you shouldn't vote Corbyn, but Brown lost in '10 &amp; Miliband lost in '15 so why vote Burnham, Cooper or Kendall?", "Burnham &amp; Farage are false gods of the outsiders, Corbyn is the real deal. Such a consensus of establishment opposition proves that.", "This cat sure loves to lick my clothes.", "I prefer the temperature here that's for sure.", "Au revoir.", "http://t.co/RI7WXSMpDW", "Joy. http://t.co/o4AwyAQCxW", "So Paris ey.", "http://t.co/YvAqzklJWR", "I didn't tag her. and the thing is, I totally meant to tag her.", "http://t.co/UN1Duy9dXw", "http://t.co/gNJR9hr15f", "http://t.co/s1PwsZrMsV", "...and when I stopped and stared at her like the scum bag she was she said \"oh yeah go ahead look at me like I'm a freak\". #asshole", "So on my way home I walked past a terrible woman making fun of a pair of little people...", "RT @sam_kriss: this by @piercepenniless is a very good critique of corbyn-utopianism http://t.co/NdvVke3HTB", "Pretty weak tbh. Flip flop flap. http://t.co/fVIWiv4BQQ", "@NatWest_Help it's what the people want.", "@NatWest_Help I think you should update the system to allow these characters and you should probably start allowing emojis tbh.", "I tried to make a payment to a friend at Natwest using ))&lt;&gt;(( as the attached message but the killjoys were having none of it. @NatWest_Help", "...a system that is now allowing a grassroots surge towards Corbyn, so all the heads are like \"FFS HOW DO WE GO BACK TO BEING CORRUPT?\"", "...and that inquiry found the old leader election system to be biased and corrupt, so they put in a new fairer a system...", "I like how the heads of Labour in 2010 were like \"how did Ed win over David? Let's have an inquiry\"...", "I like how on the Netflix login page everyone is pictured intently watching the browse menu without making any attempt to choose something.", "http://t.co/z1GnPuVVal", "I'm looking online for a waterproof hold-all &amp; I found the perfect one for a good price but it has comic sans font on it so I can't buy it.", "I think I need to make a megacut of all the times Jeremy Corbyn says \"issue\".", "token rat. http://t.co/aynAnNPCV4", "http://t.co/3ROpUC2MWH", "Hey guys stop waxing the tips of your moustaches. Seriously please.", "Midnight tweet to @georgia", "Coffee round Mac's house.", "Writing is so often like a mental equivalent of that bit when you feel a sneeze is coming but you can't make it happen.", "One cat-sitter to rule them all and in the darkness cuddle them.", "http://t.co/2O2w19pXRO", "Can everyone stop talking about Corbyn's beard and start talking about how bad Andy Burnham's makeup artist is?", "\"Don't worry about your difficulties in spelling my name. I can assure you mine are still greater.\"", "Wait, how do I spell my name again?", "RT @itsnicethat: We check in with Ed Cheverton, the busiest collage and toy-maker in town &gt; http://t.co/0CteGvdumK http://t.co/QBJuI9lwvZ", "Get drunk make art.", "RT @DaftLimmy: Lol http://t.co/gUwbiTyZ4t", "white people.", "http://t.co/3UxWwN38us", "Dear \"Gentlemen\": please stop waxing the tips of your moustache.", "Is it not clear by now that Tom Cruise's missions are possible.", "http://t.co/klX3O6voZw", "Small acts of surrealism.", "All I have to say on the matter is that Nazism isn't the only form of totalitarian fascism...", "RT @i_D: 10 recent ways your Aunt Flo is getting hip! http://t.co/UBMDuzAy8k http://t.co/qJAsOQ66ex", "And we need that new conversation to start now. We need it to start as soon as possible if Labour are ever to win again. So yeah, vote JC", "But we desperately need to change the mode of conversation in parliament. We need to move it toward representing what matters to the people.", "Look, no one leading Labour is gonna win at the next election because the Tories are moving the goal posts and redrawing the constituencies.", "RT @Corbyn4Leader: #jeremy4leader please RT http://t.co/bQGoZfDGVC", "http://t.co/ZzY6ljkJuD", "Wild swimming everywhere all the time always.", "So I know it's gross but I want to swim in Bristol Harbour just so I can say that I know what its like. Every time I walk past it taunts me.", "Just heard some Bristol tourists ask \"but is street art legal\".", "I want to pray but there's nothing to pray to.", "Where's the evidence that austerity is working? Show me figures dammit. The economy is stagnant.", "RT @HealthUntoDeath: \"We need to listen to voters on welfare\" - Harriet Harman. Then why aren't you listening to their screams?", "Cars are so awkward. Everything about them is just awkward.", "RT @ferdosnandos: Now, hang on a second, @ASOS. So, if I have my legs crossed, then... oh. http://t.co/r39XK5vkKD", "http://t.co/Tf3mxICLhw", "The free market will only ever bring us suffering, insufferable totalitarianism and a sugar-rich diet.", "You may diminish that calling it idealistic, sure. But it's only as idealistic as thinking the free market will bring us bountiful plenty.", "Its why I bother to get up everyday. Maybe today will be the first day on the long road to a cooperative loving humanity. Maybe. Just maybe.", "http://t.co/fSOAPbBtUl", "Ol' Sylvan's back in action.", "http://t.co/b7Ehp9rslp", "George Osbourne's rubbery satanic face looms down pulling trademark smirk formed from clouds of ash &amp; brimstone: \"oh it's not that bad\"", "As the sky burns and the last square foot of land is swallowed by the sea, Omega Man choking for his final breath: \"Oh it's not that bad\"", "How much worse do things have to get before people stop using the phrase \"oh it's not that bad\"", "Take me to Scotland. Take me above.", "Untrue came out 8 years ago. UK music what have you even been doing since?", "For example, Adam Sandler gets called an \"actor\".", "But if you own the papers, and you have all the loudest voices in your pocket you can call anything anything you want and make it true.", "You can't call it a living wage if you can't live on it because of inflation.", "Solidarity with the tube workers of London cause working nights is a bitch.", "Having to name stuff is the main thing that puts me of starting stuff.", "Can we all just agree to pull our fingers out for once in our rotten lives and sign up and vote for Jeremy Corbyn?", "RT @Corbyn4Leader: #Budget15\n\nRT if you agree with Jeremy \n\n#jeremy4leader http://t.co/1tVPk6ikNd", "Look, @GeorgeOsborne is a moron. http://t.co/WuntJDvyns", "I'm proud of Greece.", "Keep your computer running fast and your mind running faster.", "Will update when he starts shitting blood.", "My housemate just ate a load of glass.", "http://t.co/SKKkBfKt9w", "If you still don't think that capitalism is destroying the very basis of humanity just look at the sugar content of all your food.", "I'm in the pub watching the footie and it's the best I've ever seen England play.", "Your body is a temple. My body is a tent.", "As if you don't think America is the home of racism then why did they pick the shortest month to have Black History Month huh?", "Why does February only have 28 days when July AND August both had 31. Seems unfair.", "Sleep is underrated.", "Should have studied maths.", "RT @NTSlive: Two hours of @henryrollins every Tuesday in July. Tune in idiot. http://t.co/zp4A1CciNl", "Everyone's friends are friends of someone.", "Let me ask you what you think anarchy would look like because I think it would look a lot like this.", "Are people still really being like \"Why'd they let a black guy play Glasto on his own how arrogant is that?\" in the 21st century?", "I really wanna call someone out on being pretty racist about not liking Kanye's set at Glastonbury because he killed it and they're wrong.", "http://t.co/VNW2Og85ns", "http://t.co/CfoxweNozs", "\"Just hold tight and try not to listen to Street Lights.\"", "It's an 808s sort of morning.", "CMYK.", "I just caught a fly with one hand.", "I could not hate Myriad Pro more.", "Just won the pub quiz.", "This really feels like frisco.", "@WillGrice they still have a career and I can't figure it out.", "SLR's r overrated.", "I'm just gonna assume someone left this cup of tea here for a reason.", "In memory of all the records you'll never find on Spotify.", "RIP Kate Bush.", "And offering tax breaks at the top spits in the face of the notion that the wealth will trickle down. Taxes make the wealth trickle down.", "You can't buy up all housing/means of wealth production then call folks lazy when their kids get hungry as all their wages go on high rent.", "Those on benefits are aspirational. They're aspiring not to be forced to watch their children starve to death.", "The left wing is opposed to the exploitation of you and the destruction of your environment. What's to oppose?", "When exactly is \"of-age\" anyway? Shouldn't they be called \"the-bit-just-before-you're-over-the-hill\" dramas?", "Not gonna lie, sick to the back teeth of \"coming-of-age\" dramas.", "Jimmy Eat World Y/N", "Did that guy on Kickstarter ever make his potato salad?", "Least awkward anymore has looked flying since The Never-ending Story.", "Why did Jorah offer his hand to the queen he loves so much when he has a highly contagious terminal illness?", "http://t.co/YoahQLnk7v", "RT @davidschneider: Updated summary of key proposals in #QueensSpeech http://t.co/zpGvY3BqIc", "Somewhere impossibly warm.", "Everybody's favourite French lady is coming to town.", "Lady parlour.", "White sheets only.", "Duvet Hitler.", "\"Sir\" Eric Fucking Pickles? Wtf?", "Inequality has risen and tax avoidance hasn't been addressed. Cash is flowing out of the economy into private wealth. Is that a success?", "The economy is barely growing. If your favourite football team drew in every match for five years would you call that a success?", "Also more borrowing and no further relief provided by growth. The growth is unstable at best. What's successful about that?", "And seriously, working poor aren't poor bc they don't work hard enough. There are 1000001 reasons for poverty, but idleness ain't often one.", "And the next wave of cuts will go after the working poor. Have no doubt about that. And you won't be able to strike or unionise.", "More jobs sure, but too high a proportion part time and with no security just to get the unemployment stats down. Is that really a success?", "Can someone pls explain to me what is so successful about the Tory economic plan? It looks pretty failed to me.", "Watching Game of Thrones jump the shark is sad and boring.", "RT @tbhjuststop: How to flirt with me http://t.co/qRlWtY8xUl", "https://t.co/YHlzDV5iTF", "RT @DMReporter: FINANANCE: Bank of England admits everyone would be a millionaire by now if it wasn't for bloody foreigners.", "RT @Glinner: A homophobic culture secretary. Lucky there are so few gay people in the arts http://t.co/RZwCLGDrnJ", "@Cerysimo voted as best we could.", "RT @thugclive: I just really hope The Queen dies soon", "http://t.co/4myZipq4bX", "Don't Nicola Sturgeon, Nick Clegg &amp; Nigel Farage have better things to do tonight than stand very still in the BBC election studio?", "20 mins til the polls close and the real fighting begins.", "I think I am at pizza saturation point.", "http://t.co/PRJ1pZ5sUW", "Just won a bottle of wine the week I decide to quit drinking.", "Literally every article in today's London Evening Standard makes me sick. Such Tory toilet fodder bullshit.", "@james91ocr the one and only yes", "\"I am always looking away. Or again at something after it has given me up.\"", "I've read and reread Having A Coke With You about 7 or 8 times in the last couple hours.", "Brienne of Tarth is now my favourite character. Which means she shall die.", "the new jurassic world trailer is hilarious.", "I just want to be wherever you are hard as I can be.", "I saw this guy in York in 2011. I hope he landed that job at Buzzfeed. http://t.co/0lyEJFq6zX", "Stan Rizzo is a gift that just keeps giving.", "Photo:  http://t.co/HZTCBI3Oo1", "http://t.co/asF66krTqq", "http://t.co/eScDV4GBVv", "Tess Roby\nhttp://t.co/G98kBlxJcI\nhttps://t.co/HYjfrHysEP\nhttps://t.co/v2hcp1aKjW\n@tessroby http://t.co/PTQ1boHDw9", "dusk forever.", "http://t.co/zY1Ety6zLb", "death before decaf.", "https://t.co/qqwhHHM1U8", "@UKIPCalypso sorry, could you provide some evidence of that?", "@UKIPCalypso They claim that they can't have our views heard in Europe, and that that's bad. Yet they want to have even less say.", "@UKIPCalypso no they just treat democracy with the contempt they feel it deserves.", "@UKIPCalypso If you ran a pub and spat in someone's drink would you expect them to buy another, when plenty of other pubs also sell drinks?", "MEP's are voted in to represent us. UKIP have consistently shown they will shirk their responsibilities to the electorate. #askUKIP", "@UKIPCalypso The EU is some foreign colonial power. It's a collective. One we are currently a part of.", "@UKIPCalypso That's what MEP are voted in to do. UKIP have consistently shown they will shirk their responsibilities to the electorate.", "@UKIPCalypso so isn't it smart to keep on good terms and stay in a position to make decisions about trade deals?", "@UKIPCalypso Your debating approach consists of wild leaps and spurious statements. You just keep dodging questions. That's not a debate.", "@UKIPCalypso Grow up.", "@UKIPCalypso UKIP are of the proud, arrogant &amp; unrealistic world-view that something special about Britain will magical keep us afloat.", "@UKIPCalypso They don't need to do business with us. There are alternatives. Strong alternatives that are more inline with their interests.", "@UKIPCalypso Do you really not see how detrimental it would be in the ultra-competitive world of international business? They don't need us.", "@UKIPCalypso and that negates them being our biggest trade partners how?", "Either you work for a party and your job is to represent that party, or you are an individual with your own opinions. Cant be both. #askUKIP", "@UKIPCalypso that's a lovely ideological stance, but it doesn't really hold water when you're seeking to defend UKIP as a whole party.", "@UKIPCalypso Is the increased freedom from \"EU red tape\" really worth damaging relations with crucial trade partners? Counterproductive, no?", "You can't just update your website with a new policy then claim that past statements can't be used in criticisms of your integrity. #askukip", "@UKIPCalypso I'm not in favour of HS2. But what exactly is UKIP alternative for decentralising UK business interests and stimulating growth?", "@UKIPCalypso If you fire anyone who makes a gaff it's hard to see what you actually stand for. Claiming a policy is easy, integrity is hard.", "@UKIPCalypso and when you're General Sec attacked the NHS in January, was he not representing the party?", "@UKIPCalypso but realisticly leaving the EU will leave us with a bigger deficit so that's not credible.", "@richardabw A clumsy way to convey it yes.", "@UKIPCalypso Well for starters, http://t.co/3lLK9yMArh &amp; that time your general sec went all Godwin's law on it.", "@vict_sponge Pls reread my tweet. There's a double negative.", "They are racist and they aren't going to fix the economy or create homes. But they are going to sell off the NHS. #askukip", "I'm not saying they aren't racist, but they are and what they aren't saying is they're going to fix the economy or create homes. #askUKIP", "I know they're a one issue party and that issue is immigration, but they're also bad on lots of other issues. #askUKIP", "How do UKIP plan to balance the deficit? It's extremely questionable to claim leaving the EU will leave us better off economically. #askUKIP", "RT @davidschneider: Tories promise 2 million new jobs, some of which may even pay enough to live on.", "In a ball of yarn.", "RT @cat_parrott: Contact sheets from our Pallett shoot with @melnyczuk. Excited for the results! https://t.co/CjLaQqOTaV", "Photo:  http://t.co/bxgtJJNj7N", "http://t.co/vAusufMHmm", "@plainlaurajay oh just look how SCRUFFY I was back then", "http://t.co/e5qGhEBOy4", "Ice Hockey is everything a sport should be.", "http://t.co/5cUYGSehK9", "The thing about all the reportage on Kanye's freakouts is he's literally not half as arrogant as every white man in his pay bracket.", "Just saw a graph in the telegraph so terribly structured it forced me to use the word \"numpty\".", "http://t.co/iAA6EXTyOY", "http://t.co/sfbOJrGw6E", "Scandinavia.", "This is all I have so say on the matter. http://t.co/g0xyRs0byy", "You shouldn't let poets lie to you.", "RT @the_author_: This one delves into, again, the kinds of men MRAs are: pedophiles, rape apologists, domestic abusers, misogynists.", "black lake, bitter lake.", "Envision melting Canary Wharf down into a ball and blowing it into the shape of a tip jar.", "RT @pattymo: http://t.co/dwAPKV7nIW", "mildly damp, cold towel.", "me and @LottieTM are arguing about Innocent smoothies. She claims its FRUITLESS.", "Wish I'd took this. Look. http://t.co/69BK91hphq", "I am a dedicated", "@PhotoSonny http://t.co/lcqbmd7HQu", "RT @PhotoSonny: That thing where John Travolta steals your jumper. http://t.co/CCOxGSs6w8", "In rare viral footage, a lone octopus appears to attack crab because that's what octopuses always do.", "Meat is creepy.", "http://t.co/7sZhDnOeMb", "Stop trying to make Happn happn, it's not going to happn.", "Gotta have my mermaid fix.", ".@LottieTM http://t.co/9F9PUXXIYW", "http://t.co/FyU0E4HcLz", "You scream; I scream; we all scream for gaussian blur.", "@SallyECollett did you get the email?", "@SallyECollett hey up, today's the day! I'll be sending some pretty pictures your way this afternoon so try to contain your excitement.", "#catstakingdumps http://t.co/pjSHh4dmGf", "This cover is nice. http://t.co/0Z8V4h2jcO", "http://t.co/EZEQKkxcPg", "Cats in the lands of dogs.", "http://t.co/VBoXSdtCZy", "Cock fighting but with real cocks. http://t.co/Rt3xLGedXi", "The mere idea of a thatcher museum is fucked up.", "Bladder, don't make me go out in the cold.", "All I want is pizza.", "RT @featureshoot: Wistful Portraits of People Traveling Long Distance on Amtrak Trains http://t.co/YQsO9PoIyV http://t.co/bJr5uIMgSB", "Also this, on why increased surveillance is stifling to even those in power themselves.\nhttp://t.co/XCFYe0fZM7 http://t.co/c436WeKMq3", "Adam Curtis on the Kurdish state &amp; the diverging, distorting ideas for a contemporary utopia.\nhttp://t.co/3nvUyMCvSk http://t.co/j2g7xPWtmf", "http://t.co/ftqSScdvD6", "@LottieTM where have i heard this phrase before?", "@LottieTM such nice guys.", "http://t.co/Mx7r6M4jV1", "Ulrike Biets\nhttp://t.co/gdPjzQbYKX\nhttp://t.co/umS2eiKmJx\n@ulrikebiets http://t.co/Ftxxky6RU0", "Lison Matha\nhttp://t.co/Wy7PhwXqN9 http://t.co/5QSSD09bCP", "\"It's the job of writers and explorers to see more, travel light when it comes to preconception, to go into the dark with their eyes open.\"", "On it. http://t.co/IthQe7Tki7", "Rebecca Toh / \"Alone\"\nA very astute meditation on strangers, empathy and the self.\nhttp://t.co/LZGcI143RU\n@casualpoet http://t.co/ldfcxdL74j", "http://t.co/DSlQXkfXbR", "Photo: Kreuzburger, Berlin. (2014) http://t.co/C7UfR4lxud", "http://t.co/IiGfLSYfuY", "RT @zizek_ebooks: The dwarf in the Red Lodge", "Work when you feel sad.", "UKIP - They don't represent you and you're not allowed to represent them:\nhttp://t.co/LtHoIJOaTO", "http://t.co/4corhMoU29", "RT @Booooooom: #mailcrimp", "Must read more Pynchon.", "Thomas Mailaender / Cathedral Cars\nhttp://t.co/4dztrRQUIv", "RT @plainlaurajay: @melnyczuk @tokny http://t.co/BTSNkSktui", "RT @Booooooom: Richard Scarry's 21st Century Busy Town Jobs via: @boingboing --- http://t.co/eivxj6fgpH", "@ThomPether Life is so-so. The countryside is pretty empty. How are you?", "@ThomPether I miss you pal.", "@imogeneason you're my schedule now...", "Phases Mag. @PhasesMag \nBeautiful photography exhibited on a beautifully design website.\nhttp://t.co/YZXQmtD7OO", "Visual Playgrounds.\nhttps://t.co/RLVS58Fo8m http://t.co/iyLrKwimO7", "Marina Richter.\nAstounding on Tumblr and she recently joined Instagram.\nhttp://t.co/uaaXQ0qBHD\nhttp://t.co/0lDC0OIsuw http://t.co/lCMGGJepwB", "@imogeneason same time next week?", "Ryuichi Sakamoto / Thousand Knives\nhttp://t.co/AwlydUDedq\nThanks to @tabithabang for spinning this on @NTSlive &amp; @imogeneason for ID'ing it.", "@imogeneason YOU ARE CORRECT! https://t.co/eXIjoXWYpe", "@imogeneason Well blow me down. What was that piano piece from before, maybe 3/4 tracks ago?", "@imogeneason \"here\", as in \"in the studio\"?", "Planning a project about pervasive mass produced items of domestic urban infrastructure, aka street-lamps. Indeed.", "@imogeneason by \"a good time\", you of course must mean \"all day\".", "I constantly have to have Shazam open when listening to @NTSlive", "@inspectahdreck keep it on the download: have it constantly paused in your torrent client.", "Who thought letting Zane Lowe near Drive would be a good idea?", "\"I will warm the sheets like an electric toaster, I will lie by your side like the Sunday roast.\" - Dylan Thomas.", "Whilst I'll admit I wanted to see Fury for LaBeouf's mustache, you gotta wonder how they got all of WW2's hipsters in one tank.", "Simone de Beauvoir, interviewed by Studs Terkel in 1960.\nhttps://t.co/4dysWmOBzS", "Michael Wolin / Seoul x Heart\nhttp://t.co/5meEqeI2rv http://t.co/UfL5NRyndn", "Tonight's Instagram posts are a homage to the Southbank Undercroft.\nhttp://t.co/w5I0pwHu1l\nhttp://t.co/38n0zm2EpZ\n@Long_Live_SB #llsb", "New look Tumblr is slick &amp; pretty.", "Don't go on Instagram tonight.", "Pretty good birthday present. #RTJ2 http://t.co/INMUc3RHiJ", "Russell Brand makes a mockery of the left wing.", "http://t.co/hrfM48Jx8L", "this internet is so fast and so stable &lt;3", "@mariannecr can we campaign to make him grow that beard out again? Just look at it!", "@PhotoSonny from my father it was only \"People ain't no good\" and the whole of \"Murder Ballads\". I think I turned out well considering.", "@PhotoSonny I now feeling lucky", "Too much of my childhood follows from my father playing \"People Ain't No Good\" to me constantly as a child.", "This week in football: boring ey?", "But Portman was subsequently recast after it was felt that the footage looked as though DiCaprio was molesting her. Yeah no shit.", "This was, one can suppose, creepily in keeping with Shakespeare's 16th century intent of depicting starcrossed young lovers.", "At age 14, Natalie Portman was originally cast as the titular Juliet in Baz Lurhman's Romeo + Juliet opposite a 21 y/o Leonardo DiCaprio.", "badbadnotgood &amp; ghostface killah.\nhttp://t.co/h3aH4DcTru", "I'd like to see a double bill of Nausicaa of the Valley of the Wind and Beasts of the Southern Wild.", "Photo: Way Across Some Neurotic Sea. (2014) http://t.co/fuFeOCrnuY", "Marina Richter.\nhttp://t.co/N2f2Il8PEI", "When in \"Night Light\" by Jesse Ware, she says \"Shadowman, will you come for me?\" all I can think of is Charlie Kelly's \"Nightman Cometh\".", "Postmodern photojournalism is somewhat counter productive.", "Catherine Scrivener.\nhttp://t.co/RSmRLH2npI\nhttp://t.co/ggrc4AGZh7", "http://t.co/VAJDqlIEn8", "Scott Hardy //\n\nhttp://t.co/jbsUfEZbEv - Perf.\n\nhttp://t.co/PQqxOHOGkM", "@BBCNews @bbcnickrobinson Stop media blackout of the #GreenParty! Sign the petition here: http://t.co/t1Bd4zRtBn https://t.co/aOJXyVwUlf", "I'm feeling very \"Only Lovers Left Alive\" this evening.", "Jody Rogac //\nhttp://t.co/d2nxxuyZY4\nhttp://t.co/MUioNuGv5a\nhttp://t.co/7PdWGYPo47\nhttp://t.co/1AggOeHS5F", "Just posted a photo http://t.co/DiKPMRHiTJ", "Warren Sebastian // https://t.co/2ynaTpuRhJ", "http://t.co/ZsWLKGcRsR", "Quote - David Lynch. Amen. http://t.co/847KYT4ZkN", "8am-lyf.", "Some superb simple shots by Louis Heilbronn up on Don/Dean, a cracking little photo-interview blog. // http://t.co/ds3oHwgPy6", "Matte Mag. // http://t.co/yacWvtaYFP", "Photo: Tom and Imogen take the stairs. (http://t.co/CneYOJwIHB) http://t.co/rvaxxYiGEb", "If yr ever in Copenhagen try this. http://t.co/BWKjflArK3", "Just posted a photo http://t.co/HMv5H387CZ", "Just posted a photo http://t.co/uOD8sTKP9h", "My pal Silvia's Instagram is top-notch and well worth a follow. // http://t.co/SHLmXCH3LW", "Just ask yourself, \"What would Ariel Pink do?\"", "RT @NHAparty: Please RT if you would like a public debate on the NHS between our co-leader @cpeedell and Health Secretary @Jeremy_Hunt", "This portriat: http://t.co/2aNQrxUpCW", "http://t.co/t0gBEprN3T", "Amen to that - @zer0books manifesto. http://t.co/Tu5YuNXSqT", "RT @bestfitmusic: Bestival 2014: Part Two http://t.co/j2aBKGpjvS", "@LottieTM I regret nothing.", "Proud to be one of about 30 people seeing Shed over Outkast.", "@jakeinternet I don't believe you.", "Everyone is so beautiful in Denmark it makes my soul ache.", "Copenhagen is a hipster paradise.", "Hello Berlin. Nice to be in you again.", "The weirdest thing about the Bill Gates ice-bucket video is that he printed all text on the blueprints in Comic Sans. http://t.co/a6BKFc9wsp", "@nadiakhomami Hope you got into your first choice!", "There are so many people I want to see.", "SAY NO TO YES MEN.", "Photo: Samson and the Philistines in the theatre of colonial history, with all its repercussions (2014) http://t.co/CKEPqciLQ8", "How did I not know that Woman's Hour worked with Broomberg &amp; Chanarin. Holy shit.", "http://t.co/go8JepH22e", "Pretty happy with those.", "\"Luxury for them would be one of those large bottles of sake that are poured over tombs on the day of the dead\"", "drink water.", "RT @guardian: Police chase hijacked water bus in Venice lagoon http://t.co/ikSopqiJnV @guardianworld", "Photoset:  http://t.co/CK25QX9kt7", "red wine, cheap pizza, and I'm ready for A Coffee In Berlin.", "@charliebrogan thank you. I've calmed down now but give it a day I'm sure there'll be more.", "lone wolf no pack.", "dream team. http://t.co/44iJyINTU2", "Nils Frahm is killing it.", "Josie Long mixed with San from princess mononoke = the dream.", "faith in potential.", "Photo: here is a carp, a golden carp. (2013) http://t.co/zv9bC0InY1", "@LottieTM https://t.co/EFt50cyUwq", "I think Charlie Kelly is something of a style icon for me.", "@Dave_Rowlinson I wish", "Nick Kyrgios season approaching.", "beautiful rich dark", "Yes  Bristol  can't   wait", "@whattheel can't wait!", "I would really like to see @serafinowicz in Game of Thrones.", "Learn from everything.", "@TheDarrylChan Yes!", "Last night I dreamt The Mountain was my cousin and he ruined my birthday party.", "I am always looking away. Or again at something after it has given me up.", "http://t.co/XudWdrABFo", "@jrgdutton @dngdwn loop me in let's hang.", "@GKFennell BITCH ITS YOUR BITHRSAU HAPPY BIRTHDYSQ", "@gregianjohnson lemme know if you do go it looks great!", "@gregianjohnson https://t.co/iNEBM7OvdM", "Small slices of life, but many of them.", "RT @Anna__Conrad: This Apple / Beats press release is all over the casual arm lean http://t.co/HqQzB52FSE", "RT @LondonInStereo: Halls // In Short http://t.co/1brYsgbKDm", "@tamararoper Had that yesterday and it was glorious. It's my signature dish. Also, really need to go to that new place for @MacMetCheese", "@tamararoper same, I'm starving.", "@tamararoper hey tamara, what you got cooking?", "RT @bestfitmusic: See @AmenDunes last night in London in @Melnyczuk's gallery here: http://t.co/HvxUzqfCsp @SSanctity http://t.co/xkPTmJ10JZ", "I didn't think I'd ever see her again but I didn't think I'd never see her again.", "If I'm gonna learn a language, it's gonna be C++", "I just listened to a piece of music that made every cell in my body resonate.", "http://t.co/Pz1wgXZjiv", "@dougthmsn I have little to no recollection of tweeting this tweet.", "@michaelecolley poke hard and poke true!", "@michaelecolley Do not fear. This is just the end of an iPhone app no one used. Pokes will live forever, as long as we keep the dream alive.", "Dawn is maybe becoming my favourite time of day because you never see it for no reason.", "@tomcavill if it's open again, why does http://t.co/Qfea6uZKGE say it isn't?", "http://t.co/xvwpgz9Aav", "@whattheel AMEN! Opposing sexism is only possible by a constant fluctuating process of self-assessment and reaction.", "Loving their Mexican breakfast. No regrets, plenty of wind. @Grace_Goddard http://t.co/X3pHJp0abb", "Ratking were just in Grubbs, gettin burgers. They know.", "Really want the t-shirt.", "Grubbs Burger is the best thing in Brighton, after the sea.", "@james91ocr HIPPIES EVERYWHERE", "So If you ever move house to a new house you will have photographs of your house now because I will give you the photographs I have taken.", "I will be you friend and I will come into your house and I will take photos of your house.", "Up since half 5 &amp; feeling good.", "@merlinjobst ish", "@sustrans \"BEAT THE STRIKE, RIDE YA BIKE!\" #bikethestrike", "http://t.co/qxfBWVmAko", "@LottieTM that is more than disturbing, but at least it gives a clear view of the shape of his/her tail.", "http://t.co/WTO7nkdILF", "@LottieTM http://t.co/plqmUhyjk6", "I am a human hear me tweet.", "If I could communicate purely in images beamed straight from my brain I would.", "when someone has a thought you could never have thought.", "Giles Peterson is killin it right now if anyones interested.", "so full of ideas, so full of life.", "@oliver_chambers oh noooooooooooooooooooooooo so I did.", "RT @char_lotte_eve: UPDATES! http://t.co/Eqw205rpGA", "My brother is helping to build a safer cycling environment for all of us. Photographers check this out and pitch in: http://t.co/kJXsYtNIZa", "@dominiqueeeek https://t.co/9SPLhiqLTp", "First as funny, then as die http://t.co/8n169Ae4Ca via @sam_kriss", "RT @Radio1PunkShow: @wearebigups were at Maida Vale studio for tonights @Radio1PunkShow - more pictures here http://t.co/7XD9dbYFas", "Never doubt the redemptive power of cinema.", "@annacurteis probably cause they all fuck at the end", "@jss_hlt let's", "@CharKrol sorry I was out on a shoot today. Heading home now so I'll shoot one over to him ASAP", "@sambriggs check you DM bud", "@sambriggs @dethink2survive @CharKrol @michelle_amaria I'm also there taking snaps", "@jss_hlt Greenwich hill?", "wish there was a tindr but just for making new pals. hey we both think the other looks cool let's hang and climb a hill.", "@oliver_chambers @james91ocr @thereal_loudav cameras even in war you want to preserve something. Guns you want to be rid of something.", "@oliver_chambers @james91ocr @thereal_loudav and Sontag said like \"even if you photograph ugliness, it's cause you see beauty in it\".", "@oliver_chambers @james91ocr @thereal_loudav you get some pretty big cameras.", "Yes I am watching a documentary about William Burroughs.", "@ace_jace re: that last email, I typed +1 would be grand then looked and saw you'd typed THE EXACT SAME WORDS USING THE EXACT SAME PHRASING!", "@merlinjobst half my texts are lost in whatever realm I can only guess Steve Jobs' spirit now resides.", "I'm watching St Vincent and you are not. Or if you are, come say hi I'm by the bar behind the crop of tall guys.", "@jcxh ah hey there. How ya doing?", "Autocorrect is the babe of my life.", "@oliver_chambers nope turns out it was just made with pure sugar. So so sweet.", "Jason Bateman and Mac Demarco sound identical when they talk.", "RT @Wu_Tang_Finance: HOW COME BLACK HISTORY MONTH HAS GOTTA BE THE SHORTEST MONTH OF THE YEAR THATS FUCKED UP BRUH", "buy me photobooks pls.", "RT @ro_bot_dylan: And picking up Angel who Just arrived here from the coast Who looked so fine at first But left looking just like a ghost", "@char_lotte_eve I miss ya too.", "@gregianjohnson like 2 years ago sometime.", "@alannamcardle_ yr on my radio.", "@gregianjohnson I miss the old days where I was abstract.", "just ordered an 18\" pizza all for myself cause I can.", "https://t.co/7Kh5Lsj7d9", "RT @hapticworld: Don't forget what's important or you'll lose the plot", "https://t.co/RQ1KNz3bDu", "@jss_hlt feel nauseous at the lack of identity.", "Sat next to Josie Long on the tube and nearly lost my shit.", "@willgrice I think \"The Cheese Cave\" looks much better in english than french tbh.", "charlotteevenorman's photo http://t.co/nkJYn2Tf0F", "RT @OpieGirly: http://t.co/mD8iA7ipAm", "RT @TheTweetOfGod: Journalism was a thing once.", "@thedarrylchan Good choice of randomly allocated party, that's the same party I'm at woop!", "@TheDarrylChan hey hey! There's still some tips for you at The A&amp;B you should come by and get them and say hi while you're there.", "There are still so many hours in today and this makes me so happy.", "@merlinjobst to bring you my love", "@merlinjobst is this desire", "@merlinjobst white chalk", "@cerysimo I've always thought the shower is surely the safest place to be during a fire?", "RT @mariannecr: Aw, poor 404 error... http://t.co/TCIZL37tJQ", "@judeabides what made ya think that?", "RT @musicfansmic: Orange Is The New Warmest Colour", "RT @hapticworld: I hope nobody gets stuck in a lift at midnight", "RT @emilydianaruth: party safe tonight kids!", "To the north, where we do what we want!", "@dleink spoons? Ringers? Both?", "@_josephsheerin It's not too late, santa's not set off yet.", "@charliebrogan aww gee thanks", "@sam_kriss a thinker held in high esteem but low in self-esteem over the pain of the those 140 and of those missing 6. #poetry4samkrisswoes", "@sam_kriss that golden night you came so close yet so so far and further still. unfollow unfollow each unfollow a tear. #poetry4samkrisswoes", "RT @weird_bug: got a new phone case http://t.co/UAQQXjYCal", "RT @NormalTweetGuy: I think I'm getting sick!", "@williamggrant http://t.co/1DITGUp7sY", "@williamggrant new profile pic? http://t.co/2a20MSeKsi", "RT @williamggrant: \"Skip to 2.59 - you won't regret it.\" http://t.co/0vvUn5fyLf", "http://t.co/m01ZEiZvuH", "Intelligence and sass are my biggest turn ons in case you were all wondering.", "@Cerysimo very Cartesian.", "@sam_kriss \"the thirst for annihilation and myspace friends\"", "@nadiakhomami I've made myself some good wholesome comfort food (mac &amp; cheese) and I have everything set to make a stiff drink after.", "RT @TomDani_: Life's a bitch and then you lose your wallet", "Not great, Bob.", "RT @itssylviaplath: I do not love; I do not love anybody except myself. That is a rather shocking thing to admit.", "@sam_kriss https://t.co/363EKMOFGj", "@plainlaurajay sheeeeeeeeeeeeeeeit.", "RT @plainlaurajay: The date is 11/12/13.", "@americansmut darn.", "@americansmut was that you volunteering?", "RT @caitlinmoran: In brighter gay news, Ben Whishaw has signed on to play Freddie Mercury in his biopic *head explodes like a firework*", "@daisyojordan Couple times yeah. Such an awesome city!", "@daisyojordan I'd say Kreuzberg/Friedrichshain for partying, Mitte/Alexanderplatz for culture &amp; history.", "@ace_jace http://t.co/aiL2Ob61dn", "@daisyojordan Worth it, but if you want cheap Berlin has some super cheap places. Which neighbourhood you wanna be in?", "@daisyojordan it is.", "@daisyojordan The Eastern Comfort, it's a boat and it's awesome.", "@gregianjohnson Does he still present the Radio 1 Breakfast Show?", "Fucking love Doug Stanhope. He's exactly what a comic should be like.", "@alannamcardle_ woe the missed photo-op.", "@PhotoSonny Yarr! Tis a fools song I says!", "Luvin lyf 2012.", "Well that was an excellent shoot!", "Do you like Sandy Kim?", "I want the whole film reprinted frame by frame in a book so I can study it at length.", "You could take any still from the entirety of Antonioni's Red Desert and it would be a finer photograph than any I have taken so far.", "I've had entire heart to heart conversations solely using Pusheen the cat.", "@hapticworld blue cheese til I die!", "@MelissaRHunt my brother only gets in at 7 so I can only come by before then. When you in town?", "@hapticworld it's seeing stars!", "@leahleahcoolp ew concentrating?", "@ddancarson Chinatown for a roast pork bun.", "@ace_jace quick as a bunny with them Weeknd photos, they look great!", "RT @DesignsByGuru: Everyone wants to be nice but not many people actually want to help.", "RT @KimDotcom: Me: Are you....my dad?\n\nElephant: phhrrmmmm!", "@whattheel *Slow clap* (but really I love that kinda terrible punnery)", "Why did I move to this ugly place from that ugly place and that other ugly place?", "@williamggrant worst streaming website ever.", "@williamggrant I don't know what that means.", "@williamggrant ?", "RT @hapticworld: My mum just asked me what my beef was", "SEEKING A CREW TO HELP ON A SHOT-4-SHOT REMAKE OF \"THE OMEN\" STARRING MY CAT IN THE ROLE OF DAMIEN. PLS RETWEET.", "RT @underwirefest: Photo album of Day 5's programme of industry panels and discussions http://t.co/RjVWWf3TLK #underwire13", "@alannamcardle_ hi, d'ya get my email? sorry to pester.", "@jrgdutton as soon as I wake up tomorrow. I'll text you immediately. Gonna live tweet as I watch.", "@jrgdutton I can't watch (the doctor not derby obvs) so don't text me about it till tomorrow. Gonna have to cut myself off to not spoil it.", "@Ingvild_Deila I owe you a drink you kind soul. Hope you got back to your friends' safe and sound.", "@ace_jace hmmm... http://t.co/92mNa95all", "@ace_jace @PhotoSonny @paulbestfit might get a third.", "@ace_jace @PhotoSonny @paulbestfit just devoured a chicken burger in under a minute and ordered a second.", "thunder in the day time.", "I don't understand kangaroos.", "@kayanucha that doesn't sound like something you want in a cake...", "I feel like a character in a Richard Yates novel.", "@hapticworld ......................................................................maybe", "Pls google and listen to the lesser known \"Independent Women, Part 2\".", "@jrgdutton Wrexham does need saving.", "Glad to see Bataille getting a mention on Best Fit. @sam_kriss @bestfitmusic  http://t.co/TCrYRwuiPX", "If you do not like yourself reinvent yourself with art and be happy.", "I'm reading A Farewell To Arms on a train full of soldiers. Viva la Pace.", "@its__debateable @underwirefest hope it does!", "Really want a turtleneck t-shirt.", "@its__debateable @underwirefest I said a damn good reason and those are all pretty good reasons which together form a damn good reason.", "SHIT MY BROTHER'S GETTING MARRIED!", "I really want someone to remake Last Year In Marienbad in the Barbican.", "If you're not going to @underwirefest next week then you'd better have a damn good reason. #underwire13", "\"Stevenage: where imagination takes hold\"", "Is there anything more iconic in the 21st Century? Gotta be the most widely recognised unnatural object in the world.", "Want an AK-47 to hang on my wall.", "@alannamcardle_ c) Same, but if the void's like the river rapids at Waterworld I feel like I'm doggy paddling really hard &amp; nearly escaping.", "@alannamcardle_ a) You can look forward to that in the morning, I hope you think it's rad. b) awesome, I'll get it to you somehow...", "@alannamcardle_ Also: here's a man in a battleship canoe http://t.co/okUbSxqreU", "@alannamcardle_ YO: may I ask what's your email? Gots a proposition for ya. Also, still want that book of essays on photos? Also how're you?", "@Ingvild_Deila I notice you're on the Underwire volunteer crew too. Should be a fun few days huh?", "@richthane fiddlesticks.", "@richthane for $?", "A return to upstairs downstairs probably.", "@charliebrogan AMEN TO THAT!", "RT @charliebrogan: http://t.co/06OM0OsMKd Will never tire from watching this arghh it's insanely good. *weep*", "RT @nadiakhomami: Are you a feminist? http://t.co/B4a4MgHFL4.", "RT @bestfitmusic: How To Dress Well compiles a party playlist, featuring Kanye, Drake, Rihanna &amp; more http://t.co/kJW56AUxEl", "cats and cats and cats and cats and cats.", "last night was \"swear like a sailor\" night.", "Fuck", "RT @Beach_Sloth: Now is the Winter of Our Online Content", "@char_lotte_eve plop.", "@sam_kriss your whole life revolves around twitter.", "@WillGrice PERFECT", "RT @WillGrice: Not to mention describing poetry as 'the Death Star of culture'.", "@mariannecr poifect!", "@mariannecr where what time?", "@mariannecr I have played the trumpet. I can't read music on it but I can make the correct noises. I'm not sure I do have him actually.", "@mariannecr as in, I can play the trumpet.", "@mariannecr yes, and I needn't mime it.", "Might reduce all my online interactions to link sharing.", "Gotta wonder if two of my grandparents hadn't come here what one half of me would be like over there.", "RT @TheAVClub: A Chinese movie theater accidentally used a homoerotic Thor poster and it was glorious http://t.co/5qUe7UjNR0", "The phrase \"get my snap on\" has just this instance become both a statement that will forever haunt me and my new catchphrase.", "Folks shouldn't be penalised because plagiarism is \"wrong\" but instead be treated as if they've disclaimed \"I have nothing to offer anyone\".", "Was beautiful to simply replying \"Jesus\" to a nauseatingly Christian message.", "@tokny INDEED.", "@tokny http://t.co/caCWieiEFp", "woo it's first thursday so all set for some free art woo art its all about the art and nothing but the art and not the free drinks honest", "@tokny http://t.co/6v6n4IcrMR", "hung.ry: http://t.co/1r6ZX9rqJu", "LOL \"Google+\"", "http://t.co/aBk7QBRZqX", "maybe I'm just turning back into a racoon.", "Such huge bags beneath my eyes. Wonder if I shouldn't rock a Bateman style icepack. Wonder if I haven't been sleepwalking.", "RT @nadiakhomami: @lkmrgnbrttn Tom Dani knows what he's talking about.", "I just had a dream and you were crying and you were beautiful.", "SHIT THIS GUY HAS A PISTOL!", "Watching scanners and all anyone has is shotguns. Shotguns for all purposes.", "I cannot retweet myself. Twitter will not let me \"big-myself-up\".", "@sam_kriss my bank balance is a metaphor for why you should buy me more cocaine.", "Read for 5 hrs straight today.", "I am fucked existentially.", "Can't work out which is the greater evil, money or paperwork.", "\"Why?\" is a question you should always know the answer to but never give the answer to.", "If there is applause, let it stagnate. http://t.co/bqNFr2olBL (twee, but bearable?)", "@annacortesia smugness?", "@Charlotte__Nice Me too. I read the word Gulag earlier and all my creative and expressive woes were hushed into triviality.", "RT @Glinner: Argos aliens already turning Christmas into a living nightmare https://t.co/YeGGGqKbZT", "RT @char_lotte_eve: I never thought I'd say it, but being in the countryside is making me loopy.", "GOATS ON A HILL.", "CCTV EVEN IN THE COUNTRYSIDE.", "countryfile is weird.", "RT @zizek_ebooks: Boss", "American Graffiti &gt; Star Wars Episode 2: Attack of the Clones.", "http://t.co/AXdtQobD6k", "I'm just a boy sitting in front of a computer screen asking it to love me.", "@MelissaRHunt I just go ahead and cross anyway, forcing them to swerve around me crash and explode. I don't even look at them.", "@sam_kriss you know that's the first time I've seen the word \"Syria\" online for about a month. Media seems to have given up on it.", "@JCalvert_music sorely underwhelming.", "RT @NoPoliceman: Sunday funday who wants to meet up and smoke crack? RT if you love your mom", "@daisyojordan but you get an extra hour!", "@elliestayloose oh why thank you!", "@bestfitmusic also, look out for @paulbestfit in shot #3 http://t.co/QRzKbszWMB", "Took some photos of Waxahatchee (@k_crutchfield) at Scala last night. Big thanks to @elliestayloose. http://t.co/27MqD6Ke1S", "A++goodmoodhappytimes.", "RT @JessPartridge: Really not convinced by this Ainsley Harriott microwave risotto.", "outsider of the outsiders.", "wanna ride a motorbike through the country.", "RT @sam_kriss: http://t.co/5PneCaNI18 this continues to be the most potent cultural critique of the twenty-first century", "@char_lotte_eve If I had no other way, I probably wouldn't be wanting to wish them happy birthday. Still frustrating.", "facebook won't let me wish anyone happy birthday. piece of shit.", "@jrgdutton Can we hang sometime though? Are you free thursday eve?", "@jrgdutton you, sir, suck.", "@jrgdutton so are you actually not coming on Friday?", "I'm gonna die in hackney wick.", "@cgalbraith what annoys me about those is that SELFIE is not written backwards so that when you take a selfie it reads forwards.", "There's a special circle in hell for folk who ask why the media doesn't report on inane good shit that happens to middle class people.", "Doug Stanhope: the man Bill Hicks should have been.", "@dancarse http://t.co/dRQiEEUhin", "@Story24 not as fucked as the Harry Potter Wizarding World economy which literally runs by magic.", "Tommy Robinson: Worst example of the \"Oops I was drunk\" excuse.", "RT @ro_bot_dylan: Yonder stands your orphan with his gun, Crying like a fire in the sun.", "Kiki's Delivery Service with a Sunday Roast and a bottle of 2004 Rioja. So fucking perfect.", "At 10:30 in the morning I just cried at the death of little Resi Noth.", "RT @Dave_Rowlinson: just Quantum Leaped back to 2010 and used a USB stick. The past was slow.", "Gumtree Gumtree my old friend.", "RT @little_magpie1: Gonna try and bring the word 'crud' back.", "@rachaellenger It was pretty damn great. He's got a lot of angst and energy, which made a great change to all the moody apathy of late.", "@rachaellenger Thanks, glad you like the photos! And that suit was class.", "RT @bestfitmusic: Ever confuse your death metal bands with your Ikea flat-pack furniture? This website is for you... http://t.co/3Skp6xLF8i", "RT @songkick: Great photos of King Krule live earlier this week at @OvalSpace, courtesy of @bestfitmusic: http://t.co/X6K5b5Eml2", "When I shit gold\nI shall buy only photobooks.\nAnd I shall be richer than all of you.", "Some spanish speaker tried to change my Instagram password.", "Corsody: For people who spit blood when they brush their teeth.", "@McCormickDaniel I refer you to my \"everything is the same everywhere\" tweet.", "I spelt my proudest tweet wrong fml.", "I love how frightened all you apps get when you threaten to delete one of them.", "Don't think I could love Claire Boucher more.", "Never trust anyone who's favourite Beatle is Paul McCartney.", "Never trust anyone who's favourite Beatles' song is \"Maxwell's Silver Hammer\"", "I've listen to Good Kid MAAD City twice and its not even Noon.", "Chubby guys with guitars.", "Bitch don't kill my 9am vibe.", "@nicoledandy wanna watch them all right now.", "@nicoledandy Brief Encounter all the way!", "I just wanna be Chris Marker.", "RT @weismanjake: \"I have fucked all the women in the world\" -Adam", "@jrgdutton mustard and ketchup, always present in my condiments arsenal.", "RT @hapticworld: What are you doing today? Going to Selfridges to by @boysbygirls issue 5 you say? Good idea.", "it's strange to think some men know more about the strategic military history of World War 2 than they do about their own children.", "when someone resorts to pedantically splitting-hairs over a definition during an argument, they are either Martin Heidegger or plain wrong.", "Intricate and nuanced as such a difference is, I reckon the kids can handle it.", "Also, they should probably starting teaching the difference between \"colourful and humorous\" and \"sexist racist bigot\" in grammar schools.", "...but it may be more likely that they don't realise that the definition of \"slut\" they are referring to is outdated by some 600 years.", "UKIP may think that \"people don't understand the difference between slut and slag\" owing this to \"the lack of grammar school education\"...", "Let's", "RT @basementfever: I have a feeling Robin Thicke isn't a very nice man.", "RT @JessPartridge: Assholes.", "I am sad and you are pretty.", "@TomDani_ what if you rolled a cig but are now stuck at stanstead border control for like a fucking hour and all you hands are full?", "RT @whattheel: I might write an open letter about this.", "@whattheel in fact I sat at the back then it started going I turned saw what was going on and ran to the front making happy noises.", "@whattheel I DID SIT AT THE FRONT OMG!", "@whattheel let's go to eton and ask who the star pupils are then go up to those pupils and say \"don't be a dick\".", "@whattheel we could just post flyers around Oxbridge club rooms that say \"Don't be a dick\".", "@whattheel they're all old. They'll all be dead. They don't care about the future.", "Stanstead you're freaking me out.", "Riding what seems to be a strange little train from a bond movie.", "@gregianjohnson my sincerest apology.", "@gregianjohnson I'm not sure I was asking twitter.", "History is just really old places where really bad things happened.", "Akimbo.", "RT @AnOtherMagazine: Juergen Teller heaven: http://t.co/eQ86drMvg1", "Two prostitutes propositioned me last night. They said \"empty balls are happy balls\".", "@jss_hlt I'm in Berlin. Again. It's the best. I want to make one big enough for the whole world to be in.", "I arrived in Berlin and the first thing I did was get a Kreuzburger.", "This national express coach is too hot and smells really bad. I heart megabus.", "@james91ocr whilst running the risk of sounding stupid, their's are less of a thing?", "@rachelbrassey take it off and drape it over your shoulders. Will reduce the boil factor, allow sweat to air &amp; dry, and looks chic as fuck!", "\"I thought it better to be less easily understood and more accurate.\"", "@Ingvild_Deila hey nice to meet you the other night. Did you make it back to Brighton alright?", "@alannamcardle_ I should lend you a book of essays on photography that'll give you the jump on everyone. It's very good.", "I intend to give my kids the international cosmopolitan upbringing I never had so that they may be as interesting and smug as I fail to be.", "Creative or destructive, it's best to leave your mark.", "@alannamcardle_ Don't be scared! http://t.co/JSuinjDrle", "RT @char_lotte_eve: Rick Owens. Rick Owens. Rick Owens. Wow. And thanks. #rickowens #pfw", "@McCormickDaniel we can still be friends (I guess)", "@McCormickDaniel http://t.co/B1ufltU2H1", "death or photography.", "My window is open. My light is on. There are no bugs. I love autumn.", "someone buy me a book on Alexander the Great.", "http://t.co/Xret1YtLv6", "http://t.co/LiudfeDLMy", "@williamggrant tell that to Jai Paul.", "Cara Delevigne presents a radio show on GTA V.", "@RachPatt Glad you like them. It was really nice to see you, albeit brief. Look me up when you get any less busy yeah?", "horse bastard, equine cunt.", "http://t.co/AbR2natkp7", "http://t.co/ujcQaHN7z6", "seared into my retina. be cool, be cool.", "\"Looks like watergate\" - @dleink", "@sam_kriss ill send you em on Monday. Sorry I didn't get a chance yet and I didn't bring em to Bristol.", "@RachPatt Yuck: http://t.co/EXId8RvNl2", "RT @bestfitmusic: Photos: Fuck Buttons at the Electric Ballroom in London http://t.co/BQXue5Okvd", "RT @bestfitmusic: Photos: Yuck at The Macbeth in London http://t.co/y7TcvQT07E", "@char_lotte_eve wait is your number the same? I forgot to note down the one you put out the other day s'all! Miss ya Norm!", "@char_lotte_eve ps, Chook &amp; Norm would a great stage name for some sort of variety show double act.", "@char_lotte_eve (DM me your number)", "@McCormickDaniel knowing that water is a more sensible choice than all the coke, but not nearly as sweet. #MealDealMetaphors", "@McCormickDaniel Just when you find something you really want has been reduced you see it's been out of date for years. #MealDealMetaphors", "RT @Anna__Conrad: In order to comply with 2013 protocol, I have updated my CV skills to include that I'm a 'hard-twerker'", "@char_lotte_eve SOON", "RT @hapticworld: 10 London labels you need to know about for @FRANK151, photography by me  POW. http://t.co/hx7p4xiutt", "@sambriggs Not to give to much away, but I'm thinking of pitching a little something called \"The Vine of Best Fit\"", "At once.", "I just wanna look at every Edward Hopper.", "@jss_hlt I've often thought I should become the sculptor/creator/curator of such places/spaces/atmospheres. I should work to create them.", "@whattheel Don't worry, I hate spoilers. Plus I can't actually remember what happens at the end.", "@whattheel it is indeed. It's really great and it taught me to love Suicide even more (nb. band not activity)", "@whattheel Last Days of Disco.", "@whattheel kicking and screaming.", "@whattheel Attenberg", "RT @davidschneider: This could end in tears... http://t.co/U6feeHh7jn (via @Martinkelner)", "Finished my chapter the same time this album ended.", "There are 4 \"anaconda\" films.", "RT @jitka: god I wish Siri's name had been Diane", "\"My exact opinion is being underrepresented by the similar opinions of other people so I will be a pedantic bitch in the article comments!\"", "Forgot what a good album Glass Eights by John Roberts is.", "RT @jitka: when Life gives you lemons, eat the lemons like apples while maintaining intense eye contact with Life, to intimidate him", "@kayanucha I was thinking the exact same thing last night. Megabus is so full of life.", "Also, saw Chris Morris having his dinner last night. THE Chris Morris.", "This is the best time of the year. Shit's magical.", "@plainlaurajay come to Dalston then! Gonna watch a film in an old war bunker.", "RT @laurendubinsky: Google search results for \"flame tattoo\" are why I am terrified of democracy.", "RT @KimKierkegaard: Cooked a new meal for Kanye! He talks in lofty tones about the infinite, but in reality he is often thinking of food.", "And soaked the final chapter of a novel I'm so close to finishing. Can was in there like 20 seconds.", "A can exploded in my bag and trashed one of my cameras. Ffs.", "@JessPartridge read that as \"Androgynous Lovers\".", "RT @braidy001: Forgot how dreamy the UMO Album is", "I wanna watch the rest of Masculin Feminin and cuddle.", "@sam_kriss http://t.co/Vdm5J2zn7Y", "@sam_kriss doesn't everyone?", "@Charlotte__Nice Yes, and it was pretty much the entire point of the film.", "Just saw Only God Forgives. It's no Drive, I put it on par with Bronson but all three are totally different.", "There's a Melnyczuk with a verified tick and it isn't me. I am not real.", "Just heard @JOANNAGRUESOME on @BBC6Music. BOOM.", "@JessPartridge what's the worst that could happen?", "Imagine if such a place existed.", "Wish I could live somewhere where it's always autumn.", "How come Zomby keeps tweeting Gucci man rather than Gucci Mane?", "Life is full of changes of heart.", "@mariannecr I'm in work from 8:30am - 11pm/12am but by god I'll try!", "@mariannecr HOW DID YOU KNOW?!", "I'd rather be sleeping.", "RT @HudMo: On Silk Road trading good girls for chickens rn", "Grouper on loop til death.", "RT @Independent: Nearly half of new Harvard students admit to cheating http://t.co/veqMrv1vQ1", "@williamggrant cheese sauce.", "@williamggrant what's it for/how much filming? I may be able to help.", "RT @paulbestfit: I miss LCD so bad.", "RT @NoPoliceman: any home dogs skipping class to do marihuana? I am!! Reply with location", "@alannamcardle_ yum.", "I'm the only Melnyczuk in the UK this weekend.", "@alannamcardle_ do you, perchance, like Sibylle Baier?", "Why do dogs sit when told to?", "RT @bestfitmusic: Photos: Braids at Electrowerkz in London http://t.co/zliHBTDpQb", "RT @braidy001: cannot get over how perfect this is. I MAY have been the first UK post too... http://t.co/qEmOcfS6bv", "@dominiqueeeek I wasn't criticising I just hate robin thicke.", "@dominiqueeeek yes but there are so many better strutting songs. When are you back?", "@dominiqueeeek ew ew ew ew ew ew ew ew ew ew Robin Thicke.", "Douglas Sirk is so awesome.", "RT @plainlaurajay: Why is the iPhone snooze automatically 9 minutes? Like why 9 of all numbers?", "@sometaknight with fire.", "someone come wrap me up in a big blanket.", "all the ills of the world down to a few bum lines of code.", "RT @JosieLong: If you own the pond near melton, suffolk then we camped out next to it and then we swam in it and i regret nothing.", "living the life of luxury right now with my own private cinema so fuck all o'y'all.", "@sam_kriss nice one acknowledging my text, aren't you even curious?", "A little less Bad News a little more Power.", "@McCormickDaniel are you putting your dick in nature?", "I'd love to see Ron Swanson beat Ron Burgundy to death.", "RT @jitka: I guess \"curated\" is the big new buzzword huh", "RT @marcuschown: http://t.co/E18bswgDNV", "Reading reviews of Nicolas Winding Refn films makes me ashamed of film critics.", "my bike is broken and its the worst thing.", "@dominiqueeeek like what? Y'right?", "@sam_kriss it's pretty obvious when people make obvious statements. obvious.", "@james91ocr in the light of golden dawn...", "RT @ro_bot_dylan: But I would not feel so all alone, Everybody must get stoned.", "We all have romantic notions of the past, it's just some aren't crazy racist.", "\"@dancarse \"Babel\": the \"thinking\" man's \"The Butterfly Effect\". It just replaces \"Ashton Kutcher\" with \"Brad Pitt\".\"", "It's disgusting.", "Is there a more purer work of neo-nazi cinema than 300?", "Totally not down with this slut-shaming episode of Don't Trust the B.", "Will historians look back on now and say \"You could see the tensions of conflict building. It was all so obvious.\"?", "@char_lotte_eve LETS DO IT! Plus hopefully future hausmate Ben is from there, and his gf is there. Haustrip?", "@char_lotte_eve LET'S LOOK AT HAUUUUUUUSES!", "Dunno why I even bought this pony.", "I don't miss Leeds.", "I miss Bristol.", "I miss Manchester.", "I thought it would football related but it turns out it's not. #CBB", "Why is everyone missing the final C off CBBC? #CBB #ignorant", "Advertising is easy. All you have to do is find a way to associate your brand with cats apparently.", "Clothes you can eat is actually a really good idea.", "@sam_kriss but also the make large format digital cameras too.", "@sam_kriss I thought your dick was inauthentic.", "HOLY SHIT http://t.co/vNvfQgcIyL", "http://t.co/Hkgq3hO49h", "really want a large format camera. like, really large.", "I was looking at my resume feeling really fresh today.", "@whattheel The NSA has been shady from the start!", "@char_lotte_eve another place to feel the bittersweet longing to be less lost.", "RT @dougthmsn: @melnyczuk http://t.co/gvxqEBbfVh there's more. I've felt them all.", "@WillGrice man imagine if I hadn't replied to your reply and I BECAME EVERYTHING I'M COMPLAINING ABOUT.", "@WillGrice my heart swells.", "@jss_hlt Oh thaanx! More to come when I make it off this damn Megabus. They're all surprisingly enough from a single hugely productive day.", "Bitch I'm back out my coma.", "\"I decided: if Drive was really good cocaine, then Only God Forgives was going to be really fucking good acid\" Nicolas Winding Refn.", "Photos:", "RT @whattheel: \"It's a bit shouty.\" #DadReview", "What a beautiful morphing blending morning.", "@whattheel me oh my", "@whattheel how far north?", "I don't want a lover, I want a muse.", "@sam_kriss the unprecedented novelty of death.", "@sam_kriss I'm going to die like this.", "@sam_kriss working.", "@sam_kriss and ours isn't?", "@sam_kriss probably as fucked up as us.", "@sam_kriss naw, the internet is older than I am.", "RT @zizek_ebooks: I either hate the world or I'm indifferent to it", "Oliver Stone is the worst.", "My self-depreciating humour is really getting me down.", "There's no satisfying end to a game of Tetris.", "RT @k_crutchfield: I need beer", "RT @whitegrlproblem: I'm so bored that I'm hungry.", "RT @TheTweetOfGod: \"Creation science\" has the same intellectual heft as \"dragon anatomy\".", "You can take a beautiful photograph, sure. But can you take a good one?", "@gregianjohnson I can't even begin to understand the mindset that feels empowered by this. All it screams to me is \"I fear my penis is tiny\"", "My sanguine self in melancholy times.", "Wait so now Ariel and Persil both have M83 songs from the same album on their adverts. Fucking hell ad companies are getting lazy.", "RT @char_lotte_eve: Maybe I should take more selfies.", "That McCoy's advert makes me want to never eat McCoy's again. Man Crisps? Asshole Crisps.", "@char_lotte_eve naw I'm working. fml.", "Persepolis is really good. I'd almost go so far as to say it should be on the school curriculum.", "@sam_kriss read my story or I'll tell all your followers what a fraud you are.", "RT @DesignsByGuru: Being broke is the root of all evil.", "http://t.co/7iSgsWN43b", "Just stretched my leg and realised I should have stayed a dancer. http://t.co/kS5bBB1ALX", "@sam_kriss DOWN WITH THE MATRIARCHY!", "@sam_kriss HANGOVERS ARE (NOT?) FEMINISM", "@sam_kriss TWITTER IS (NOT?) THE PATRIARCHY", "The connection I can't shake watching this film: ER.", "@sam_kriss I'm glad. Too much for a tweet though. Email.", "The Good German has some of the slickest action choreography/direction/editing I've seen in a long time. It's like a masterclass.", "@sam_kriss I don't get your reply, o causal acquaintance.", "twitter, you are the bar tender. the internet is that lonely bar.", "I wanna be a bartender in a lonely bar. The kind you talk to. I feel it's a job I was born to do.", "RT @nadiakhomami: Oh look, everyone's Caitlin Moran. How witty.", "RT @Story24: Dammit. I thought about pizza, now I reaalllyyy want pizza.", "@char_lotte_eve Cycle trip to Brighton? When are either of us ever gonna be free though?", "Gonna see Only God Forgives by myself because fuck all you. Need to see it so bad.", "RT @ro_bot_dylan: I didn't mean to make you so sad You just happened to be there, that's all", "I'm somewhere in the internet but I don't know where I am.", "\"You act like nothing ever happened but it meant the world to me.\"", "@JamesWoooods Well I live there now, but I'm looking to move into a live-in studio either here or south. Da dream. http://t.co/FyXgx4hew1", "@JamesWoooods move to Hackney Wick and we can!", "I wanna play bass in a band.", "RT @caitlinmoran: Twitter's UK manager, @TonyW, currently Tweeting personal apologies to women who've been abused on Twitter.", "Might put on all my winter clothes and wander around til I pass out.", "@Goon_ads WOO @zerocoremag FTW", "RT @Whybray: @melnyczuk nooooooooooooOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOO!!!!!!!!!", "@Whybray \nO O O S O O O      \nO O O X O O O      \nO O X X O O O     \nS X X X S O O     \nX X S S X S S     \nS S X X X S S\n\nwin.", "@Whybray \nO O O O O O O     \nO O O X O O O     \nO O O X O O O    \nS X X X S O O    \nX X S S X S S    \nS S X X X S S", "@Whybray \nO O O O O O O    \nO O O O O O O    \nO O O X O O O   \nO X X X S O O   \nX X S S X S S   \nS S X X X S S", "@Whybray \nO O O O O O O   \nO O O O O O O   \nO O O X O O O  \nO X X X S O O  \nO X S S X S O  \nS S X X X S S", "@Whybray \nO O O O O O O  \nO O O O O O O  \nO O O X O O O \nO O X X S O O \nO X S S X S O \nS S X X X S O", "@Whybray \nO O O O O O O      \nO O O O O O O      \nO O O O O O O      \nO O X X S O O       \nO X S S X O O       \nS  S X X X S O", "@Whybray \nO O O O O O O     \nO O O O O O O     \nO O O O O O O     \nO O X X O O O      \nO O S S X O O      \nS  S X X X S O", "@Whybray \nO O O O O O O    \nO O O O O O O    \nO O O O O O O    \nO O X O O O O     \nO O S O X O O     \nS S X X X S O", "@Whybray \nO O O O O O O   \nO O O O O O O   \nO O O O O O O   \nO O O O O O O    \nO O S O X O O    \nO S X X X S O", "@Whybray \nO O O O O O O  \nO O O O O O O  \nO O O O O O O  \nO O O O O O O   \nO O S O O O O   \nO S X X X O O", "@Whybray O O O O O O O \nO O O O O O O \nO O O O O O O \nO O O O O O O  \nO O O O O O O  \nO S X X O O O", "@Whybray O O O O O O O O O O O O O O O O O O O O O O O O O O O O O O O O O O O O O O X O O O", "@sam_kriss rather be a homeless acquaintance than live with ma parents.", "RT @ChloeHowl: There should REALLY be a class in school on dealing with money.", "A shell exploded. Twenty or thirty young men were blown up in France, among them Andrew Ramsay, whose death, mercifully, was instantaneous.", "The tone in his voice when he answers the question \"what happened to Jacqueline?\".", "@sam_kriss Acquaintances ey? Bitch.", "@chloenobrainer so Miranda July.", "@francinegorman great shout on the saltwater, my hand's way better already.", "@jss_hlt my work here is done.", "Just met Wu Tang Clan.", "@RachPatt Aahh sweet. Which particularly adept musicians would those be?", "life is all curveball.", "@RachPatt hey so what are you doing now?", "The spiritual link between Chris Marker and Daido Moriyama.", "Thunder is the best thing ever.", "RT @Horse_ebooks: identity information being totally destroyed -", "@ace_jace so good to meet you too! Blonde Scott Pilgrim 4eva. Hope you can make it down tonight, bring anyone you like.", "@dngdwn rats", "RT @Dave_Rowlinson: drying a t-shirt by wearing it on the cycle ride in is not what Jay-Z would do.", "@gregianjohnson can't wait.", "@gregianjohnson but only because I'll definitely be reliant on a caffitar bag.", "hey remember when the cast of friends got really old without accepting it and it was really embarrassing?", "Someone woke up in the wrong side of bed. But not me. I'm still in bed.", "RT @ChrisMasonC: Some top pictures of @IndieLabelMkt: http://t.co/DWOcQsazpK via @bestfitmusic", "The security at these Somerset House gigs is as tight as the security guards' sphincters.", "Hackney Wick to Somerset House in 22 mins.", "Overwhelming urge to say \"well this is a bit of a sausage fest\" whilst stood in the gents.", "tall dark and empty.", "Looking heavily out of place in the Somerset House VIP area.", "RT @Tim_Kelly: What's that smell? Is it Boeing's reputation in flames? http://t.co/RtwqJe1gtB", "RT @TFLN: (717): Nope I went the fuck home like an adult", "So many folks spend so long wanting to be beautiful that they forget to be interesting.", "RT @steveroggenbuck: poems are stil being writen that do not acnowledge the existence of the internet in any way", "RT @JosieLong: If you resent paying for social security then it'd be great if you could change your mind, cause you're in the wrong.", "@WillGrice Sure man, I'm down for that.", "@WillGrice Yeah loads, it was 4 days long. Check out my previous galleries if you like! #shamelessplug", "@WillGrice Cheers man! Was over there at the weekend and it was really great! Went swimming in the Baltic at 6am amongst other adventures.", "RT @bestfitmusic: Check out photos from the final day of @OpenerFestival in Poland from Best Fit's @melnyczuk. http://t.co/lfi2JGlF01", "RT @georgewobrien: I will always like Always Like This.", "@alannamcardle_ hey are you going on tour soon? Can I be your tour photographer?", "@parakeetorsutin keepin it on the DL, but I'll be there.", "@parakeetorsutin oh man thank you so much! When are you guys next playing in LDN btw, I need to take my housemate.", "@parakeetorsutin Next time I'm at your gig and I yell encore, I wanna hear you shred Steve Reich's 'Electric Counterpoint'.", "@parakeetorsutin I saw Jonny Greenwood at the weekend and he looked like a less energetic version of you.", "@gregianjohnson DO IT COWARD!", "@char_lotte_eve OH MY GOD so good. Pls lets hang tomorrow and I can tell you alll about it!", "RT @hapticworld: Don't forget to surrender your rirearms @melnyczuk http://t.co/6QiySaAX1L", "RT @ChloeAngyal: Murray is indeed the first Brit to win Wimbledon in 77 years unless you think women are people.", "@plainlaurajay Do kiwis eat kiwis?", "@plainlaurajay read that as croissant grazing.", "@whattheel Bravo. Firsts are for suckers anyway.", "I've missed you, Internet.", "That Mos Def video is powerful.", "@gregianjohnson Yeah dude, and I met Steve Reich. Did I mention that? Steve Reich. Yes that Steve Reich. The one &amp; only Steve fucking Reich.", "@whattheel also I hope grass bison has a bison eating grass on the bottle right?", "@whattheel I'm gonna drink all the breakfast Prosecco then hit the swimming pool and do Kendrick proud.", "@whattheel I'm planning to fill my case with Tyskie and check it on to the plane home. #partyhard", "@whattheel that someone being me.", "So I just missed the only sporting event I'll probably ever give a shit about.", "No biggy, just Steve fucking Reich.", "I also shook hands with Steve Reich.", "Yesterday I met Devendra Banhart, Mount Kimbie and Crystal Fighters.", "Dammit Wordpress.", "@alannamcardle_ Favouriting this seemed like the only noble action I could take today.", "fuck marlboro.", "RT @JamesWoooods: Milk was a bad choice.", "Late night organ donor.", "There's a spa and a pool in this hotel but I'm content with a working shower for once.", "@TheSpocker thanks dude!", "Just met Tame Impala.", "@anna_kelly_ Poland to cover a festival. Should be good.", "Will everyone shut the fuck up about post-Glasto blues you're giving me the blues.", "But I really can't complain because this is awesome.", "And I've dropped a fiver.", "At Luton, through security, flight delayed by an hour already. Great.", "I &lt;3 the colour blue.", "gotta learn to make moonshine.", "@georgewobrien well I'm in Poland until Monday so try and make it any day from Tuesday on if you can!", "@georgewobrien yeah pretty excited for that. When are you interviewing her btw?", "@georgewobrien @dancarse @lkmrgnbrttn @JamalGuthrie @sambriggs a steady diet of burgers and wine.", "I'm far more scared of the living than the dead.", "RT @L2__P2: wikipedia page on 'vernacular geography' was clearly written by an encarta 95 enthusiast.", "They'll keep building flats and killing local businesses until theres nothing worth moving here for.", "Valhalla Rising. What?", "The Hanging Gate has changed slightly.", "How much do I not give a fuck? Let me show you right now before you give it up.", "Fuck fuck fucking card reader corruption.", "Natasha Kahn chilling at Hackney Wick station.", "@char_lotte_eve Just back to London after a stellar weekend in Bristol. Are you back in Norwich now?", "@WillGrice ahh cheers bro! Photography side of things is going really well.", "@WillGrice the pays not great but it's fun and I'm getting by &amp; it's only part time so I get to take plenty of photos.", "@WillGrice @jimbodutts @gregianjohnson that I am, that I am.", "@jimbodutts @WillGrice @gregianjohnson I'll start saving my pennies now.", "@gregianjohnson @jimbodutts @WillGrice shit.", "@jimbodutts @WillGrice pls only refer to me as Howieezus from now on.", "@McCormickDaniel just kidding! I &lt;3 you mum! @valerimelnyczuk", "@McCormickDaniel me too. Especially my mum. @valerimelnyczuk", "@jimbodutts @WillGrice @gregianjohnson if any of you are around at the time I want that on my tombstone.", "@jimbodutts @emmajew (screamed to the tune of a heckler requesting freebird.)", "@jimbodutts @emmajew FREE BAR FREE BAR FREE BAR!", "@jimbodutts @WillGrice @gregianjohnson I'm basically Jesus Christ or Coca-Cola. I don't mind which.", "@McCormickDaniel that's the only reason I do all those things.", "@jimbodutts @emmajew my car still smells a bit. @dominiqueeeek", "@jimbodutts @WillGrice @gregianjohnson Y'all met at my housewarming. Just throwing that out there.", "@jimbodutts yeah boi!", "Got so drunk last night that I can't remember a formidable chunk of the night. Last time I got that drunk was exactly a year ago yesterday.", "A guy told me off for playing with his dog last night. \"What the fuck do you think you're doing?\" he said.", "Tacos for breakfast.", "\"That's the new Kanye? It's just really aggressive!\" - my favourite quote of last night.", "Cows are cool.", "Wanna go to the countryside already wtf.", ".@tokny can shower for England.", "Want some sushi.", "Bristol is the bestol.", "It's Friday night drop the Yeezy.", "RT @chloenobrainer: I love watching couples break up on the tube. Does that make me an awful person?", "So Yeezus is fucking awesome.", "And now the sun's come out to make me even more annoyed that I'm not shooting Waxahatchee on a roof.", "RT @PhotoSonny: Today's shoot for @NotionMagazine with @alexisknox, @sebulous and @melnyczuk  went exceedingly well.", "Prospect of a new 300 film must be a wet dream for Golden Dawn.", "@PhotoSonny yeah man for sure! That's really near my house too. DM me the address/details.", "Pigeons fucking in front of me.", "PSYCHED. http://t.co/TBduIUm1iJ", "@tokny good.", "new camera looks just how I want. stoked.", ".@lkmrgnbrttn not cool dude.", "Update: for those out there who stayed up all night worrying, I fixed my hair.", "@plainlaurajay where you going?", "no better time to reinvent yourself.", "@jacobdrozario doing this \"summer\" lark all wrong.", "@gregianjohnson I'm still building up the courage to attend.", "warm beer in a cold park.", "@gregianjohnson if I had a self help group that would be its name and I would be its only member.", "Cut my hair like a fucking idiot.", "@chloenobrainer @plainlaurajay but on a serious (hand muted) note: https://t.co/8yvprKo7rl", "@chloenobrainer @plainlaurajay https://t.co/U9HTfwNhjg", "@char_lotte_eve As for colours, primes are my favs but anything colourful is great by me! What are the options?", "@char_lotte_eve Don't be it's gonna be fun! I'll DM you my address so my legions of fans don't come a'knocking.", "@char_lotte_eve Super psyched for our shoot on Monday. You got your running route planned out? Forgot to say: make it end in Victoria Park!", "@dancarse Urgffice 2003 more like.", "I hate when facebook chat says someone's online when they're not online, and I look like an ass.", "@jss_hlt 3. It looked alright in colour but I preferred how dropping the sat worked with the noise.", "@jss_hlt digital yo, shot on a camera I found in my cupboard that the previous tenants left.", "@jss_hlt hey so here's my first play around with da cheap P&amp;S, what d'you reckon? http://t.co/3GOtLIuz57", "@MelissaRHunt weeeeeell are you free at all this week?", "@MelissaRHunt YOU'RE LEAVING THE COUNTRY?", "@MelissaRHunt the Hackney Pearl. It's awesome.", "Slowest shift of work I've ever done.", "RT @HudMo: taking a shit w sunglasses on again. second time in a week without even realising. whats happened to me", "RT @BBCRadio4: Next on #bbcaq: Does the panel consider grass root Conservatives to be swivel eyed loons?", "I'm not scared of terrorism in the same way I'm not scared of lightning or choking to death on my food.", "@jss_hlt Well I hope I pull them off then. Pretty excited to get started, hope to do the first one next week blue skies permitting.", "@jss_hlt Well yeah unless you have your own darkroom I don't see the point. If someone else develops your film it's a cop out.", "@jss_hlt I am planning to do some exp.s with cheap shitty old point and shoots and just bought one off ebay. Ooo the possibilities.", "@jss_hlt Yeah that great! I don't shoot on film, it just ain't my thing. I just really dig digital. &amp; I just use tumblr as my photodiary.", "@jss_hlt But over the next few weeks I'm planning to embark on a few actual projects and they will be great will be great.", "@jss_hlt not really atm, I'm just trying my hand and a range of styles and techniques to see what works and learn more.", "@alannamcardle_ clearly you need a leather jacket and a fedora.", "Did you go out looking for companionship, a little human warmth, only to come to in the woods covered in animal blood?", "Wanna me a girl with anger issues.", "@jss_hlt love that shit. Like my pic?", "In some weird cleaning mood I've never felt before. WTF?", "@RachPatt yeah not too shabby, pretty much lovin lyf atm. I'm living down in the big smoke, where are you?", "@gregianjohnson har har har.", "Get Lucky is the only track I can imagine hearing at a party.", "It sounds like a half decent Daft Punk al album being played at 33 rather than 45.", "Is there a subtlety to the new Daft Punk album I'm just missing or is it actually just really lame?", "@dominiqueeeek yeah fuck dem books!", "@jimbodutts I like to think I base my football on Thomas the Tank Engine.", "Win.", "RT @Tomsingssongs: See there's leaaaaderrrrs and the there's followeeerrrss, but i'd rather be a dick than a swallowaaaaaaa", "RT @PhotoSonny: Spaced wouldn't work now. They'd be looking for flats alone, at home, on Gumtree.", "@georgewobrien @dancarse I WANNA GO BACK.", "Well that was a crazy weekend.", "@chloenobrainer in a nutshell: yes.", "I'm still in Brighton. This could take some time.", "@EmmaDraffin prepare to be disappointed.", "RT @mrchrisaddison: Scuse me. I have to give the Ukraine votes out. #Eurovision", "RT @DIMBLEBOT: REMINDER: \"EVERYTHING IS OK IN BAKU\" #EVERYTHINGISOK #EUROVISION", "RT @mariannecr: Go home, Armenia, you're drunk. #eurovision", "Sweet Baboo fans are my favourite fans. #TGE13", "@richthane @georgewobrien snooze ya looze.", "RT @bestfitmusic: The Great Escape 2013: Friday http://t.co/vynEYp8wst", "@RachPatt Hey long time no see. How's it goin?", "Equal but different.", "Just wander past Billy Bragg.", "@paulbestfit @dancarse @georgewobrien just finishing up a pint then I'll be on my way (y)", "Just gone to the marina and there's a boat called the Great Escape. Seems pretty apt. #TGE13", "So Great Escape should be a great escapade. What?", "all I ever wanna do is meet new people who think I'm worth meeting.", "@cgalbraith \"I find the defendant guilty.\" Which one?", "RT @cgalbraith: There's a lawyer with the same name as me. I might sue him.", "Always shoot on Nikon except when you're shooting on whatever the fuck you want who am I yr mum?", "@char_lotte_eve The more I think about how much potential this has the more super super excited I get.", "Why do your work when you can retweet?", "RT @AntiJokeCat: Why did the man with no arms fall off his bike? Someone threw a washing machine at him.", "RT @ro_bot_dylan: Kick your shoes off, do not fear, Bring that bottle over here. I'll be your baby tonight.", "Shit I woke up from a nap too quick and now I can't do shit or focus on shit for shit. Shit.", "@dancarse @georgewobrien It's gonna be a fuuuun weekend! Let me know if either of you wanna buddy up w/me for snaps.", "RT @bestfitmusic: Check out photos of WHY? and Halls from their London gig last week. http://t.co/bl1C6H5XMp", "Fuck you incandescent light bulbs.", "urgh urgh urgh urgh", "a brain is a tricky thing.", "@james91ocr no?", "Iron Man 3 is intriguingly subversive.", "A cry for help but it seems innocent enough.", "hollow ghosts.", "How is the new Doctor Who SO bad?", "Wish I could photograph this dark place.", "@sam_kriss I like that we had the same approach to our dissertations.", "@ElenaFrancescaP ahh I remember it well.", "@ElenaFrancescaP aha good to know high school never changes.", "someone not camera shy with a character. someone lost.", "I need a muse.", "@chloenobrainer I don't believe you.", "@chloenobrainer I was thinking of staying in bed, covers over head.", "Sunlight a constant reminder I should be doing shit but I'm not.", "Sinking feeling I'll always get shit upon.", "saddest song in the world.", "@championrecords you're too kind. Hope you enjoyed it!", "At Why? about to see how big Yoni's muscles have got.", "@siamakamini yeah they don't cope well with the dark, I shot oOOoO on it and that was the darkest gig ever. Total nightmare!", "@siamakamini how bout you?", "@siamakamini hey! Yeah the lomo's going well. Got some pretty mean snaps of Death Grips and switched to using 800 film which is way better.", "@paulbestfit you're just eating salad and you in fact have more energy? what's the secret do share!", "RT @bangonpr: Brilliant Photos of @TheKnifenews live at @Roundhouseldn by Howard Melnyczuk http://t.co/pkz3TQ0dVW", "RT @bestfitmusic: Photos of The Knife live in London by Howard Melnyczuk http://t.co/Qo1cNeBuxG", "Now ending my bullshit twee tweets.", "My pillows smell like rain.", "&amp; BED.", "I fall in love to easily with the phantom that appears in the angle at which a girl turns her head for a fraction of a second.", "Dance to your own beat except when there's an actual beat in which case dance to that.", "Thinking of becoming a dancer but only for alternative electronic musicians.", "Those crazy Swedish geniuses.", "Wanna live in the mountains. Wanna live by the sea.", "90s teen movie pop punk.", "RT @BBC6MusicNews: Daft Punk 'Goat Lucky' http://t.co/YXEToXXos3", "@Tomsingssongs probs just need a new needle dude.", "you can't have democracy without debate.", "times website is bullshit.", "I can feel tension in muscles I didn't know I had.", "#BIFF", "@BBCNews this is news?", "@lkmrgnbrttn  http://t.co/23XRfs1RH7", "fucking lazy today.", "@jss_hlt I see non of these things.", "@lkmrgnbrttn blocked!", "RT @sam_kriss: did you know? if a nigel farage is brought into shallower water, the lack of pressure will cause its body to explode", "@sometaknight Congratulations you are officially my 300th follower. You have won an all you can eat cruise around the world. Yay!", "Just slipstreamed behind a non-stopping bus all the way from Highbury to Hackney. Took like 15 mins tops. Shat myself. So awesome.", "RT @sometaknight: mac n cheez is the bees knees", "@PaulArnold46 no it's worse now, there's no water pressure for the cold tap so it's either a good scalding or the jar.", "talking in Haikus/til I get a job that pays/pain pain pain pain pain.", "RT @sorryhouse: feel depressed by how coherent most of the tweets on this account are", "just had to shower using a gherkin jar. fuckssake.", "@PaulArnold46 http://t.co/CqBgbtNSIv", "@PaulArnold46 #00FFFFFTW amirite?", "Cyan quickly becoming my favourite colour.", "RT @plainlaurajay: Beastie Boys memoir by Mike D &amp; AD-Rock to be released in 2015. Exciting news @melnyczuk", "@wutheringhugs http://t.co/70xZRRLjY3", "@chloenobrainer ... @lkmrgnbrttn ?", "Constant writers block like being blind.", "I think \"Target Audiences\" are the worst thing that ever happened to any artform.", "my kingdom 4 a cup of coffee.", "imagine meeting people on the internet.", "coffee is the only thing that matters and its gone.", "There's no fucking coffee and there's never any fucking coffee.", "RT @DrugForumsBest: I really want some coke. I want some coke.", "SUCK MY DICK I'M A FASHION BLOGGER! XOXO", "RT @sam_kriss: I HAVE MADE 1600 TWEETS AND YET I STILL DON'T HAVE A WEEKLY COLUMN IN A RESPECTABLE BROADSHEET. WHAT GIVES MAN", "@lkmrgnbrttn hermit.", "RT @ultraculture: Note to self: rag on Zach Braff more often http://t.co/gvZPxRRR61", "RT @DIMBLEBOT: ED BALLS #BBCQT", "World's darkest gig no flash urgh.", "RT @Whybray: Best http://t.co/ByjGLPEp9a", "@mariannecr ah the gender swapped equivalent of tittiesandkitties!", "@_Birthdays Any idea of set times for tonight?", "do over.", "fighting the urge to ask questions I don't want answers to.", "And suddenly it all makes sense.", "Just remember that no matter how bad things are they can always get worse.", "Humiliation everyday.", "Love becomes a stranger.", "@MelissaRHunt @jimbodutts oh right yeah that's another possibility.", "@MelissaRHunt @jimbodutts like 10 maybe?", "@MelissaRHunt @jimbodutts I'm covering a band in dalston but I can meet after if you guys like?", "Probably for the best.", "I've made a major error and then compounded it with more errors so much so that I'm not sure when to restart from.", "what now what now what now what now what", "http://t.co/H8KvZ2EdAZ", "RT @Default_Browser: . @melnyczuk http://t.co/mDszGffxQS", "RT @DazedMagazine: Orgies could save the rainforests, right? http://t.co/NAJUq7UmLc", "stefanos manos.", "RT @Peston: Among footballers Suarez might bite, has anyone mentioned Kale Quichy? Too bourgeois?", "Cameron is solving the immigration \"problem\" too by driving the rest of us out of the country like rats from a sinking ship.", "RT @Horse_ebooks: So You Want To Look Sharp and Smart in Your Suit, Shirts, and Ties? The Biggest Mistake Men", "I feel hollow today.", "RT @ZombyMusic: http://t.co/nohKJGpRmw", "contempt comes easy, contentment comes hard.", "when did northern become a synonym for working-class?", "I wish I was a psychic empath.", "The writing on this new series of dr who is really subpar.", "@sam_kriss You can say if it's shit.", "@sam_kriss sent.", "The new Daft Punk sounds like this but not as good http://t.co/VR6l8qOWZ7", "@sam_kriss it's super depressing. whats yr email?", "Wish there was an app I could sing the fragments I still remember of songs from my past into to tell me what they are &amp; then give me a hug.", "@lkmrgnbrttn my current self.", "I need some to read something I wrote and tell me it isn't shit.", "RT @davidschneider: I presume tomorrow Cameron will say \"We're all London marathon runners now\".", "maybe I just need coffee", "I brought this on myself.", "I'm really boring you should probably unfollow.", "want to drop off the earth to be found only by my tumblr feed.", "Just marry me. http://t.co/TLBKIlNXK8", "RT @ro_bot_dylan: They tell you, \"Time is money\" as if your life was worth its weight in gold.", "RT @mariannecr: Looks like a station, acts like a station, is not a station. http://t.co/AB1raS4uXj", "RT @davidschneider: I presume the US gun lobby are saying terrible events like the Boston marathon bombings could be avoided if every ru ...", "my legs are itchy.", "Dammit all the work I need to do is sit-at-the-comp work and I'm feeling the opposite.", "I don't know enough musicians.", "http://t.co/fZrkzyzjhs", "RT @PennyRed: Bloody hell, America, what is HAPPENING here? #mitshooting #BostonMarathon #Watertown", "Nothing turns me on than listening to a girl get really passionately involved with what she's talking about. Esp when she's smart as fuck.", "@EilishCunn but today's weather was awesome. Sunny then a thunderstorm for like 10 mins then sunny again. What more could you want?", "RT @AJEnglish: China censors the word 'censorship' in director's acceptance speech: http://t.co/rq6IG6aarR #China", "RT @guardiannews: Top story = Michael Gove proposes longer school day and shorter holidays http://t.co/eRs8VNlOwY", "@chloenobrainer can I go and grab it?", "@chloenobrainer which one? Yes pls.", "RT @laurendubinsky: One day we'll look back on Google docs and laugh at them like we do cassette tapes and walkmans. I cannot wait for t ...", "A book by someone who's still alive.", "somebody buy me books by Tao Lin and Zachary German.", "This new TNGHT stuff is very disappointing.", "RT @bestfitmusic: Twitter finally launch their #music app. See some screenshots now: http://t.co/lUuJNHiyfN", "I JUST HEARD THUNDER!", "I want a thunderstorm.", "@jimbodutts I do mean the band yes. Just photographed them supporting British Sea Power. Such a good gig all round!", "RT @Mixmag: Mat Zo and the Anjunabeats label have allegedly been ripped off by a very famous pop star. Find out who: http://t.co/HOzfIz2bbZ", "Holy shit Toy are insane!", "Yet again she got what she wanted. Yet again her \"values\" of paying for shit yourself didn't hold very strong. Remember she requested this.", "RT @davidschneider: Worst Game of Thrones episode ever #thatcherfuneral", "@robandrobility me too. your timeline that is.", "@paulbestfit I'm just relieved they're being sure to burn her before they bury her too. Just to be sure.", "RT @spitzenprodukte: Meanwhile, thousands of North Korean's huddle round their TVs, puzzled at the bizarre rituals and wondering if anyo ...", "RT @robandrobility: Today I'll be remembering the miners of Great Britain. The South Wales Striking Miners Choir - Take Me Home: http:// ...", "She isn't the Queen, she isn't Churchill. She was a bad ruler who ruined lives. WTF is this PR bullshit?", "This country is fucking stupid.", "well this is nauseating.", "RT @porksmith: http://t.co/vuria8Fg6m", "RT @bestfitmusic: Photos: Lomography: Team Ghost at Birthdays in London http://t.co/Yy3tm4ReKB", "Collisions tell us more about ourselves than isolated observation ever will. We rattle down a chamber we sit in a chair.", "Well what a full room this is.", "I'm too neurotic.", "https://t.co/X0TA92h9s4", "never missed the country more.", "Guessing Jaime Lannister will never be hand of the king now then.", "OMG GOT", "RT @davidschneider: There's been a misunderstanding re this silencing. \"Big Ben\" is government code for \"opposition\".", "RT @charltonbrooker: Call me a doom-monger, but I reckon this ten-minute nationwide ban on breathing during the Thatcher funeral is goin ...", "RT @Queen_UK: Big Ben will not chime during Mrs Thatcher's funeral. It was consideried there has been already enough Ding Dong associate ...", "@mariannecr awesome!", "https://t.co/8Gl6S4dls5", "https://t.co/Ow8Tr7gCJy", "ok so the Phoenix/R Kelly track works.", "@sam_kriss also I'm coming to Leeds a week today. You about?", "@sam_kriss think you'd better lay off the sauce.", "Unlovable.", "All this talk of Adam Scott winning some dull sport thing and I keep thinking everyone means Ben Wyatt.", "Okay BBC you can take the Tory cock out of your mouth now they'll probably try and shut you down anyway.", "Everything that's good gets thrown away eventually.", "You only live once and you're fucking it up.", "RT @JoshAJHall: Remember Jamie Woon. What was all that about.", "Sit in a park and tweet? Ride a bike? Long and want?", "What can I do today?", "Could I call you just to hear you would you care?", "Dunno if I'm happy or sad today.", "RT @ro_bot_dylan: And your saintlike face and your ghostlike soul, Oh, who among them do you think could destroy you?", "RT @ro_bot_dylan: Sad-eyed lady of the lowlands, Where the sad-eyed prophet says that no man comes", "@cgalbraith good to see you last night.", "@ktdonoghue obvs!", "@WillGrice prude.", "You know you're gonna be remembered for the things that you say and do.", "@WillGrice it's a fine line I suppose but what I have in mind won't even be that erotic.", "@WillGrice wow cheers", "Nobuyoshi Araki: Sakura http://t.co/BMCvwmuAVe via @NOWNESS", "I wanna take some really intimate photos of couples making love. DM me if you're interested, yeah? #sex #drugs #photography", "RT @bestfitmusic: We saw @JamesBlake at Heaven in London this week. See the show in pictures here: http://t.co/dJKHXE6eWt", "Last chance. http://t.co/pKWrHsgoJQ", "RT @sam_kriss: my life these days: flicking through a book called \"badiou &amp; deleuze read literature\", humming a jaunty lil adventure ...", "RT @OwenJones84: People who keep using the \"were you even born in 1979?\" line presumably have no opinion on World War II #bbcqt", "@lkmrgnbrttn that'll be my \"edge\".", "@lkmrgnbrttn Might start putting an outfit breakdown in the bottom corner of all my snaps from now on.", "aaaaaaall oooooooover the plaaaaaace.", "learning by constant mistakes all the time.", "really lacking inspiration. fuck.", "RT @guardian: Bitcoin exchange halts trades of digital currency after drop in value http://t.co/SJ4ZfHUAGC", "@oliver_chambers probably not. but my real gripe is with making less fair and by PR and spin being praised for it.", "@oliver_chambers I can't really say it as eloquently as I'd like in 140/280/420 characters so here's a link instead. http://t.co/0ggyf6JOee", "@oliver_chambers She didn't choose an economy that provided jobs or benefit the country en masse. She created credit instead.", "@oliver_chambers it's not that I'm saying it didn't grow, I just don't think she replaced what was yes a failing economy with a working one.", "RT @RenegadeEcon: Taxpayers can 'well afford' to contribute to the cost of Baroness Thatcher's funeral says William Hague. You cannot wr ...", "Thatcher's \"saving\" of the economy is such a subjective myth.", "RT @NewStatesman: How the coalition is repeating Thatcher's biggest mistake: the poll tax http://t.co/JIk7aK7OH3", "@lkmrgnbrttn I don't think that many of either mourned either of them.", "RT @OwenJones84: It's bonkers Labour MPs are expected to march to Westminster to pay tribute to someone who led governments that hammere ...", "@georgewobrien for sure!", "@gregianjohnson step away from the keyboard!", "RT @PageFortyFive: By the way, do let me know where Thatcher's to be buried: I'm busy filling my bladder in preparation.", "James Blake. Not as good looking as Ben Whishaw. Not as bad looking as @lkmrgnbrttn.", "RT @laurenlaverne: This is very good. #Thatcher http://t.co/oeM9wpgkx5", "RT @GusTheFox: HOW TO STEAL STUFF FROM JEREMY PAXMAN'S HOUSE: A GUIDE http://t.co/XS3M2DpjXt", "RT @DesignsByGuru: Digital art is taking over the game", "RT @bestfitmusic: Faber &amp; Faber to publish \"anti cookbook\" by hip London restaurateurs Meat Liquor. http://t.co/rs3bzCMSwJ", "RT @IndyVoices: \"Mrs Thatcher implanted the gene of greed in Britain\", says @simon_kelner http://t.co/uwCVBAHeBO", "RT @commentisfree: The dictate to 'not speak ill of the dead' isn't appropriate for influential public figures @GGreenwald http://t.co/V ...", "RT @SocialistViews: Don't mourn for Thatcher, mourn her victims. Never forget the Irish Hunger Strikers http://t.co/UVzZtVyGnz #thatcher", "RT @davidschneider: Technically Lady Thatcher can't have a state funeral because she didn't believe in the state.", "RT @marcusbrig: The 'ism' and what it created is alive, malignant and remains ugly and powerful in the UK. #Thatcher.", "RT @theQuietus: \"What Mick Philpott did is beyond comprehension. what the government is doing is beyond belief\" http://t.co/eqZH27sKcv", "RT @RealBobMortimer: \"THATCHER DIES\" Who cares outside of the Cotswolds?.. Switch  to clay tiles or try a flat roof!", "RT @frankieboyle: Looking forward to hearing about who found all the horcruxes", "RT @helloitsdan: http://t.co/9XGnxlPy4w ha ha. oh dear. it's the classic ad banner combination mistake!", "RT @LicholasNee: @RufusHound If you want respect in death, be prepared to earn it in life.", "RT @OwenJones84: We still live in the Britain that Thatcherism built. More than ever.", "RT @RufusHound: Amidst the jokes, some tweets read \"Show some respect\". I think some people have a very odd understanding of what deserv ...", "RT @frankieboyle: Before Thatcher: Scotland quite good at football; proper summers; near full employment; optimism\nAfter Thatcher: AIDS; ...", "RT @poniewozik: The most disrespectful thing you can do when a political figure dies is to patronize their ideas by suspending criticism", "https://t.co/BcmnwOlPAT", "@hannahjbrook her effects are still going now. most notably manifesting last monday.", "@gregianjohnson let's see how many countries I can say this about before I kick it.", "I hate this country.", "people.", "RT @jimbodutts: There's no way I can have a productive day now. Great.", "RT @AndrewCollins: She can't expect people to care about her when she taught us all to only care about ourselves.", "RT @frankieboyle: Thatcher being dead is a lot less tragic than Cameron being alive", "RT @serafinowicz: Say what you like about Thatcher, at least she had the decency to shoot herself.", "RT @frankieboyle: Booby Sands's ghost just appeared to me, trying to start a conga", "RT @heawood: ...which is much more difficult to fight and more dangerous to liberty.\"", "RT @heawood: Thatcher on her nation's coalminers: \"We had to fight the enemy without in the Falklands. We always have to be aware of the ...", "RT @sam_kriss: God is on your side? Is He a Conservative? The Devil's on my side, he's a good Communist.", "wtf britain.", "RT @Number10gov: Prime Minister David Cameron on the death of Lady Thatcher: \"She didn't just lead our country; she saved our country.\"", "RT @jimbodutts: The 'who is Margaret Thatcher?' tweets are almost as good as the 'wait, the Titanic was real?' tweets.", "RT @heawood: Thatcher on feminism: \"I hate feminism. It is a poison.\" Thatcher on Mandela: \"He is a terrorist.\" Thatcher on Pinochet: \"W ...", "okay regardless of politics, if nothing else keep #nostatefuneral trending because that's the last thing we need.", "RT @mrmarksteel: As Davina would say, \"Let's have a look at your best bits.\" To start with \"No sanctions - Nelson Mandela is a terrorist.\"", "Such a good weeknd.", "RT @ro_bot_dylan: She sees the bartender in a pool of blood, Cries out, \"My God, they killed them all!\"", "Yep they did.", "Are they about to kill a whole solar system?", "@mariannecr @timfoxon @thechoir I'm enjoying your beautiful singing buried beneath a tone deaf child!", "At the party on bellend road.", "Casual unexpected Q&amp;A with Garth Marenghi. Not to shabby.", "Peckham reminds me of Bristol.", "Hail to the outlaw, for the law is failing.", "Shout all you like no one listens to anything except money, sex &amp; guns.", "@lewisdotcom but you can't imagine nothingness, we have literally no concept of it.", "@lewisdotcom idk, you won't be anywhere I guess. but if it is nothingness like I reckon then you won't be able to regret or want anything.", "@lewisdotcom but you won't be around to even notice.", "@lewisdotcom I'm more frightened about what can happen when you're alive tbh.", "afterlife = not bloody likely.", "and the future folks will be all \"that's so cute but seriously wtf? you still wanna watch that shit? why not come live in our comp games?\".", "and if everyone does arrive together, are there films to watch? won't that freak the folks from the 15th century the fuck out?", "how does time work in heaven? if its eternal does everyone arrive simultaneously or is it linked to time on earth for some unlikely reason?", "thinking of buying a long board for summer.", "@chloenobrainer Harmony Korinathon!", "@gregianjohnson I txt u chk yr fone.", "Photoset: Burberry Prorsum AW13, LFW http://t.co/L9L11tpCcY", "RIP MLK", "@oliver_chambers pretty much.", "RT @MrPooni: A reminder of how your outrage helps fuel the Daily Mail hate machine via @utterben: http://t.co/HLMKju1GD5", "listening to a doc about Berlin wanting to move to Berlin which I will when the NHS gets shut down and Britain dies.", "what can I do that doesn't require food, money, staring at a screen, concentrating or a willing partner?", "all day making minimal paintings with pixels. eyes bleed.", "RT @bestfitmusic: Photos: Mirroring (Grouper &amp; Tiny Vipers) at The Yard Theatre http://t.co/3uv6cTeFRO", "@jss_hlt anxiety/stress?", "@realDonaldTrump @kg08tj Better than Game of Thrones are you fucking stupid?", "I hope this mornings all been an April fool and I'm actually still asleep.", "@gregianjohnson all those days slaving away just for a celestial reality show.", "@gregianjohnson what if we die and then gods all like LOL YOU JUST GOT PUNK'D! and he has Ashton Kutcher's little face and everything?", "@gregianjohnson you just got FOOLD.", "@mariannecr computers algorithms don't understand time like we do or something probably. S'abstract innit.", "@mariannecr it's probably just April fooling you.", "@dominiqueeeek now even they're not delivering fffffs.x", "RT @lazyoaf: get 100% off everything online for the next 1 minute.", "@Tim_Kelly must be a pretty big elephant tick!", "@dominiqueeeek turn iMessage on I can't get through.", "Life is an April fools.", "@sam_kriss also actual news wise this http://t.co/85u7kzGb3Q but it may just be an April fools but its pretty bad taste tbh.", "@sam_kriss Gives a whole new meaning to the phrase \"pizza crust\".", "@KateBushCBE just fell asleep little head drifted down slowly on my shoulder. Woke her up again by tweeting this oops.", "@sam_kriss oh was that not the news I was watching? I thought real life was just getting hammier. Actual news, new Game of Thrones.", "I woke up and now I can't get back to sleep but I definitely haven't had enough sleep and now I won't do anything.", "@sam_kriss North Korea invaded South Korea and South Dakota invaded North Dakota.", "Why have children when you can have cats?", "https://t.co/aiM7t4tED2", "@GKFennell forever and never are the same time.", "Soundclouds \"Here's the drop\" arrow might just be the most despicable thing I've seen in a while.", "@GKFennell chaos is the purest serenity.", "it's almost serene.", "like a ship in the night cast adrift in choppy seas torn sails frayed sheets no rudder.", "Easter, the meh holiday!", "Feel sad.", "In the photo pit for squarepusher. My eyes are about to hurt.", "So hungover", "@vanessaptrsn nothing can force the brilliance of a coffee machine into subservience.", "RT @jimbodutts: Yeah. Rosies. Yeah. There's a lot to say.", "RT @amolrajan: Happy birthday @piersmorgan. Like any good vintage, you're getting better with age; but soon, like all of us, you'll be p ...", "What am I doing?", "@alannamcardle_ I love both her and PFSC so much.", "@tokny http://t.co/1NGpSkhbqE", "improvise, for that is the way of gods.", "Basically wanna be Joaquin Phoenix in The Master.", "So ready to get shit faced tonight I'm considering shoting tequila from now.", "@chloenobrainer enchanyonce.", "@chloenobrainer wish beyonce was my feyonce.", "Hollywood leading men are getting more and more bland.", "Sat on a train and realise my railcard expired yesterday. Fuck fuck fuck.", "@iskrastrings sure thing! I won't be able to send it to you until Wednesday so I hope you don't mind waiting a little longer.", "God damn card reader.", "@iskrastrings hi I've no problem, is I just for personal use? Which one were you after?", "@chloenobrainer it'll be EPIC", "Oh so THIS is how you get DVT!", "Oh shit. This is not a double decker. There are no power sockets.", "@chloenobrainer how very modular of you!", "@chloenobrainer need an outfit that takes sweat away from the body whilst keep worth and comfort in.", "@chloenobrainer so I sweat to death?", "what does one wear for 4.5+ hrs on a bus that will inevitably become stuck in snow?", "let's go make some useless objects.", "THEY CHANGED SOMETHING IN THE FACEBOOK...", "Imagine if every time you had a beer you had no idea how much alcohol was gonna be in it. Wouldn't that be way safer.", "RT @frankieboyle: I believe that Scottish Independence should be settled by right of single combat, and I invite the English to nominate ...", "RT @TheAVClub: George R.R. Martin says he's considering a Game Of Thrones prequel TV series http://t.co/P64X7VW9hd", "RT @TheTomMontague: George Osbourne is such a cheese!", "@jimbodutts is that his niche? Nothing new but nice enough.", "Have your freak out online or not at all.", "RT @ZombyMusic: i need a cara delevingne and rita ora sandwich asap", "What is you could take all that jealous possessive rage and turn it from pain into light?", "REBLOG YO SELF!", "@MelissaRHunt Can I move in with your parents?", "@MelissaRHunt HOLY SHIT I WANT WTF HOW DO YOU I DIDNT EVEN WTF I CUDDLE THAT OMG IT COULD RUN BESIDE ON MY BIKE OMG LIKE A DOG BUT NOT DUMB!", "@MelissaRHunt AN OCELOT?", "@MelissaRHunt TELL MEEEEE", "@MelissaRHunt I can't think of any more things people can buy tell me.", "@MelissaRHunt a jehovah's witness?", "@MelissaRHunt A Pushmi-pullyu?", "@MelissaRHunt Oh is it a small island?!", "@MelissaRHunt Did you stay out all night so they cracked and got you a new phone?", "@dancarse for real? So he'd be North West? And then he'll inevitably have a clothing/fragrance line called North by North West? #socray", "At some level we all have an affection for our neuroses.", "@tokny &amp; @KateBushCBE have been gone less than a day and this house is so cold and quiet and alone. No one to knock my dirty dishes over.", "@sam_kriss omg you do. that and stalin.", "@WillGrice Just the one, mind. He won't let anyone push the boat out.", "RT @ultraculture: Thinking of setting up a support group for all the actors who aren't Adam Driver.", "@james91ocr LOOOOOOOOOL", "Just can't get my shit togetter.", "so The Master is easily the best film of 2012. WTF Argo go suck a dick.", "massively underwhelmed by It's Kevin.", "aggression is an opposite of reason.", "on the internet no one can hear you scream \"I'M FABULOUS\".", "Pretty excited for It's Kevin.", "Your bank account is a chain.", "what if no one is the good guys.", "OMG Cate Blanchet as Katherine Hepburn. She's so good. Almost better than the real deal. Almost.", "Watching the Aviator because I like hearing people say my name.", "RT @davidschneider: Philosophically it's impossible to watch an episode of Friends you haven't already seen.", "Photography is about dialect.", "I have lost a slipper.", "RT @IAMLILBUB: The BUBLOG LADY #twinpeaks #loglady #mybubhassomethingtotellyou http://t.co/JxQsj4aHyx", "worst of both worlds.", "Everything on my own all the time fml.", "http://t.co/N2x2rfR7N8", "may the size of your balls make the size of your ambition.", "need to stop giving a fuck.", "I took some photos of @OlafurArnalds and the Britten Sinfonia orchestra at London's @BarbicanCentre for @bestfitmusic http://t.co/yspNLUpTh0", "dunno how to take a day off.", "I wish I knew what to do something show me the light.", "shyness will be the death of me.", "CREATIVITY BLOCK SUCK A DICK.", "RT @bestfitmusic: Photos: Maps &amp; Atlases at Dingwalls in London http://t.co/GGJi7O7Qo8", "@MelissaRHunt oh shit that doesnt start til thursday. I'll find something else but for now sleeeeeeep.", "@MelissaRHunt http://t.co/BpImT5UhyB http://t.co/4CPakm0M6Q http://t.co/49kez4JPeJ  these are all free apparently?", "lost.", "@MelissaRHunt yo what you wanna do tomorrow?", "Nauseous liked a trapped animal going round and round in circles.", "@KateBushCBE fuckssake.", "RT @TheOnion: Nervous Pope Candidate Changes Wine Into Jesus Christ's Urine http://t.co/Idi2Tbb1WN", "@thewildcat90 but they won't so long as it keeps them providing them with easy stats targets. everyone at the top wins.", "@chloenobrainer who are you?", "The war on drugs is never gonna end as long as people are still willing to pay for drugs.", "@braidy001 Sup?", "When is it gonna get warmer?", "omg John McCain in Parks &amp; Rec", "@HollieAnderton I'm coming to Leeds weekend after next so I'll bring it with me and put it on your computer for you?", "RT @ZombyMusic: why stand and contemplate a piece of art when u can just get a sick pic of it for instagram", "@lkmrgnbrttn you weren't even on the list you hack.", "At a techno night with a guy who doesn't dance. Wtf.", "\"I'm something of a connoisseur of generic tumblrs\"", "Dejected, vulnerable.", "not sure how I feel about beauty today.", "Such an ugly dog.", "I don't get what's a good show dog. Fuck you crufts.", "so fucking stressed out don't wanna do anything.", "@chloenobrainer Yeah she's a boy. Massive testicles. We have a transgender cat, we're so progressive.", "oh yeah college humor is mostly miss.", "OMG @KATEBUSHCBE IS A BOY!", "Let me massage your elbow.", "I'd happily take all those bullets inside you and put them inside of myself.", "RT @bestfitmusic: Morrissey 'Rick-rolls' David Bowie. http://t.co/Nf5ccUjWgR", "I'm awful.", "@MelissaRHunt @KateBushCBE she hasn't moved in like 15 mins.", "@KateBushCBE is sitting firmly on my arm making it hard to work. http://t.co/o6HGLu2yP3", "Look out for the new issue of @THEFLYMAGAZINE as I've got a photo of Unknown Mortal Orchestra sitting in the back.", "RT @guardianmusic: Social media: It's TERRIFYING http://t.co/Y5qBnRB5eW", "How many times does Helen Mirren have to play the queen before we can have her replace that fat tired boring old lizzy full time?", "Are there still people that think the Tories will ever help the poor?", "On Sunday I will be turning my room into a Camera Obscura for as long as I feel like. Private viewings welcome.", "Bed.", "Video:  http://t.co/PxyMtC5tZd", "@jameswoooods ALSO http://t.co/Za4WDRVWDz", "@JamesWoooods DO IT http://t.co/6mzLUPPIMs", "RT @Glinner: In other words, \"Maybe NOW we can have your oil\" http://t.co/Bak6BgPIZ3", "@alicejmarshall It's the best! I just had a coffee, vanilla &amp; maple syrup taste explosion. It was how I imagine Canada to taste.", "There's some vague aspect in the aesthetic of the film of Ghost In The Shell that I've been drifting after ever since.", "coffee and ice-cream is the best combination in my mouth.", "entering space in real time.", "YAY new Andrew Bujalski!", "I'd rather see foxes digging through bins than dogs digging through children.", "there is no better indicator that no one has any decent concept of reality than the way folks use of the phrase \"down to earth\".", "@charliebrogan WIN I've been listening to that loads too the past couple days.", "NO COFFEE KILL ME NOW.", "http://t.co/cjQ8Uu42Jq", "@JamesWoooods sounds awesome! I have a few ideas that could work.", "@JamesWoooods I feel great about it and I just asked my camera and it said yeah too. Fill me in!", "RT @Horse_ebooks: there. Nicole: Oh, sorry. Nicole: you Steven Carson? Steven: Yes, I Nicole: Hi Nicole Johnson. Steven: Oh, in", "http://t.co/dWwhvt4SUM", "sad.", "Just paid for my first gig since moving to London.", "RT @ZombyMusic: I like Sartre but prolly wouldn't wanna hang out n shit what a fucking nause", "Seriously, that whole splitting the tory vote bit was fun but really now. #ukip", "We Need To Talk About UKIP", "@gregianjohnson sure but how does he even get people to talk to him? It's so impressive.", "How does Louis Theroux make such good documentaries whilst being so judgmental?", "http://t.co/0BUMTW8FqA harry-styles-being-hit-in-the-crotch-by-a-shoe", "LOL 50 shades of grey now all women must love rough sex or else. wut.", "RT @JamesWoooods: @edgarwright @paddyconsidine @simonpegg Any chance of a Tyrannosaur / Scott Pilgrim crossover?", "@plainlaurajay Victoria.x", "ANYONE N EVERYONE COME VICKY PARK YEAH? (LDN NOT WRRNGTN)", "@plainlaurajay yo come da park.", "Photo:  http://t.co/abCkqrvYcG", "@Grace_Goddard There are some gifs I will make just for your private collection &lt;3", "It's a good day.", "http://t.co/PvI65IMFxk", "So I took some photos of @SkyFerreira at @WhiteHeatclub last night for @bestfitmusic (http://t.co/Edmoptr9z4). She had an awesome light.", "@jss_hlt such a big compliment! Thanxx!", "Photo:  http://t.co/hvgfyqw8pU", "Photo:  http://t.co/XxYuxOGNmb", "Photo:  http://t.co/YTJycLmja1", "Photo:  http://t.co/7UHpTPsTa7", "@MelissaRHunt break a leg!", "surround yourself with positive, talented, successful people and then harshly criticise yourself accordingly.", "so hung up.", "http://t.co/fsGpTWWaZY", "RT @jimbodutts: @melnyczuk Beckyyyyyyyy", "RT @jimbodutts: @melnyczuk argh I feel like I'm gonna be sick", "@jimbodutts She was with her fiancee. Hate him, I did.", "RT @jimbodutts: @melnyczuk you bastard I hate you.", "@jimbodutts sat next to her on the tube. just as hot irl.", "Wish I was Bob Dylan but circa 65 not now.", "If I don't keep moving forward I will drown.", "@gregianjohnson http://t.co/wbQtSRe3rV", "@gregianjohnson I am. I really am. I might become a nomad.", "why do all the best tweets come from folks with retweet turned off. I'm trying to compliment you ffs.", "@gregianjohnson less so.", "@gregianjohnson or the heart of the sun.", "@gregianjohnson May well be. But more likely NY, Cali, Tokyo, Sweden or Berlin.", "WOULDNT IT BE NICE TO TAKE PICTURES IN A PLACE WHERE IT ISNT GREY SHIT LIGHT ALL THE TIME?", "Feel like I'm failing all the time.", "I ate some very old cheese sauce and now I feel like vomit.", "@katgarratt it's coming.", "@katgarratt oh man I want to so bad but I need a publication to get me in to stuff. Wanna start one?", "RT @noglossfilmfest: Oscar Win Is a First for Kickstarter-Funded Film:\nhttp://t.co/gOKtA9yrKm", "@gregianjohnson @jimbodutts you two are so cute &lt;3", "RT @plainlaurajay: @melnyczuk http://t.co/hzrkWP8i0Z", "ANYONE FANCY SENDING ME TO PARIS ILL TAKE SHIT HOT PHOTOS FOR YOU NO REGRETS. PLS RT.", "PLS TELL LES MIS WON NOTHING.", "http://t.co/HCP04fbUF1", "@mariannecr  Keep an eye out for a long overdue redo of my whole portfolio, which will include a lot more. Coming sooooooooon.", "@mariannecr Yeah the top three are, the bottom two are from pringle. Glad you like them. Thanks!", "Photo:  http://t.co/vJE8b1T26p", "Photo:  http://t.co/Nz0Nb9YyFD", "Photo:  http://t.co/bbVqQpidxh", "POSTING SHIT TO THE WRONG BLOG LIKE A HACK.", "Photo:  http://t.co/mHioxcBfUr", "RT @mariannecr: Pope said that God told him to resign... that's literally what the school chaplain said at my 6th form leavers mass. She ...", "Photo:  http://t.co/9QCwZqCv37", "Photo:  http://t.co/kulPoxqChz", "Photo:  http://t.co/QlF60FJaL0", "Did Dolce &amp; Gabbana know the pope was gonna quit?", "Photo:  http://t.co/ARUMiTgNkY", "Photo:  http://t.co/8tb1GIef7U", "@gregianjohnson http://t.co/zoEtovvLCJ", "@gregianjohnson yeah like we all wanna shell out on a new AA battery every 30 months mr money bags.", "Currys/pc world only sell wireless mice wtf?", "I want an ocelot.", "Crazies.", "ate like 3 burritos.", "@GKFennell I think I'd make a great 007, drinking cheap whiskey, refusing to shoot anyone on principle and being pedantic about everything.", "RT @GKFennell: @melnyczuk the world is not enough #Melnyczukasthenext007", "Nothing is good enough.", "Rage.", "procrastination king twenty thirteen.", "@KitsuneOkay yes and yes!", "melonckitty.", "all I ever want is something new.", "It Internet wont work on my laptop and I've tried everything so I might actually have to get out of bed its so hard being me wah wah wah.", "So much angst.", "RT @wolfpupy: heres my view rich people are bad and poor people are the cool ones", "http://t.co/5LWzDkCaAe", "I wanna enter a world of self-loathing and spiritual squalor.", "Nostrils smell like bleach.", "Fuck pls.", "RT @DuncanWeldon: The Communist Manifesto is 165 years old today. Original opening line of first English edition - 'a frightful hobgobli ...", "@ALICETATE_ I did the exact same all yesterday!", "@KitsuneOkay No that's on Thursday. Do you need a schedule?", "Fashion shows are the ballet of our day and serve the same social function as opera attendance.", "RT @charltonbrooker: It literally might as well come with an in-built walnut dispenser for all I care so far #PS4", "Fucking nailed it.", "I have no idea what is happening at the brits and I am not watching. So for the next few hours I will retweet seemingly at random. #Brits", "@Grace_Goddard so more 'broadcast-delay tweeting' then.", "@Grace_Goddard so is he the one live tweeting it all?", "RT @Grace_Goddard: Watching #BRITs2013 with @lkmrgnbrttn is just like sitting next to a quietly breathing twitter account.", "People are made up of water and fear.", "RT @chloemckernan: hmm why can't I make trouser that don't make people look like a twelve yr old boy or that they have pooed their pants ...", "@sam_kriss That's all your life is already get over it.", "Running out of coffee is for me a more dire situation than running out of toilet paper.", "sleeeeeeeeeeeeeeeeeep.", "what a difference a few degrees makes.", "SKYLL", "my imperfect skull.", "burns the eyes from my skull.", "3;44=3;smorty4", "why is everyone asleep I wanna talk.", "Still reckon Pringle is my fav of the collections I saw this weekend. Just wanna eat this here coat.", "In desperate need of someone to photo tomorrow gotta keep this buzz going.", "wanna make out.", "fell asleep at 7, work up at 11, wtf.", "@alannamcardle_ it let's you send * photos that delete themselves after a certain time. *naked", "Also, free coke.", "Now I'm at the Dorchester for Teatum Jones. Doesn't take the top spot for most surreal experience this weekend but it's sure trying.", "Mixed feelings on the Ashish collection. Hi-via chic? But that sparkly number looked like tv static, had a certain new aesthetic feel.", "@MelissaRHunt you're makin' me blush!", "Photo:  http://t.co/hVxWjLh", "Oh so this is what starstruck feels like.", "So this is surreal.", "Is there a more perfect album for a day like today than Yellow House? No.", "So much walking.", "Pringle exhibition was so nice.", "I feel like a new man today.", "Think god LFW runs later than I do.", "Quantities", "@kayatulomah Yep! Are you?", "Pretty sure I just saw Charlotte Gainsbourg. Looked her straight in the eyes.", "@MelissaRHunt yup just taking a couple snaps.", "Paul Smith no biggy.", "@jimbodutts @dominiqueeeek FUN FACT: the CBE stands for \"CAT OF DA BESTEST EVER\".", "RT @KateBushCBE: MEEEEEEEEOWOOWWWW", "shit my curtain broke and now I can't see past all the glare.", "@lewisdotcom you're welcome to come round and play with her whenever you want!", "this kitten makes it all okay.", "I think I need to learn how to pretend/act like I shit money.", "The law can be wrong.", "@ALICETATE_ I'll also be taking pictures (as best I can) so lemme know if you need any or whatever", "@ALICETATE_ yep, courtesy of @dominiqueeeek. Wanna hit it together?", "One hell of a life.", "@ALICETATE_ hey are you going to Burberry on Monday?", "So this is pretty pretty cool.", "so what does one wear to fashion week?", "@ThisBandThat 'fraid not no. Were they good?", "step into the dark.", "Seeking all large mirrors I can find.", "Yes I do.", "a dog on a chain to a post.", "and I won't take my phone and I won't take my wallet but I will take some whiskey and I will take some fruit.", "When it's warmer I'm gonna cycle from the city to the sea and sleep beneath the trees.", "Selenographic coordinates.", "Returning to photos way too many days later is a really nice process. Shame it's so self-indulgent.", "BYE BYE CASH COW I HAVE FINISHED MILKING YOU TIT NOW.", "TOO YOUNG TOO YOUNG", "@dominiqueeeek oh awesome! Googled prorsum and it all became clear!", "@dominiqueeeek is that the clue I recognise it but can't place it.", "@dominiqueeeek don't leave me hanging gimme a clue.x", "@dominiqueeeek do go on...", "@lazyoaf twitter &amp; tumblr.", "Not sure if its the constant state of exhaustion or the bitter cold but I feel like I'm gonna pass out and die.", "what I wouldn't give for a little fire once in a while.", "THANK FUCK THAT'S OVER WHY COULDN'T I HAVE JUST BEEN AT WORK?", "I feel like a prostitute, which is degrading to prostitutes.", "How long can I spend in the toilets round two.", "I've almost forgotten what meals are normally like.", "Cunt shit arse nearly free.", "FUCK FUCK FUCK FUCK FUCK FUCK FUCK FUCK FUCK FUCK FUCK FUCK FUCK FUCK FUCK FUCK FUCK FUCK FUCK FUCK FUCK FUCK FUCK FUCK FUCK FUCK FUCK FUCK.", "I smell a rat.", "@plainlaurajay let's both do it.", "@plainlaurajay free pancakes.", "@plainlaurajay yeah but you will!", "@plainlaurajay 1 very 1 min 40 so easy.", "@plainlaurajay easy.", "@plainlaurajay yeah that and then I'm covering the John Rocha show on Saturday but still I'm pissed off.", "2.665992910005773829000505737188919910050937376626189504846728110094886482901023848488288190947638495095958572628900503027477464617179959947", "Computer is my computant.", "Coffee is my confidant.", "Routine is my nemesis.", "And I should be really happy this week but I'm just not feeling it.", "The only thing that could make feel better is pancakes but what are the chances of that?", "Such a bad mood today don't even talk to me.", "Well that guy was an aggressive son of a bitch.", "@lkmrgnbrttn chckn ain't doin any favours to my skin.", "RT @omgthatspunny: What is Mozart doing right now? De-composing.", "Thinking about a new sushi whiskey only diet.", "Just tracked down a copy of @zerocoremag so chuffed.", "Safe Canadians on the trainadian.", "In case anyone is sitting up waiting for news of my progress, I'm still on this damn bus.", "Should have brought whiskey.", "Megabusmegadelay", "http://t.co/Tv6Vv3p", "Plumes of smoke from the sugar factory like sculptures breathing.", "The world is bathed in a golden light and I'm stuck on my way to a job I hate.", "I need to do a lot less.", "@ThisBandThat a pleasure as always! I'll send you one over tonight after work, think I got some good'uns.", "Just chatted with a guy that looked so much like Stuart Lee that I forgot he wasn't actually Stuart Lee.", "And I don't want a \"knees up\" with a cunt.", "The angriest music isn't angry enough.", "RT @piersmorgan: I want to die.", "RT @GraPar: \"A same-sex couple cannot consummate a marriage\" - yo, dude, I have some videos to show you.", "So many gigs on my own.", "And my bike wasn't stolen!", "I just saw &amp; photographed Conor Oberst and it was totally great!", "I'm in the arsehole of London and there's a parakeet.", "Isn't there somewhere computers this old go to die?", "@chloenobrainer *like", "@chloenobrainer you tweet that its not something everyone does everyday.", "If it isn't easy you're doing it wrong.", "http://t.co/DjT1NI6", "I think all my feelings and memories might be fiction. I get so hung up on things that I can't place.", "Amazing what a difference a good night's sleep can make.", "@tokny http://t.co/YB2eUuE", "@tokny http://t.co/wZlJ11Q", "Facebook is the worst.", "I wanna burn and break some shit but I don't wanna leave my desk.", "ambition over extends ability yet again.", "RT @TheOnion: This Week's Top Story | Teenage Girl Blossoming Into Beautiful Object http://t.co/P9SRVUCU", "if I don't take this photograph soon I might implode. and by implode I mean give in.", "I'm so bored. Make me unbored.", "Sad.", "I haven't taken a decent photo this week. I've barely taken any photos this week. I need to photograph.", "Suburban Britain fills me with melancholy and I feel sick.", "This job is the most Kafkan experience of my life.", "All I ever want is another cup of coffee.", "Nice overground conductor this morning though. What a legend.", "I finally decide to carry my camera with me and it rains.", "Music I listened to like 3 years ago revival!", "@tokny http://t.co/t8UDlUs", "I feel nauseous.", "This is the most boring and meaningless task I've ever undertaken. This is even more boring than that time I watched cricket.", "@tokny http://t.co/NGkBKLF", "Am I moving forward?", "Fucking love it when the sun comes out in later winter and the air smells so great and all the colours pop! #omg #^-^", "Why is it that when you get about half way up the hierarchy everyone's a stuck up dickhead?", "Omg why people even own blackberrys?", "looking back over old photos and feeling like I have actually gotten better.", "@tokny http://t.co/krPb9r4 excited?", "@tokny https://t.co/zffSYib", "RT @dominiqueeeek: just spent about 10 minutes looking for a pencil that was behind my ear.", "@jss_hlt Cheers!", "someone bring me a drink.", "I have been using it for about 3 minutes and I like the new iTunes.", "@CharlotteTaylo_ I wish you lost weight when you said yes to chocolate.", "NEW COMPUTER WOO COMPUTER", "Not that I have any work to be even be doing.", "Locking my tweets so I can tweet at work and not get fired for not doing work.", "@jacobdrozario I was literally looking on there this morning! So good! It's alright man there will be more parties. D'you have a good night?", "HEY DOES ANYONE WANT TO BUILD ME A WEBSITE FOR FREE? nope didn't think so.", "WHO WILL MAKE IT FURTHEST PAST THEIR PRIME? YOU DECIDE!", "STALONE V WILLIS V SCHWARTZANEGGGGGGGER IN A THREE BATTLE TO BE THE OLDEST MAN.", "@dngdwn I'm on my way to my shitty job!", "@gregianjohnson don't even remember tweeting this.", "@dngdwn you mean to say tweeting the names of fictional burgers isn't productive?", "Up at 5:45 but by the wrong way of doing it. This is so lame.", "Wanna start a burger joint and have a veggie burger called the \"Raging Halloumi Patty\" #dontstealthatitsgold", "why does my cat eat everything? Better than a hoover.", "@mariannecr UNFOLLOW ME? AS IF YOU COULD", "\"Am I your carer?\" \"You're really grinding me down.\" - @gregianjohnson", "H'edita", "RT @bestfitmusic: Photos: Toro Y Moi plays Village Underground http://t.co/U78BvDxy", "@Grace_Goddard I was gonna get a bottle myself. Fancy going halves?", "@Schteeeve should be a few going inc @anna_kelly_ I'll DM you my address wooooooooo!", "@jss_hlt beggars can't be choosers.", "#dark", "I'd take my time with that shit too.", "Is the cloud not letting me log on because it knows I would kill Murdoch with my bare hands if I were ever lucky enough to meet him IRL?", "@Schteeeve COME TO MY PARTY ON SATURDAY DO IT PLS PLS PLS", "Sat amongst men organising their affairs. Make of that what you will.", "Starbucks has really gone to shit since I left.", "RT @BretEastonEllis: In Zero Dark Thirty Oscar ads Jessica Chastain says \"We all remember where we were when Osama Bin Laden was killed. ...", "@CharlotteTaylo_ @alicejmarshall fair.", "@alicejmarshall @CharlotteTaylo_ .........http://t.co/gNJXjl9B..................... (I haven't seen it though so)", "Sit down with people and they will tell you their stories and they will beautiful and sad and moving. You just need to know how to listen.", "LFW = London Fotography Week, right?", "Because if you do, you're a cunt.", "Never confuse compassion for weakness.", "10 hour shift. 15 mins for lunch. Think I might die.", "@lowriellis frowning so hard it covers your ear holes.", "What is happening with Chris O'Dowd's accent in Girls?", "When will it be dry so I can ride my bicycle?", "Pretty disappointed.", "RT @HudMo: Otari bottle opener http://t.co/cqkRnMjF", "Going home early listening to \"Causers of This\" wondering why he didn't play like he does on this album.", "RT @Whybray: at least it's warm in here", "@TheSpocker you've clearly never gotten high and sat right at the front. It's like the most low key roller-coaster ever!", "Bullion was playing a DJ set and I didn't even know. Missed that.", "@sam_kriss man have you been to the DDR museum in Berlin? I went with @dominiqueeeek shit was crazy.", "I love the DLR.", "@dominiqueeeek nice.", "@plainlaurajay ARE YOU IN PARIS NOW?", "I'd rather be doing manual labour.", "bullshit bullshit bullshit.", "@jss_hlt I might just cook it all again for dinner.", "@jss_hlt Is that a disgusted or impressed \"oh my god\"?", "@jss_hlt and mash of course.", "@jss_hlt Served with a snow chilled glass of pilsner.", "@jss_hlt A peppered steak, pesto &amp; paprika fried mushrooms, balsamic caramelised onion, and diced bacon: all under sage, soy &amp; pepper gravy.", "Actually just tweeted about my lunch Twitter you've beaten me.", "Pretty much the best lunch possible. http://t.co/p0clLbLi", "RT @laurasnapes: increasingly realise that I only watch Girls so I can read the opinion pieces/post-match analysis what kind of idiot am I", "Photo:  http://t.co/qBdwQKpz", "I think I've got the knack of this photographicity lark.", "Photo:  http://t.co/dQuvtL6f", "I HOPE EVERYONE HAS MADE A NOTE OF THAT ADDRESS IT IS GONNA BE DELETED NOW. GOTTA KEEP MY SHIT ON LOCK DOWN SOMETIMES HOPE YOU UNDERSTAND.X", "@chloenobrainer SHIT it's gonna be like beatlemania in no time over here at shalbourne sq. Like beatlemania or the Rushdie fatwa you decide.", "\"I am just going outside and may be some time.\" - Howard Melnyczuk 2013", "Photo:  http://t.co/8RAvUtzM", "Photo:  http://t.co/ThgeOUmZ", "FUCK MA LIVER.", "To help recover from too much beer and mezcal.", "Drinking my body weight in strong black coffee.", "@melissarhunt http://t.co/0YXGZhUG", "RT @dominiqueeeek: @melnyczuk @daisylowe http://t.co/elRX0kno", "RT @bestfitmusic: Photos: Wu Block headline The Garage http://t.co/2FVgoCgH", "Photo:  http://t.co/sr72KEOZ", "Photo:  http://t.co/oKG94UY3", "Photo:  http://t.co/6bGgqvpc", "Photo:  http://t.co/0kIjIn5k", "RT @ultraculture: Still reeling from the fact that they didn't name a single one of the Hobbit movies \"Bilbo Begins\".", "I wanna meet new people and be surrounded by life.", "@kat_iedunn if you're referring to Django, my word of the month is now \"Parley\".", "RT @plainlaurajay: This. http://t.co/QMzS2IuT", "So someone actually found those beers. IT WAS A JOKE GUYS GEEZ!", "@jss_hlt someone else did just ask me if I was a journalist and I was reasonable more debonair about it.", "@jss_hlt it's too late I already tried to mumble something. Plus I look all sweaty and flustered because I nearly didn't get in.", "@jss_hlt bless him. I didn't know what to say.", "The prize is two beers if you couldn't guess. #clicheprize", "Thus I am launching a competition for the first person to find the two beers I've hidden somewhere in London.", "Had to stash two beers outside cause I forgot they were in my bag.", "Do I look that much like a hitman?", "A kid with a camera just said \"Here come the professionals\" after seeing me arrive.", "That was an ordeal.", "Westfield to Westfield.", "Well that guy was a cunt. Don't treat like I'm complaining before I say a thing. Cunt.", "@dominiqueeeek @tokny no.", "why do only me and @lkmrgnbrttn use gchat? the rest y'all are suckas but I luvyas.xx", "New Girl or new Girls?", "@GKFennell I'm ready.", "@lowriellis yeah I saw that and I still have no idea what it means.", "Photo:  http://t.co/GHa2BLd1", "Photo:  http://t.co/ACi0Vsmw", "Photo:  http://t.co/bEi62ZAK", "@sam_kriss @robdromb I realise that was suitably vague.", "Today has some of the most beautiful skies I ever seen in London.", "@sam_kriss @robdromb I'd hazard upon a nod to John Cage &amp; Marcel Duchamp on that point but I'm woefully under-read on both.", "@sam_kriss @robdromb I think so yes, but in two kinds, one side actively curated and the other more passively situational.", "Instant coffee you are my only enemy.", "@gregianjohnson http://t.co/srLDc4Ol", "Photo:  http://t.co/TYYgkN1I", "It's crazy how quickly a good day can be ruined.", "@gregianjohnson @dngdwn I was bored on a train.", "@dngdwn @gregianjohnson PRETTY MUCH YES.", "@_tompitts quotations are there for when facts aren't.", "@jss_hlt lol", "\"quotations are used to make anything look credible\".", "@dngdwn @_tompitts @gregianjohnson PRETTY MUCH YES", "@_tompitts @gregianjohnson one was taking the Michael.", "@_tompitts @gregianjohnson such is the nature of intellectual excuses.", "@gregianjohnson @_tompitts this is all a  great lot of mental masturbation but I'd rather actually do than sit chatting how I can't.", "@gregianjohnson @_tompitts Art is only ever the product of shitting or getting off the pot.", "@gregianjohnson @_tompitts one may make many valid excuses but no one else aside from your mother gives a shit.", "@_tompitts @gregianjohnson art is hindered by never trying because one feels one will only fail. One will assuredly fail but may also not.", "@robdromb @sam_kriss I'd love to.", "@_tompitts @gregianjohnson \"success hath an enemy named ne'er even trying\".", "@gregianjohnson I completely disagree. Hold on to that notion and you're doomed. You'll never do anything.", "@gregianjohnson so fuck the past and embrace the present.", "@gregianjohnson my point about context over meta is about just this, people like us feel cripple in the face of the past's success...", "@gregianjohnson I preferred your first attempt. Made way more sense.", "@gregianjohnson yeah but it's nice to have a direction before you start walking, but you should NEVER have a path.", "@gregianjohnson man I do plenty.", "RT @gregianjohnson: @melnyczuk Labour fucked itself to grab the centrist middle Englanders and mild Tories who quite like foreign food b ...", "@gregianjohnson I'm on a train I think they'll kick me off if I get my hands too dirty. And mistakes are my forte!", "@sam_kriss @robdromb I think we need to replace the notion of meta-narrative with the concept of context.", "@sam_kriss @robdromb Genuine context of the kind that can retrace the link between life and art. Rather than just between art and other art.", "@sam_kriss aka: FUCK YOU HATERS ITS ALL BULLSHIT ANYWAY.", "@sam_kriss Yeah gonna get off twitter before someone notices we've been postulating wildly and tries to contradict.", "@sam_kriss we need to engage with irrelevance/unimportance rather than just practice it. \"Meta\"shit tries to create meaning &amp; is hence lies.", "@sam_kriss but it's a notion that has been alive since WWI &amp; before, but has been pushed further &amp; further to the back the collective mind.", "@sam_kriss &amp; that's a bitter pill, it knocks the ego hard, that you may not be of any importance just because you were born at all.", "@sam_kriss If we stop assuming that life is worth living just because we are alive we may begin to engage with it again.", "@sam_kriss I'll hazard a guess at how to phrase the question we need (I will undoubtably fail but I may share a fragment of relevance) :", "@sam_kriss Idealistic navel-gazing nostalgia and guilt-filled regret.", "@sam_kriss It sits there simultaneously saying \"I miss modernism, I wish I'd been there\" &amp; \"modernism was just middleclass people bitching\".", "@sam_kriss but that's precisely all post-modernist art has done, turn in on itself assume it's own importance &amp; ignore it's own irrelevance.", "@sam_kriss Intellectualism is the death of art.", "@sam_kriss We all too overeducated we can't see the path for the pitfalls so we don't even try.", "@sam_kriss yeah, but the problem isn't a lack of avant-garde, its a lack of novel and independent ideas.", "@sam_kriss change to what the objective is, whats the point?", "@jss_hlt but now all we focus on are trivial things because we feel life is trivial. We have no bold ambitions because they're so naive.", "@jss_hlt Religious art spoke the Bible in new visual languages, Modern art spoke of subjective changing moralities and experiences.", "@jss_hlt Because art genuinely helped us to understand the how the social world was constructed.", "RT @sam_kriss: @melnyczuk a reason for art implies a reason for life. in late capitalism we have neither but that can change", "@sam_kriss I guess that's what I'm saying. Art has spent ages tackling the problem of adequate subject, largely succeeded, so let's move on.", "@sam_kriss All the old reasons for living have worn too thin, they require suspensions of disbelief too great, leaps of faith too large.", "@sam_kriss That sounded fucking depressing, wasn't meant to be was actually just pragmatic/logical.", "@sam_kriss Nah it's not a problem of division it's a problem of why we bother living at all. Art has no purpose because life has no purpose.", "@sam_kriss but it is a lot of effort.", "@sam_kriss I just don't see why anyone would go to all the effort of a revolution when it'll all be the same old shit afterwards anyway.", "@sam_kriss NB, twitter is the worst place for mini essays. I hate having to multi-tweet.", "@sam_kriss If anything the mere attempt at creating a distraction through art draws greater attention to life's disappointing limitations.", "@sam_kriss But in doing that art disappoints us more because it doesn't replace life.", "@sam_kriss The problem is all we wanna reference with art is art itself because life has disappointed us.", "@sam_kriss I don't think art is innately self-referential, but it is innately referential.", "Labour are fucking fucked even in the face of the most unpopular government I can remember. WTF Labour.", "@sam_kriss Yeah sure you can continue the dialogue but it's all get so dull. I'm really afraid of boredom.", "Is it even possible to make relevant art anymore?", "Watching Diner making me glad I don't live in late 50s America.", "@EilishCunn southern fried chicken = WIN!", "@EilishCunn and if you can't accept it, blow it up with TNT.", "I've decided from now on I'm gonna dress like the cool kid with the sunglasses from Richie Rich.", "RT @bestfitmusic: Photos: Joanna Gruesome at The Lexington in pictures http://t.co/sRyRQsLk", "@lewisdotcom you ain't wrong there bro!", "@vanessaptrsn is that a yes?", "DURHAMDURHAMDURHAM!", "I wanna take more portraits so if anyone would like to sit for me lemme know pls pls pls.", "@oliver_chambers thaaaaaaaat's London! People spend so much time on crowded tubes that they forget the freedom of movement.", "RT @st_vincent: There are few words I dislike more than \"nosh\".", "I feel strange.", "I miss everyone right now.", "RT @BadJokeCat: I hate jokes that rely on visual imagery. I've had it right up to here with them.", "@sam_kriss awesome. It would go in issue 0 and you would feel full of win", "@sam_kriss how's your article coming bro?", "@sam_kriss further, to Durham.", "Someone is shining something down on me.", "Heading to the frozen north.", "@jacobdrozario awesome!", "@jacobdrozario so what's the plan with this photo blog bro? I'm real up for it.", "Eating an entire chocolate gateau by myself because it's been one of those weeks.", "RT @chloenobrainer: Today I picked up unflattering but hilarious photographs feat. @melnyczuk @plainlaurajay @lkmrgnbrttn @Tomsingssongs ...", "I want to go out.", "RT @jacobdrozario: Why Tumblr Is Killing Personal Style http://t.co/cDCleRdt via @ComplexMag", "dear Bill O'Reilly, Japan is not in Europe.", "@lkmrgnbrttn if I ring you now would it foil your ruse?", "They changed Mark on the Centre Point adverts. Did they think I wouldn't notice? I walk past him everyday.", "@mariannecr Yes! Thanks!", "The news that the camera could lie made getting photographed much more popular. - Susan Sontag", "*it", "So a girl just knocked on the bus door to get it to wait for me and I just made my day.", "I actually don't like my job.", "It's called empathy you cunt.", "@MelissaRHunt http://t.co/TJE2QaUX", "Putney Bridge is beautiful at dawn.", "@gregianjohnson @tokny so to recap all art is mindless violence and computer games are better than me right?", "RT @dominiqueeeek: why is no one ever online when i feel like talking, huh?", "@tokny http://t.co/av41NQzO", "@HollieAnderton yuh huh, except theres probably too much too fit in an email. may end up sending it on a dvd via the old age method of post.", "RT @AntiJokeCat: Yo momma's so old, she's probably going to die pretty soon.", "@HollieAnderton D: Not too great. Having trouble trying to making it work, but I can send you the footage for your showreel in the meantime?", "@Story24 sent you an email with all that stuff to I think your hotmail? It was one I already had for you let me know if you have a new one.", "@Story24 awesome! If you're quick you might make issue 0 which is out this month but if not then hold on for the next one in April.", "@Story24 would welcome stuff about graphic novels/computer games/film.", "@Story24 oh cheers man! It's about all aspects of contemporary arts culture, with a view to criticism over punditry. Get involved!", "@jacobdrozario I'm rubbish at naming stuff but I'll have a think. Also, how do you wanna go about it? What would you say to an e-zine?", "This new Grouper album is a return to form.", "@jss_hlt Summer Glau aka the plainest girl on tv?", "Just passed a sign that said \"do not alight here\". What poor lost soul erected it? I fear I may soon pass another saying \"do not love here\".", "If I could do a PHD on Virginia Woolf I think I probably would.", "Virginia Woolf &gt; James Joyce", "Looooooooooooooooooong day is long.", "@jacobdrozario well great! We could put out a round up of the best photographers/photographs we've seen online and off.", "@jacobdrozario PLAN!", "Well this is a fucking disaster.", "The internet has blurred the line between criticism and punditry to a ridiculous level. What a shame.", "Should I find a way to make prints of ma photos for sell?", "@jacobdrozario @dominiqueeeek I cannot wait for that Lichtenstein exhibit. It's gonna be off the hook.", "@jacobdrozario you're making me blush!", "@jacobdrozario aha cheers bro!", "Photo:  http://t.co/JHQQXOMs", "Wanna put on a photo exhibition in a lift shaft.", "Photo:  http://t.co/YXA6YIgM", "When I'm old I want to retire to a seaside town and only eat cheeseburgers and only drink tequila shots and only write cynical novels.", "BURGERS BURGERS BURGERS EVERYDAY.", "Tate!", "@TheSpocker Thanks for the tip pal. Pie lovers of the world unite!", "56 joggers in the time it took to eat a pie. Must be the 2nd of January!", "Pieminister!", "Photo:  http://t.co/TVbhX5vQ", "Photo:  http://t.co/GvlRS4cu", "Photo:  http://t.co/xzCHuzAU", "Photo:  http://t.co/EnwsR5Ml", "@tokny http://t.co/O477JEAl", "Such shows are trying to show friend circles of white privileged folk in NY &amp; those folks don't have black friends. Therein lies the racism.", "So I don't think Girls is racist. Friends didn't have any black characters. Nor HIMYM. Nor Will &amp; Grace/many other NY based shows.", "kate bush is set to hunt mode this morning. it isn't the morning anymore. damn.", "Do I have any friends who enjoy having their photo taken?", "Photo:  http://t.co/5vjD3AQk", "Photo:  http://t.co/HutTBG58", "RT @chloenobrainer: Buying a dress that @plainlaurajay said made me look like a clown so I can add that to my style list alongside grand ...", "@MelissaRHunt oh no my other favourite pair. Those maroon ones are on deaths door though.", "Why does no one think to politely ask for anything but instead stand around being passive aggressive about how no one is friendly or polite?", "@chloenobrainer PHEW! That would have messed up all the plans for the PARTY!", "@chloenobrainer are we supposed to be in work on monday?", "@chloenobrainer cris and I got told the 3rd.", "@chloenobrainer in work on Monday? Not to my knowledge, that's NYE.", "MY KITTEN JUST GOT A CBE!", "@chloenobrainer setting off in less than an hour!", "Photo:  http://t.co/hohaPlyS", "I NEED A SECOND OPINION WHERE THE FUCK IS EVERYONE?", "Photo:  http://t.co/otyRKe27", "@jss_hlt time for new favourite socks.", "I have holes in my favourite socks. I am devastated.", "New Years High Resolutions.", "RT @bestfitmusic: Photos: Emmy the Great and Tim Wheeler at the Scala http://t.co/xi84Rvxe", "most contemporary horror films are so sanitised. completely impotent.", "Fucking love the Glaswegian dialect. Is there any way I can get every voice translated into the Glaswegian dialect?", "nothing like a healthy dose of self-loathing to get you through the day.", "What's with all this \"Men only want to have sex/Women only want to avoid sex\" bullshit anyway?", "Saw Rat's Tales last night at @rxtheatre. Beautiful, dark &amp; utterly captivating from the very get-go. Your kids will love it &amp; so will you!", "\"Country-sports enthusiasts\"? ERR NO, they're blood-sports enthusiasts. Call a spade a bloody spade, especially when it's covered in blood.", "@dngdwn modest", "@plainlaurajay ;P", "@plainlaurajay touchy! :P", "The debate is there. You just have to wake up and engage.", "Watching Weekend on @Film4. You should all watch Weekend.", "@lewisdotcom Gee thanx.", "@tao_lin yes", "May I never marry.", "Imma get really drunk now.", "RT @AntiJokeCat: Last Christmas I gave you my heart, but the very next day, your body rejected the transplant and you died.", "@GKFennell thats my twitter feed anytime DW is on.", "I'm so fucked up and confused. MERRY CHRISTMAS!", "RT @GKFennell: Merry Christmas, here's a picture of me shining my new Sunlight Box at my bottom: http://t.co/aRYnxMIi #WWJD", "Man I might take the whole of April off life just to watch GOT and DW.", "\"Winter is coming\"? A little Game of Thrones nod there?", "Oh good she's not dead. Hottest companion yet.", "Already.", "Yeah so I wont mind watching this new companion in oh wait no she's dead.", "In pain.", "XMAS THEMED UPDATE TO VOXOC COMING SOOOOOOON.", "@jacobdrozario Merry Xmas buddy http://t.co/4dwqpflk", "@mariannecr I like that. All the Ukrainian proverbs I've heard are depressing as hell.", "@jacobdrozario something like that yeah...", "@jacobdrozario and this is just the tip of the iceberg. http://t.co/Nds9MKQW", "@jacobdrozario JUST DAMMIT http://t.co/PIsQRfrz", "@jacobdrozario Such a moron. If I ever bump into him in my local Tesco I'll slap him/ask for her number.", "@jacobdrozario http://t.co/818rXUSs", "Need to talk so I talk to a text document.", "There will never be a time more opportune.", "so please with a daydream.", "I wish there was somewhere I could store stuff on the internet but I guess I'd never look at it.", "@lkmrgnbrttn just search \"megabus cardiff\"", "Cara Delevingne fucking marry me.", "Nelson has gotten so FAT! http://t.co/pozxP96I", "@sam_kriss yeah pretty much.", "Wouldn't it be great if I hadn't just spent a tenner on food and drink in Birmingham New Street station?", "Wouldn't it be great if we weren't all driven by paradoxical desires.", "Wouldn't it be great of we knew greatness before it was gone.", "@mariannecr LAMELY PRACTICAL. you coming to @tortisaw's tonight?", "@mariannecr GON GET SOOOOOOO DRUNK! #fuckyesthenorth", "RT @mariannecr: In ze pub for ze foosball. Two and a half pints come to just over a fiver. Good old North.", "RT @JamesWoooods: @melnyczuk \"Sexting\"", "I don't understand what this new Facebook 'Poke' app is for.", "RT @ad_I_am: I've just attended my son's primary school nativity play ... an inept production not helped by quite dreadful performances. ...", "RARING TO GO", "@Story24 I'm looking at my hands but it's not working!", "Wish I was a dancer.", "RT @nadiakhomami: How many Dalstonites are actually from London? http://t.co/Qwx7cedi", "I think I just wrote a story and I think it made me feel so much better.", "Right now I don't want anything from anyone. I just wanna lose myself in abstract sensation fill the blank space overwhelmed and removed.", "RT @OKComics: Christmas Shopping hits boiling point! Just saw a well-to-do couple, mid-50's, having an actual fist fight on Briggate!", "@tokny http://t.co/XoRmBtf9", "WANNA FUCKIN PARTY SO BAD NEED A BLOW OUT.", "In my favourite burger joint in London. #tommisburgers", "I WANT TO PARTY WHERE IS PARTY?", "The world turns constantly. The only end it'll have is the end of interest.", "Whenever I see people with beats headphones I think \"You lost soul, you are lonely and scared, reaching out frantic in vain for anything!\"", "He has Beats by Dre headphones.", "There's a guy on my bus who looks like a pathetic Ryan Gosling. Like Ryan Gosling would look if he was someone you never want to talk to.", "@ALICETATE_ hey it's FINE. Nothing more has really happened til my email today. But I'm now pretty excited!", "@gregianjohnson &amp; I need to do that, go home and change and then go photograph Emmy the Great at like 8/9 tonight. Can probably fit u in :).", "@gregianjohnson YES, but I'll have to see how much time I have after work as I need to do some last minute christmas shopping.", "Actually really enjoy my job.", "RT @Horse_ebooks: What about your lake", "AFTER MONTHS IN THE WILDERNESS I FINALLY HAVE BROADBAND AGAIN.", "Totally forgot about the impending Doctor Who Christmas special.", "awoke in the night to find Kate Bush licking my face.", "Omg my bed.", "RT @bestfitmusic: Some predictably shadowy photos of The xx in Brixton. http://t.co/maUUtPiM", "RT @TheOnion: Iran Worried U.S. Might Be Building 8,500th Nuclear Weapon http://t.co/AfIlsdhi #OnionYIR", "@MelissaRHunt WOOOOOOOO!", "So what you're telling me, Twitter, is that I don't need to bother with instagram?", "Sometimes when I'm at gigs I watch the band on the screen of the smartphone of the person next to me because I don't get this reality shit.", "And now I'll never explore.", "Bleurghhh.", "Pretty sure Jamie xx is sampling the streets I'm there somewhere, amongst other things.", "Oh nope gotta stand round a corner. Wut?", "In front of all the crowd for the XX at Brixton O2. Ain't bad at all.", "@GraPar I like the size of your Gas peak. It's good to see.", "RT @JosieLong: This is the thing that I shout most at the tv \"HOUSING BENEFIT GOES TO THE PRIVATE LANDLORDS!!!\"", "Pie.", "RT @bestfitmusic: Photos: Atmospheric photos of Luke Sital-Singh at St Pancras Old Church http://t.co/5tAOauC2", "@jimbodutts @the_false_nine did you just tweet yourself?", "http://t.co/J2kzFZ5C", "We have all forgotten this and capitalism as stopped moving.", "Because really only those who propogate wealth matter from an economic pov. Not just those with wealth who put nothing back in the system.", "And if you are rich don't act like giving such opportunities isn't what you should be doing and is instead because you are such a kind soul.", "@jimbodutts I could say the same about 'chatting shit about football to your mates via a national newspaper column'.", "Being rich is nearly never a result of you being more talented/more intelligent/better than anyone else. It's usually down to circumstance.", "So if you are rich, dont act all high and mighty. You should give back and spread the opportunities you yourself have capitalised on.", "@jimbodutts I'm now teaching google to the employees of a bus company. Go go google gang!", "I almost feel important.", "So I went and stood in a very full room to take pictures of @localnatives last week. It was really great! Big thanx to all at @infectious_uk", "New job woo woo!", "@jimbodutts @dngdwn it's almost like I'm a photographer or something.", "@dngdwn @jimbodutts Hopefully taking pictures of their London gig. Really hope I am as I don't have a way in otherwise. So good at bestival.", "RT @jimbodutts: I've seen it all now; pitiful attempt at a moshpit at an XX gig. Jesus Christ.", "Kate Bush keeps trying to eat her own tail. http://t.co/pjI4dwZN", "@chloenobrainer you get that internship then? Tell tell tell!", "Camo trend enters its death throws.", "RT @bestfitmusic: We headed down to Fabric on a Wednesday night to see Matthew Dear do his thing. http://t.co/QHuDGEL4", "@Claire_Hawker gonna make some little thumb weights (&amp; call them thumbells). If I can't have skinny thumbs then maybe I can have ripped ones", "Kate Bush keeps trying to eat her own tail. http://t.co/dGzAQgQE", "RT @Horse_ebooks: reasons why restaurants", "@heartsnbones win.", "May the burger joint never die.", "RT @gregianjohnson: @melnyczuk @jimbodutts @dngdwn @The_False_Nine Forget PDF PDF PDF. Let's just call it GULAG.", "@gregianjohnson @jimbodutts @dngdwn @the_false_nine Nonsense I'm not some kind of dictator now pipe down or you'll feel the back of my hand.", "@gregianjohnson @jimbodutts @dngdwn @the_false_nine yes he is your boss but I am his boss.", "RT @jimbodutts: @dngdwn @gregianjohnson yeah I am one of @The_False_Nine editors, and supposed sport editor for @melnyczuk &amp; his big ...", "RT @BarbicanCentre: High &amp; Dizzy anyone? Join @guildhallschool musicians for live accompaniment to not so silent Harold Lloyd shorts ...", "KITTEH.", "CAT PROOFING HAS BEGUN.", "Maybe twitter isn't the place to compile all the things that piss me off. But then what else would I tweet about?", "@kayakmusic what would you recommend me to change my mind? (hiphop/post-68 novels wise)", "@lewisdotcom @dominiqueeeek http://t.co/OVRzytqN", "@kayakmusic I jest, but really?", "French girls can stay.", "Like, why do we even teach French in our schools? It should be Spanish/German or GTFO. Also never sleep with a French guy, boring as fuck.", "All whilst thinking it's the shit because the average American lives too sheltered a life to know Paris has fuck all to do with romance.", "It's all just bad novels, bad hiphop and good films right?", "Has France done anything worthwhile since '68?", "@chloemckernan Omg are you with the kitty now? Omg thaaaaaaaaaaaaaanx! Canne wait!", "Just saw Amour. Need a hug.", "PHASE ONE OF PDF.PDF.PDF HAS BEGUN.", "http://t.co/ZposG2Ti", "RT @big_ben_clock: BONG BONG BONG BONG", "How is it 4 o'clock already?", "RT @bestfitmusic: MTV have named Frank Ocean their 'Man of the Year' for 2012 after battling homophobia. http://t.co/hHUwtNvC", "@projectania but I'll just look so crazy! Maybe that will stop people wanting to heckle me though, out of fear.", "@projectania yeah, except in a gig it's usually too noisy/busy to explain anything. But not too noisy to heckle me apparently.", "@projectania go on...", "@projectania This band called Local Natives, they were great.", "TYPING A LOT DO LITTLE WORK.", "@projectania \"Stand closer\" \"Get over there that's a good angle\" \"Shouldn't you have a flash\". It grates on you after a while.", "So many people last night telling me how to do my job. Don't.", "@ALICETATE_ WOOOOOOOOOOOOOO! Sorry to pester, just typed up the email to send out to everyone involved but wanted to hear back from you 1st.", "@ALICETATE_ YO CHECK YOUR FB MESSAGES PLS. YOU CAN ALWAYS SAY NO TO MY PROPOSAL DON'T SWEAT, I JUST THINK YOU'D DIG WHAT IT'S ABOUT. #CAPS", "@ThisBandThat Yeah I'll send over my best one just for little ol' you! Should be ready in like 45.", "Bullion played a free set in LDN and I didn't know. Damn.", "@ThisBandThat Yeah it was good to see you too! You have fun? That room was packed! About to have a look through, hope I got some good'uns.", "@dominiqueeeek is it only a week I thought it was longer.... :(", "@EmmaDraffin how is it other than its abundance of tacky coats? Do you get to board to uni?x", "@EmmaDraffin I shudder just imagining.", "My least favourite sound is the sound a puffer coat makes when it rubs together.", "@TheSpocker thanks a lot! Yeah I did enjoy it, their an awesome band felt like I was photographing a compact little riot.", "Crowd of jerks, band of gents. #localnatives", "@TheSpocker nice one bro! Are you in any of my photos?", "@TheSpocker I hope you were at the front all those guys were fucking great.", "@TheSpocker look on line of best fit my good man. http://t.co/yO8OlAQk if you were at the front you may well be there.", "RT @richthane: my day gets worse. keys and wallet back but some joker has gone INTO my wallet and stole my Oyster Card. nothing else. ju ...", "@TheSpocker yes I have a few. How come?", "I have less than 4000 tweets? How do I have less than 4000 tweets?", "wish there was a tfl app.", "I need a new computer. Like right now.", "Fuck my computer.", "Just fuckjng render already ffffffs.", "@dominiqueeeek are you excited? http://t.co/VqaH6OIN", "@GKFennell Google it dawg. It's in response to your retweet about best new bands.", "@GKFennell FIDLAR.", "Whenever stuff is exporting I get so anxious.", "@ThisBandThat cool I'll probably get down about then too. Pretty excited, heard great things about them live but haven't caught them before.", "One hell of a life.", "@ThisBandThat oh man I'm covering Local Natives tonight too! What time you getting there?", "@ThisBandThat and in the mean time keep eye out for some pictures I took for the Local Natives interview. Should be up soon. How about you?", "@ThisBandThat well later in the month I'm hopefully shooting a little band called the xx... #fingersxrosswed", "@ThisBandThat any time!", "I done took some snaps of that FIDLAR gig for @bestfitmusic. Big thanks to @oliaxel &amp; @trailofpress for sorting it out. http://t.co/yO8OlAQk", "RT @RaychulJE: People spelling 'can't' like 'carnt' is just the worst.", "@Claire_Hawker oh good glad it's not just me, I'd hate to actually have just fat thumbs.", "15 mins til closing time, 3 drink tickets left. Gonna drink whiskey quicker than Tom Waits.", "I think my thumb is too fat to type M without also pressing delete. #iphoneworldproblems", "If this week is tellingm me anything it's that I definitely chose the right vocation.", "Matthew Dear putting on a classy show down at Fabric. White lights &amp; white roses.", "So I had a +1 but didn't know so I guess all 5 of these free drink tickets are for me. Damn Fabric are good hosts. #fabricldn", "I have all my Xmas presents bought and wrapped and it's only Dec 5th, cause I'm not getting any of you bastards a god damn thing. #organised", "RT @lewisdotcom: i love my friends", "@tokny  http://t.co/O905h0Hn", "RT @bestfitmusic: Coolest sibling band at the moment? And no, it's not Kings Of Leon... http://t.co/5JEUIc6o", "@plainlaurajay stood next to a guy chewing card spitting it out on the overground. Think this beats you, the tube sniffer.", "on the passive-aggressive warpath today stay outta ma way.", "BUSY DAY BUSY DAY BUSY DAY BUSY DAY BUSDAY.", "@The_False_Nine a yahoo email? are you kidding me?", "RT @bestfitmusic: FIDLAR put on what may well have been the most raucous show we've witnessed all year at Dingwalls in Camden last night ...", "RT @bestfitmusic: Some pretty bloody beautiful shots of Ben Gibbard at London's Union Chapel right here:   http://t.co/9Qm148kc", "@dominiqueeeek @dominiqueeeek @dominiqueeeek @dominiqueeeek @dominiqueeeek @dominiqueeeek @dominiqueeeek @dominiqueeeek @dominiqueeeek", "@dominiqueeeek you're also super cute!", "RT @dominiqueeeek: i'm so alt http://t.co/buAqgDSN", "Steve LeMac was there. AND KATE NASH. Omg! #rollinwiththestars", "So that FIDLAR gig was pretty good. Ain't been to a gig like that since I was 17.", "15 inches of death. #pizza", "So bored of this bus I might burst.", "@alex_gillham ah you should watch Last Days of Disco instead maybe. It's by the same director and it's better. It's so good. Cheer up soon.", "Tonight, me @tokny &amp; @lkmrgnbrttn get to do what @dominiqueeeek &amp; @lowriellis do every night: get drunk &amp; act like angsty rebellious teens.", "@alex_gillham Not enjoying it?", "RT @bsmrocks: Best looking vinyl at this weekends @IndieLabelMkt goes go @Gnarwolves according to @bestfitmusic. Nice Cosby shot too. ht ...", "Yep that was the best gig I've been to in ages. A real pro.", "But some one organising the gig just radio'd someone else to tell me to take all my photos from the foyer. Press pass worth nothing.", "Ben Gibbard living legend.", "This is exactly where I needed to be tonight.", "Sick of all my music sick of all my games sick of all my films sick of all my photos sick of all my dreams.", "@DIXON_27 we don't know yet. Is it a boy or a girl?", "I don't understand internet shopping.", "Photo:  http://t.co/HCdJcTgD", "Just spat cider all over my new job application.", "RT @bestfitmusic: Music fans rub shoulders with kitsch craft enthusiasts at Day Two of London's Xmas Independent Label Market. http://t. ...", "RT @bestfitmusic: We went to London's @IndieLabelMkt and spoke to people about what they were getting themselves, ahem, we mean a friend ...", "Hey girls who think you're really smokin when you're pretty plain, I'm not checkin you out. I just look around a lot don't flatter yo'selfs.", "RT @Glinner: Oh, wow, love this. Ariel Pink's 'Kinski Assassin' http://t.co/asC6pR4C", "RT @zizek_ebooks: I'm Stalin. You can not swim. I will assure you are reimbursed", "RT @AJEnglish: On the Blog: High police support for Greece's Golden Dawn http://t.co/tXTVNDIS", "RT @bestfitmusic: Some awesome photos from Day One of this weekend's Independent Label Market (@IndieLabelMkt) in London. http://t.co/B7 ...", "RT @bestfitmusic: We headed to the @IndieLabelMkt in London earlier today. Here's a lowdown on what happened, with photos coming later.  ...", "Why does my morning coffee taste like vodka?", "RT @PennyRed: Apparently, Met police consider my reporting a threat to London's security. How flattering. (pg 16) http://t.co/8aaun819   ...", "@hohohodders man you don't even know how much. I didn't know I had so much fluid.", "@plainlaurajay as we speak(tweet).", "@hohohodders oh man no I'm not. Im so ill. It won't go away.", "@dominiqueeeek @dixon_27 but but but :( pls pls pls @chloemckernan pls.", "@dominiqueeeek also I feel really bad.", "@dominiqueeeek nah this new scrumpy they have on draft at the pearl.", "My tummy's on the fritz and as lovely as that scrumpy cider was, it definitely made matters worse.", "@DIXON_27 @dominiqueeeek YAY @tokny &amp; I ARE SO HAPPY!", "@DIXON_27 also send us a pic so I can start getting emotionally attached.", "@DIXON_27 actually @dominiqueeeek is coming down in about 10 days in a car so maybe she could bring it?", "@DIXON_27 omg yes pls but how would we get it to London?", "Photo:  http://t.co/PJjqDKDp", "Photo:  http://t.co/VJ02Kd7k", "RT @laurendubinsky: I am so over sex w/a woman being the \"bait\" in every.single.thing. As if it's all men want &amp; we hate it unless w ...", "RT @AntiJokeCat: Roses are black, violets are black. I'm blind.", "RT @bestfitmusic: We won Best Digital Publication Of The Year! Thank you x @recordoftheday", "RT @theQuietus: Well done @bestfitmusic winning best website @recordoftheday awards. Also seem to have trumped the Quietus sartorially too", "RT @bestfitmusic: Photos: Wild Belle play Birthdays http://t.co/pDtArnqO", "@dominiqueeeek I'm king of that round.", "@ALICETATE_ you are too kind. In reality I would probably have done even worse than @dominiqueeeek", "@chloenobrainer for the +1!", "A pawn who thinks he's a bishop.", "@chloenobrainer MEEEEEEEEEEEEEEEEEEEEEEEEEEEEEEEEEEEEEEEEEEEEEEEEEEEEEEEEEEEEEEEEEEEEEEEEEEEEEEEEEEEEEEEEEEEEEEEEEEEEEEEEEEEEEEEEEEEEEEEEEEE", "@ALICETATE_ who who is the winner. I wanna know!", "Photo:  http://t.co/zdxJhnGr", "Photo:  http://t.co/5WUbhfGI", "Just photographed @localnatives and they were really nice guys! Well done those guys.", "Turn up to work today with odd shoes. Both left feet. The irony is I'm actually a pretty good dancer.", "Photo:  http://t.co/fX0v0JOe", "@jimbodutts YEAH MAN WTF WHERE WE'RE UOU?", "So that party was pretty perfect.", "@mariannecr it's what I do!", "IT'S THE FREAKIN WEEKND BABY IMMA BOUT TO HAVE ME SOME FUN.", "@lowriellis YESSSSSSSSSSS! What time you get in?", "Trying to bring down the tax avoiding corporate juggernaut from the inside by oversleeping &amp; general incompetence #not #ohjesusineedthemoney", "@hohohodders LOL", "@kat_iedunn aren't your eyes filled with water?", "@kat_iedunn what does that phrase even mean?", "RT @ro_bot_dylan: Now your dancing child with his Chinese suit, He spoke to me, I took his flute. No, I wasn't very cute to him, Was I?", "a good job is hard to find.", "@EilishCunn well I'd take that as a win if I were you.", "Am I the only Howard Melnyczuk in the world?", "Remind me never to miss the last overground from Stratford.", "I'm basically Nick Miller with a camera.", "Photography is great.", "The impenetrable Olympic village.", "Look, your Starbucks card doesn't have a chip in. You don't need to swipe it again to top it up. It's not your fucking oyster you dumb fuck.", "Errr.... Yeah.", "@lkmrgnbrttn if that was me, I just mean in this one room.", "Everyone here looks like they wanna kill each other. Crowd weave at yr peril.", "Went and lost said press pass. So much for soveigners.", "@jimbodutts gone and lost it now anyway.", "FINALLY.", "@jimbodutts yeah we'll see how useful it is when I try and go back stage after.", "He's on but tech issues.", "@dngdwn well that's lucky for me as I can't photograph sound.", "@chloenobrainer you can use ours but what for?", "@lkmrgnbrttn whittle.", "DJ is also doing good.", "@dngdwn ah shit. Was FlyLo good at Warehouse? Did he use his fancy visual thing I've heard so much about?", "Glad I got in. Got my first press pass and everything. http://t.co/3HgO8F4W", "Thundercat is killin it.", "Jumped the queue. This is a shambles.", "I'm late huge queue. Wasn't even expecting to queue. Shit.", "Okay begin live tweet:", "Stay tuned. I shall be half-heartedly live tweeting my photographing of @flyinglotus tonight.", "Pretty damn good ride to work today h\nHackney wick to St Paul's in 25 mins that's good right can I get an AHHHH YEEAAAAH?", "@AntCork LOL as if I love homeless people they have the best stories.", "Why do I feel so bummed out?", "It's overr-caffeinated what-am-I-doing-with-my-life freak out time!", "So it turns out trying to convert like 500 photos takes a fair while.", "I just wanna make love, is that so wrong?", "@hohohodders YEAH! Let's hang, when are you free?", "for the love of god.", "ps, feel free to give me a job yeah?", "tomorrow I shall update my photodiary keep your eyes on this feed you'll love it.", "BYE BYE INTERNET.", "LIKE LIKE LIKE LIKE LIKE LIKE LIKE LIKE LIKE LIKE LIKE LIKE LIKE LIKE.", "Eddi Front, St Pancras Old Church, 08.11.12\nShot by me for Best Fit Recordings. http://t.co/Isy2LqDk", "Work Work Work Work Work Work Work Work Work Work Work Work Work Work Work Work Work Work.", "RT @alicejmarshall: something is not quite right with the world when the train ticket in your pocket is worth more than your phone", "FUCKIN AMERICAN SPIRIT YOU SLIPPERY FUCK.", "@MelissaRHunt http://t.co/hOeXLYqH", "@MelissaRHunt awww, oh you! http://t.co/vrDoyZXZ", "@tokny http://t.co/v3LQxnY4", "forgot how good Attack The Block is. Fucking hell Joe Cornish and all else involved I salute you.", "@MelissaRHunt well you're in for a treat when you do see em!", "@MelissaRHunt YEH? http://t.co/qi6HXG4K", "Luck is just an excuse people use when they're stuck and they don't know why.", "@MelissaRHunt SURE CAN, HOWS WEDS? http://t.co/qoGBlYoA", "Photo:  http://t.co/FW0AAwFx", "Don't bring yr bf here he'll leave you.", "Wild Belle, 07/11/2012 shot by me for Line of Best Fit. http://t.co/6SFG7FgJ", "RT @linnb_: @melnyczuk  Torches + Loom + Chateaux @ Old Queens Head, London - 2/11/12 - Shout4Music http://t.co/5QFpZXLi", "whittling down photos bane of my life.", "@SalvadorVari the part where he took photos. no I jest. He's just great and I feel like I'm channelling him without meaning to.", "I think I'm the new Caravaggio. Is that too bold a claim? I mean it with the utmost respect, but y'know, he's dead &amp; the position is vacant.", "Photo:  http://t.co/zcoYwh5h", "Photo:  http://t.co/4HiRPhz1", "RT @norock: Cameron looking forward to working with Obama \"over next four years\". Two and a half, Dave. Two and a half at most.", "RT @BarackObama: Four more years. http://t.co/bAJE6Vom", "@linnb_ don't forget to tweet me a link to the article too!", "@linnb_ just get then off Flickr or tumblr I guess. If you could link to my tumblr at the bottom that'd be great, it's http://t.co/YazSF4ZO", "@linnb_ err yeah sure go for it.", "@linnb_ also thanks for liking my shots!", "@linnb_ errr no I didn't get a fb message sry. What did you ask?", "http://t.co/LCBrJZSw", "GOBAMA", "RT @EastEndFilmFest: Check out the fantastic @underwirefest 2012 programme -  taking place Nov 20th - 24th @RitzyCinema http://t.co/hKzkhldl", "RT @Aiannucci: Romney's closing words: \"Tomorrow is a new beginning.Tomorrow we begin a new tomorrow.\" I've just puked myself inside out.", "in a sleeping back to boot. #mondaybloodymonday", "only chat I got open is the bro sat next to me. #thatshowiim", "Photo:  http://t.co/NM7EG9Vm", "http://t.co/D9piFXWB http://t.co/dYX0qE5d", "Photo:  http://t.co/CjooF4PP", "Photo:  http://t.co/NnXLhYDy", "@dominiqueeeek WAIT, WHAT?", "@dominiqueeeek XXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXX", "@dominiqueeeek NOTHIN.......................................................................................................................", "@DOMINIQUEEEEK JUST FOR THE RECORD, @lkmrgnbrttn WOULD CHOOSE ME............................................................................", "RT @deansmith7: Don't trust people that wear double denim or nazi uniforms.", "TODAY IS CAPS ONLY DAY", "RT @alicejmarshall: Check out my site http://t.co/fEY71lPd", "@TOKNY http://t.co/gF2aNRCN", "@dominiqueeeek dunno, some episode with a hot poetry teacher and croquet. @lkmrgnbrttn now just changed it over to take me out.", "@dominiqueeeek watching suburgatory you'd be proud.", "@plainlaurajay FUCKNWELLJEAL!", "@chloenobrainer I just had another chicken burger. Not nearly as fun.", "@chloenobrainer I'm on a low income give me a break #mrsgeorgeosbourne", "@chloenobrainer is queen of chicken.", "Photo:  http://t.co/vF7BMUWs", "Photo:  http://t.co/L1152YA5", "Photo:  http://t.co/giHzZu0N", "Photo:  http://t.co/bN5fyOAt", "RT @zizek_ebooks: Shit for John Carpenter", "RT @nicoledandy: What's the point in complaining about the mercury prize, all the bands nominated were crap anyway and the worst one won ...", "RT @GKFennell: @Rich_Fulcher what about my eyebrows? http://t.co/6GPckaiB", "Met Will Self tonight. He was a cool guy.", "@ALICETATE_ insanely jealous!", "RT @plainlaurajay: Kiefer Sutherland is a terrible actor...&amp; his name is Kiefer. Kiefer.", "RT @zizek_ebooks: Wait a minute... wait a minute! I hate myself.", "@jimbodutts dude ring me!", "Srsly that religion is a joke.", "Is America really gonna elect a Mormon?", "Your god can suck my dick.", "http://t.co/bMzSChIk http://t.co/bMzSChIk http://t.co/bMzSChIk http://t.co/bMzSChIk http://t.co/bMzSChIk http://t.co/bMzSChIk", "https://t.co/zokkmM8e", "@james91ocr but Labour and the Tories are like the different flanks of the Tories too, but without any real power.", "I wish I could vote in the US elections more than the UK elections. Our policies just copy theirs anyway.", "do people really want an edge to edge display?", "woodkid's having a good time soundtracking tv ads ey", "i remember when #4thought was stimulating and not just a platform for religious nutjobs.", "who gives a shit if it's dangerous. you'll still do it because life is better spent on the cusp of joy than in a mire of boredom.", "the simpsons film is so shit.", "new underestimate man's ability to hold a grudge.", "RT @oliver_chambers: bye bye ceefax, its amazing you lasted this long http://t.co/3SmkeVwP", "it's a cliche to say but Jean-Luc Godard is rekindling my love of film.", "real men make love not war.", "http://t.co/EL63KEIa", "D'ENTRE LES MORT", "RESSUSCITE LES CHOSES", "LE TRAVAIL HUMAIN", "@GKFennell bruding at about 8ish I'll give Ye a text when we're heading.", "Ideology is the aesthetic of thought.", "@GKFennell yo you free tonight? i'm in town, brude then this? http://t.co/9scAdhbV http://t.co/9scAdhbV http://t.co/9scAdhbV", "@dominiqueeeek sitting in bed thinking about a bike ride. chilled as fuck mate. #unemployed", "damn my house having a download limit. figure I'm probably near.", "@plainlaurajay http://t.co/qkUMy0nF", "All hail the lords of high bit rates.", "@plainlaurajay what url did we settle on? any luck get something that's just nogold or akin?", "@dominiqueeeek what else are you gonna do with them?", "RT @plainlaurajay: Bought a velvet skirt from #americanapparel earlier, and cannot stop stroking it. #smallamountofnormal", "This is so uplifting. #liftedorthestoryisinthesoilkeepyoureartotheground", "the songs of your youth.", "Fuck sake I wish I could program. Literally everything I wanna do involves some level of it, even writing a fucking essay. damn.", "Buy a car and spend all your on money on it and all your time bitching about it. By a bike and have fun.", "@dominiqueeeek @melissarhunt I sent you both some flowers...", "@lowriellis is that like \"chow down\" but with free TVs?", "@plainlaurajay currently writing a potential essay for our blog yo! #nogold", "@Tim_Kelly When is anything gonna be done about the systematic destruction of our economy?", "RT @kat_iedunn: I want to stamp on today's face.", "@tokny new Emeralds.", "@dominiqueeeek @MelissaRHunt don't eat them all at once ladies http://t.co/Ybc8x6Ia", "@dominiqueeeek @MelissaRHunt ooo burn!", "@dominiqueeeek this how my missing you feels: http://t.co/vqBvUKKL", "@Claire_Hawker the bad news is I don't move in down there til the 10th of nov. you there now?", "I woke up to realise I have absolutely nothing to be awake for.", "life with the lightest dabs of fiction.", "L'atalante is a great way to start the week.", "Beds on boats are always the best. Look at them.", "like, if your sure your god will save you, that's great. But why force it on anyone else? That's politics not faith, call it straight.", "hey christianity wtf?", "lol just saw Harmony Korine wtf?", "and that Elliott Smith should have scored better movies.", "the main lesson from Good Will Hunting is that every man in America, from pauper to princeton, is a grade-A macho cunt.", "Greece far right moves are pretty scary.", "So @Channel4News just put Scarborough as being north of Newcastle on a map of the UK. Whoops.", "@plainlaurajay OMG HE DOES!", "@AntCork Unbelievable but it's true. A lot of them die horrible painful deaths at that.", "@dominiqueeeek that's gotta be good Karma.", "@GKFennell I'm currently waiting to move into a house in London. Glorious success! Are you still in Leeds?", "newsflash: non-smokers die too.", "I'M GONNA HIT YO ASS WITH A SKI", "DARAMAH", "@GKFennell http://t.co/6ZoLfbYN", "@GKFennell http://t.co/p0Yxxbrj", "@GKFennell let em grouch. http://t.co/8pKy98da", "loving Eddie Mair on Newsnight.", "@GKFennell AND YET YOU USED FOUR IN THAT TWEET ALONE", "Photography is the inventory of mortality.", "really wish invisible children would drop dead.", "@plainlaurajay I always knew he was guilty, even before he was accused. #justinleecollins", "Crime is okay as long as you own where you commit it.", "I don't care what you say about my race, creed, or religion, Fatty, but don't tell me I'm not sensitive to beauty. That's my Achilles' heel.", "@lowriellis http://t.co/YXgqtkBN", "Beautiful Sunday roast with @dominiqueeeek", "I'm so in love.", "Photo:  http://t.co/ey0DFzH2", "Photo:  http://t.co/HpOstoOq", "Photo:  http://t.co/8ThZ8PxM", "@MelissaRHunt nooooooo that's the same night as my partyyy grim.", "I think it's a common misconception to think you posses your own image, as if you can own anything in the visual world.", "@gregianjohnson I'll let you know if Al appears to offer me a cigar.", "My god! A megabus with two decks, wifi and plug sockets. Wtf happened? #megabusftw", "Rollin mad party bangerz round north LDN wit da Cunningham sisterz. Big time. #212", "Watch this void.", "@jimbodutts Going to work on the Wall? Good luck with the celibacy. #lookimadeagameofthronesreferencearentifunnyhahaha", "RT @jimbodutts: \"Any background in history is preferable. Duties primarily include patrolling visitors around Chester\"", "Photo:  http://t.co/xwl0gSpF", "@lkmrgnbrttn so far all I know is he speaks French.", "Alistar McGowan has past it. Did he ever have it? Who knows.", "@jimbodutts already heard it. It's damn good.", "It is a fundamental truth of human nature that man is incapable of remaining permanently on the heights, of continuing to admire anything.", "living in the shadow.", "@jimbodutts http://t.co/GUlAR84t", "@JamesWoooods it's Elephant by Tame Impala. Their new album is set to be sweet as. http://t.co/zo9WJXVV", "RT @plainlaurajay: Need to find a reasonably priced skeleton jumpsuit.", "@anna_kelly_  goin Ross' tonight?", "@AntCork sorted!", "@MelissaRHunt north ftw. Re: Tuesday - sure! Sounds like a right laugh.", "@anna_kelly_ yes most probably unless any of the jobs I've applied for her back to me. Givin it til sometime next week.", "@mariannecr yes! move in 27/10 so it'll be a housewarming/bday/Halloween bonanza. Mexican Day of the Dead theme. Tequila &amp; sangria only. Tbc", "@AntCork yeah the party theme is Mexican day of the dead so get your face paints out adn ready. Tequila &amp; sangria only. Werewolves accepted.", "@MelissaRHunt ah well we can't move in for a month so you'll have to wait to see it but I should be in London til next week so let's hang.", "@anna_kelly_ no the bad news is we can't move in for a month but the news is its an amazing pad!", "@AntCork also if you ever need to stay just hit me up with a text bromie, it's been too long I miss ya.", "@AntCork sharing with @tokny of course! gonna have a birthday-come-housewarming at the end of oct you gotta come!", "just signed for a 2 bed HOUSE in hackney wick with a garden and everything like wtf? #livinthedream", "costa is playing pendulum and the wifi lasts 30 mins. wouldn't get this shit in starbucks.", "wavves on the new fruit shoot advert what?", "Leutton Postle Spring/Summer 2013, shot by me for http://t.co/bneNLNyh http://t.co/Oeczjt47", "filling out and application for starbucks and all my serious answers look like i'm taking the piss. i just do love coffee that much.", "the clock in this room is kickin out a syncopated beat and I for one am loving it.", "fuck that took a long time. but I feel it was worth it. note to self, put less photos in the \"sure why not\" folder.", "officially back using chrome.", "@MelissaRHunt no need to book time off, lets just chill on friday?", "@jimbodutts OKAY YOU WANG.", "@chloenobrainer ah I'm in Bristol next weekend! @plainlaurajay dunno but i'm showing @tokny da sights so come join us.", "@jimbodutts NO I HAVEN'T HEARD IT YET IS IT GOOD YOU COCKSUCKER?", "@plainlaurajay whatcha doin tomorrow homegrrl? @chloenobrainer see you in October then! Text/tweet when you start getting free time.", "@MelissaRHunt @plainlaurajay @chloenobrainer so when are we gon hang y'all?", "@chloenobrainer but yes also let's hang.", "@chloenobrainer @jimbodutts same haircut for four years and counting!", "well that was fun. great collection.", "@chloenobrainer yeah I've made it. Now officially homeless. #couchsurfinftw", "En route to LDN after a pretty auspicious start.", "@plainlaurajay i think you should.", "why i no sleep now?", "RT @zizek_ebooks: Oh my god, if my wife were to disappear - I'm not a murderer but let us say ugh... drop me, it would open up a new lif ...", "well this was a shit episode of doctor who.", "i'm pretty sure everyone knows who jesus was. it's just that they don't care.", "@lewisdotcom only your new favourite pub/s. northern prices in the centre of london. give it a google.", "@lewisdotcom best find a sam smiths.", "RT @dominiqueeeek: y'know when you download a whole album/greatest hits so you don't just have single tracks? #nowplaying tears for fear ...", "@AAliceAstbury think you've caught something on the old tumblr. http://t.co/rz7GxTGh", "RT @zizek_ebooks: Life is a stupid, meaningless thing that has nothing to teach you.", "friends! countrymen! what are good websites for finding flats to rent?", "naming stuff is hard.", "@sam_kriss what's your current number bro?", "@sam_kriss monday bro, monday. lets hang big time!", "no rustie? and so the mercury music prize renders itself completely irrelevant.", "james franco eats dry toast ew wtf?", "@LeifPodhajsky ah don't worry about it.", "all my friends are cooler than me. well done friends.", "sam bacile seems like a total idiot.", "@HollieAnderton I'm not sure may be a few months :/", "@LeifPodhajsky hi i think you've been hacked, you just dm'd me some spam. ps, love you work.", "A beautiful black kitten just chased after me on my back and now I can't find it.", "Photo:  http://t.co/UPvedsLz", "Photo:  http://t.co/FumKBchf", "Photo:  http://t.co/o2Xd8fIc", "@HollieAnderton HEY! Yeah can't wait either. Sorry for the major delay, had problems getting a new comp. I'll keep you posted don't despair.", "Oh man it's my favourite time of year.", "@cgalbraith such a deep voice.", "He's gonna be sore in the morning.", "YES", "Championship point. #fuckme #USOpen #comeonAndy", "Fuck that was so barely in wow.", "What other sport do you play solidly for 5 hours having played the day before too? Footballers demand a day rest between games. Wankers", "@jimbodutts I mean other than this match it's been a pretty dull year for sport.", "@jimbodutts if Murray wins this he's a shoe in for sports personality right?", "4.5 hours is too long to do anything let alone sprint back and forth.", "So you pay a load for sky and it still has ads every five minutes? #seemsprettyshit", "@hannahjbrook I want him just to hurry up and win I'm shattered. He's just so selfish god.", "wish i'd gone bestival fuckssake.", "@lowriellis but the problem with capitalism is that choice is restricted to those with money (power). we need to gain the skills to oppose.", "also doctor who started again and no one told me til now. mega thanks to @jimbodutts he's got his priorities straight.", "my left eye has been weeping for like a week now and i don't know why.", "curation and critique are the heart and soul of a cultured democracy.", "@lowriellis @dominiqueeeek now motherfulcher!!!", "@dominiqueeeek third thing tweet about a previous tweet.", "http://t.co/zxLcERuC", "@mariannecr @thmsbsh @tokny @rachetpeg yeah I've only given it one listen and I thought it sounded very now but very forgettable.", "@tokny hey man went to Berghain on Friday night. It was sick you'd have loved it. Wish you were here!", "Berlin ist superfun.", "RT @dominiqueeeek: auf weidersehen, pet.", "What to do in airport for 5 hours.", "Getting off a plane to Berlin. Try again 1hr. #fucksake", "Boarding a flight to Berlin.", "@vanessaptrsn no I'm just off to Berlin. Not so bad really!", "goodbye macbook see you in two weeks :'(.", "@lowriellis HALLELUJAH", "@tokny hey man wanna go? http://t.co/zUsHAQpg", "@tokny yeah man i heard it yesterday. nothing grabbed me. it sounded fresh though i guess... bit disappointing, gonna see if it grows on me.", "@jimbodutts nah im cooking my mum dinner so i'll be in after that.", "@jimbodutts well let me know so I don't come in just when y'all are leaving.", "Gonna chill on the xx tweets now.", "@plainlaurajay you're gonna love the new xx.", "@jimbodutts okay well let me know when you get out. What are you seeing/how long d'you reckon you'll stay out?", "@mariannecr oh man best of luck to the baby Rizkallah!", "So glad I got this before the summer is entirely gone. Gonna be the perfect soundtrack as the summer fades right through to winter. #coexist", "@jimbodutts I am this evening I think yes maybe. What's the plan?", "Definitely getting this on vinyl. #coexist", "Can't remember the last time an album demanded me to just listen without doing something else. Lying staring at the ceiling. #coexist", "@the_changingman the internet is the best!", "for the first time in a long while i think i might be doing something right.", "@jimbodutts http://t.co/EgK8L50V", "http://t.co/IDGekoTI", "new xx is leaked. @tokny @jimbodutts @lowriellis", "\"I want to go places and see people. I want my mind to grow. I want to live where things happen on a big...\" http://t.co/l8gjtAun", "@thunder_mind sounds like the science of sleep to me. are the dreams good and crazy at least? I hope you get rested soon!", "Just posted a photo http://t.co/jvaeaNAd", "Just posted a photo http://t.co/3iaWOE4n", "Just posted a photo http://t.co/3eAWHufe", "@vanessaptrsn never gets old!", "look out he's got a stick.", "@vanessaptrsn \"look at the size of that thing's rod\"", "garth marenghi introduced by matt berry. perfect.", "C4 now. do it.", "@thunder_mind stop dreaming? dreaming is the best thing ever!", "what to watch. whatoch."]}