{"NikeRunning": ["@QuinnCarterFR There's nothing like race day. https://t.co/QbxzRK3G9L", "@Smit_talks No rest for the fast. https://t.co/HMizVAXFil", "@J_Oliver6 Day in, day out. Think you can double the mileage by next week?", "@OSUluvingirl Let nothing stop you. https://t.co/Mo5RBB7wUG", "@hectorsalas10 Always chasing more. When will you conquer 13.1?", "@ChadAtcheson Future so bright... https://t.co/yyCWuoeXxy", "@JenBeck1126 Early bird catches the PR. https://t.co/fCUkVHi1DD", "@tframe Hard work leads to hardware. We'll see you at the finish line.", "@bwtic No stopping you. 1k up next.", "@avalencia212 Always trust your running instinct.", "@latifiana Keep reaching for the sky. https://t.co/8KPrgiXDjH", "@lrocks09 Chasing history with your run. Any races lined up?", "@ChonnaParker That rabbit better watch out: https://t.co/pGVCA3IiLB", "@tril_lian That's what we love to hear. Is it tomorrow yet?", "@Lauramchapman Every run has a purpose. Any races on the calendar?", "@Lingking27 Now that's some serious squad goals. Good work to the whole team.", "@stahlwal You've set a goal, now it's time to crush it.", "@BTexans Those look like the Air Zoom All Out Flyknit. We'd suggest checking with your local authorized Nike retailer for availability.", "@EmaLeto84 We like where this is going. Keep pushing yourself.", "@CharlesHChapman Neither are we. https://t.co/NgGmzKaIf6", "@npann Views like that make getting up early that much easier. Great run.", "@runnerbychance Run, rest, repeat.", "@Nike @DJRapsey Except his date with the roads. https://t.co/0kmg3mFPoF", "@Ashbomb84 Just smart running. Check out these tips to keep your cool all summer long: https://t.co/dx1bUl9PDP", "@DerekLSellers Talk about a run hit wonder. How far you pushing yourself this weekend?", "@grantsdad Take that, records. https://t.co/pTD8Yb6Tmk", "@karlavillarreal Embrace that feeling. Unleash your wild side.", "@phuxen Always horsing around.", "@cooptyhebert The numbers don't lie, your hard work is paying off. https://t.co/klW2jzV6sA", "@SharonStrom Limits are made to be broken.", "@christiemlowe Break it down to build it up. Keep these tips in mind too. | https://t.co/Rr1MY2bReY", "@chevytah Turning up the speed dial.", "@xoHelene Time to taper and get ready to crush SF.", "@raulmasan Hola, si cambias el idioma a ingles y luego a castellano ya deberia de funcionarte. Saludos", "@DanielCzyzak One accomplishment after another. Let Coach help you keep the streak going. | https://t.co/3b2I1Oo7IO", "@wrightmf79 Consistency is key to success, and you're living proof.", "@Jorr313Det Going the distance on a Thursday. What's in store for the weekend?", "@lrocks09 Motivation is the key. Six more tomorrow?", "@JoeMacM38 Nothing life feeling accomplished first thing in the morning.", "@_Awake13_ Spending some quality time and getting in some quality miles.", "@DenRosen Patent that. It's the formula for success.", "@gramirez3553 Straight to a faster you. Adding more mileage this weekend?", "@thedynasty2016 Well-rounded routine. When's race day?", "@JBlaze23 Soak in the view.", "@heidihanna Nothing like a good run to reduce and release stress.", "@stahlwal Quadruple digits look good on you. Any races on the horizon?", "@CharlesHChapman Unleashing your wild side. https://t.co/BDne2gSRQq", "@katiembowser Preach.", "@xoHelene Rise and grind. When do you lace up next?", "@RobertHrabluk Furry friends make the best training partners.", "@QuinnCarterFR Roots on routes. Any races coming up?", "@AE9941 Power in numbers.", "@Ma7moud_El5ayat Going the distance. What's next?", "@creativeauditor Soon it will become the norm. What's next?", "@willias1 Faster by the mile, better by the minute. Training for anything?", "@TheAgentHunt Slowing down isn't an option. How far will you go next?", "@_montaser_ Run, rest, repeat. We've got work to do. https://t.co/hf0F4pk3t7", "@themissjenn Earned it. Way to break 'em in the right way.", "@wilfriedboh Heat on your feet.", "@msstacylloyd Exactly.", "@runnin_ref You're well on your way to hitting that mark. Keep up that training.", "@_SammySA Do the work, great results will follow.", "@rhobouncer You're ready to take center stage. How do the legs feel?", "@iAmLarsYoung Ain't nothing but a peanut.", "@iashleeloveyou That's right. How many miles do you have planned tomorrow?", "@joebski Check this out to beat the heat: https://t.co/1nKPVjKPtU", "@modise_lucy We're making that our screensaver.", "@javorski_rachel Finding your joy in the great outdoors.", "@coops313 You only have two speeds: Fast and faster.", "@ShoeLacyLace Dedication that doesn't fall short. What's the mileage goal this month?", "@NikeSupport @stonsing127 From one race to the next. Training never stops. | https://t.co/rAbMergamk https://t.co/sw43WbUpA3", "@fatusfee No snooze button needed. Same time tomorrow?", "@raulmasan Podrias probar a cambiar el idioma de tu telefono a ingles? Se escucha la voz? Un saludo.", "@Eduardo050685 Hola, si nos facilitas tu email por MD, el dia de la carrera, tiempo y distancia nos encargaremos de subirla manualmente.", "@GogleddIwerddon Imagine what you'll be able to do in two years.", "@schlingel Super. Immer wieder gerne! https://t.co/mVyJiTtgT5", "@hectorsalas10 Don't limit your challenges, challenge your limits.", "@Brie_Ndondi Practice makes perfect. Maybe our training plans might be useful: https://t.co/jXXQv3Szbd.", "@TonyWinward Sore today, stronger tomorrow.", "@_SammySA Your biggest competition is the one in the mirror.", "@_montaser_ Smart and tasty way to recover. Check out these smoothie recipes to keep you fueled: https://t.co/CoglDAZHxB", "@sam_fantastic Taking your training to the next level. https://t.co/7xbeSt3YRM", "@cornydet Is there anything that can stop you? We don't think so.", "@xoHelene Push past your limits to find your fast.", "@KevThommo77 Tuesday 10k has a nice ring to it. What's on the way for Wednesday?", "@npann Find your trail.", "@corinnecahill Every step is a step forward. Let Coach help get you there faster. | https://t.co/EYj2lbnwpk", "@yunitaandiani Stay woke.", "@HerreraMarv Running hysteria.", "@Omettospappy You can always beat the heat with these tips: https://t.co/XR2Y8qDQt9", "@VickEKnox There's nothing you can't do. Respect.", "@JayKondrk77 Hey Jay, thanks for hitting us up. Check out these helpful tips on how to increase your speed. | https://t.co/BUA9pz185m", "@thejonphillips Thanks for the feedback, Jon. We will pass it along to our team. Let us know if there is anything else we can help you with.", "@mochrimek Those 4 miles were all you. We're just here for the nudge out the door.", "@wilfriedboh No hard date to share at this time. Stay tuned to our feed and https://t.co/MgQydOiR1D for more updates.", "@JJ_Schafer Lucky number 13. How's your progress to 1K miles?", "@CharlesHChapman Barriers are meant to be broken. What's the next record to fall?", "@_Awake13_ Getting her started on the right foot. More miles tomorrow?", "@modise_lucy You'll never regret getting in a run.", "@Sill_Lino Happy feet. https://t.co/iMkVhr7wce", "@JApostol3 Exhibiting your speed. Please, no photographs.", "@BlackenAmbaa Halfway to Volt. What's your plan to get there?", "@RobertHrabluk Miles always have you on cloud nine. Push it to 4 tomorrow?", "@evebee4 We'd recommend checking with your local Nike stores to inquire about NRC events. Let us know if we can help with anything else.", "@cardsdalisay Fire in your heart, fire in the sky.", "@M1CHA3L1988 Show them who's really in charge; https://t.co/6x34V4BvZ1", "@idhzan Stay on track and feeling great will become the norm.", "@Eduardo050685 Hola Eduardo. Nos puedes contar que es lo que te sucede, estaremos encantados de ayudarte y solucionar tu problema. Saludos", "@KilianZagel Haben ihn gefunden: Nike Air Span+ 5 aus unserer Winterkollektion '08", "@AliK_AliG We like the sound of your plans. Let us know how it goes.", "@Brie_Ndondi Tomorrow day 6, are you training for something?", "@robynw A decade of speed and strength. We're ready for more. https://t.co/3G4Mnxo8ga", "@AliK_AliG Push past expectations to push past your limits. How far will you go next?", "@avalencia212 Get lost in the miles.", "@LukeJFrederick Runner's high.", "@GregGigs Better late than never. How far will you go this week?", "@j15gje The grass is always greener where you're running.", "@patsokay We knew you didn't peak in high school. Racing anytime soon?", "@Sereg0st Rock and run on.", "@JoyDelosReyes34 You're most free when you run wild.", "@ChristalLRyles Make every step a step forward. https://t.co/HvZRRXspBP", "@rupert1975 Rome wasn't built in a day. Bounce back tomorrow.", "@wrightmf79 Felt like a sauna, but it's no sweat for you.", "@Stephen_Logan We've missed you. Good to have you back in action.", "@ClumsyBloom Another run, another day closer to your best. https://t.co/fAX3nJys2y", "@talmekia Run. Recover. Repeat. | https://t.co/ImBHWJAjQq", "@bugnjoy (2/2) NRC running levels don't indicate when to change shoes. Chat with a running expert to learn more: https://t.co/EalRFl9FsQ", "@lumaca81 The summer heat won't melt away your dedication.", "@aohafiz You did the math. Now do the running. https://t.co/CvKb9pPlzM", "@bugnjoy (1/2) Depending on running style and personal preference, we recommend replacing your running shoes around the 300-500 mile mark.", "@lrocks09 Way to own your Monday, just as promised.", "@ShotsOfLYFE Make the most of your miles by making them fast.", "@timslaglejr The power of momentum.", "@TonyWinward We don't see you slowing down. 1000 by October, think you're up for it?", "@iAudrey Another step towards a better you. Do you have a fitness goal for the summer?", "@JBlaze23 No day is complete without miles.", "@idhzan Life's better fast. Are you currently training for anything?", "@bfenn Puttin' the petal to the medal. How's your progress going thus far?", "@ShoeLacyLace Scenic Sundays are the best. Nicely done.", "@PilotProp Outrunning your shadow.", "@msstacylloyd Take that, Monday. https://t.co/jyTJ51r3cp", "@EmaLeto84 Boom. See you tomorrow.", "@bisdak_explorer You've got the speed, but can you go the distance? | https://t.co/uSjfful7os", "@EmaLeto84 Progress doesn't have a finish line. https://t.co/ReMzgyUiie", "@aohafiz Heading straight for the finish line. What's your goal?", "@MalindaAnnHill Nothing planned but still racing towards the volt level. Keep us up-to-date with your progress.", "@iamshangreaux Let's see if we can help you along the way; https://t.co/3H1Ssf4ZUg", "@KAMONIHASISSUES Fast start to the week. Training for anything?", "@creativeauditor Upping your mileage and dropping the pace. That's dedication. When's the next run?", "@coops313 And Monday, Tuesday, Wednesday...", "@tril_lian Strength from the feet up. How'd it go?", "@bdrake25 When running in circles gets you somewhere. https://t.co/tHRvbhYdRA", "@MarieAlojado No signs of slowing down. How's the training coming along?", "@MustafaAbdElhak Next stop, Gold. Lace up and get after it.", "@Baldini44 One run closer to the starting line. https://t.co/pLghgKEJ8A", "@vbangie7 Week 2 complete. Where's week 3 taking you?", "@LaurenLCoetzee Immersed in speed. How far tomorrow?", "@JBlaze23 Bridging the gap to a stronger you. How far this week?", "@nzuniga Victory pose. We're ready to see more.", "@NickyChulo 1 down, unlimited to go. How far will you go this month?", "@rwale95 Easy runs don't make you better. What's your goal?", "@Lauramchapman We like the sound of that. How do the legs feel?", "@PickMW0105 Breaking your own records. What badge will you chase next?", "@NorcalSk8Mike We'll be waiting. https://t.co/YL9fzFWxLL", "@daniellericks With a line up like that, you're race ready. Let's get one on your calendar. | https://t.co/iiUrHfAfEt", "@jnbdesigner Extending your streak. Going even longer tomorrow?", "@TrinaFresco Soon that will be your warm up. Keep at it. https://t.co/VPFohDWV8P", "@edwarsimal_emp Runnin' the streets now. Racing the streets in January.", "@MalindaAnnHill Playing your best hand. What's on the calendar next?", "@wilfriedboh Finding your fast. Stepping out for more tomorrow?", "@QuinnCarterFR Competition better watch out. How'd it go?", "@NorcalSk8Mike No rest for the fast. Sub 25 on deck.", "@fisch_11 We'll see you next week. https://t.co/dw9VF9XNwR", "@CatMoore26 3 months till you toe the line. Have a goal time in mind? https://t.co/IMmDTIVkbE", "@fatusfee Sunday checklist: complete. How's your fitness coming along?", "@stepanbinek You woke up hungry. What's in store tomorrow?", "@Nike @GeordieRob85 Grab a friend and go. | https://t.co/xNzRZtaHwM https://t.co/4GZWohGreu", "@dustin_twalker Makes you wanna get ready for the next... https://t.co/sjbrZGVqbT", "@chevytah Unlimited Air. How far tomorrow?", "@mabathoana Going above and beyond. Training for anything? https://t.co/dKoaT01zQZ", "@karlavillarreal Breaking a sweat to break tape. When do you lace up next?", "@MKouyoumdjian Got it. Are you able to check back with that store on options? If not, we recommend checking in with your nearest Nike store.", "@CharityEdgar Giving it 110%. Watch out July.", "@AE9941 Top of the podium, always.", "@AmarullahAdhi Signs point towards a faster you. Make it two this week.", "@MKouyoumdjian Sorry to see that, Mary. When and where did you purchase those?", "@gramirez3553 If it doesn't challenge you, it doesn't change you.", "@lrocks09 Focused on fast. How far this week?", "@clestoak Breaking records, four laps at a time. https://t.co/fDaR5rG0h7", "@creativeauditor Quick feet make for fast finishes. https://t.co/aGS1AID5hK", "@AliK_AliG Glow so hard. https://t.co/IVh7BM99tH", "@franciscastro9 The month's not over, there's still work to do. How far will you go?", "@Jorr313Det You can't be stopped. What's in store for Sunday?", "@dowhatulove247 Only one way you're going to earn that medal... https://t.co/sIyedRk7en", "@avalencia212 *Faster together. https://t.co/AMyhsGa4yx", "@joehelms411 Dedicated to going the distance. What goal are you chasing?", "@snackandnap Out the door and on your way to a faster you. How'd it go?", "@turki1478 Unlimited Ks ahead. What's the plan to get to Gold?", "@jjzombie13 Hitting the road to hit a PR. Keep truckin'.", "@knowntravelr You've got a goal, Coach has a plan. | https://t.co/Fn3lTohKCo", "@CharityEdgar Chasing down victory. How'd it go?", "@ClumsyBloom Speed is earned. What's in store tomorrow?", "@iamshangreaux Early bird gets the PR. Training for anything?", "@JMoore4LSU Unlimited dedication. Now it's time to push for 2,000. https://t.co/sNGwpxKvjV", "@tancheekwang On track towards a new PR. How are the legs feeling?", "@KSRuprai Shave time not beards. What's your plan to get to Blue?", "@MALUCKYBHANDARI Equipped for speed. When's race day?", "@ayeshsalah Not at this time. We recommend checking in with your local Nike store for any updates on events in your area.", "@Chuck_Daly4 Always on the move. How'd it go?", "@BxGemStars Push limits to find your fast. https://t.co/fTNjjrFrVa", "@Jorr313Det Forecast for July: More medals. What's the goal for the month? https://t.co/8pMhdQbw73", "@DynamoNRC1981 No matter the weather, you always bring the heat. https://t.co/aC5MBoTTiz", "@LucaQuartana The look of pure determination.", "@JBlaze23 Outrunning the elements.", "@mylittletiffie Keep that momentum going. How's the body feeling?", "@brunomsilva82 Soaring past your expectations.", "@RickyLReed The fun is in the miles. Nice view, too.", "@jovannycipriano Keep building. Liftoff in T-minus... https://t.co/GdbxYCMbjd", "@JacobHjelmaas Change can be a good thing, and you're proof.", "@zoeesl Keep feeding that habit. Racing soon?", "@Baldini44 Sounds like a recipe for success. Keep us posted on your progress.", "@Dubaidrives Always run in the fast lane. Nicely done.", "@QuinnCFR The next one is yours. Push through that final wall with these tips. | https://t.co/SgcnA7LlBd", "@edwarsimal_emp Starting the day on a fast foot. Good work.", "@Baldini44 Calm, cool, and collected. What's in store for the weekend?", "@Nike @tracyguida  See you at the finish line. https://t.co/AF9utbdtRz", "@TriQuincharaF Preparados listos 3,2,1...RUN, RUN, RUN. https://t.co/UMYpUqQGME", "@hectorsalas10 Runners wake up before the sun.", "@auke_heins Mocht je verder nog vragen hebben horen we het graag.", "@auke_heins Op dit moment hebben we alleen de Pegasus 34 in de collectie. We hopen dat ze je klachten zullen verlichten.", "@sanzz24 You're the real MVP.", "@mommaruns26 Pics or it didn't happen. Enjoy the trip.", "@mommaruns26 Going long on a Thursday. What's in store for the weekend?", "@JJDugganII We hope you jumped into that pool after your run.", "@joebski Training smart. Here's some tips to help you get even faster: https://t.co/2BPaGLdSf6", "@darienne_marie Sounds like you've got a full calendar. These tips will have you ready for each starting line: https://t.co/QB9cLQ157h", "@CORONABARBERSHP We've got some tips to help you break that 9-minute barrier: https://t.co/J1ldWw0NaG", "@travyharrison As the temperature rises, so does your determination.", "@iDreesCan There's nothing like that feeling of accomplishment. Respect.", "@cooptyhebert Five today. Six tomorrow. Keep it going.", "@thehc3 Way to pound that pavement.", "@wrightmf79 Wake up. Run. Smile. Repeat.", "@lluismclane When the land ends, you keep going.", "@Patlekin Get ready to beat that heat with these tips: https://t.co/6gKYNjkJj3", "@darienne_marie What doesn't kill you makes you faster. Racing anytime soon?", "@anthonycclau Best way to explore is on foot.", "@DerekLSellers Drenched in hard work.", "@udeyxiswadi Blow out your candles. Then blow past the competition. https://t.co/K1CcdWr99K", "@RobertHrabluk The grass is always greener where you're running.", "@xoHelene One week into July, what's the goal for the month?", "@debbierodd She probably ran before she could even crawl. What a natural.", "@ClarissaChicago Crazy 8's. Almost to quadruple digits.", "@JenBeck1126 We have a feeling you're just getting warmed up. https://t.co/SR6WDuEaS6", "@TonyWinward Clear some room in the trophy case. It's raining PB's. https://t.co/BSZY4MZiHE", "@Weligsander He will be chasing the official world record of 2:02:57 at the Berlin Marathon in September.", "@ollielavery Summer is in full swing, and you're ready to conquer it.", "@bijenpattnaik Doing some serious work. Nicely done.", "The stage is set for another breakthrough @EliudKipchoge #justdoit", "@kandicecasey You don't sweat, you sparkle.", "@trashbagdave There is always room for improvement. You can connect with us here: https://t.co/8d1uFRT48a.", "@karlavillarreal Without the lows, the highs can't be reached.", "@AE9941 Sun doesn't set on dedication.", "@knowntravelr Watch out world, you can't be stopped. https://t.co/dwpmZi9rAd", "@ablinkin A match made in miles. How are we gonna celebrate? https://t.co/x9sQLJD2RF", "@iDreesCan Miles bring out the smiles. Getting out there tomorrow too?", "@j15gje You know the distance. Now chase it. | https://t.co/jNe8TOqbOu", "@knorris40 Getting in your mileage. Any races on the horizon?", "@msstacylloyd Better by the minute, stronger by the mile. What's your goal?", "@josefosolis Your skies are clear for takeoff. Take flight. https://t.co/QN0SILIcMP", "@jurinegrinotti Dedication brings distance. What's the plan for July?", "@xinaevans Run free.", "@j15gje You were made for the fast lane. What are you training for?", "@BilliYah Fast today, stronger tomorrow. Recovery is key. https://t.co/X85L4lSbWb", "@RonPipes You never lost it.", "@tkm222 Clear skies call for extra K's. Time to rest, hydrate, and repeat.", "@dranalli The real fireworks were on the street. Nicely done.", "@rmhv0604 Never miss an opportunity to get better. When's the season start?", "@AdamOfWilliams Kick up your legs. You earned that view.", "@ThomasGolding82 Earned your wings. Time to fly.", "@Nick_isdabest If we hear thunder, we'll know it's you.", "@mrk_davis And you're living proof.", "@JApostol3 Earning those midweek miles. Same time tomorrow?", "@smankeyy Feel free to chat with our Running Experts on https://t.co/MgQydOiR1D for any questions and/or feedback. | https://t.co/tiZTNep1rM", "@smankeyy There's no better way. Which pair did you have your eye on?", "@jjzombie13 Schedule for the summer. https://t.co/uumJYOiOeF", "@OSUluvingirl Show us 5. | https://t.co/AQiECqWori", "@OSUluvingirl Overtime always pays off. How far will you go tomorrow?", "@creativeauditor Miles on repeat. How's the training coming along?", "@carumuga Time to push yourself further. | https://t.co/cwHVNuKviK", "@Drummaboy_MikeD Bring the fire and the miles will follow.", "@ChonnaParker Can she run a 5k doe?", "@joshmkerby ... and fast. https://t.co/2nRlEqxhEY", "@theresa248 Running back and fourth paid off. How far tomorrow?", "@Drummaboy_MikeD You've got the speed but can you go the distance? | https://t.co/zENtHPgTcb", "@daniellericks Time to fuel up. | https://t.co/3Ovvr27vMm", "@EmperorOOMK Stay ahead of the chaos. 8k coming soon. https://t.co/Rn90kIgESw", "@Chels_Espo You know what's next. 5 miles tomorrow.", "@pearson_ality Let's get you back to where you want to be. | https://t.co/SamAts5F8i", "@robertdelfave Gravity couldn't stop you. We'll see you tomorrow.", "@momma__perry Staying connected through long distance.", "@tancheekwang No rest for the fast.", "@JenBeck1126 Let freedom ring. https://t.co/Fg56dQZlct", "@bring_u_JOI Done and dusted. When do you lace up next?", "@dowhatulove247 The flag wasn't the only thing flying today. Did it come with a PR?", "@tray_80 Running free. How's the training coming?", "@Nike @blurhino77 Make it rain. https://t.co/4rHxdE89pp", "@srinivas88 Stronger by the day. What are you training for?", "@kayla_harlow1 Because no one got faster by staying inside. https://t.co/d8HbsJtEcN", "@tdrosen Dedicated to distance. Volt is around the corner. https://t.co/N3LYJM6Ykw", "@AE9941 Cool down like a boss.", "@IfUSeekDrew The sweet taste of victory.", "@stylist_raven Connect with a Running Expert to help you find the perfect running shoe. | https://t.co/xWt21rfHUa", "@Baldini44 And Tuesday, Wednesday, Thursday...", "@ivesays_ Welcome back. https://t.co/puVzAWqMtx", "@sam_fantastic Better fuel up, we have more ground to cover tomorrow.", "@brandon__snyder Ready to turn things up a notch? | https://t.co/bPU6Tk8sAG", "@dowhatulove247 You're off and running. Keep the streak going. https://t.co/anSTY47OTr", "@j2krugler Setbacks make for the greatest comebacks. https://t.co/wPbzxmiHNs", "@ribeiroandreia9 Recover faster for a fast finish. https://t.co/afGMAb1ehx", "@BilliYah 1 down, unlimited to go. When do you lace up next?", "@BigTanelly Early morning commitment. Every day progress.", "@bbbusbee The date is set. Have a goal time in mind?", "@JBlaze23 Your fastest times are ahead. What's in store this week?", "@bbbusbee It starts with a fast foundation. When's the race?", "@BearwithKyle Don't be late. We've got work to do.", "@Nike @samthomas_20 See you on the mountain. https://t.co/TFZehTLvNU", "@leepalisoc A faster you is on the horizon. When do you head out the door next?", "@RAFAEL_O_CAMARG Level does not exist. Only direction to go is up. https://t.co/ifeHNOKgnL", "@TMobilejacket Every step leads to success. Enjoy the journey.", "@amartinezribot Encuentra en https://t.co/MgQydOiR1D las Nike Free RN Flyknit. Podemos ayudarte a hacer la compra.|https://t.co/Csio4xffGh", "@zoeesl Our kind of Sundays at the beach.", "@OSUluvingirl Views are best when earned. https://t.co/rk2LzHd5cg", "@daniellericks We'll hold you to it. | https://t.co/eyra65wGqO", "@mymanhenri Distance today, speed tomorrow. https://t.co/x71e2gt5Uj", "@creativeauditor Consider it done. | https://t.co/jMAqxtfBpi", "@KAMONIHASISSUES Less selfies, more miles. https://t.co/sGGPbxDjyA", "@creativeauditor You mean stronger and faster?", "@AE9941 You can't be stopped. How do the legs feel?", "@daniellericks Done and dusted. How far will you go this week? https://t.co/WU0OXjoewj", "@tril_lian You know what they say about slow and steady...", "@RobertHrabluk But can you do it faster?", "@jasondmitchell Makes you wanna... https://t.co/4ONWGsYCpd", "@jjzombie13 You came, you saw, you ran. https://t.co/JJJgAFvDCH", "@JasonMilholen Miles away from home make you stronger. How'd it go?", "@TonyWinward Might? https://t.co/XEI1oTvPCj", "@EmmaCGiles First of many. Think you can keep the streak up?", "@Broonland Let's get you to where you want to be. | https://t.co/PjiHI4itU1", "@PickMW0105 Celebrating the best way we know how. https://t.co/gEXEI6Oy8s", "@Luckbao You've done it before, now do it again. Saddle up. https://t.co/dT5OufvubP", "@mtbodkin How'd it go?", "@B_Alfa14 Every mile matters. https://t.co/7Qix7ZrDFe", "@djsantero Continue to push ahead. Progress never stops. https://t.co/ipdetHyttT", "@MikeHockings Stirring up for the perfect storm. Did it come with a PR?", "@woogidy_woogidy Solid work. Ready for Mo' miles tomorrow? https://t.co/cvEfMZy4YG", "@trashbagdave Recovery days are just as important as fast days. How'd it go?", "@MoeDLeeIV The sweet taste of victory.", "@MustafaAbdElhak A relationship that'll go the distance. Here's to many more. https://t.co/7c4k7h9Xvv", "@Baldini44 The clock is ticking. How's the training coming along?", "@nikemike777 Same time next week? (and every day in between)", "@TonyWinward Triple threat. Which record will you chase next?", "@Bob_ooo Up and at 'em. Training for anything specific?", "@ablinkin Headed down the homestretch. Have a plan to get there?", "@wilfriedboh Progress has no boundaries. Any races on the calendar?", "@K_Dons15 From one Kevin to another... https://t.co/ZY6tPLanZT", "@Baptuitsme Sip some tea, then run again. https://t.co/0RKuR7p4pm", "@djsantero Every step counts. What're you chasing next? https://t.co/yW6lkxJEDu", "@tkm222 Improving with every run. What're you training for?", "@meserloz Run. Recover. Repeat. https://t.co/ZUL85NQHwC", "@turki1478 Continue to push yourself. How far this week?", "@fitsmallpackage Living life on the run. https://t.co/RMMg3zRGNF", "@robertdelfave The only think you should be looking back at is the competition. Leave 'em in the dust.", "@4rifgunawan The weekend may be over, but there's still work to do. Get after it. https://t.co/4ZRJghD2oC", "@dowhatulove247 Because no one ever got faster running on excuses. https://t.co/GrSsgJQN1D", "@stephen_stritch Building strength with every step. When's the next?", "@clestoak Fast isn't alway pretty. What are you training for?", "@Jevon6_ Heading the right direction. Have a goal in mind?", "@edwarsimal_emp Better by the minute, stronger by the mile. Keep pushing.", "@Nike @timjonesy Speed is earned. https://t.co/9PAOaELDHq", "@KABoutwell If it doesn't challenge you, it doesn't change you. https://t.co/nRxpsdibHy", "@MarkAbbott604 Fast is your only speed. https://t.co/1bzk29ZzqU", "@brandon__snyder New month, same dedication. What's the plan for July?", "@jluckyar15 We're here for you. Go ahead and follow this link to find out how challenges work within the NRC App. | https://t.co/SIbqLqdcbo", "@KAMONIHASISSUES Taking a run on the wild side. https://t.co/qBKwfbJU5c", "@trashbagdave First of many. What's in store for tomorrow's flow?", "@chapshots Light up the streets. How far tomorrow? https://t.co/rw67kUF3S4", "@avalencia212 Fueled for fast. | https://t.co/SiaapAkxXs", "@QuinnCFR Or if you just set your mind to it and... https://t.co/rtZmiZ0fWk", "@vnogueira09 Run and chill? | https://t.co/HY000ybDHp", "@ivgoat We've got you. Check out the #hashtag leaderboards under the new NRC Challenges section here: https://t.co/qHqsjOreqZ", "@hectorsalas10 Prize is a faster you. Now focus on recovery to get ready for the next. | https://t.co/S2huqAg2WB", "@steveserra Like you never left. How far tomorrow?", "@tril_lian You woke up hungry. How'd it go?", "@FareedaMabry We had a great time. Are you free tomorrow?", "@JHairston2 Let your feet lead the way. Training for anything?", "@AE9941 Who runs the world? Still Adrian.", "@Chrissy_Aranha Only thing is putting them in motion. When do you lace up next? https://t.co/LYOv2J9gJ6", "@adam272012 Finding your strength. What's your next goal? https://t.co/1Zp4b2IzRQ", "@Drummaboy_MikeD Building up that endurance. We like where your heading.", "@AE9941 Balanced training is key. What's in store for July?", "@trashbagdave Speed isn't earned by taking it easy. Solid work.", "@BilliYah Bring on the weekend.", "@BeardownSkylar Run, Skylar, Run.", "@IronCobra You can't be stopped. What's the goal for July?", "@NeemYoga Speed, strength, and endurance. You can do it all.", "@Karan7singh When a good thing just keeps getting better. https://t.co/VEXaCXckai", "@ChonnaParker It happens. Hydrate for more miles tomorrow. | https://t.co/aLohizPIWE", "@lrocks09 Squad goals. https://t.co/0HvWYjT3Is", "@belenmezag Running in circles and getting somewhere.", "@mrPeute Good job, volgende keer paar kilometertjes erbij? De platinum badge is in zicht.", "@Asedad73 Make sure you're prepared for round two: https://t.co/PA78syjga7", "@tkm222 Rain can't stop you. 9.99 KM tomorrow?", "@tobylamon It's not where you start, it's where you finish. Coach will help you with the journey. | https://t.co/dqwzsuFrb0", "@LyricalEleMEnt @RobertHrabluk, think you could show her the ropes?", "@tobylamon Way to get out there. What's on the calendar for tomorrow?", "@cjohnson397 Many dream it, but few achieve it. Congrats on this milestone.", "@jjzombie13 An endless horizon to chase.", "@Jorr313Det Always run in the fast lane. https://t.co/Rt3hZvt6bM", "@JenBeck1126 Miles crushed no matter the terrain. That's what matters.", "@BilliYah Good reason to smile. How'd it go?", "@RobertHrabluk Appetite for greatness. Stay hungry.", "@juustBam Put them to work. | https://t.co/cKbhAvAsM1", "@Nike @charles_earley Break the sound barrier. https://t.co/t0mT5wVkFx", "@CharlesHChapman Upping your mileage and keeping pace. Sub-7 coming soon?", "@brandy_n_coke Ready to put that fitness to the test? https://t.co/S2MvOHVf31", "@Nike @JRFox10 Mornings are made for miles. https://t.co/O7O7nsnHnX", "@EmaLeto84 Nothing wrong with taking a rest day. Recover, and come back even stronger.", "@edwarsimal_emp Never too late to start. We'll see you at the finish line. | https://t.co/iADEiIPLm1", "@athleisureist Our in-store athletes would be happy to direct you to local routes and running hotspots.", "@athleisureist Although there are no official run clubs we would recommend heading to the local Nike stores.", "@TonyWinward Motivation is key. Let's add another 7 miles tomorrow.", "@edwarsimal_emp Back at it again. What's the goal, Edwar?", "@brandon__snyder Never not moving, Brandon. Any races coming up?", "@RodFindlay We are with you every step of the way.", "@JBlaze23 Does Eevee have a training plan? Let's hook her up; https://t.co/pVOfB4Sd37", "@brianv_graphics Challenge complete. Beast mode unlocked. https://t.co/22mpW5rvyM", "@brucemclean_mac Installation failed. Error message 404: Summer is not available in your country, please try again soon.", "@Sya2Times Consistency is key. One of our training plans will help you unlock your potential. Check them here; https://t.co/s9WjwL1dCa", "@kandicecasey Make progress not excuses. https://t.co/R9WW3o3RNk", "@Sya2Times 4 down, unlimited to go. What's your goal?", "@GlennHolmesLA Done and dusted. How do the legs feel?", "@creativeauditor Almost a month out. Let's get you across the finish line faster. | https://t.co/GgAOwbjGdg", "@robertdelfave Fastest kid on the block.", "@rahil_juneja Green means go. How far will you go in July?", "@schmee_ivee Shaving seconds off the clock. Competition better watch out. https://t.co/BOUgIsLBby", "@creativeauditor The fast lane is calling your name. What are you training for?", "@Smit_talks Don't stop there. | https://t.co/MXtnf9pvTs", "@JBlaze23 Just another jog in the park.", "@MoeDLeeIV Pavin' the streets with rubber. Do you have a goal in mind for the end of summer?", "@Fit_not_Skinny Smiles for miles. Push it to 20 come July?", "@JApostol3 You woke up hungry. How far tomorrow?", "@EmaLeto84 There's no stopping you. Can you reach 20?", "@justdongon Covering ground one block at a time. | https://t.co/drd1DNizqg", "@Eric_D_Jackson You're going to need a bigger trophy case. https://t.co/g22R1NMPcw", "@sam_fantastic The starting line is calling your name. | https://t.co/btYFP5PuIn", "@KryptDANite Leaving the competition on another planet. What are you training for?", "@sam_fantastic No rainin' on your parade. How many miles are in the forecast this week?", "@JenBeck1126 Speedwork in disguise. How's the knee feeling?", "@HeathMeadows Double the fun.", "@MikeBaze4015 Focused for the next 500. Training for anything? https://t.co/83UNCDk02Y", "@EduNogueiraDev We are in your corner. Keep us updated.", "@Ant_Judge Every step is progression. Keep moving.", "@PUSH4EVER And with days to spare. Welcome to the club. https://t.co/ZD9Mxylmzy", "@FarAguirre You're not showing any signs of slowing down.", "@tril_lian Which came first, the coffee or the kilometres?", "@maurigallardoc Impressive month. Any goals for July?", "@talmekia Speed in numbers. https://t.co/RRtI6bosdU", "@edwarsimal_emp There's only one way to go from here... faster. | https://t.co/9UxhpAup6v", "@wiscoinferno Never not working. You're hustlin'.", "@brianv_graphics Two is better than none, but we think you've got more in you. Up for the challenge?", "@yandimartinis30 Hard work doesn't go unnoticed. What are you training for? https://t.co/kIvOcLYOaj", "@AWeisman1ceSaid Greatness is a choice. https://t.co/3mHBAalkaU", "@rdot333 Comeback season. Are you training for anything in particular, or just shaking the rust off?", "@AWeisman1ceSaid There we go, thought we'd lost you already. How'd the run go?", "@EduNogueiraDev Mission accomplished. What's the next goal?", "@jnbdesigner You're back and ready for more. https://t.co/SZHzLmmYRR", "@kahahuna Hey Jess, thanks for the feedback. We have passed it along to the appropriate team. Let us know if we can assist you further.", "@WaukeSlosh Sorry to hear. Let's see how we can help. Please send over a few screenshots of what you're seeing.", "@daniipage3 Just to clarify, a negative split means you ran faster than your previous lap, which is a good thing. | https://t.co/siT3DvLcow", "@daniipage3 The only negative thing about that run was your splits.", "@BigTanelly The more you run, the better you get. Keep at it.", "@Mateo47 For future updates regarding promotions, we recommend creating a free Nike+ account here: https://t.co/7NYxmzRDaU (2/2)", "@Mateo47 Use SUMMER20 to take 20% off all clearance items here: https://t.co/yjFh88mZIY. It expires today, 6.27, at 11:59 PT. (1/2)", "@SoCal208 Hungry for miles instead. Have a goal in mind?", "@BigTanelly The focus is back. When's the race?", "@JenBeck1126 Faster together. Find your motivation at the top.", "@Ant_Judge Everyone has barriers. Let Coach help you break yours. | https://t.co/Kk47f5mIXE", "@sophie_denton We've decided to make some changes to our NRC setup. Check your DMs for additional info.", "@MarieAlojado You're in for a fast finish. How'd it go?", "@tancheekwang Train fast, run faster.", "@cooptyhebert Progress comes from being uncomfortable. Let's see you push it to 6 next run.", "@J_Oliver6 Set your goal, and never settle.", "@MarieAlojado Less than a month till showtime. Continue to push.", "@Mateo47 Check out the Nike Air Zoom Pegasus 34 (https://t.co/fAHaoBHu8C) and the Nike Air Zoom Wildhorse 4 (https://t.co/OqzHVtbCLA).", "@Y0ung_KTizZle Progress happens one step at a time. What are you training for?", "@BengalaMan And you'll keep doing it.", "@phillybluntsUS It's gonna be a fun summer. https://t.co/05P4eszGcV", "@J_Oliver6 Everyone's a beginner at the beginning. When's the race?", "@Mateo47 Sounds like a question for us. Do you prefer a more natural, responsive, or cushioned ride? What have you worn in the past?", "@adam272012 Sub-7 = Broken. What're you chasing next? https://t.co/zZQQqjSugn", "@xoHelene Another week. Another goal to crush.", "@RobertHrabluk Find your endless trail.", "@Aalaa_Alhashemi All the best superheroes change their outfits.", "@TonyWinward Second to none, Tony.", "@edwarsimal Numbers don't lie. You'll be lapping competition.", "@MiKeKtracho Welcome to the team, we're faster here.", "@hectorsalas10 You've got the mindset, now bring on the miles. https://t.co/I0pgg8e35Y", "@melissapaniagua Your dedication is in full bloom. Don't stop now.", "@hectorsalas10 But the work's not over. How far will you go next month?", "@Baptuitsme We've been waiting. Ready to double up on distance? https://t.co/dWpUD1pGqm", "@Smit_talks We'll hold you to it. See you then.", "@brandon__snyder Good boy... you too, Brandon. You two ready to go again tomorrow?", "@Smit_talks Showing Monday who's boss. When do you get back out there?", "@Greg_Gampel Only 9 more miles until we all eat.", "@B_Alfa14 Way to bring the heat. Can you push for 5 tomorrow?", "@AliK_AliG Worth it.", "@LovedbyJay You provide the miles, we'll provide the cheers. https://t.co/KId3rxKxat", "@laurent4508 Melting bricks and pavement with every stride.", "@sam_fantastic Not all superheroes wear capes. Or shirts for that matter.", "@martinlanders77 Appreciate the feedback. We'll be sure to pass it along to our team.", "@stylist_raven Consistency is the foundation of progress. Keep checkin' in with us along the way.", "@brucemclean_mac The path to progress is in clear view. Keep working.", "@TheBerner Get notified here: https://t.co/S2M6Wpb5Y5.", "@aderolo Endurance doesn't build itself. Can you push for 4?", "@TonyWinward Early bird gets the PR. Still atop the leaderboard?", "@iam3Staxx The month's not over. Think you can hit your original goal of 35? https://t.co/0V9qYrHlVg", "@Nike @Bowenea234 We don't blame her. https://t.co/diCt1I3dmR", "@BengalaMan Kicking off the week on a fast foot.", "@stylist_raven One step closer to a faster you. Training for anything specific?", "@adrianrmr The breakfast of champions. But just in case you want to switch it up. | https://t.co/luyLnVta1f", "@CharlesHChapman Welcome to the breakfast club. We're going for gold. https://t.co/LFAjTte7Rs", "@srinivas88 Why wait? | https://t.co/HfDi9N4Oll", "@lrocks09 There's something magical about running with the sunrise.", "@Fit_not_Skinny Words to live by. Waking up hungrier tomorrow?", "@srinivas88 The journey is always worth it. What are you training for?", "@kandicecasey We know the feeling. Running today? https://t.co/R2MJxzd4h1", "@JenBeck1126 Monday started off right. What's your goal this week?", "@CatMoore26 Our calendar is marked. Continue to keep pushing.", "@MaritasCorner Your training doesn't take a vacation. What's the goal this week?", "@GireeshS22 Rome wasn't built in a day. Keep building upon your success and feel free to hit us up if you need any tips or advice.", "@PhilippeCrols Tijd om wat Personal Records te verbreken.", "@IamErickD Finding your fast. How far will you go this week?", "@EmaLeto84 Celebrate today. Focus on 14 tomorrow. https://t.co/2stZBqTqH3", "@spicegirldst8 Speed is on the schedule. Same time next week?", "@CatMoore26 Weekend complete. Training for anything?", "@daniellericks Sundays are for sweat. What's in store for Monday?", "@jjzombie13 Training never stops. Will you reach 52 weeks?", "@Drummaboy_MikeD You're heading in the right direction. | https://t.co/h1HeqGP3PB", "@roddito How many weeks have you been training for the marathon? We can go from there.", "@KAMONIHASISSUES Sky's the limit. Whose going to stop you?", "@Ant_Judge No rest for the fast.", "@Drummaboy_MikeD https://t.co/OCTpZIvecu", "@gdubeaux That post-run feeling... https://t.co/0wgBOia5yh", "@chriscracklePOP Smells like you're cooking up a PR...", "@ChonnaParker Keep those laces tied, there's still work to do. What's next?", "@j11blackmore Look cool, stay fast. | https://t.co/04wLaQrd1I", "@iksnivek You woke up hungry for miles. What's your goal this week?", "@pmitchell33 Up and at 'em. There are miles to conquer. https://t.co/2oWyyL7ZUz", "@sayyessel Pressure makes diamonds, right?", "@EmaLeto84 Always on the move. How far today?", "@TheBerner No news to share at this time. Sign up to be the first to get notified when it arrives here: https://t.co/MiETHBa1ea", "@ShoeLacyLace Pushing each other to greatness. Where to next?", "@CoreyKitchener ... and you're not stopping anytime soon. https://t.co/QJmWc5J2Py", "@djridley We'll save you a spot on the podium. You're in a league of your own.", "@GireeshS22 Well... How'd it go?", "@BrianReamBrazil Makes you want to get ready for the next... https://t.co/T70LhicslL", "@jasondmitchell Keeping your motivation high. We'll see you next week. | https://t.co/fCFHgT4VDK", "@mrmikegolf Green means go. How far this week? https://t.co/fI4pnozlNS", "@mabathoana Dedication that goes the distance. More today?", "@AustinJoe2012 Your dedication doesn't run short. https://t.co/AqUVTGeIG9", "@roddito Our calendar is marked. How far today?", "@AustinJoe2012 Starting small but going big. What are you training for?", "@fatusfee 5 mile goal complete. What're you chasing next? https://t.co/CCAxBaswHL", "@mdlfilming Things are starting to get serious. | https://t.co/8AwzWMSekm", "@wilfriedboh Make it a routine. | https://t.co/X97D1XJeTK", "@darlingdede A breakfast that will go the distance. Training for anything? https://t.co/1fETJOj7Qm", "@iamRICKS Break your own records.", "@djsantero Recovery goes a long way. How far this week?", "@dowhatulove247 Faster by the minute, better by the mile. You got this.", "@hectorsalas10 No one gets better by stopping. https://t.co/SnohaJ1Q6T", "@creativeauditor You delivered distance. Ready to bring the speed? | https://t.co/oyDgucKX44", "@fatusfee Weekend's off and running. How'd the legs feel?", "@JApostol3 Schooling the competition. Have a goal in mind?", "@decollery 7 down, unlimited to go. How far tomorrow?", "@eyelidd_ Set a goal and chase it. Now let's go for gold. https://t.co/uDXDVtohCu", "@willstreissguth Miles set in stone. Where to tomorrow?", "@roddito Weekend warrior. What are you training for?", "@TonyWinward Overtime earns medals.", "@BLWilliams11 Earning. Your. Hardware.", "@marleeandmeeee Oops, you just got faster. What's in store today?", "@Brandon_Runs On track for 65. Can he do it? https://t.co/k9z8uf53Hy", "@Jorr313Det Think tomorrow the early bird can catch a PR?", "@mabathoana Focused on a strong finish. How'd it go?", "@MrDougCarnahan Not messing around. What's your goal? https://t.co/tqGqtk4fgH", "@trappistbeing You vs. your excuses. https://t.co/EMVhHgc5EM", "@mrmikegolf You'd be surprised how much you gain when you're losing. What's the next milestone? https://t.co/MbOavp8cG6", "@rupert1975 Saturdays are for the PRs. How'd the legs feel?", "@QuinnCFR You've got more in you. Retirement can wait another year.", "@schmee_ivee But who had the faster finish?", "@brianjboyle Running and coffee, it's sure to give you a kick.", "@JenBeck1126 If you're running, you're improving. Any races coming up?", "@danadinosaur Quadruple digits coming soon. What's your goal to reach 1,000? https://t.co/MFKvkCaj3b", "@AE9941 Speed in numbers.", "@juangarciaCA Running for show. Training for anything? https://t.co/Cf0kQm4XAN", "@xoHelene When you get to your goal, then push past it. https://t.co/GyMhYaHWQ5", "@Angeli_aka_FUE No news to share at the moment. Keep your eyes on our events page for any updates. | https://t.co/EcvQXhWVC5", "@xoHelene We're checking in. Get to 26 for the week?", "@themissjenn Sounds like progress. Nicely done.", "@wildfiretrading Thanks for sending that. That's 2:15 total rest, or just over 10 seconds of rest between sets. Let us know how it goes.", "@adam272012 Clear some room in your trophy case. We know there's more to come.", "@gdubeaux The credit is all yours. https://t.co/AqRF05MOC7", "@AppleyardJoseph Startin' the weekend sweaty https://t.co/bjL1qxco4q", "@GregGigs Summer: 0, You: 1.", "@JBlaze23 Serious squad goals.", "@MalindaAnnHill Boom. Make sure you're keepin' cool in this summer heat. | https://t.co/mCx5iblJTs", "@TonyWinward That's just smart training. Race hard, recover easy.", "@MalindaAnnHill This calls for a celebration. How many miles will you get in today? https://t.co/DoSzkjkajh", "@wildfiretrading Here to help. Just to make sure we're on the same page, can you send us a screenshot of the workout instructions?", "@FitAtLII Keep up the momentum.", "@EmaLeto84 Ten gold stars from us.", "@AggieRuns Busy year. Keep us up to date with your achievements.", "@tonipime Progression is why we do this. Any races coming up?", "@themissjenn We'll hold you to it. https://t.co/3MImQZlAHE", "@falbiii Earning your wings. Keep flying.", "@JBlaze23 Summer season calls for longer miles. That's what we call fun.", "@TonyWinward Exactly right. Congratulations on breaking your 5K &amp; 10K PB.", "@plgcorea Hear that? Sounds like progress. https://t.co/iyNVyrs5M3", "@mrmikegolf Thanks for the feedback. We've passed it along to our team. Let us know if we can assist with anything else.", "@lumaca81 Always set the bar high. How far tomorrow?", "@_xshinex No matter what you're training for, Coach will have you ready. | https://t.co/Jitsfr1LYt", "@sam_fantastic Fast just got faster.", "@mabathoana Faster and faster. Ready to put your speed to the test? https://t.co/zWRiopCS8W", "@bharaj_rohan Getting in your daily dose of 5K. How's the body feeling?", "@Steve009J It's a lifestyle for you.", "@JenBeck1126 Nothing like having your biggest cheerleader always by your side.", "@GreggDSchroeder Appreciate your input, and we will pass along your feedback.", "@Billy_Dengel Any weather warrior. https://t.co/qduNgSGLFN", "@AggieRuns Recovering the right way. When's the next race?", "@avalencia212 Complex routes, simple destination.", "@Drummaboy_MikeD Trail blazer.", "@JBlaze23 Running with purpose.", "@QuinnCFR When the land ends, you keep going.", "@theresa248 Finding your fast. Let us know how it goes. https://t.co/GbTYjq7bjd", "@EmaLeto84 https://t.co/83of4dt5cY", "@_xshinex Every mile serves a purpose. Training for anything?", "@motherlover227 Build strength during your time off. | https://t.co/6a7dnOtxLh", "@SoCal208 Progress doesn't take a vacation.", "@jenny_querry Recovery has never tasted so good. | https://t.co/hgToqXUJar", "@EmaLeto84 Let's talk after the sweat.", "@EmaLeto84 Almost a perfect 10. See you tomorrow.", "@theresa248 Longer days call for longer runs. How far tomorrow?", "@joshdmorg You've set the bar HIgh with that milestone. How will you celebrate the next one? https://t.co/3Vy0PBl0Ji", "@bijenpattnaik Building strength with every lap. https://t.co/76OFk9gaXS", "@fatusfee It's going to be a fast weekend.", "@BreezyLaundry A win is a win. Let's unlock silver by getting to 25.", "@PolinaKerman Putting the work in. Have a race on the calendar?", "@Jeffrey_Denny We're in. Training starts now. | https://t.co/du795OLSqr", "@CharlesHChapman Miles for breakfast.", "@fatusfee The starting line is calling your name. What race? https://t.co/fDf27tcZqi", "@cooptyhebert Outrun the elements. Have a goal in mind? https://t.co/M9lAFkUx6d", "@ashleanthony Miles &gt; coffee. Are you currently training for anything?", "@kandicecasey Welcome back. What are you training for now?", "@Vernaeve Can't stop the heat when you're bringing the heat.", "@3LWTV Motivation is key. Just do it.", "@RandyStpatrick For further information on the Leaderboards, take a look at this link: https://t.co/LX4Y0aEXZC. (2/2)", "@RandyStpatrick The Challenges are currently unavailable in NRC. However, we advise you to use the Hashtag Leaderboard in the app. (1/2)", "@PolinaKerman Running rings around everyone. Have you checked out our 10K training plan? https://t.co/IhHUH7wvOi", "@FitFlyFellow Better late than never.", "@bennettrun Do call it a comeback.", "@_m0cc0_ Think you can hit 2000 by 2018?", "@IfUSeekDrew Keep putting one foot in front of the other.", "@thetitchmark147 You're lapping everyone on the couch. Keep it up.", "@Smit_talks Make every step a step towards progress. https://t.co/VRYZ3EDxXd", "@marcam713 We know you'll find one. When you do, let Coach help you unlock your potential. | https://t.co/G1fRrsyplb", "@brucemclean_mac Evening K's with a view. No better combination.", "@GreenHalo42 If we hear thunder, we'll know it's you.", "@marcam713 Green means go. Any races on the horizon?", "@uknowjmac We hear you and will pass your suggestion along to our team.", "@uknowjmac Challenges are now featured in the NRC App through the hashtag leaderboard. Learn more here: https://t.co/bInVXHGBPx", "@jjzombie13 Go from river to race. Training for anything?", "@iAudrey Nice, Audrey. Ready to break a sweat? | https://t.co/B4q1IynJGj", "@JenBeck1126 Words to run by. https://t.co/y3LoaK9FnK", "@srinivas88 Barriers are meant to be broken. Well done.", "@djsantero Milestones are best when you're sitting atop the leaderboard.", "@nathankunicki We have changed our NRC set-up. For local route suggestions and workouts check out: https://t.co/flDGn9IHm6", "@xoHelene We'll hold you to it. See you at the end of the week.", "@fatusfee There's strength in numbers. Let us know how it goes.", "@itsDJCroft You're back and ready for more. | https://t.co/2YEgpj2sLA", "@Pierremgb Thanks for hitting us up. The Flyknit Racers will run true to size. Let us know if we can help answer any additional questions.", "@Lauramchapman Starting the week the right way.", "@cardsdalisay https://t.co/V04OtHrWFg", "@PolinaKerman You're never too old to work on yourself. What's the goal? We may be able to help you get there.", "@ladyxlight Milestone made. Think you can clock another 100k in the before 2018?", "@julio_sarabia Be there and run square. What's the goal?", "@maurigallardoc Putting in the KM's. Any races coming up?", "@creativeauditor Coach will have you ready for the starting line. https://t.co/qG4hjfFiCT", "@creativeauditor The real fun starts now. When's race day?", "@nbreitbach No word yet, but stay tuned to our Nike+ Events page for updates. | https://t.co/LFQFH9sLVP", "@BigTanelly Issa lifestyle.", "@ericemley Looking fast. How'd the run go?", "@talmekia Monday blues? Never heard of it. https://t.co/xS1HPQkJhy", "@xoHelene You're off to a strong start. How many miles this week?", "@SuccessMalefa Going the distance. It's like you never left.", "@AE9941 You make running a work of art.", "@johnnyvisable Your week's off to a running start. Any upcoming races?", "@beckyburris_ Aren't you glad you pushed through?", "@RobertHrabluk Growth comes from being uncomfortable. Let's see you run 4 next time.", "@MaritasCorner We know of worse places to train. Feel free to check in with us once you're overseas.", "@trappistbeing Pushing has paid off. Double the distance = double the reward.", "@GireeshS22 Lighting up the way.", "@Eric_D_Jackson Sunday sun chasing.", "@bijenpattnaik Homestraight to greatness.", "@Jeroen_Reinders Een fantastische invulling van Vaderdag.", "@hectorsalas10 The goal is set. We'll hold you to it.", "@hectorsalas10 Above and beyond. Same time next week?", "@kandicecasey That was just the appetizer. Look out Chicago.", "@bdrake25 Setting a great example.", "@jjzombie13 Making your competition disappear.", "@vickibrightside Crushed it. Celebrate today, back to work tomorrow. https://t.co/oXurVTDzbE", "@Alvamstrong Natrual born runner.", "@ChonnaParker You know what they say about slow and steady...", "@jerseycowboy3 5k in the books. What's your goal?", "@subhasha7x Unlimited dedication. How'd it go?", "@GireeshS22 Have a goal time in mind?", "@GireeshS22 First of many.", "@JenBeck1126 We know where she gets it from.", "@EmaLeto84 When's the race? https://t.co/u2MMz0A9eK", "@rupert1975 Kickstart your recovery. | https://t.co/4HBnJlE4dv", "@fatusfee Earning your speed. Training for anything?", "@mu_ester Keep us in the loop. We'll find a plan that will get you across the finish faster.", "@laalaa_22 You're not one to dog it. Now let's recover for the next. | https://t.co/cGIe611odC", "@mu_ester Eyes set on Purple. What's your goal for the marathon?", "@rupert1975 Faster by the week. How do you plan on cooling off?", "@Tehbeardedgamer They've gone the distance. How far will you take the next pair? https://t.co/7ioOc2kHcW", "@Sill_Lino See yourself breaking the tape. When's the race? https://t.co/dELWWWoCiC", "@dowhatulove247 You're finding your wings. https://t.co/ENXMSD75Mq", "@LadyPacolleen Ran always sounds better than run. 10k soon?", "@Sill_Lino Nothing's clouding your dedication. What're you training for?", "@AWeisman1ceSaid Your followers have been warned.", "@leebear81 Striding in the right direction. Have a goal time in mind?", "@DaleSharp66 Beginning of a legacy. How'd it go?", "@sam_fantastic Speed is up to scale. How's the training going?", "@Fit_not_Skinny You woke up hungry. Have a goal in mind?", "@lxd1 Don't sweat it. | https://t.co/Faqnzfl0Sp", "@TiaraBeth Coach will guide you to the finish line. | https://t.co/X3M2V7PijR", "@iam3Staxx Bronze and not done yet. What's the goal this month?", "@jjzombie13 Only one way to go. https://t.co/hljI8zVreZ", "@cheetosky Rock on. Any races coming up?", "@BigTanelly We'll keep an eye out for Deebo.", "@ChonnaParker Turning over a new leaf to a better you. What's the goal?", "@AE9941 All eyes on you.", "@OSUluvingirl Time to add another trophy case. https://t.co/Q2XS8qW6pR", "@subhasha7x The gift that keeps on giving. https://t.co/fv9xglL6hI", "@RobertHrabluk Lightning strikes twice. Keep rumbling.", "@Vin1nair Think you can hit it by July? We sure do.", "@subhasha7x What's the goal, Subhash? We may be able to help you get there.", "@StasSlender Welcome to the club.", "@rupert1975 Rest up. Your legs will thank you tomorrow.", "@OSUluvingirl Every mile does count. Training for anything in particular?", "@hectorsalas10 There's no such thing as bad weather, just soft people.", "@vickibrightside We'll be cheering for a PR. https://t.co/uR0M0WNSC7", "@KarinaJunker Warm-up is over. Time to get serious. https://t.co/Sg6Yo3kbFp", "@RobertHrabluk Miles crushed no matter the terrain.", "@alex_trenton Keep bringing the miles, he'll keep bringing the laughs.", "@TonyWinward Share your results with us. Get ready for a PR.", "@MalindaAnnHill Just past the halfway mark, keep pushing.", "@AndersReynolds Finish line is in sight. Will you be breaking the tape come January?", "@tril_lian With no signs of slowing down. https://t.co/vHuptDLm2I", "@brucemclean_mac Celebrate the run with a cold one. | https://t.co/ewlZ0t21pr", "@rowiro Consistency is a cornerstone of achievement.", "@rowiro Trails call for more KMs. When are you getting back out there?", "@cjhampton06 There is no finish line.", "@AbYwOoDs You're anything but slow.", "@Nike @Starengu A little rain won't stop us. https://t.co/EsIxQTqY4K", "@mentlemadness New PR's on the path to progress. Keep pushin' your limits.", "@iAudrey Make every step a step towards greatness. https://t.co/44ouJmAIBE", "@CallmeminiKC Steady diet of miles. What's in store for the weekend?", "@TonyWinward Harder, better, faster, stronger.", "@jnbdesigner Early bird gets the miles.", "@brgale1 Imagine what you could do with a plan. https://t.co/zWLCx2Pa8U", "@sumit6500 There's no stopping you. Got a race planned?", "@AE9941 Family first.", "@danisworkingon We will no longer host live sessions in 2017. Check out https://t.co/lx9TD0GkTQ and https://t.co/ZiPPcVwhi2 for NRC updates.", "@rupert1975 Looks like your Ks are heating up.", "@GregGigs Built for miles. How far will you take them?", "@JenBeck1126 6 down, countless to go. https://t.co/JpFdF2RBBl", "@BigTanelly Never skipped a beat. Welcome back.", "@rosiita Your fast has no limits. https://t.co/qNfsUpJJRu", "@adam272012 Ready to break 7? | https://t.co/b3mYgaekEV", "@admiralnignog Making Coach proud. https://t.co/brqyhqwm6x", "@NBrentegani No dates have been determined on a race series, but be sure to check NTC and NRC for events near you. | https://t.co/7we8PUxgq6", "@ltl_ash You've got the gear, now it's time to go the distance. Check in with us after your first run.", "@xoHelene Turning negative's into a positive. | https://t.co/YjUU0Cec4G", "@ChristalLRyles What's Wednesday got in store for you?", "@Barker57Steven Forget the car, grab your shoes and keep pace with @TonyWinward.", "@ianfrommontreal On course for success. Keep us in the loop with your progress.", "@bijenpattnaik Unstoppable.", "@KAMONIHASISSUES Putting in the hours. https://t.co/SzBXmKL26V", "@brianv_graphics Back at it again. What's the goal?", "@dowhatulove247 Picking up where you left off. Sub-2 is yours. https://t.co/iaOUF3Oy6W", "@tril_lian Early bird catches the PR.", "@BenjaminHis A huge milestone. Volt is right around the corner.", "@ChonnaParker https://t.co/aTS7JEerg4", "@hitchinsIV Time to refocus. Let's get your head in the game. | https://t.co/p1tMQ8Cr9S", "@Richhhhhhh Sore today = strength tomorrow. Check out this article on how to get that extra boost for round 2. | https://t.co/Vr7mebLGca", "@Drummaboy_MikeD Progress happens one step at a time. When's run number 3?", "@decollery Race or no race, Coach will have you ready. | https://t.co/gvGLdTrF6L", "@CallmeminiKC Hot temps. Hot streak.", "@ChonnaParker A better you is in bloom. What's on the agenda tomorrow?", "@Nike @MaritasCorner 3 months till the big day. How's the training coming along?", "@decollery Speed from point A to B. Got any races on the calendar?", "@cooptyhebert Your PRs are creating quite the buzz.", "@JenBeck1126 On a hot streak. How'd the legs feel?", "@trappistbeing Let's talk after the sweat.", "@JApostol3 Back to back to push yourself. What's the goal?", "@trappistbeing You're just getting started. Can you hit 7 this week?", "@AaronBower Good question, Aaron. 3:30 is the combined rest time, giving yourself :30 rest after each rep.", "@AlejandroGVidal We'll be ready to celebrate with you. Prepare for race day with these tips. | https://t.co/yqVX1tuGZ9", "@ellisdon197 Getting in some serious miles. Itching to race?", "@baturmort You've got the shoes, Coach has a plan in the app. | https://t.co/bkcz1sSZ6h", "@run4thelove Our calendar is marked. How do the legs feel?", "@glaizaIRL Earned your wings.", "@Wanjiru31 You'll break that 7-min barrier in no time. Any upcoming races?", "@FernandoLoy Muchas gracias por tu opinion, sigue en marcha y ponte en forma. Saludos", "@rhobouncer The harder the session the more it was worth it.", "@kandicecasey The only certainty is that we run.", "@graceg03 The only way to start the week.", "@AE9941 When the journey is just as nice as the destination.", "@xinaevans Practice makes perfect.", "@allikayyyy4 Think you can keep up with @OSUluvingirl?", "@roemmichak Mo miles, Mo progress. https://t.co/Mr3eHL01Ci", "@laurent4508 When in doubt, sweat it out. https://t.co/cCT4F7UC3x", "@Ant_Judge You're fast.", "@turki1478 Startin' off the week with a bang. Are you currently training for anything?", "@Sven1020 Straight to the finish line. Let's get a race on the calendar.", "@rupert1975 Recharge and recover for the next one. | https://t.co/EsqmQMhqkE", "@JenBeck1126 Fire extinguisher not included. How do you plan on cooling off?", "@sam_fantastic 7 going on 8. No signs of slowing down. https://t.co/MCvrEHcun5", "@edwarsimal 10 down, unlimited to go. How'd the legs feel?", "@miguelgaucin That new PR feeling. https://t.co/I4w9qREPbO", "@lumaca81 On your way to a better you. Let's have you shoot for 8k next.", "@CarlosWhuascar On the fast path. Any races on the horizon?", "@lenz_julia That's what we love to hear. Training for anything in particular?", "@Ebonie_Boucher Four legs are better than two.", "@chriswisemusic We'll make sure you're on the fast road to success. | https://t.co/SHphl70Ith", "@kandicecasey Motivation is key. Keep us in the loop.", "@EduScribblings Good work. Next up is the ten. Check our training plan here: https://t.co/Lf4KqbIQkx", "@iRealPedro Think you can hit 5 5'ks?", "@leepalisoc Keep pushing and you'll soon be reaping the benefits.", "@NiraMiTcHELL Rest up, you're going to need it.", "@bdrake25 Top the leaderboard so you can top the podium. No looking back now.", "@_MattieD Your buddy doesn't look tired, ready to take it further next time?", "@2GZandCountin Month's not over. Stay on your toes. | https://t.co/He0ShT4xZz", "@pwned24k Competition better watch out. https://t.co/FZm4NwL09p", "@jjzombie13 A streak worth keeping, don't stop now.", "@kazsabina_ 100km is yours. https://t.co/uMxevZjWfD", "@_vivek_nair Progress is a habit. You've got this.", "@Mike_Shake With a pace to match? https://t.co/aPqTjJas53", "@beavisnsquirrel We'll bring the motivation, you bring the hard work.", "@Yeic Kicking it into gear. https://t.co/WkOUzErMlC", "@KarinaJunker Stirring up for the perfect storm. Did it come with a PR?", "@Manchester1024 We asked and you delivered. Think you can make it to Volt?", "@JApostol3 Half marathon, full commitment. Focus on recovery to get you ready for tomorrow. | https://t.co/Y0QTGox2uz", "@heroreo313 Six down, unlimited to go. Have any races on the horizon?", "@JdDicko The start of something speedy. Ready for the next? https://t.co/n02w2XGbYX", "@dowhatulove247 No rest for the fast.", "@CallmeminiKC Hard runs lead to fast finishes.", "@QuinnCFR The hard part's over, you started. Let's go the distance. | https://t.co/O0NzjuDIir", "@NiraMiTcHELL Our calendar's marked. How do the legs feel?", "@JustQuynn Run the weekend or the weekend runs you. https://t.co/ZDLOZcoDSU", "@Robert_Calby If we had a tail, we'd be waggin' it. https://t.co/uVA0WC9TKr", "@J_Dreamers You know what they say about the early bird...", "@erikgtz We see you going the distance. https://t.co/vh21E68Vya", "@brucemclean_mac Eyes on the prize.", "@kazsabina_ Well... We going to get there?", "@Ludachris14 Second's on deck. See you next week.", "@TEAMR00R Ready to level up? What's your plan to get to Blue?", "@jnickmiller Turn up the volume and watch your splits drop.", "@JenMcDav Coast is clear for more miles. How far will you go this month?", "@iRealPedro That's what we like to see. How'd it feel?", "@jamesstewart95 We are rooting for you. Let us know when you hit it.", "@ChristalLRyles The pace is set. When's sub 50?", "@kazsabina_ Records are made to be broken. What's next?", "@BxGemStars Stay cool. | https://t.co/Ic0WlUNr1E", "@mentlemadness Taking your training to super levels.", "@IlyasPali Finding your stride. How far in June?", "@Irtyu1 From fresh to fast. When will you put them to the test?", "@NiraMiTcHELL Our idea of a perfect 10. When's the next race?", "@AE9941 Fastest on the block. https://t.co/AsKyHPwa5G", "@TrizzInc Can't cloud your dedication. You're clear for takeoff. https://t.co/IADVny7ay7", "@mymanhenri Volting to the finish line. What's your goal?", "@cooptyhebert Sky's the limit. How far will you go tomorrow?", "@JayKondrk77 Why wait? https://t.co/sWa1jRU2Bo", "@koxinell Fast start to the weekend.", "@justinrod You know what they say about slow and steady...", "@Trekdex Round two on deck. Which PR will you chase next?", "@Mandallene Running in circles and getting somewhere. Have a goal in mind?", "@bijenpattnaik Hard work all around. How's the training going?", "@DISFIT4JnG Double trouble. Ready for the next? https://t.co/MR7RiVhB7q", "@erinok2la Putting in double time. What're you training for?", "@creativeauditor Let 'em eat your dust.", "@JenBeck1126 Sunrise miles. Any races on the horizon?", "@AliK_AliG Can't contain your speed. What's in store tomorrow?", "@dowhatulove247 The goal is set.", "@IfUSeekDrew Learning from your run. https://t.co/nkCpv7Xn85", "@IrwanBadree Set your sights on 1000k. https://t.co/ku8iwZXdOy", "@_MattieD Unleash your speed. How far tomorrow?", "@dowhatulove247 You stole the show. How'd it go? https://t.co/nZIHHMlJib", "@jphoven Weekend warrior. Recover stronger for the next. | https://t.co/4d30ZBX2QF", "@HeyMissRager No word on that, currently. Stay tuned to our feed for any updates.", "@sam_fantastic Taking a break from the city streets, but still bringing the same hustle.", "@Nike @dalemeredith No days off. https://t.co/u8UNHXXqaj", "@skhulu95_38398 It's a lifestyle.", "@AE9941 Getting your daily dose of Vitamin (D)istance.", "@themissjenn Dedicated to distance. Adding more mileage this weekend?", "@SweetLianne Taco 'bout a spicy run. Earned it.", "@kazsabina_ No pain, no gain. How will you raise the bar next week?", "@trappistbeing We've got a plan to keep you on track. | https://t.co/u3gU7Oni6t", "@PaschenkoYurec More miles in the book. What's next?", "@avalencia212 Can't stop, wont stop. Keep moving.", "@trappistbeing Time to celebrate. What's next?", "@IfUSeekDrew Solid. Training for anything in particular?", "@trinchechoso Hola Eduardo. Ese problema se debe a que cada dispositivos le cuesta mas o menos en conectar con el GPS por eso sale asi.", "@LordOfExplorers Eat right, run hard. https://t.co/WdnYmi91KD", "@jjzombie13 Birds of a feather run together.", "@MoeDLeeIV Beat the soreness with these tips: https://t.co/6huYqOzmqV", "@TahmidK Progress has no offseason.", "@di_vvf The start of a long-distance relationship. How many kilometers did you get in today?", "@kandicecasey Recovery is essential to progress. Bounce back with these tips. | https://t.co/fmGx3XTlrm", "@Rev_Pope Anything worth doing is worth overdoing. https://t.co/E3iIkybEXM", "@samriddhd Still got the work done. Coach can help you get back up to speed. | https://t.co/tDJav06Znv", "@dengaterade Earned your wings.", "@JenBeck1126 If it doesn't challenge you, it won't change you.", "@thedonkeyslayer No news on that colorway for the Zoom Fly. Stay tuned to our feed and https://t.co/MgQydOiR1D for the latest.", "@kandicecasey Check in with us along the way. We're always happy to provide advice/ coaching.", "@xoHelene Strength and speed all in one workout.", "@LoveRunandPray The measures will have to be done independently. We recommend running on a local track for the most accurate results.", "@sophsindorf Always strive for new heights. https://t.co/lF2GCdTO5l", "@traciennewman Racking up miles at a record pace. Thats's dedication. When's the next run?", "@rossenfeffer One milestone at a time. We know you'll go the distance.", "@OSUluvingirl Taking it to the track for some serious speedwork. When's the next session?", "@itsrosstaylor The Nike Zoom Vaporfly 4% will release in July. Stay tuned here for the latest. https://t.co/geoaEP2J2I", "@jojoredpaula You deserve to be rewarded. We appreciate your feedback and we'll be sure to pass it along to our team.", "@cjhampton06 Nothing like blue skies and an open trail. Keep exploring.", "@benjgray Last stretch left and that reward is yours. Go get it. https://t.co/gLw1uJS3CT", "@msantiagorv On and on and on. Keep on moving.", "@AlejandroGVidal Good work. What's the goal? Let's see if we can help you get there.", "@sip320 Word of wisdom. Keep up the grind. https://t.co/xpzhCdXWGE", "@ChristalLRyles Logic will get you from A to B. Imagination will take you everywhere.", "@stephen_stritch Let us know how you get on.", "@kandicecasey Have a look at our Training Plans to get you on the right track: https://t.co/tkWrRfygkH.", "@kandicecasey Goodstuf, could you tell us which marathon you are training for?", "@IfUSeekDrew More miles? What's the goal?", "@tonipime Can't stop, won't stop.", "@tray_80 Every step counts. Training for anything at the moment?", "@CuppaJ0 How many did you manage to clock, Joanna?", "@brianv_graphics Everday K's. Keep on moving,", "@almarquez13 Here's a plan to go along with your new shoes: https://t.co/EkGKt9ncAo", "@MarieAlojado Celebrate today, sore tomorrow.", "@LovedbyJay Smashing records on Global Running day. Coincidence? We think not. https://t.co/qwABV00TfP", "@JustAnt1914 Sonny Crockett would be proud.", "@mymanhenri Each run has a purpose, and you're fulfilling it.", "@RGB154 Did you reward yourself with a ride after?", "@angela__pamela_ Didn't miss a step. Time to rest, recover, and come back stronger.", "@TonyWinward Dedication that deserves a monument. We know you'll finish strong.", "@Mel2F Relaxed today, faster tomorrow. What are you training for?", "@lewisid No news to report. Stay tuned to our feed and https://t.co/MgQydOiR1D for the latest.", "@TuralAhmedsoy Make it a daily thing.", "@RobertHrabluk Blazing your own trail.", "@sam_fantastic You can beat the heat with these tips: https://t.co/hVQujEoY5t", "@gusyinxcanedo On track towards a faster you. Continue to push the envelope.", "@AmberNDaugherty Don't stop now. Check in with Coach to get you faster than ever. | https://t.co/kRQEVg3Yly", "@CleanCoachKatie Casually race ready. | https://t.co/3rIYVCDZ7E", "@ShoeLacyLace Is there anything she can't do?", "@mentlemadness That's the goal: a little better with each day.", "@757Basketball Thanks for taking us along on your running journey. We know it's a lifestyle for you.", "@teresasunkestag We got your feet covered every step of the way. Keep pushing.", "@koxinell Ready to barge on into the record books.", "@iltosoo Tieni un occhio su https://t.co/MgQydOiR1D e sui canali social di Nike, per essere sempre aggiornato su news ed eventi Nike. (2/2)", "@JenBeck1126 For you, every day it's global running day.", "@kandicecasey Looking to reach your fastest mile? We'll be there with you all the way: https://t.co/0goapxH4Cp", "@dowhatulove247 You're the one who did all the hard work. Much respect.", "@gunawan_h That item is not available for purchase. If we can assist any further please let us know.", "@Jozy_Preach That's an interesting idea... https://t.co/eIlzzc74uC", "@jordiepoblete Running in circles, yet getting somewhere. Nicely done.", "@GomezadisaDelma We've just you a Direct Message with some steps that should sync up your run to your coach plan. Please check your inbox.", "@cabezaxeneize Hola, nos gustaria que configuraras tu telefono en ingles, Configuracion&gt; Region &amp; lenguaje&gt; Ingles. Se escucha en ingles?", "@SoyMotalberto Hola Luis, un placer poder ayudarte. Mandanos por MD tu correo con el que estas registrado y te mandaremos un reset. Saludos", "@brucemclean_mac Giddyup. https://t.co/WfNQzpK8VJ", "@KierranS As you build, don't forget to recover well. | https://t.co/RrRA0aV6Cg", "@KierranS Like you never left. What's the goal?", "@SoCal208 Trails &gt; Treadmills. https://t.co/dENHhPtutq", "@757Basketball But can you go the distance? Let's get a race on the calendar. | https://t.co/jzFXdYRt8L", "@sip320 The proof is in the sweat.", "@lumaca81 Rome wasn't built in a day. Make every step a step forward.", "@brianv_graphics Followed by 3-mile run Tuesday, right?", "@iamlesher Powering up for a fast finish.", "@steveserra Squad goals.", "@rhobouncer The only limits in life are the ones you put on yourself. Keep pushin'.", "@ShoeLacyLace Continue to push. We're with you every step of the way.", "@JHairston2 Don't hit snooze, hit the streets.", "@jjzombie13 Sky's the limit for your potential.", "@feng_423 They can really wrap you up. Training for anything in particular?", "@NorcalSk8Mike New shoes, New goals.", "@philippephbjj Nicely done. Any races on the horizon?", "@_MattieD Welcome to the club. Let's get to work. | https://t.co/iNHE22Qnzq", "@JBlaze23 Explore with every run, discover with every mile. https://t.co/mzKIXJup8M", "@karenatran Sunday's done, can you make it 7 days in a row?", "@dowhatulove247 One week out. Start visualizing your success. | https://t.co/BngVX25Iad", "@Just10_89 Putting in extra work, even on race day. We like your style.", "@whenyourejohn Less than 2 weeks out from Glasgow. Are you in?", "@xinaevans Exactly. https://t.co/NTMGpKLJJ1", "@hectorsalas10 Start strong, finish stronger. | https://t.co/Lrp7kLOfOb", "@SoCal208 There's a new sheriff in town. https://t.co/q9teOdUgFZ", "@KAMONIHASISSUES You're constantly doing great work with every run. Much respect.", "@L15AMW The beginning of a long-distance relationship. We like where this is going.", "@smuddMAVS Sign us up. Think you're ready?", "@HashTagDaf Rise and grind.", "@beansandmiles Our type of morning joe... we mean jog.", "@xoHelene First day down, have a new race on the calendar?", "@tril_lian There's no raining on your parade. How far tomorrow?", "@mentlemadness Training for a faster you. Nicely done.", "@_vivek_nair Consistency is key. Training for anything?", "@IamMOFO44 The gold standard. What's your goal for next month?", "@floresd3rd Pick your poison. | https://t.co/fwTRAHqKMJ", "@ShoeLacyLace Couples that run together, stay together.", "@kazsabina_ The best way to stick to a plan is to make one. | https://t.co/3rKuZ1cVGT", "@lumaca81 Let's get to work. Coach can get you there faster in the App. | https://t.co/UeICnyWTQb", "@Brandon_Runs Another legacy in the making. Rest up and prepare for tomorrow. | https://t.co/Xu1gKeByae", "@Drummaboy_MikeD You only get faster from here. | https://t.co/bPdbhVfsye", "@natejones1010 An even better one is waiting for Sunday. Can you keep up?", "@BigBearOne Reaching Purple level like... https://t.co/cs2X9rqjTf", "@NiraMiTcHELL Your runway is clear for training. Prepare for takeoff. https://t.co/GcuxhzKtho", "@Steve009J Because no one got faster sitting on the couch. How many Ks this June?", "@kazsabina_ The best views are from the top. What're you training for?", "@jacobs_sibylle Every run deserves a treat.", "@SmangaMad Paving your way to a new PR. How far tomorrow?", "@bigtymeG76 Looks like you've got a new record to break. Time to get after it.", "@BilliYah Sore today, stronger tomorrow.", "@lumaca81 One down, unlimited to go. What's the goal this summer?", "@TasteofColorado Earning an extra slice of cake. https://t.co/i6GwHSKQx0", "@Cjthebulldog New goals lead to new PRs. What's yours?", "@chaseheavener New month, new routine. | https://t.co/j5xxhBDk5b", "@KAMONIHASISSUES Going, going, gone.", "@creativeauditor Pain today, strength tomorrow. Check out these helpful tips on how to get ready for round 2. | https://t.co/MGD22bJ4pt", "@dowhatulove247 Race day is fast approaching. Here's a tip to help fuel your best performance: https://t.co/J1kYO8pzy3", "@JenBeck1126 Dust off the shelves. Time to rack 'em up. https://t.co/8YsHa6qT0A", "@AndrewByrom1 Percfect choice. When's the race?", "@LuisMGarin Progression is the road to success. Enjoy the journey.", "@heroreo313 The best way to brighten up a gloomy day.", "@sip320 Work had enough and anything's possible.", "@KyleGAdema We recommend hitting those distances at a slower pace. This will help your legs recover for your next intense workout.", "@Drummaboy_MikeD First it becomes a routine then it becomes a necessity.", "@maurigallardoc Going the distance. Training for anything in particular?", "@justinenriquez_ Mental strength to go the distance. Way to power through.", "@PilotProp Finding your zen with every step.", "@g_walmsley No events are currently scheduled, Georgia. Keep your eyes here for any updates: https://t.co/OLKbv0UoYt", "@talmekia Fueled for fast. Have you tried our recipe? | https://t.co/CZzhXe80HJ", "@imrunning4life We're impressed. Can you push for 140? https://t.co/8vUXUI3PGV", "@tcumike No plans of it currently, but that could change. Please keep an eye out for future updates, Mike.", "@StarDriven_ The BETRUE Apple Watch Nike+ Bands launched today at 10am PST. Shop the available options here. | https://t.co/FTO94InX8l", "@lifeasyoshi The BETRUE Apple Watch Nike+ Bands went live at 10am PST. Shop the collection here. | https://t.co/035zO3yJIb", "@metrogemRN Style to go miles. Now make sure you have the plan. | https://t.co/EBgyyZbOvx", "@FrankPucher Take the guesswork out of it. | https://t.co/4e6h7dSBot", "@sam_fantastic Shaking out the soreness.", "@Marcus_Bldn Earned your wings. Get ready to fly.", "@steveserra Teamwork makes the dream work. https://t.co/jzLvGZfqml", "@Andreholyn1 The NikeLab Air VaporMax BETRUE launched today at 1pm ET and is now sold out. | https://t.co/0B5xh6gcmS", "@tcumike We recommend downloading the Nike+ SNKRS app to sign up to get notified\nwhen a new colorway drops. | https://t.co/CpBxZWJ6Nq", "@mostar_5 Starting June on the right foot. What's this month's goal?", "@Erick_isai6188 Solid run. Think you can hit 7k's next time out?", "@mentlemadness A little rain can't dampen your drive. Nicely done.", "@ShoeLacyLace Relationship goals.", "@Just10_89 Let us know how you get on. We are rooting for you.", "@AirMagKnows Question is, what's for dessert?", "@chaseheavener Think you can hit it by the end of 2017? We do.", "@bijenpattnaik Running circles around the opposition.", "@MattDusenbury Everyday you're hustling. Kudos.", "@kandicecasey What's the date? Got a training plan?\n https://t.co/x8rN3nwXzl", "@KAMONIHASISSUES With months like that this year's going to be unforgettable.", "@brianv_graphics Is there anything you can't do?", "@brianv_graphics Streaks seperate the strong and the weak.", "@JennLeeDawson Soaking up the vitamin d(istance). Any races on the horizon?", "@RudkerFern Us too. How far are you going? https://t.co/oWU4bZdx7u", "@Just10_89 No one gets faster by taking it easy. Racing soon?", "@jnbdesigner The real work begins once you clock out.", "@TheLegitMrsH Great things never came from comfort zones. What can we expect in June?", "@ugo_dv Please check your DM for a detailed answer to your question.", "@Nike @sam1990_18 Only one way to find out. Let's get to work. https://t.co/1kkEltgU6K", "@Stephen_Logan We like the sound of that. Let's talk after the sweat.", "@Stephen_Logan Clocking in overtime. How far will you go tomorrow?", "@gthibaul We fancy these. https://t.co/X9zb9wIyed", "@beansandmiles Another year older, another run faster. https://t.co/LWdAbio7Qx", "@ShaneRooD15 Making history is hard work. When's the race?", "@hvk13 Progress has no finish line. https://t.co/4iREiR51MK", "@dnett22 The fireworks won't be the only show. Coach can help get you ready. | https://t.co/xD1MCFRFfN", "@coops313 Was it fast though? https://t.co/JNnHm0tDAq", "@JenBeck1126 What's the plan to maintain the top spot in June?", "@kaytbaybeee Keep grinding. Any upcoming races?", "@moniquevaristo Earning your speed. What's your plan to get to Platinum?", "@sandeepchandok The track isn't the only place to get stronger. | https://t.co/yZWPFzlLMw", "@kilonpop Will there be a second date? https://t.co/1gULHx5KGF", "@JApostol3 Consistency is key, and you're proof. Get ready for that long run.", "@mentlemadness Nice work. Think you can make it 7 straight?", "@JBlaze23 Memories made in miles.", "@ajanko18 With those views, the miles must sail by.", "@CuteAsADutton1 In a lane of your own. Now its time to celebrate... with more miles.", "@caitlin_chin Run no matter what. When's the next?", "@sandeepchandok Running rings around them. What's the goal? Let's see if we can help you get there.", "@kandicecasey A recipe for success.", "@maurigallardoc Bringing the heat.", "@brianv_graphics This you can raise this to a 7k by the end of the week?", "@LuisAvilesN1 Hola, prueba a editar una carrera antigua y refrescar la pantalla de actividad. Como fue? Saludos", "@yannfruch Actuellement, il est malheureusement impossible d'afficher le plan du lieu lors du partage d'un run.", "@bijenpattnaik Well done, next week going for the 8.50?", "@bdancebug A journey of a thousand miles begins with a single step.", "@kindof_obsessed Here's to a lot more where that came from. https://t.co/gyuKnN92N5", "@FHFcoachMAC Hope you're okay with long-distance...", "@Hannadebank Finding your inner elite. How was the finish?", "@flourish_pantry Love it. If you ever get the itch to race, we got you covered: https://t.co/E0rzk0G3QG", "@dnett22 Another run in paradise. Any races on the horizon?", "@mocaisaloca Practice makes perfect. https://t.co/COnf6xtNBF", "@dowhatulove247 It's all about how you finish. https://t.co/1ZwYIvV4BN", "@Greg_Gampel Miles and strikes. Knock 'em both out.", "@SoCal208 Never lose your cool. | https://t.co/yyg8NZ4sJk", "@prettygeekyCEO Double the dedication. Taking all the right steps to a better you.", "@KryptDANite Week's not over. Save room for more. https://t.co/YuldaxAC34", "@HiitToBeFit Rising to the occasion. How far will you go this week?", "@iRealPedro Let's raise the bar. High 5 tomorrow.", "@LovedbyJay You've covered distance. Now it's time to pick up the pace. https://t.co/lSjKuyrWLv", "@flourish_pantry With no signs of slowing down. Training for anything?", "@JerseyGirl981 *Year of Teandra.", "@AE9941 Still haven't reached your peak.", "@tancheekwang Breaking barriers one workout at a time.", "@fitsmallpackage You earned that escape.", "@RobertHrabluk If we hear thunder, we'll know it's you.", "@YonniKepes Hit us up here; https://t.co/MGfXjJMaJg", "@flipberkin Thanks for keeping us in the loop. What date are you wanting to hit 5000 by?", "@sip320 And you do it so well.", "@missleslie10 Welcome back. What's the goal?", "@PaulMerena Connect with @AE9941. He never misses a workout.", "@fitsmallpackage Time to cool off. Same time tomorrow? https://t.co/2uwhXHFICD", "@QuinnCFR Building a strong foundation for a faster you.", "@taylorrobinson_ Just to clarify, is your distance not tracking or is there no Voice Feedback?", "@Sven1020 The week is off and running. What are you training for?", "@sam_fantastic What's the problem? Cat got your speed? | https://t.co/XDvHKJNaVg", "@IfUSeekDrew Keep runnin' with the beat. https://t.co/XH2fFOU5FR", "@rymndcn Way to own your Monday. What's the goal for June?", "@kpincomb Sub 60 looks fast on you. What's the plan to break 58:00?", "@whoisyonni Back in full stride. How'd the legs feel?", "@Jorr313Det But do your miles match your emojis? The goal is set.", "@okbutRLYtho Yes, learn about the new Nike+ Run Club App here: https://t.co/BxpSAFB6qe", "@ObiwanShoenobi Pushing yourself further with each run. What's your goal?", "@Jorr313Det Finishing the month strong. Think you can keep up the distance in June?", "@siancanseeyou Bet you're glad you did now.", "@RClaure_nefro Going the extra mile.", "@Blissmas Great choice. Let us know what you go for next.", "@JApostol3 No signs of slowing down.", "@JustQuynn Check our 5k training plan, we may be able to help you; https://t.co/smlOsvjMUz", "@Raven5wood Last minute laps.", "@bdrake25 Whats your current streak, Brett?", "@dowhatulove247 Building your speed. Continue to find your edge. https://t.co/cWBSVzxNAF", "@krystalroxas Welcome to the club. Think you can make next month? https://t.co/Dlpqq3YuhB", "@heidihanna We'll see you at the finish line. | https://t.co/e7vHrFde91", "@tril_lian On your way to first like... https://t.co/SnqhvDY6Vj", "@IamCjCarter Setting goals to break them. How's the 10k/hr coming?", "@jphoven Watch your time drop. | https://t.co/XkF5Lyfkyr", "@JennLeeDawson Finishing the week strong. https://t.co/Qs4hOSCFeW", "@koxinell Coast is clear for more miles. How'd the legs feel?", "@AJDanageJr We'll hold you to it. https://t.co/MimpJbn53Q", "@rundeirun Better make moves. Think you can keep up?", "@shegotgame Like you never left. Have a goal in mind?", "@AE9941 Mask on. https://t.co/SZUqWEzHHx", "@MonicaMongo This is only the beginning. Continue to test your limits.", "@GoodDoBee Finding your fast. Ready for the next? https://t.co/R0nxYYm1q7", "@IfUSeekDrew You've always got us. https://t.co/iLbVRwBMei", "@BigTanelly The feeling is mutual. https://t.co/AHYgWPLNj2", "@JBlaze23 Getting lost in the miles. What're you training for?", "@JustQuynn Always on your toes. Have a goal in mind?", "@ClassyHippyLife Post-run recovery done right. | https://t.co/JNvDoGCk0G", "@PaschenkoYurec Straight to the finish line. Let's get a race on the calendar. https://t.co/rutItjIzBP", "@Coop8640 Help is on the way. | https://t.co/9AWm5ZOHCq", "@dowhatulove247 Way to capitalize. Did it come with a PR?", "@IRun2BMe Unlimited miles ahead. How far will you take them today?", "@nickjohnjames Recovery is key for record breaking runs. | https://t.co/y0ywOtHGu3", "@AJDanageJr Your time to shine. How did it go?", "@coops313 Less selfies, more Ks. What are you training for?", "@MaxMeezy You're ready. Coach has a plan in the app. | https://t.co/kOWhAEq8cI https://t.co/CvQS6kpbXd", "@TinyDancerLou 5k down, unlimited to go. https://t.co/PT4NoCwXpS", "@CatMan_42 One thing on your mind. https://t.co/jw56IEuorI", "@QuinnCFR Green means go. When's the race?", "@arnikatweets Keep flying into the week. https://t.co/o0HPKipV3r", "@vale_ferdy 2 legs, 3 wheels. You can't be stopped.", "@JackCasey25 We're here for you, Jack. Are you starting your runs through your Coach plan?", "@Lingking27 Making (heat) waves. How's the training?", "@Drummaboy_MikeD Solid work. Let's focus on recovery to get you ready for your next. | https://t.co/TypQJwVUyR", "@BxGemStars Farther and faster tomorrow. Bring it.", "@JennLeeDawson Ks in the bank. What's in store for Sunday?", "@mentlemadness This is just the beginning. What's the goal?", "@Brandon_Runs Your speed is no joke. How do the legs feel?", "@jnbdesigner Competition better watch out. Ready for 4 tomorrow?", "@Yoyaash The fast lane is calling your name. https://t.co/cbKQRBnaCn", "@JApostol3 Bringing the heat. How far for the next?", "@JenBeck1126 Meet your upgrade. https://t.co/JYb5NkLRCQ", "@koxinell Endless Ks on the horizon. What're your training for?", "@bijenpattnaik You'll be ready. Have a goal time in mind?", "@QuinnCFR Now that's a Saturday morning you won't regret.", "@jamesjdavies74 Record breaking fashion. Continue to push.", "@JHairston2 Refreshed and recharged. Have any races on the calendar?", "@arnikatweets But never wasting the day. More tomorrow?", "@2GZandCountin 4 days left. Will you hold the #1 spot?", "@Nike @IRun2BMe Race ready. | https://t.co/Srd0mpSsBt https://t.co/7kTqPHLAWC", "@Drummaboy_MikeD The Benchmark Run is used as a checkpoint to determine an appropriate pace for your following runs. How'd it go?", "@bijenpattnaik Dedication brings distance. Training for anything?", "@bake_n_run You're only 19 miles away from tasting victory. https://t.co/YkbnW5OGoc", "@richardmsalonga Thanks for testing that. Can you send us your Nike+ email, device, OS, and NRC App version via DM? https://t.co/Jd0K3rwpdg", "@richardmsalonga Let's have you log out&gt; restart your device&gt; log in. Please go on a test run and report back to us.", "@richardmsalonga Thanks for that. During the run were you listening to music? Also, do you have audio feedback turned on?", "@richardmsalonga We're here to help, Richard. Is your post getting liked during the run?", "@SKYYorRocky Here to help. We recommend checking with authorized retailers in your area for the Free Hyperfeel Run Trail (616247-001).", "@Coop8640 The stage is set for a comeback. https://t.co/Uk6zsjkJD0", "@coops313 Check out these tips for how to go the distance. | https://t.co/88G29iVrCI", "@bribritherunguy Another milestone in the books. Keep that odometer rolling.", "@coops313 Every run adds up. https://t.co/uBrlUCXEBQ", "@ChadKCunningham You only got two speeds: fast and faster.", "@_baetea Miles are your happy hour.", "@Drummaboy_MikeD Gains are made on recovery days. Trust us on this one.", "@vick3rs You're the human highlighter. Keep shining.", "@ObiwanShoenobi Beat that heat. | https://t.co/kICM6Oy77X", "@QuinnCFR Sounds about right.", "@leanpepinillo Hola, me gustaria decirte que ahora los Fuels los puedes ver en el sitio web. Sigue en marcha. Saludos", "@IronCobra Right on time.", "@robertdelfave Sipping on success.", "@jjzombie13 Things look blurry when you run that fast.", "@LovedbyJay A little water won't dampen your determination. https://t.co/eJxWAKgDBg", "@ToriGlass Who said all runs must come to an end? https://t.co/u7NfgZn2Qo", "@kandicecasey You earned it. Now time to celebrate. https://t.co/xP5seQ5aIo", "@_barefootdragon What are you waiting for? Find that extra push with a plan from coach. | https://t.co/WvNstaXhNX", "@kandicecasey See you at the finish line. https://t.co/MurT9zRJaF", "@selberg_noreen Looks like you made the right decision.", "@JApostol3 We respect the dedication.", "@sumit6500 The better you eat, the better you'll feel. Here are some helpful nutrition tips from NRC. | https://t.co/ZtRF4SJjq7", "@Drummaboy_MikeD You're going places fast. We like what we see.", "@ryancheeley Mile by mile, you're getting better with every run.", "@Bellslusi Stop signs don't apply to you.", "@JenBeck1126 Never losing a step, or your positive attitude. Way to get out there.", "@Drummaboy_MikeD Coach can help make your fitness a lifestyle. | https://t.co/hVtiZ1BDWt", "@CatMan_42 What kind of adventures? We want in.", "@Drummaboy_MikeD With every step comes progression. What's the goal? Perhaps we can help you get there.", "@SoCal208 Chocolate chip or oatmeal?", "@PaschenkoYurec On track for greatness.", "@kandicecasey Don't worry about the weather. You bring the heat regardless.", "@sumit6500 What's the goal? Let's see if we can help you get there.", "@Tjeerdx Please try the Belgian version of https://t.co/MgQydOiR1D, since the telephone number that you are using has a +32 prefix. (2/2)", "@Tjeerdx We are happy to help. Are you using the UK or Belgium version of https://t.co/MgQydOiR1D for this Notify Me service? (1/2)", "@bijenpattnaik We have taken your feedback and passed it to our team, Bijen. Thank you for your input.", "@FitAtLII Every run deserves a medal.", "@sarahdoody We recommend reaching out to Nike Store Chiado for NRC events in Lisbon. | 0035 1 912 284 724 (M-F 10am-8pm, Sat-Sun 11am-10pm)", "@IronCobra Never a bad time to put in miles. When do you clock in tomorrow?", "@Paulwray2 Only one way to find out...", "@MarieAlojado Make sure you can beat the heat. | https://t.co/iePqbUDQ81", "@RobertHrabluk Rain or shine, you deliver results.", "@music_mike25 No signs of slowing down. Speed work ahead. | https://t.co/s5yrLQ20F3", "@bijenpattnaik Good question, Bijen. We're unable to edit past weeks of your Coach plan. Let us know if you have any other questions.", "@iMestie We're here to help, Edo. Let's have you log out of NRC&gt; restart your device&gt; log back in. Give us a shout if this happens again.", "@TonyWinward 100 in your sights. Time to finish strong.", "@mmmollyn Pedal to the medal. Earned that hardware.", "@TheNikkoTan That's what we call an achievement. What's next?", "@brianv_graphics Twice the effort, twice the reward.", "@Yoyaash Keep us in the loop with your achievements.", "@FarAguirre Stronger with every run. How far this week?", "@brandon__snyder Turn obstacles into opportunities. What's your goal time?", "@losangelesx91 If you've got a will, we've got a way. | https://t.co/9maAlDPoac", "@comezlushiku Fast lane is wide open. It's yours for the taking.", "@brandon__snyder No sign of slowing down. How's the training going?", "@chaseheavener You've got 13 new reasons to celebrate. https://t.co/hkPD6TZXjG", "@DaleHurles Unlock your potential. How many miles this month?", "@Just10_89 Tenacity doesn't take a day off.", "@tril_lian Breaking the tape deserves taking a nap. https://t.co/HPDZIEmtPY", "@OSUluvingirl Our calendar's marked. Coach can get you there faster. https://t.co/zX2EWABwpg", "@coops313 Well...", "@BLUESTARFTW Starting your day with endorphins.", "@welsh_tenor The stage is set. Ready to show off?", "@RunTracey The hardest part is over- you started. Keep pushing.", "@SmangaMad There's always time for progress. Keep this up and you'll start a streak.", "@tril_lian Dedication brings distance. How'd you finish?", "@Brandon_Runs You said it, we'll hold you to it.", "@aimeen1 We know you'll be standing out at the finish line. https://t.co/SdbsHNHtzp", "@OSUluvingirl Our kind of pay day. Continue that feeling for the next.", "@JApostol3 Running with pace and purpose. What're you training for?", "@ericpmeier He learned from the best. https://t.co/1RoEvLCtr2", "@srinivas88 Earning your speed. What's the plan from now until the next?", "@JennLeeDawson On the fast path to success. How'd it go?", "@Raven5wood That's what we call clocking over time.", "@Chilltown36 Save room for more tomorrow. https://t.co/Sd9XqhOtVz", "@ARallapalli Dedicated to a fast finish. How do the feet feel?", "@arnikatweets Your day's off to a running start. What's your goal?", "@AmaraHakak The journey never stops. https://t.co/6s3OjKa3c8", "@avalencia212 Not everyone can run 10 miles with ease. When's the race?", "@dethabun Always ready to rock. How far tomorrow?", "@tmmybrbr Better get to steppin'.", "@SebastianWolski Watch out world. https://t.co/5sqoGyNnSC", "@xoHelene Getting a little vitamin d(istance).", "@jjzombie13 When we see that sub 7-minute pace... https://t.co/Vj6WWb9Gzu", "@cfchimp 10,000 reasons to keep going.", "@falbiii Striding towards a faster you. How far tomorrow?", "@jessicaejoseph_ The best part of a new record is that you have a new time to beat. Get after it.", "@katers513 It's like you never left. https://t.co/VnqUBUY9ia", "@jjzombie13 Well... How'd it go?", "@keatonguess Done and dusted. How do the legs feel?", "@Kamakacci_Juice The Nike Air Zoom Wildhorse 4 is a responsive ride designed for all-terrain. | https://t.co/kp1pg7oh3K", "@Jorr313Det You kicked into another gear. What's your goal?", "@LisM87 Unmatched consistency. Feeling race day ready?", "@ShaSnipe Sounds like 26.2 is up next. You're gonna need a bigger trophy case.", "@AE9941 Hard work leads to hardware. Did it come with a PR?", "@emmeeerrr Continue your legacy. https://t.co/dva186VB2Q", "@eyelidd_ Coach has a plan in the app. You'll be ready. | https://t.co/vrxtXNRuNn", "@tmmybrbr Month's not over. What's the final mileage for May?", "@CourtneyLeard We've contacted Air traffic control. You were flying today.", "@pazinger It's in the books. https://t.co/tjxXDiHoUb", "@sumit6500 With dedication comes distance. https://t.co/jOUhIhXecd", "@jessuhcuh Up and at 'em. How far will you explore next?", "@brandon_trollip We know how you'll be celebrating. https://t.co/oewpDfeZSL", "@eyelidd_ No clouding your focus. What are you working towards?", "@LFOUNDOS Green means go. Any races coming up?", "@belenmezag Fast track to the weekend. How'd it go?", "@dowhatulove247 Time to find your inner elite. | https://t.co/KZ8a14zD3N", "@jjzombie13 You always remember your first.", "@OSUluvingirl Race day is the reward for all your hard work. Time to cash in. https://t.co/foys1bFbIy", "@tril_lian Now comes the fun part. Check in with us before the race.", "@MarieAlojado We already know it's going to be a fast Friday when you take it to the track. Bring on the weekend.", "@chatoart We've seen worse places to run. Are you currently training for anything?", "@comezlushiku The streak continues. Let's see you take it up a notch. How about a 10K this week?", "@Kamakacci_Juice We'd be happy to help. Do you prefer a more natural, cushioned, or responsive ride?", "@fitsmallpackage A vital piece of training is the recovery process. Soak it up.", "@PressureWrestle Setting the stage for quicker submissions. https://t.co/moNAhUSQCS", "@RobertHrabluk Best escape is on foot. Nicely done.", "@alisha_lowis Found your sole mate. Have you introduced them to the roads yet?", "@BigTanelly Nicely done. Quench your thirst and more with these helpful tips from NRC. | https://t.co/EBZwK0pbmQ", "@jacobs_sibylle Progress with a view.", "@aproehl20 Fitness isn't a destination, it's a journey. You're on the right path.", "@ShaSnipe Ready to break the tape? https://t.co/iw25g3kCs3", "@brandon__snyder That's what we love to see. Keep that momentum going.", "@runatilla New shoes call for new challenges. How far will you take it today? | https://t.co/4CL63bAukL", "@CrzKhor Keep bringing the miles, he'll bring the laughs.", "@camilledashana That's the ultimate goal. You're well on your way.", "@MalindaAnnHill Earned that cake.", "@seanjohnsonrn Sorry to hear that. Could you confirm if you have the most recent update of the app? https://t.co/Jd0K3rwpdg", "@a_glassof We recommend getting your normal running shoe size.", "@bake_n_run We'll be cheering for you, Shivali. How often do you train for this marathon?", "@IronCobra Sounds like you need to find your fast; https://t.co/Td7iMniUMM", "@camilledashana What's the goal, Camille?", "@chaseheavener Stay on track and your goal will soon come.", "@MoeDLeeIV Looks like you've got a leg up on her.", "@Vuyo_Daza It's all about first impressions. What're you training for?", "@devon_read Not slowing down. Can you push 8:15 next?", "@steveserra Our kind of block party. Push it to 4 tomorrow.", "@zoogenia Here's to happy feet. https://t.co/9COjtcSSFJ", "@SavageEmily Just in time for race day. What's your goal time?", "@blanketcoverage Make sure that you've enabled push notifications in the NRC App and you should be notified. | https://t.co/oLUtnCcoVg", "@brianv_graphics Make your potentially a plan. | https://t.co/4kMWossBrS", "@KAMONIHASISSUES 200 down, unlimited to go. https://t.co/GlAMkmyI42", "@RobertHrabluk Hop to it.", "@falbiii Day 2 done and dusted. How far tomorrow?", "@AirMagKnows What's for dessert?", "@loribegins We are? Sounds good. Here's a helping hand; https://t.co/hfidZSi9fg", "@Jorr313Det Finding your speed. This may help you push it further; https://t.co/mbhTq8Ixdq", "@andrewtideas This product was in high demand. It is scheduled to drop next on June 8. More info here; https://t.co/kCeiFZaeyO", "@JBlaze23 The littlest things can have the biggest impacts.", "@pmitchell33 Every night is a great night for a run, Patrick. Training for anything?", "@brianv_graphics Putting in the work early in the week. What are you training for?", "@mommyblendz A recipe for a better you. Are you training for anything currently?", "@BIG_KRAFTY Finding your fast. Have a goal in mind?", "@IronCobra Consistency leads to growth. Let's see you push it to 4 miles next run.", "@yazrunsonplants We know you'll be ready. Here's some helpful tips so you can shine on race day. | https://t.co/Zck8rJ8uwr", "@QuinnCFR Staying ahead of the curve. What's your goal?", "@yazrunsonplants Nothing like a Pegasus' first flight. Any races on the horizon?", "@SoCal208 @BigBronc0 Ready...set...", "@tril_lian Preach.", "@AE9941 Rising above the rest.", "@wyomingmuse No end in sight... wait a second...", "@laurent4508 Stay dry while you make a splash. https://t.co/VE5Qsgl0M5", "@Nike @JApostol3 Like he never left. https://t.co/K5fvFjNylv", "@jacobs_sibylle Promise you're not lion?", "@JenBeck1126 We can't wait to hear the results. Keep us posted.", "@falbiii We've got just the plan to help you reach your goal. | https://t.co/YVJUbqiwJ3", "@AngeloAltez Don't leave us hanging. We'll see you tomorrow. https://t.co/Rogr1J3E37", "@leeanne533 Put that PR on the mantle. Well done.", "@stylishlysable It's dangerous to go alone, take this. | https://t.co/64MzwvMo3e", "@JenBeck1126 Quality over quantity. When do you toe the starting line?", "@falbiii Beginning of a legacy. Have a goal in mind?", "@steveserra Chasing miles not squirrels. What's your goal?", "@music_mike25 At the end of the day, you're better for it. Here are some tips on how to increase your efficiency. | https://t.co/iUvzWw5yHE", "@BengalaMan 8 more reasons to smile about. Nicely done.", "@JennLeeDawson Speed in full bloom.", "@LadyPacolleen The harder something is the greater the reward.", "@JHairston2 Shake it off, tomorrow is another day.", "@brandon__snyder Bringing the heat.", "@thedelpho Nous allons voir cela ensemble et trouver une solution. Contacte-nous via ce lien : https://t.co/3EyCACZVxc", "@DasCoffee We got you. Check your training plan here; https://t.co/v61QYG61hY", "@JBlaze23 New week, new opportunity. How many miles you got this week?", "@dethabun Progress is a journey, not a finish line.", "@ShawnMaile We recommend reaching out to your local Nike retail store and expressing your interest in starting a run club in your area.", "@ritamruiz Set your speed and go. | https://t.co/2E7dsCkUxW", "@fitsmallpackage Earning your speed. When's the next race? https://t.co/XDxyHK1RTd", "@dvirreznik Makin' every run electric. Can you push for 10k this week?", "@tril_lian A quick shakeout before race day. Feeling ready?", "@BronaghMonahan Stay ahead of the storm. | https://t.co/sIzfODM4y7 https://t.co/Xt833rJ8yC", "@srinivas88 Finding your fast. When will you hit 500k?", "@rushandteal Welcome to the team. What're you training for?", "@AE9941 Next week ain't ready for you.", "@AlexZiabko Ending the week with style.", "@Android_Btsy Are you able to send us a DM with your email address? Let's see how we can assist you. https://t.co/Jd0K3rwpdg", "@ijuswannadraw The journey is the destination. Welcome.", "@DanniMenzies More active than nature.", "@kevinsmith812 If you are US-based, to be in with a chance to win a pair of the Vaporfly Elite you need to sync a 5k, no time needed.", "@iRunInACircle We like crazy. Keep us in the loop with your progress.", "@romankurys Miles turning into milestones, great achievement.", "@maurigallardoc Sky's the limit. How far will you go this week?", "@dowhatulove247 This is just the beginning. https://t.co/ocCwksRadu", "@whenyourejohn Is there a race on the horizon?", "@robertdelfave Building a fast foundation brick by brick.", "@AmaraHakak Sights set on a PR. How do the legs feel?", "@GregNyse Fully booked, make sure you're race day ready. | https://t.co/RUv9jWpwsT", "@mahdi Green means go, Blue is on the horizon.", "@bdrake25 Not all heroes wear capes... lace up.", "@Andy_Quinn Make every step count. | https://t.co/xHV0nWZhGt", "@LovedbyJay Giving yourself the gift of endorphins.", "@Steve009J Simply unstoppable. We'll see you tomorrow.", "@Andy_Quinn Tunnel vision. Have a goal in mind?", "@harpistangelina You vs. yourself. https://t.co/bjw036imWg", "@KicksDiamond Sorry to see that. Hard to say a set number as far as mile count goes. However, when and where did you purchase the shoes?", "@stylishlysable Weekend warrior. What are you training for?", "@kingparkergold Stand out at the finish line. https://t.co/gbN3EhL5CP", "@Donaldinho07 Speed in full bloom. How'd it go?", "@GregNyse Can your speed go the distance? Let's get a race on the calendar. | https://t.co/s5JhnnlbRP", "@iRealPedro Whenever you're ready. https://t.co/OQrUeUqcIF", "@iRealPedro Prove it with another run.", "@vick3rs Run your city. | https://t.co/dqfnA8UACZ", "@JoeGibson89 Check out information on that here: https://t.co/2BogIVRkTz", "@QuinnCFR Sunday Runday. Perfect end to the week.", "@MilesThurston Sorry to hear that, Miles. Could you send us a DM with some more info? Let's see what we can do. https://t.co/Jd0K3rwpdg", "@xinaevans Mornings are better when you go for a run first.", "@barriebloor Still, a Sunday well spent brings a week of content. Going for that 5k tomorrow?", "@SingyLi Let's get this sorted for you, Sing. Are you able to DM us your email address?", "@dethabun Who's keeping up with who?", "@chaseheavener Looks like a perfect 10 to us.", "@JenBeck1126 Run fueled by adrenaline.", "@QuinnCFR This is just the beginning. https://t.co/0HelZWVu1P", "@peter_mackie19 So... when's the race? | https://t.co/RILXEv9T5B", "@AE9941 Your speed making a splash.", "@Jorr313Det Done and dusted. Let's get you ready for the next. | https://t.co/JEURnHYxK4", "@Spideyellis Always chasing #1 on the leaderboard. | https://t.co/PQiNJVrVBJ", "@joelnert You're on your way to a fast finish. Keep pushing. | https://t.co/R6zFIfInay", "@jacobs_sibylle Own your city. https://t.co/v4xeBE2PwW", "@sip320 Part of a well-rounded day.", "@janavarro_MD Better than a cup of coffee, faster too.", "@LukeFenek Give your feet a leg up. https://t.co/k5GzgavQrg", "@hectorsalas10 Keep 'em coming. https://t.co/oIX1tYvp0V", "@brianv_graphics Keep watching the miles climb. You got this.", "@KAMONIHASISSUES When your training is taking off... https://t.co/Iaa8dxWvhW", "@jnbdesigner Beat the clock. | https://t.co/DtmZ0ZL3wm", "@NikeUK @umarjourno Lace up and let's go. | https://t.co/ryzGO8wbin https://t.co/prtKCgW3fG", "@LadyPacolleen Dedication brings distance. What's the goal?", "@JackGaffney94 Every mile counts. | https://t.co/xPGVEwa6Tf", "@mmmollyn Rest, run, repeat. When's the race?| https://t.co/MBft312tWi", "@MgVine Our team is ready to help. Let's get you fitted. | https://t.co/tWUITXHhxC", "@julia_panna When you start your run make sure you're allowing the countdown to conclude prior to starting.", "@julia_panna Let's have you logout of the NRC App&gt; restart your device&gt; login, go on a test run. Report back once you've completed the run.", "@julia_panna Good question. You'll need a mobile data or WiFi connection to end and sync your run.", "@tril_lian Every K keeps you on track. How far tomorrow?", "@CaffeinePixie89 Half a marathon, and a whole lot of progress. https://t.co/TX53n9sm88", "@b_curtis Sounds great. We're just a tweet away if you need anything else.", "@avalencia212 When you realize it's the weekend, you finish your run like... https://t.co/qEuJqEo96Y", "@b_curtis Also, take a look at the Nike Zoom Pegasus 33 (https://t.co/eqEElphwjL). It provides a smooth, natural ride.", "@b_curtis Sure thing. Check out the Zoom Structure 20 (https://t.co/aLKYZD4dre). It provides a stable and responsive ride.", "@ArieRich We know a future Olympian when we see one.", "@brandon__snyder Cinco de miles.", "@vick3rs Nothing like blue skies and open water to get in your recovery run. Let the weekend begin.", "@_MmIbrahim We know the feeling. https://t.co/69yROAnrpE", "@b_curtis We can take this. Do you prefer a more natural, responsive, or cushioned ride? What have you worn in the past? Let us know.", "@RichMatravers We've got you. Check out the Zoom Structure 20 (https://t.co/nrLQAVrLhJ) and the LunarGlide 8 (https://t.co/TqNe3SEG7q).", "@sumit6500 Progression. What's the goal?", "@Jorr313Det Don't worry too much. Beast mode. https://t.co/iTagw4Q7P8", "@brianv_graphics Think you have a Saturday 6 in you?", "@gordillo_ruben Always moving. Training for anything?", "@sam_fantastic Thanks for leaving a tip.", "@Running2BeBtr Do what you're comfortable with. We generally recommend resting 2-3 minutes between each speed interval.", "@sam_fantastic We can't wait. Let's talk after the sweat.", "@dethabun Heading into the weekend like... https://t.co/4w8xbLCAZ4", "@nathanwoodward Really pounding that pavement.", "@Welsh_PA Stage is set for a PR.", "@AngeloAltez When the sun goes down, you lace up. https://t.co/ZYoQY13trT", "@jessicanoemii Embrace the journey. When you're ready to start training for a marathon, Coach has got you covered. | https://t.co/HBU0aKGqZ5", "@jessicanoemii Better late than never. Training for anything?", "@FlannCasey Takin' strides towards a better you. Are you training for anything currently?", "@TiaraBeth Taking on the challenge and getting faster for it. Nicely done.", "@getfittory Rep those miles in style. Check our available NRC-inspired shirts here: https://t.co/aEmOktSO5f", "@QuinnCFR Taking the scenic route.", "@Running_Nick_NL Taking a run down memory lane. Getting the itch to race again?", "@Welsh_PA No days off. How far tomorrow?", "@AliK_AliG A little encouragement goes a long way. High fives all around.", "@andresguzman6 The goal is to get a little better every day. You're doing it.", "@brianv_graphics Bringing that humpday heat.", "@tkm222 All day, every day.", "@friedryyce Progress only stops if you do. How far will you go tomorrow?", "@JBlaze23 Guaranteed it will be fly.", "@jakerichter That colorway of the LunarEpic Low Flyknit 2 has sold out. We recommend checking with some of our authorized retailers.", "@Danielle_Barone Our team just got stronger. https://t.co/DwzKaGSrEP", "@SoCal208 Looks like a little friendly competition. How does a 6-miler sound, @BigBronc0? Tag, you're both it.", "@_Tillyjp Proving your persistence. Same time tomorrow?", "@nathanwoodward Startin' off strong. Is there anything you are training for in particular?", "@sam_fantastic Boom, first step is to have a plan. Check out our 10K training routine/ running advice via NRC. | https://t.co/uwJIQkVKyq", "@sam_fantastic Eatin' up the miles. Do you have a fitness goal you are training for?", "@brandon__snyder Running in place, but still moving forward.", "@IronCobra Always on the clock. What're you training for?", "@iAudrey 5 miles is the goal, right? Let's get you there. | https://t.co/eqWaYpBtyg", "@selberg_noreen Miles &gt; coffee.", "@beavisnsquirrel Racking 'em up. Let's see you take on a 10K next. https://t.co/pEeIoWhpdB", "@mtbodkin Don't worry, your legs will thank you later. https://t.co/vx7MprYcaj", "@letsdostuffs A big step forward. Ready to stampede to the finish?", "@hutchike A relationship that can go the distance. Think you can keep up? | https://t.co/FsiXeIf23F", "@ollielavery Have your cake and eat it too. You earned it.", "@getshawfit Time to strengthen the relationship. | https://t.co/81pUsl8KKh", "@19Warrior85 Lace up. This calls for some miles.", "@iRealPedro Breaking your own speed barriers. Any races on the horizon?", "@IshanS_Om That run had you feeling like... https://t.co/5z9vkkpoBe", "@MsAllisonLynn Yeah.... Looks just like it. https://t.co/tqUsW1MTDR", "@brianv_graphics Two days runnning. https://t.co/Lq6d0z2L2k", "@coops313 Equipped for a new PR.", "@fitnfabtay It doesn't stop here. Unlimited progress ahead. https://t.co/RaVXjkL3Ei", "@Jason_Yabut We won't say anything if you don't. https://t.co/83mHmzI2ke", "@dethabun Shoot for a PR.", "@drewj6ft7 A great reason to celebrate. Racing anytime soon?", "@jackwanstall Sights are set. Can he get there? https://t.co/ZNWgtPt7dG", "@coops313 Way to get out there. We know you're due for a strong comeback.", "@Sill_Lino Making your four-legged friend proud. Treats all around.", "@JBlaze23 Just in time for all those miles you're gonna run, right?", "@ArchieChallen Let's make this routine. When do you lace up next?", "@iRealPedro Shocking speed. Only getting faster from here.", "@athomas4271 Toughest competition is you yesterday. Think you can do the same for a 5k?", "@NamesWest The perfect partner for those morning miles. Training for anything?", "@Running_Nick_NL Your runway is cleared for takeoff. How far will you go this month?", "@Welsh_PA Craving race day. When do you toe the line? https://t.co/1W7j5bHkLM", "@JHairston2 Stretch, run and repeat.", "@missleslie10 Miles turn into marathons.", "@Enrique93941653 Muchas gracias a ti por confiar en nosotros. Sigue en marcha.", "@music_mike25 This week ain't ready for you.", "@brianv_graphics Starting the weak off right.", "@IronCobra When you make time, you make progress.", "@arthurgmgoodman Stack mileage to top the leaderboard. https://t.co/k7bEa5u2gq", "@MickeyInglesLaw Letting your creativity take the lead.", "@Smit_talks It's a lifestyle, and you're thriving.", "@Brendan_Speaks Runner's Zen. What's your goal?", "@BronaghMonahan The sky is the limit. https://t.co/mS7KHhxilE", "@music_mike25 Burning more than just the competition. https://t.co/GiGo06YOVm", "@poppazo2001 You don't just set goals. You hunt them.", "@poppazo2001 Building up for race day. What's your goal time?", "@brandon__snyder Chasing a goal is the best way to stay on pace.", "@brandon__snyder Keep pounding the pavement. What's the goal? https://t.co/sfGtDHTiv2", "@mymanhenri Correct. Stay tuned to https://t.co/jEp19E5jTq and @NikeSF to run with us and receive route suggestions from your NRC Coach.", "@AE9941 Let's taco about it. How'd it go?", "@lextm94 Put the world on hold, your miles are waiting.", "@mymanhenri We will no longer host weekly live sessions in 2017, but you can check out our latest events here: https://t.co/kzB1JrUX4L", "@prettygeekyCEO Still faster than everyone in bed. We'll be waiting to hear how Wednesday goes.", "@WorldAgp Tuesday it is. We'll hold you to it. https://t.co/EyUzTiRk4y", "@SoCal208 Obstacles are meant to be conquered.", "@mrgoldin Strong performance this month. Can you catch first place?", "@Nike @CandiceCub The limit does not exist. https://t.co/XGY0aWn1Ey", "@unatalpelinegra You're just getting warmed up. https://t.co/hpRh2RLWBP", "@mentlemadness That feeling when you start the week off right. https://t.co/3mKUsmrqox", "@leannedb01 We recommend jogging at a comfortable pace for 10-20 minutes, followed by stretching, dynamic drills and 2-4 fast strides.", "@dswhilden You can only get faster from here. | https://t.co/eCKTuVhzRa", "@gusyinxcanedo Ready to double the distance? Let's go.", "@vuillemincedric Floating through the K's. When do you lace up next?", "@igor_oliveira That's the Nike Dry Miler L/S Running Top in the black colorway. Let us know if you have any additional questions.", "@vale_ferdy Training to be leader of the pack.", "@Eric_D_Jackson Feeling inspired? What's the goal?", "@tril_lian Ending the week the right way.", "@getfittory Week 1 over. What's in store for week 2?", "@mmmollyn Push limits to find your fast.", "@saltos_jaime Easy as pi.", "@levajsics Crushed it. But we all know third time's a charm.", "@tkm222 Race day is quickly approaching. Let's get you there faster. | https://t.co/NzOMgh1O5a", "@MalindaAnnHill Dedication in overdrive. How many miles this month?", "@lxd1 Strong with the Ks you are.", "@OSUluvingirl Warning: running may cause excessive happiness. See you again tomorrow.", "@J140815 Run the week or the week runs you. How'd it go?", "@AndyBarnett17 Welcome to the team. We're faster here.", "@jacobs_sibylle Beat the heat. | https://t.co/Bm636nQXGh", "@JamesTCaldwell A fast finish is yours for the taking. | https://t.co/3XqvDUA5U4", "@WorldAgp Victory is earned. When do you lace up next?", "@freshlemon A step in the fast direction. 3:30 in sight.", "@tkm222 One down, unlimited to go. What's the goal?", "@jnbdesigner Carry the momentum into the week. https://t.co/z7poRnGFZ7", "@friedryyce Fuel up for the victory lap. | https://t.co/jiVwLWES6B", "@ZTTZTTZTZ Make today's dedication the norm.", "@RunTracey Run your way to the record books.", "@Brandon_Runs Power up for the next. | https://t.co/rBvr8JxGVk", "@AngeloAltez Put your training to the test. Any races planned?", "@lxd1 A routine in the making. How far this month?", "@ShaSnipe Run, recover, repeat. https://t.co/ZORMoaERR9", "@jjzombie13 We know you can go the distance. But let's see how fast.", "@shreyash17 Only one way to go from here... faster.", "@RN_SNEAKERHEAD Your journey has just begun. Let's get a race on your schedule. | https://t.co/BRGo6JkKBu", "@wyomingmuse Unleash the beast. What's in store tomorrow?", "@QuinnCFR Dare to branch out? Double the distance by the end of this week.", "@GatorfanJSB We like our miles served sunny side up.", "@dethabun Watch the good times roll.", "@urbn_challenger Welcome to the breakfast club. How far this week?", "@manuelopezG Just watch the competition try and catch up.", "@freshlemon Equipped for speed. How did it go?", "@waynedbrown Way to crush it. Sub 1:30 for the next.", "@MarieAlojado Icing on the (cup)cake.", "@toldbyram You've mastered Sunday. How about Monday-Saturday?", "@brucemclean_mac Speed is in full bloom. Did it come with a PR?", "@Andy_Quinn Home crowd advantage. When's the next?", "@macboeck Next level commitment. https://t.co/dL7VTkoQgP", "@AlvarezTheViper Unmatched dedication. Have a goal in mind?", "@TimothyRichie It doesn't stop here. How far will you go next? https://t.co/FvtbiaRNvs", "@mohitsajwan62 Unlimited progress. Focus on recovery today, more Ks tomorrow.", "@718covergirl One step closer to a faster you. How'd it feel?", "@Rcanna73 Footwear and apparel were specially made for the runners. Learn more about the gear here: https://t.co/lVdm7TnKEZ", "@sumit6500 Still lapping everyone on the couch. Pick it up to 5k this week.", "@KristelGauthier Waste no time. Let's get to work.| https://t.co/Hs3972soxv", "@rymndcn There's more where that came from. https://t.co/Fcuh3ZjZgv", "@Jorr313Det Our kind of block party. What's in store for Sunday?", "@tril_lian Let's get you to the finish line faster. | https://t.co/qfHq8DCN4z", "@kandicecasey Relentless tenacity. Way to get back at it.", "@AirMagKnows Fueling your goals. https://t.co/S7AY1VcQUj", "@superblob No word on that yet. Stay tuned here for latest news. | https://t.co/T18P3h6K5o", "@tril_lian Own the night. What are you training for?", "@Akramlolo 200k is next. How quickly can you get there?", "@krystalroxas Greatness is waiting, you just have to chase it.", "@cooptyhebert Finding your fast. When will you put it to the test?", "@cpasion8 Hitting your stride. Ready to put a race on the schedule?", "@benearle You found your fuel. Keep it comin'. https://t.co/qLXb9nw4lY", "@AlexElizabethB Hard work leads to hardware. Did it come with a PR?", "@QuinnCFR The road to greatness isn't easy, but worth it. https://t.co/plr8K5J9lY", "@jnbdesigner Looks like you're ready to toast the competition. Any races on the calendar?", "@WalkthePlank12 Every step brings you closer... but 3 miles at a time will get you there faster.", "@dethabun Sky's the limit. What's the goal?", "RT @Nike: Eliud Kipchoge - 2:00:25\nThe barrier just got that much closer. #Breaking2 #JustDoIt https://t.co/uw9Dz1zknE", "RT @Nike: Eliud Kipchoge - 2:00:25\nThe barrier just got that much closer. #Breaking2 #JustDoIt https://t.co/A9fb1wZt1X", "@LeslieAScott The Zoom Vaporfly Elite will not be sold at retail. However, check out other options here: https://t.co/vaZK14Rn5A", "RT @Nike: Can you run the 100m in :17?\nHow about 422 times in a row?\nWe know three athletes about to. #Breaking2 https://t.co/nd4BxYjtoP", "@XBionicUK We've got your back. You can view the live stream here. | https://t.co/xklCcbPyYX", "RT @Nike: Barriers are meant to be broken, and this is a crazy-fast one. #Breaking2 https://t.co/UML2mI0xGr", "@romankurys Just another reason to celebrate.", "@HeathMeadows Solid work. Have a goal in mind?", "@JBlaze23 Perseverance &gt; Precipitation.", "@athleisureist Wait till you get your feet on them. Summer miles, here we come.", "@comezlushiku We like what we see. Training for any upcoming races?", "@J_philly92 We prefer to start the weekend sweaty. https://t.co/fi4FQC04aN", "@RobertHrabluk Consistency is key to success, and you're living proof.", "@bennettrun The calm before the storm. #Breaking2", "@Rbburhama Wave goodbye to the competition. Training for anything?", "@codyferguson_ The event will start at 11:45 p.m. EST. Start time is subject to change depending on weather/athlete conditions.", "@pablo83n Check out this link for more information: https://t.co/EOdMJPqoUd", "@beavisnsquirrel Breaking records and making your own history. Respect.", "@QuinnCFR Bouncing back in the best way possible: getting a personal record.", "@brianv_graphics Do you have a Saturday 6 in you?", "@ChonnaParker We're ready to break records when you are. | https://t.co/2ZDxvdg02A", "@dethabun Rain or shine we know you'll be out there getting more miles.", "@ilovelivingwell Check out viewing options and more information here. https://t.co/ONgEJqMHF6", "@midpackbiped That's the equivalent of running across the USA 5 times. Here's to great memories and more miles to come.", "@dethabun Pace on fire. What's in store for the weekend?", "@ChonnaParker Perseverance breeds progress. What do you want to accomplish next?", "@CallMeDelicious We got the next best thing. | https://t.co/lzg5sD5mR9", "@brucemclean_mac Living in the fast lane. https://t.co/m28O5Dc93w", "@jamescbarnes Sometimes victory is finishing the race.", "@AE9941 Progress you've made, more miles in you we sense.", "@brandon__snyder Great question. You can log a run using any device that syncs to Nike+ in order to be eligble.", "@jamescbarnes Back on track. Training for anything?", "@alessiodidato Taking the shortest path towards progress.", "@beansandmiles Friends don't let friends run alone. https://t.co/xumapfc8Of", "@Smit_talks Progress is making time when there is none. https://t.co/M6GulQ7lAt", "@brandon__snyder We've got a plan to keep you on pace whatever the distance: https://t.co/n8TA1M4iNF", "@KaitS Don't miss a moment of the historic event.| https://t.co/8nGj3Z9xSP", "@Radioface_88 Leave that for the tortoises. Time to take it up a notch. | https://t.co/Cx3RlqCEBA", "@mmmollyn Putting in work before you clock in. Nicely done.", "@brandon__snyder That's what we love to see. Getting after it tomorrow as well?", "@QuinnCFR Today's frustration is tomorrow's motivation. We know you'll bounce back.", "@caitfieldx A perfect way to end the day. Have any races planned?", "@JenBeck1126 Messy hair proves your speed.", "@sam49741866 Thanks for reaching out. We recommend contacting Nike+ Run Club NYC for opportunities that may be available.", "@badgaalrii We've got just the thing. | https://t.co/zIGvaX0VGE", "@AngeloAltez Growth comes from being uncomfortable. Let's see you push it 6KM next run.", "@iRealPedro What's the goal? Let's see if we can help you get there.", "@tril_lian 100% successful.", "@Enrique93941653 Hola Enrique, nuestros partners son Apple Watch, Garmin y Tom Tom. Todos ellos unas herramientas perfectas. Saludos", "@runneralive Let's look into this for you, Alex. Where are you currently located?", "@MinhTFresh503 Find a training plan to help get you there quicker: https://t.co/eIvUhRi9Qy", "@brianv_graphics That's the spirit.", "@iAmArlynn Check out these tips to start shaving off your time. | https://t.co/korHevKmud", "@chaseheavener Time to raise the bar. 5:45/mile by the end of the month?", "@MoeDLeeIV Time to smash your PR. Have a new race on the calendar?", "@aaron_scholer We hear you, Aaron. Feel free to give us a shout if you need further assistance. You know where to find us.", "@freestateron Never let last night ruin today.", "@iAmArlynn Hungry for PRs. What record is going down next?", "@RobertHrabluk Step it up. Surprise us with 4 this week. https://t.co/K8IuzvT1UQ", "@aaron_scholer Mind if we jump in? Have you checked out the Air Zoom Structure 20? It's built for stability. https://t.co/kBvTK6zcQ4", "@Stephen_Logan Best run of the year. Let's see you hit 20 next.", "@Davyt85 Records are made to be broken. When's round two?", "@Nike @King_TITI14 Never. https://t.co/zu3k3dn6uY", "@rundeirun @benlamers The Breaking2 event will be streamed. Get notified here to watch: https://t.co/JEGIaDrRPJ", "@clareleeblogs One step closer to a faster you. Let's set you up with a plan in the app. | https://t.co/eOtZVOlY8s", "@mmmollyn Preparing to make history. https://t.co/G7lVPf2V5S", "@jjzombie13 The only cure is more miles.", "@jstrasser For information regarding the event, check this out. | https://t.co/lppuHlVPh7", "@Weligsander Hills on hump day, no better workout.", "@vick3rs What a result. When's race day?", "@MarieAlojado Iregardless of the weather, you are raising the temperature.", "@AirMagKnows Nothing tastes better.", "@taelonv We are with you every step of the way.", "@ToddKeating The Breaking 2 is happening this weekend. Get notified for the final details here: https://t.co/i2ThzpjSOv", "@brianv_graphics Think you can hit a 3mi Thursday?", "@romankurys Check our half marathon training plan here, Roman; https://t.co/BlFCR7IFV7", "@dethabun You run every day that ends in a \"y\".", "@Smit_talks https://t.co/T2MGGTqVNq", "@homerborp Let's make tomorrow a fast one. https://t.co/B52OZ75d4j", "@themissjenn A runner on a mission. Enjoy today, then back to work tomorrow.", "@5k_chick Serious commitment. What's your next goal?", "@Hollie_BH Get notified here: https://t.co/d2S3OsoR9w", "@dowhatulove247 Practice makes perfect. Check out these tips on how to increase your speed. | https://t.co/NBmGe5YVk2", "@Bromka Limitations are in the mind. Break them.", "@mmmollyn Ain't that the truth. SF coming up soon.", "@laurent4508 Home is where the miles are.", "@iAmArlynn Eat up those miles.", "@Nike @kyla_solana04 Let's get to steppin'. | https://t.co/W4LL5ywr33", "@JenBeck1126 Cut miles so you can cut time. https://t.co/hvUDsy35Bl", "@music_mike25 Keep the miles rolling. https://t.co/lPSlg57RUQ", "@BurtRosevear The bar is set. Now how will you raise it?", "@jjzombie13 Don't let a stumble define your journey. Find the strength to keep going. | https://t.co/LPJdXKKTCT", "@krystalevy Let's make Wednesday a long one. Up for the challenge?", "@CuteAsADutton1 Ks must run in the family. https://t.co/weDw9MphQF", "@sweatyourstuff Pick a color and chase it. | https://t.co/X6oPRRhpgH", "@clareleeblogs Have a goal in mind?", "@sam_fantastic Don't stop now. What's next?", "@LadyPacolleen Keep moving.", "@clareleeblogs Welcome to the club. The only way is indeed up, let's help you get there. | https://t.co/T29JO2wxi7", "@stephaniestran Keep your cool, you already bring the heat.", "@sip320 Running rings around everyone.", "@christiemlowe We missed you too, What's the goal?", "@AirMagKnows What's for dessert?", "@SPORTSCENTER123 If you are still unsure of how it works let us know. We would be happy to help.", "@SPORTSCENTER123 Help is at hand. Check the following page for information regarding the watch and it's functions; https://t.co/k0ajhumvVh", "@todd3569 Find your fast here: https://t.co/ZNzmJTLMkE", "@friedryyce You only have two speeds: fast and faster.", "@MarieAlojado Sun's out, shades on. Hydrate and focus on more miles tomorrow.", "@todd3569 Let's talk after the sweat.", "@rick5years Continue to push yourself and results will follow. Let's start with the little things here: https://t.co/7URFbJjUnH.", "@sam_fantastic Excuses? Never heard of 'em. https://t.co/NUUpSRkRcm", "@JBlaze23 We don't have to tell you twice... https://t.co/u4T7uxQtKl", "@goldinlisa Because your nose shouldn't run alone. https://t.co/mp8c2rowCe", "@JBlaze23 Appetite for miles. What's the goal for May?", "@hisnibsjones This just calls for a 13.18 mile run to get you back on top.", "@fitsmallpackage Outrun Mother Nature so you can outrun the competition. https://t.co/FtQijvYqOR", "@OSUluvingirl Double does of dedication. How'd it go?", "@christiemlowe Must've missed those miles. Training for anything?", "@LGriz9 Nothing to share currently. Keep your eyes here for any updates. | https://t.co/L3jOxNbkZP", "@OSUluvingirl Friends help the miles fly by. Have another run on the calendar?", "@Nike @k_mahoney12 Let's take them from pretty, to pretty fast. | https://t.co/B6vNirxYup", "@Lingking27 Keep smiling, there are more miles ahead.", "@AE9941 Stepping into the week like... https://t.co/rMVu1GJ1kO", "@Running2BeBtr You've set the date, now pick a Coach plan in the app. | https://t.co/uKuRqjdrgU", "@JSpruel10 Every mile matters. | https://t.co/Fq4Xg0Kusf", "@_amandacardenas Absolutely. https://t.co/NduUoG6WGH", "@hisnibsjones Beating the clock and your competition.", "@Baptuitsme Hot start to the month. What's on the calendar?", "@KC_Wade Celebrate today, back to the road tomorrow. https://t.co/0tHNUdWc87", "@BennyMRD The beginning of a legacy. Welcoming us with more Ks soon?", "@marlina_quiroz Small steps lead to fast finishes. Link up with Coach to get you race ready. | https://t.co/tsCnQRoazR", "@rick5years No speed limit on age. When's race day?", "@SmileforKami Your squad represented. You dominated.", "@pazinger 5 months till you toe the line. Stay focused. https://t.co/SMufeH8iXX", "@Thrasher17Esp Hola, mandanos tu correo con el que estar registrado por MD y echaremos un vistazo a tu perfil. Just Do It!", "@CourtneyCorner A good start is half the battle.", "@RClaure_nefro Done and dusted. Let's pick it up to 10k this week.", "@krystalevy Further by the week. How'd it go?", "@marlina_quiroz Earning your speed. Have a race lined up?", "@pazinger Perfect day to start. When's the race?", "@wyomingmuse Giddy-up and get after it again tomorrow. https://t.co/IQDWc0eUXl", "@DaniellaVanIsle Here's to the next race. How'd it go?", "@MarieAlojado With your team behind you, anything's possible.", "@tril_lian Green means go.", "@ZTTZTTZTZ Same time next week? (And every day in between)", "@Jozy_NutMegz Never doubted your determination. 100 miles in May.", "@beansandmiles Globe-trotting. https://t.co/qzx2QBJla7", "@kychandler All out determination. https://t.co/Jepj4vfKJ2", "@chakranuya You've got a whole team behind you. Come run with us. | https://t.co/8Bihv3L998", "@jjzombie13 Detail oriented.", "@___brookeashley Every step is progress. How'd you feel?", "@tancheekwang Refocus and recharge. 90 minutes is yours for the taking.", "@LadyPacolleen A faster you is on the horizon. How'd the run go?", "@JenBeck1126 You know how to lead. How far in May?", "@toldbyram Easy as pi.", "@SilverGameDog Well?", "@plgcorea Scared you'll get better? https://t.co/dn9mN2Uga8", "@AmaraHakak With as much ground as you cover this is no surprise. 100k next month.", "@dethabun From one week to the next. This checklist never rests.", "@Honnie02 When it's tough, you're doing it right.", "@AndyHillMKM 1k down. Unlimited to go. https://t.co/kMxhMxQzXG", "@taelonv Becomne a household name. | https://t.co/Gdl69qwjKn", "@comezlushiku Got anything penciled in tomorrow?", "@julia_locklear https://t.co/L8bBIsNnch", "@tril_lian Up and at 'em. https://t.co/3m7G6eudiM", "@Lauramchapman No rest for the weekend.", "@julia_locklear Allergies are no match for you. How much ground did you cover?", "@fitnfabtay ...Leads to Sunday morning runs.", "@djjerm Sounds like you should keep on going. https://t.co/kWZwtYv7Hi", "@AE9941 Making the rounds.", "@chaseheavener You've set the goal. Let's get you to 1,000. | https://t.co/DRS8OlFyou", "@matthewbowden Running reign or shine.", "@ChonnaParker Your miles missed you.", "@jamielynettec Team run &gt; Solo run.", "@krystalevy Every step farther counts. Race day is coming. https://t.co/Hv8r0Y6okt", "@tancheekwang The stage is set. Now put on a show.", "@ThaRulersBack No word on womens' styles at this time. There are some men styles available with an 8\" inseam here: https://t.co/T36jL91IbB", "@BillGregory23 18 is no small feat. Enjoy today, and it's on to the next chapter tomorrow.", "@absarpathan786 Always strive for more. Let's get your started on another. | https://t.co/eU72hZjP8F", "@JenMcDav Petal to the medal. Have a race lined up?", "@JBrezinaPhoto Longer and faster has a better ring to it. See you tomorrow.", "@jacobs_sibylle Bad conditions make for better runners, but we can help with one of those things... https://t.co/TgBYFwu5dz", "@cesardamian Like you never left. What's next on the calendar?", "@KAMONIHASISSUES Heading toward a new PR. | https://t.co/fCVfw63vAh", "@tril_lian Let's get you back on track. | https://t.co/SJnqCOVuvi", "@karenatran Motivated by miles. Any races lined up?", "@beckiegoneeast Continue to top the leaderboard. | https://t.co/NbC47qyzwL", "@brianv_graphics Didn't miss a step. Focus on recovery to get you ready for the next. | https://t.co/VEGU7zCoFd", "@caw21 It sounded good, but did it happen?", "@idzulputra Way to branch out. How far this weekend?", "@sumit6500 Earning your speed. How'd it feel?", "@starexplorer From coast to coast, you've got the miles covered. https://t.co/SnOyzFS7sZ", "@AlvarezTheViper New goals lead to new PRs. What are you chasing next?", "@seif_edrees Coast is clear for more miles. What's your goal?", "@rachelmcshea The Apple Watch is currently our only GPS tracking device, check it our here: https://t.co/g7sUMNjexi", "@JennLeeDawson A better you is in bloom.", "@ChadKCunningham They need to change that street name to Chad avenue, 'cause you just owned it.", "@Nike @TheJonnyGranby You better believe it. https://t.co/zcCbeENLlq", "@KirstenLAS That sunny day feeling. https://t.co/GL5owctWna", "@AngeloAltez Strength comes from consistency. When's the next run?", "@AuntyNod Stronger for it. How are the legs?", "@OSUluvingirl Fitness and miles going up. Three more weeks until you kick off your racing season. You'll be ready.", "@sweatyourstuff The miles should be the only struggle. Let us know what you think of these options. | https://t.co/mxBeu5cSRO", "@AE9941 Soak up that vitamin D.", "@SebasBurgos Hola, esa es la ultima actualizacion para android. Has comprobado que en la configuracion de carrera la voz esta todo activado?", "@stephen_stritch Think you can hit 5 next week? We do.", "@MoeDLeeIV Try these on for size. https://t.co/DBPwRj2hIL", "@jonomurphy7 Follow Coach's lead and the results will follow. What's your goal for May?", "@erikselby Starting a training plan with Coach can help get your feet wet. | https://t.co/v71KfzyjDE", "@KingTurboFox We know the feeling. https://t.co/rbWio9T5tx", "@NiraMiTcHELL Distance makes the heart grow stronger. Welcome back. https://t.co/GPJbCGqQHz", "@chaseheavener Fast is relative, hard work isn't. When do you lace up next?", "@sam_bartley Future goals? https://t.co/nKEjrL5nEe", "@erikselby Face of a champion. Any races on the horizon?", "@JenBeck1126 Time to soak it all in and enjoy it.", "@k_g_carey Home is where the miles are. Nicely done.", "@infamous_ed That run had you feeling like... https://t.co/uIsEDJAWwi", "@CoachBarnes91 Do you think you have a six-mile Saturday in you?", "@AliK_AliG Turning up the temp, tearing up the track.", "@ollielavery Putting a spring in your step.", "@sumit6500 No stopping you. What's the goal?", "@rymndcn We don't have one. You're showing us up.", "@taelonv Just you and the track. Bliss.", "@tril_lian The most important meal of the day.", "@Broonland You got this.", "@niki_rae88 We can be with you every step of the way. Check our half marathon training plan here. | https://t.co/gSWkgr3cIK", "@fadedfast You dont get views like that from the couch.", "@Jorr313Det Highlight of the night. Ready to pick it up tomorrow?", "@MoeDLeeIV You're melting them away as we speak.", "@haydendale_ Time to make up for lost K's. | https://t.co/AEMl0ItvTu", "@rudigeryan Every dog has it's day.", "@rudigeryan Fast is your only speed. What's the next time to beat?", "@QuinnCFR Light up the streets. Think you can double the distance in May? https://t.co/RMg4eudfXk", "@Welsh_PA Nothing gets you over the hump like PR's. What's your next goal?", "@JBlaze23 A reminder that your feet are happiest running. https://t.co/dSJAPR9SAZ", "@CoachStephanieF Branch out and watch how far you'll go. When's race day?", "@jnbdesigner The perfect way to launch yourself into the rest of the week. https://t.co/0wi9gSww8T", "@LiteracyInaCan Mind if we jump in? Happy to help. Drop us a DM with what you've worn in the past and we can go from there.", "@Welsh_PA Records are made to be broken and you're only getting faster.", "@shibunair Come meet us at NRC, Ks are faster together. | https://t.co/K0N9bCC9HU", "@jacobs_sibylle Full calendar today, full passport tomorrow.", "@JenBeck1126 Talent runs in the family. Orange you glad she did it?", "@NegroEstupendo Sometimes an easy run is what the body needs. Go long tomorrow.", "@SebasBurgos Hola, el tema de la voz deberia estar solucionado con la ultima actializacion NRC 5.6 Ya la tienes?", "@cuchinotoo Un placer podido haberte ayudar y explicarte las cosas. Just Do It! https://t.co/TDNHPDOUqP", "@jamielynettec Worth the views.", "@JBlaze23 Every step is progression.", "@missleslie10 Any run &gt; No run.", "@jacobs_sibylle Question is; when's race day?", "@shibunair What's the goal? Let's help you get there.", "@friedryyce Preparation leads to PRs. How'd it go?", "@jjzombie13 Runs are a blur, but your goals are always in focus.", "@MarieAlojado There's no limit to what you can accomplish with a pair of running shoes.", "@dowhatulove247 Stick to the plan and a fast finish is inevitable.", "@Eho1011 We know how you'll be celebrating. https://t.co/9jc5b3XJjN", "@buckie01 Your speed can't be tamed. https://t.co/UKhtUiM7XZ", "@CoachJuddMorton Always on the right track.", "@BakHanane We'd ask what you wished for but we already know: more KMs.", "@JHairston2 And away you go. What's the mileage this week? https://t.co/iwaigFHWLL", "@muma_murphy There's a new sheriff in town. https://t.co/dhJR60Erpb", "@ArrowSh0t Training starts today. | https://t.co/nMQcytLxJf", "@PilotProp Proving your strength can go the distance. Same pace for 13 next week?", "@SuccessMalefa Like clockwork. When do you lace up next? https://t.co/SbD4VCUoPO", "@ArrowSh0t Ready to push the pace tomorrow. What are you training for?", "@ollielavery Covering universal distance. https://t.co/C4Ey7YnlH5", "@JenBeck1126 Well? Will we?", "@kim_neverenough With you every step of the way.", "@EleonoraBranca Exactly. We'll be here for each step, KM, and race.", "@DeckerBrennan We've missed you. What's the goal this time?", "@avalencia212 Miles like that will take your breath away.", "@Tomles Hola, no dejamos de ofrecer soporte, simplemente puede que no funcione correctamente, pero soporte siempre ofrecemos. Un saludo", "@vick3rs And you delivered. What's next?", "@brianv_graphics Start of the week, end of the weak.", "@hectorsalas10 Monday runday. Solid start to the week.", "@friedryyce Never lose your cool. |  https://t.co/bsCZMPUidV", "@AliK_AliG Breeze, palm trees and miles. What more could you ask for?", "@fitnfabtay A body in motion stays in motion. Keep that momentum going. | https://t.co/dIGQKSrSSa", "@JennLeeDawson Break PRs, hit HRs. https://t.co/5YF0a3WWme", "@MarieAlojado You don't chase goals. You hunt them down.", "@sam_fantastic Age is just a number, your splits are what count.", "@RobertHrabluk Bolt past your competition.", "@BlaugranaFan Another reason to celebrate.", "@BlaugranaFan Earning your hardware. Did it come with a PR?", "@AE9941 The only way to start a week. https://t.co/BoRAm4VJx3", "@grantsdad You've set a goal, now make a plan. | https://t.co/SoXqs5rJXQ", "@grantsdad One down, unlimited to go. What's your mileage goal this year?", "@sam_fantastic A perfect blend of speed and strength. Well-balanced routine.", "@wokrabi Run. PR. Rest. Repeat.", "@bdrake25 Sweet sixteen.", "@rlhalkes No need to wish when you can do. Get back out there.", "@itsloreeeeeruns We'll see you at the finish line. https://t.co/6mByeKFOMg", "@BillGregory23 4:15 is yours for the taking. https://t.co/Q4BmceRlAz", "@Mike_Shake Let's get you faster than ever. | https://t.co/HuDr6ne0sr", "@dmncbrm And another one, and another one...", "@beansandmiles Caution: may cause speeding.", "@itsloreeeeeruns Motivation in full spin. How far will you go this week?", "@RobertHrabluk Get ready to beat the heat. | https://t.co/gdDjfgGLXW", "@nouca8 Kiss that pace goodbye. Let's pick it up for the next. | https://t.co/pbG2Hud4ZQ", "@OSUluvingirl Sunny with a chance of fast.", "@caw21 Best way to celebrate is with more miles. https://t.co/AndXcfidtM", "@AVaroneSoto Laughing while running means double the cardio.", "@cservin47 Coasting through your miles.", "@bharaj_rohan It's like you never left. Same time tomorrow?", "@freshlemon When's the next race? https://t.co/1s4pisvdwm", "@k_g_carey Speed isn't earned by taking it easy. Solid work.", "@MyBigAppleCity Nothin' like runner's bliss. Training for anything?", "@Bellslusi Let's get you race day ready. | https://t.co/XZaOp3lyKF", "@tril_lian Our type of night cap.", "@iamjeffwilson Operation quick feet is a go. | https://t.co/lzEBFhlPEV", "@JamesXavierLam Running with them or from them? https://t.co/FVxHosH9BR", "@petrklimahelmet Shaping up for a fast finish. Let's get a race on your calendar.", "@JenBeck1126 Tenacity gets you to the top, consistency keeps you there.", "@feliciapaigexo 100 down, unlimited to go. https://t.co/ASWE4fdEFe", "@k_grace27 Steady starts lead to fast finishes.", "@Bellslusi Weekend warrior. Have a race lined up?", "@jacobs_sibylle Let's get you a personal best to match. | https://t.co/nKM7hYQ6DW", "@idzulputra A strong mindset leads to negative splits. https://t.co/VBVVUVoTSt", "@snackandnap Set your sights on 2018. Follow Coach in the app. | https://t.co/kwYYnUBeDm", "@cdel31 Bridging the gap to a stronger you. How far this week?", "@Kakavirk Becoming a marathon monster. How do the legs feel?", "@roy_nd Earn your way back to the top. | https://t.co/V9QrYFSxVK", "@beansandmiles How far would you go for a PR?", "@MishMatheus Sometimes you just need a little push.", "@pazinger Let's get you ready for the next chapter. | https://t.co/6XLTKht9ql", "@calvinprest Who says you can't do both?", "@missleslie10 Finishing the weekend strong, but there's still work to do. https://t.co/NBqgKjfQxf", "@jnbdesigner Fuel up. | https://t.co/nysrQtNpkr", "@mondzr Easy as pi.", "@freshlemon Looks like you were ready. How'd it go?", "@JoshKHOU Making the most of your run. https://t.co/crhptTRtt1", "@jpmarks14 Let's make this a habit. Think you can keep it up?", "@taelonv You're finding your rhythm. Have a goal in mind?", "@NatalieMcGourty Correct. You will take 2:15 rest in between each interval.", "@friedryyce Create miles, not excuses. https://t.co/5ZA6kLDoZL", "@cpasion8 Weekend's not over. How far tomorrow?", "@dethabun A golden opportunity to get out there. When's the next?", "@cservin47 Dedication in full bloom. How'd it go?", "@BillGregory23 1 week out. Have a goal time in mind?", "@MatthewCGoto We smell a race in your future. | https://t.co/m1Pu6suUWQ", "@mymanhenri When's round two?", "@Jorr313Det Progress is earned. Continue to push. https://t.co/umbLwO2dTR", "@capodastro Faster than everyone on the couch. How far tomorrow?", "@CatMan_42 Earning your strength. Let's get you race day ready. | https://t.co/XOgWfaTLIR", "@k_g_carey Refresh and recharge. Let's get ready for tomorrow. | https://t.co/7VKtAVeBUL", "@hectorsalas10 You've set the mark. When's the next race? https://t.co/1dLERYXAMb", "@jacobs_sibylle BRReaking records.", "@CoachBarnes91 Weekends don't mean days off. You've got this.", "@hectorsalas10 Ready to beat the clock. How'd it go?", "@therealsmeagss Either way we'll see you out there. | https://t.co/WCAUmmCj65", "@FinneyVince Don't cut corners, cut time. | https://t.co/5JlKR5EuIu", "@Fit_not_Skinny The starting line is calling your name. https://t.co/OmOlpjzhyt", "@ollielavery Making 12k look easy. What's your goal?", "@romankurys Rest, recover, and come back stronger. | https://t.co/n8fwJ2KtHY", "@yelseayox More than just food for thought. https://t.co/igSjb2wwpW", "@bdancebug Records are meant to be broken. What's next?", "@homerborp On to the next chapter.", "@NoseyAntics Selfies or it didn't happen. https://t.co/uqmDt0gbjk", "@MarieAlojado That head cold never stood a chance against your heart. Welcome back.", "@k_g_carey Love every mile. Training for anything?", "@Chuck_Daly4 An obstacle is just another opportunity. We'll be cheering you on every step of the way.", "@chelshirecat11 Definitely check out the Pegasus 33; a great combo of responsiveness + cushioning over the long run. https://t.co/zKlUi30S0z", "@arthurgmgoodman Try this on for size. | https://t.co/TQc5NUrNIy", "@EaseWaySays Your miles are standing out. https://t.co/xik2zeRbgs", "@ryan_a_sloan Comfort to go the distance with you. How's the body feel?", "@jean_panzer Our calendars are marked. We'll be with you every step of the way. | https://t.co/gDH5DrVAhl", "@chelshirecat11 Okay great. How did you like it? Also, are you looking for a more natural, responsive, or cushioned feel in your next pair?", "@chelshirecat11 We'll take this one. We'd be happy to help. What running shoes have you worn in the past?", "@JBlaze23 Your future is as bright as your miles.", "@CuteAsADutton1 We'll be with you every mile of the way. Check out these tips on how to run harder for longer. | https://t.co/gxRbSDrZOW", "@cardsdalisay Small changes can lead to big results.", "@TheSpeggy Fastest spud out there. Nicely done.", "@jean_panzer New shoes for a new PR. When's race day?", "@AuntyNod Sky's the limit. Keep pushing.", "@arthurgmgoodman Nothing says happy Friday like new PRs. Have you thought about what you want to accomplish next?", "@rakugu786 Mind if we jump in? Just to clarify, what shoes are you looking to compare? We can go from there.", "@RealMMcCullough Run. Or run not. There is no try.", "@cpasion8 Racks on racks on racks. Keep stacking those miles.", "@michaelkelly14 Running towards a better you, you are.", "@HiitToBeFit One track mind. https://t.co/sF5AsWBXGx", "@JBlaze23 Switch it up. What are you working towards?", "@jamielynettec Unstoppable.", "@Rachaun1 Squad.", "@j_antosh You got this.", "@jjzombie13 Power moves.", "@friedryyce Think you can hit 4 next week?", "@idzulputra That Friday feeling. What's the weekend got in store for you?", "@almarquez13 No better feeling than making progress. Let us know how it goes.", "@Mr_Foxx13 Deal. Let's talk after the sweat.", "@pameler417 While others sleep, you're getting better.", "@Mr_Foxx13 Always ahead of the pack. How far tomorrow? https://t.co/xzcAgsDGBL", "@sam_fantastic Well done. https://t.co/OOkcxwzXVK", "@CuteAsADutton1 Raise the banners. What's the next goal?", "@jasonscloud Sounds like it's time to strengthen the relationship. | https://t.co/6hia55QaMi", "@jasonscloud Ease in and then power through. Training for anything?", "@really_sharrie We know the feeling. https://t.co/1wZnJC6flx", "@sip320 Now comes the fun part. Check in with us at the starting line.", "@tril_lian Where some see difficulty, you see opportunity. https://t.co/tRCDn9zNLg", "@CoachBarnes91 The miles are worth the overtime.", "@AmbaaLynnn7 We see nothing wrong here.", "@ManonAllender Beautiful scenery pairs well with kilometers. How far will you go next time?", "@Andy_Quinn The real work begins when you clock out.", "@ellejazmeyne With you every step of the way. https://t.co/im4b5m3JyX", "@cardsdalisay Put your heart into anything and your body will follow.", "@TonyWinward What's your goal for 2017?", "@Giteaux Welcome back. Have you missed us?", "@brucemclean_mac One life, countless miles.", "@taelonv Always great to hit those targets. Looking to improve on distance or time?", "@officialAndrue Welcome to the club. Let's get you a training plan; https://t.co/x7lv2oVKmQ", "@JHairston2 Do call it a comeback.", "@andrewtwalk Succesfull entrants will be contacted directly via email. Keep checking your inbox.", "@krystalroxas Take it back to the concrete streets.", "@diego_dibarra Running rings around everyone.", "@brianv_graphics Fun time.", "@kcmiller85 Celebrate with every step.", "@Stephen_Logan Taking the road less traveled. How far tomorrow?", "@friedryyce The first mile is always the hardest. Check out these tips on how to get your body ready for round 2. | https://t.co/qH3Ac3UYWr", "@ncalacat We got you. Check out the hottest spots to run in your area. | https://t.co/9invP7J0sM", "@SlavikJoey The competition can't sleep on you. Take it another level with the right plan from Coach. | https://t.co/CjfZYayMSJ", "@rupert1975 If it gets you off the couch then you're doing it right.", "@JenMcDav On the path to greatness. When's the next run?", "@JenBeck1126 Leader of the pack. What's your goal for the month?", "@2EGGS_EMJ Hungry for distance. When's the race? https://t.co/f9GuCrNJUv", "@talmekia Flex on 'em. Keep pushing the distance. https://t.co/FFKQzuo1cb", "@DanniMenzies Challenge: Shave another 90 seconds off by August? Got what it takes?", "@tril_lian There's no such thing as bad weather, just soft people.", "@Lingking27 Three rules, one goal.", "@BIGMIG0517 The future you?", "@vick3rs The longer the day the more you can fit in. Think you can make a 10k PR? https://t.co/4TYbj92uyJ", "@Debskyrs En hopelijk loop jij straks met hem mee, Debby. https://t.co/41usuq75te", "@Debskyrs Dit is een reminder van onze app om een run te doen. Als het mannetje echter blijft verschijnen, kun je contact opnemen met Apple.", "@jimmybuckitz Feeling motivated? Let's have you link up with Coach to pick a plan. | https://t.co/F5knFoxK4t", "@jjzombie13 PRs and miles, with long runs and sprinting...", "@dethabun No better way to start the day. Training for anything?", "@Pdao8 Bold expectations come from a mile hungry heart.", "@Ant_Judge Burnin' through the milestones. https://t.co/cKQjzPgD4l", "@taelonv Just in time for summer. Let Coach help you become a stronger, faster runner. | https://t.co/OHrqZjgE2y", "@waynedbrown Just over 2 weeks out. What's your goal time?", "@antonumberone When running in circles gets you places. https://t.co/deCz1aCGYw", "@StaRemix_ Speed in every color.", "@SuccessMalefa Looking race ready. Let's get one on your schedule. | https://t.co/5l9g1H6OeO", "@casals_jordi If distance is what you want, let's get you there. | https://t.co/QtlZENbS6P", "@Officially_IT The best runs are when you can't stop. What're you training for?", "@casals_jordi Are you trying to get faster or not? | https://t.co/SVtCZR5P4n", "@taitaiitalia Never press snooze on results.", "@waynedbrown Being fast ain't easy. Lacing up for a race soon?", "@brucemclean_mac Taking your PRs to new heights.", "@krystalevy Rising to the occasion. Have a race lined up?", "@MalindaAnnHill Looks aren't everything. Congrats on a great race.", "@steveserra Who's keeping up with who?", "@DedrickWelch Can't stop now. Brighter miles ahead.", "@Nike @LadyBLouLou Unlimited speed. https://t.co/kmZAPqrH0j", "@AliK_AliG No fooling around this morning. How far tomorrow?", "@DedrickWelch More than you think, are you the next?", "@romankurys Chasing miles whilst everyone else is chasing Z's.", "@idzulputra The best thing on the breakfast menu.", "@brianv_graphics Consistency is key. We'll see you tomorrow. https://t.co/ITD1zaYHzg", "@JennLeeDawson A faster you is just around the corner. Keep pushing.", "@AE9941 From the sideline to the finish line. Any races on your calendar?", "@twoods210 It's nacho problem if you just press start.", "@sam_fantastic Stronger with every beat. When's the next run?", "@cdel31 Sunny with a chance of distance.", "@Fit_not_Skinny Mondays are no match for you. https://t.co/2959UwAsAE", "@Nike @ajwilliamson22 We know just the thing. | https://t.co/zXLJ7b1y1X", "@TonyWinward We're with you every step of the way. Check out these helpful tips on how to visualize your goals. | https://t.co/OD28UAW0J7", "@MoeDLeeIV Take time to recover. You'll be back at it in no time. | https://t.co/4VzgCjIm0E", "@TonyWinward The streak continues. What's next after the 500 mark?", "@SmangaMad It pays to take the long road home.", "@AnthonyMichaeI The dream doesn't stop. Set your sights on 2018.", "@bdrake25 You're on fire. https://t.co/4EZVER0rdU", "@Arey0 Stand out at the finish line. | https://t.co/qAnM6vIKZi", "@eraponi21 When the land ends, you keep going.", "@sophialin0303 Nothing like training for a race to keep you on track. | https://t.co/k5l5wQgHvE", "@bennettrun Can't stop, won't stop.", "@dethabun Wake up and run. You've got the routine down.", "@LovedbyJay https://t.co/Q6ywtagOCh", "@N0tASn3AkrH3aD Let's keep this up. We'll see you next week.", "@Romiidaboss No end in sight. What's your goal this week?", "@bdrake25 We'll be waiting. https://t.co/yV8EhmLqOl", "@jacobs_sibylle Did you get those three miles?", "@PilotProp It's all downhill from here.", "@AE9941 Victory is yours. How'd it go?", "@bdrake25 No sign of slowing down. How far tomorrow?", "@MelissaD_RMT Ready to race. | https://t.co/eL8RNOB9dL https://t.co/euaJAUSLJO", "@MarieAlojado Earning those finish line cheers. https://t.co/pqmAUWHpps", "@RunT_DanceT Back to the grind. What's the goal?", "@TerrySpannJr Miles make you go... https://t.co/06LeEXgiU4", "@LouieVuittonJ0N When miles meet motivation. Keep the momentum rolling.", "@beansandmiles Pave your way to a new PR.", "@AhmadKhairyy A well-rounded workout.", "@taitaiitalia Getting your daily dose of vitamin d(istance).", "@brucemclean_mac More Ks on the horizon.", "@JennLeeDawson Go out on a limb, push for 6 tomorrow.", "@neptos There's only one way to get there. Up and at 'em.", "@caw21 We see 130 miles this month. Up for the challenge? https://t.co/1F1HqGnvnm", "@bharaj_rohan Done and dusted. When are you lacing up next?", "@juhiek Chasing adventure. https://t.co/vY48o0gOmR", "@CorespeedGym First one in the books. How'd it go?", "@freshlemon Continue to push yourself. When's the race?", "@_Maeeee You want it. https://t.co/vOumwxW3oK", "@efrencasas Keepin' the streak alive. https://t.co/vuF6NC4OwB", "@itsloreeeeeruns The momentum is building, are you ready?", "@caw21 Stackin' miles. What's your goal this month?", "@BillGregory23 How long until the big day?", "@jjzombie13 Fresh air for fast feet.", "@jacobs_sibylle Followed by a quick cat nap. How far tomorrow?", "@Sill_Lino Making it look like a breeze. How far tomorrow?", "@Dhump_466 On the straight and narrow. Any races coming up?", "@chaseheavener No rest for the fast.", "@rickyl06 Kicks built for more than just kicking back.", "@themissjenn Off to a hot start. Keep the momentum rolling. https://t.co/wJMfcEsmpt", "@sip320 We'll see you at the finish line. Make us proud.", "@JenBeck1126 Put your rest day to work. | https://t.co/9dxdyXfxMV", "@freestateron Looks like a perfect 10 to us.", "@ThatLeoBurg Chat in with one of our Running Experts to find the best running shoe for you. Click the link here: https://t.co/2up6Xgp8XS", "@dmelendez32 Team up with Coach. He's got a plan in the app. | https://t.co/dVwe2uVmkk", "@ChonnaParker You'll be back at the top in no time. Keep pushing.", "@juhiek A new PR awaits. What's your goal? https://t.co/3IsAp5qnNH", "@fertolomeo We've got what you need. | https://t.co/pSrTWZalbM", "@BillGregory23 You're finding your rhythm. Training for anything?", "@hectorsalas10 Taking the road less traveled means getting the trail all to yourself.", "@rupert1975 Breaking in the weekend the best way possible. https://t.co/bPb3pv1pxs", "@wiscoinferno Chasing miles in any weather. What're you training for? https://t.co/Ukgw8Yj5d2", "@taitaiitalia Collecting eggs and KMs this weekend.", "@romankurys See yourself at the top of the leaderboard. | https://t.co/LLTiHkz0Ip", "@senthilpkumaran No sign of slowing down. Racing soon?", "@BizzoPresents Records are made to be broken. On to the next one.", "@talmekia Sounds like one hill of a run. How'd it go?", "@iamjeffwilson Commitment pays off. Ready to level up? https://t.co/qQID1GBte2", "@Kakavirk Ending the week on the right foot. Hitting the trails this weekend?", "@wilson_marvin Don't worry, we won't tell anyone. https://t.co/frWiWuutes", "@Arey0 Better conditions, better you.", "@sam_fantastic Not all superheroes wear capes. Way to push yourself.", "@Nike @BoxFit_PT Racers, start your engines. https://t.co/yPiZ1RnMXQ", "@cooptyhebert Good laughs and miles pair well together.", "@superwomankw The weekends are better in color. https://t.co/mEWx8uRPbQ", "@mymanhenri Stronger every run. https://t.co/0g8SZj0tTA", "@federering Time aside, you got better today. If you want to crank up the speed, check out these helpful tips. | https://t.co/GmAnwdNZSF", "@mikejones42o Every day is an opportunity to get better.", "@justinrod Break records, then break them again.", "@AuraSalla Miles crashing at your feet with an amazing view? Nothing better.", "@rabasz Nicely done. Any races on the horizon?", "@PeterRchai Taking a run down memory lane. This calls for some miles.", "@JaRzMa Me alegro que todo vuelva a la normalidad. Ya sabes ahora, a seguir sumando kilometros. Just Do It! https://t.co/ucAcWlhevj", "@yaileoad Hola Armando. Asegurate que tu GPS esta conectado y el modo ahorro desactivado, es la causa del problema. Just Do It!", "@miawellnessclub Strength in numbers.", "@sbntwrk 5K Fridays? Aslong as you have enough fuel to hang out on Sunday as well we can dig it.", "@beansandmiles Who needs plans when you have motivation?", "@romankurys If it was easy it wouldn't be worth it. Hang in there, we are rooting for you.", "@JBlaze23 A sight you would have to paws for. https://t.co/RjloCGDn7L", "@arthurgmgoodman First of many. How did it go?", "@drewj6ft7 You crushed last week's mile.", "@sam_fantastic Nothing better than outrunning your own expectations. https://t.co/pTDHP9OSUI", "@s_viktoria222 Perseverance leads to PRs. When's the next run?", "@joshuadimapilis Back to the hustle. What's your goal for tomorrow?", "@TonyWinward That's a stacked schedule, but we know you're ready for the challenge.", "@macfixer We've got you. | https://t.co/5agWZQZMdZ", "@DarrylJay2 Thankful for every mile. When's the next run?", "@kengaylord Hard to hate when it keeps you moving. Training for anything?", "@gfc3rd Be ready for May. | https://t.co/7rHp1QVp8x", "@AhmadKhairyy Effort doesn't go unnoticed. Ready for more tomorrow?", "@TonyWinward Miles are piling up. Any races on the calendar?", "@jonruffell A little pain, a lot of gain. Keep it up.", "@NollyQ_ Let's go ahead and check both these off the list. | https://t.co/AgXotBfyyx", "@JoeyTakaedza Taking steps to a better you. Coach has a plan for that. | https://t.co/AhP4x5gt2Y", "@AE9941 Building bridges.", "@LesPenn That feelings only going to get better. https://t.co/blcuVqsSAY", "@saysha_sasha The first step towards a new you. Enjoy.", "@gfc3rd What's the goal? Let's get you a plan of action.", "@kmann12 The more sore the bigger the score. Rest up.", "@kmann12 Nice work. How are the legs?", "@pazinger Protein is key.", "@kmann12 Dusting off the cobwebs. Let us know how it goes. https://t.co/1L7rM7nN2S", "@djordjecupic Chewin' up the miles. https://t.co/KX1qAJz0Pz", "@MarieAlojado If the rain won't quit, neither will you.", "@LFOUNDOS Squad goals.", "@Jorr313Det No speedbumps this week.", "@Welsh_PA Run to your own beat. https://t.co/iK9DO8TcgY", "@jennifern1 Head for an ice bath too. https://t.co/PIDdpjdz5o", "@straightShimmy The tougher it is, the tougher you become.", "@Mike_Shake The miles are waiting. | https://t.co/7QOjLbAxhX", "@Kakavirk Forge your own path towards progress.", "@Jorgarell Got any races coming up? https://t.co/g8XpyB3fqj", "@KMcSpedon Focused on fast.", "@JoeyTakaedza Your legs will lead the way. Have a goal in mind?", "@Weligsander Fast all year round. https://t.co/DFiSdMkSgj", "@kpincomb Your fast keeps getting faster. Set your sights on sub-27. | https://t.co/otCSz1Rgv6", "@kaitiibear Embrace the feeling. It's worth every mile. https://t.co/NXoBJSUw2Z", "@beavisnsquirrel A 10-second PR. We knew you'd do it. What's your next goal time?", "@alessiodidato Bright kilometers ahead.", "@JenBeck1126 Never short on mileage.", "@taitaiitalia Our calendars are marked. Continue to discover your limits.", "@Fromherlips Stretch, rock, and foam roll. https://t.co/U41eHrInED", "@jnbdesigner The grass is always greener where you run.", "@mostar_5 Midweek K's complete. Any big runs planned for the weekend?", "@cesarmun To find a running shoes that matched your needs, we suggest chatting to one of our Running Experts here: https://t.co/MBm0N09hWg", "@cesarmun The Roshe One and the Air Presto are actually lifestyle shoes and we would only recommend to wear for casual use.", "@Enrique93941653 Me alegra saber que todo vuelve a la normalidad. Ahora a seguir quemando kilometros. Just Do It! https://t.co/FiZ5XoBa6j", "@brandon__snyder If there's anything else we can help with, let us know.", "@brandon__snyder We would recommend switching up, usually, between 600 - 800 km, this can vary across different weights and running styles.", "@idzulputra Consider it seized.", "@kandicecasey Any faster and sunsets will have to chase you.", "@Eicir Celebrate every step. https://t.co/XDYv5hKz10", "@mattsince87 Just wait 'till they're on your feet.", "@shanetreynolds6 No leprechaun needed. https://t.co/c2UmJuTSnf", "@deedeeOntherun We didn't doubt you for a second. https://t.co/1kS5G9MQqO", "@MarkAWoodland Let Coach lead the way. | https://t.co/jVB3P2zi8v", "@thetommymchale We've been out running. Join us tomorrow?", "@JamesTCaldwell Finest training partner around.", "@Nike @Fromherlips Relationship status = it's complicated.", "@mmmollyn Just getting your feet wet. When's the next race?", "@MarieAlojado Rain or shine, you grind. https://t.co/lrBdTnD5UR", "@s7_arsenal Let's turn that walk into a run. | https://t.co/cjaPu5EZhz", "@brandon__snyder Looks like this old dog is teaching you new tricks.", "@AE9941 Running every borough.", "@JohnLoughton Choosing the path of most resistance.", "@Welsh_PA Hop to it, Ks are waiting. https://t.co/Bi1tnEE3W6", "@Running_Nick_NL Single track mind. https://t.co/X03CvTMLDe", "@Kakavirk Unlimited feels. https://t.co/Hmq4GfzhpX", "@taitaiitalia Hitting your mark. What are you training for?", "@JamesTCaldwell Licks for laps. What's your goal?", "@CoachBarnes91 We know he's competitive. How about 198 miles by June 11? https://t.co/77cIlmnxKe", "@adam272012 Stay cool. | https://t.co/6QIA76Wdty https://t.co/LBVpj5zu8V", "@therealamypatel Fast never goes out of style.", "@CoachBarnes91 Even the mileage is bigger in Texas. How far tomorrow?", "@jonruffell You guessed it. | https://t.co/oEXrohfiMX", "@MarkAWoodland Any races on the horizon?", "@jjzombie13 No sun? No problem. https://t.co/terErG69VQ", "@bichro The best way to explore a new city is on foot.", "@jonruffell Get back on track. | https://t.co/sBGzTFOygi", "@JaRzMa Hola Jim. podrias probar a seleccionarlas desde el apartado de album&gt; ver todas y seleccionarlas? Hazme saber como ha ido. Saludos", "@laalaa_22 Every step is progress.", "@krystalroxas Putting in a shift. What's the goal?", "@veeteegee Must be the scent of success.", "@RobertHrabluk Never doggin' it.", "@Glenn_Mango Don't let 'em fence you in. How's training?", "@veto_godly One mile stronger. When's the next run?", "@AliK_AliG Stay hungry. You've got work to finish.", "@Nike @Mort_82 Speed is earned. https://t.co/naBzyz7ien", "@brucemclean_mac Having a field day. How far did you go?", "@k_g_carey Keep up the pace. What's the week lookin' like?", "@ceae Turning wind into wins. https://t.co/oFKzd9TUhG", "@MarieAlojado Shake it off. The finish line is in sight. https://t.co/3p5vElE2lG", "@Romiidaboss Two PRs in two days? You've got more in you.", "@xoHelene The starting line is in sight. Keep your head down and maintain focus.", "@JBlaze23 Reflecting on your distance.", "@Nike @snina81 Sprint now, snack later. | https://t.co/du38FleVZX", "@AE9941 Take a Ferris Wheel detour, we'll pause your run.", "@ethanwhittemore Smashing way to start the week. Keep it up. https://t.co/BkBfwGbhei", "@Kakavirk Running in a lane all your own. See you tomorrow?", "@vuillemincedric Crushing Ks. How far will you go tomorrow? https://t.co/X6fGJsc7TX", "@Jorgarell Stronger with every stride.", "@ShanksJack Red, white, and fast. | https://t.co/mbx4tCrVEF", "@sam_fantastic Miles for breakfast. https://t.co/Kw69v3MI39", "@SmileforKami Don't call it a comeback.", "@instantv1ntage Hills and chills, a perfect Sunday.", "@stephen_stritch New week, new challenge. What's the goal?", "@dowhatulove247 When's the first marathon?", "@ohitsjustony97 Sub 27:00 5k. | https://t.co/LN7sFkylZX", "@MarieAlojado That offer is no longer available but you can shop that style here: https://t.co/azJa5mWbkB", "@JestAllie Continue that momentum through the week. https://t.co/bQsT7Ea435", "@ChocolateVein We saved you a spot at Volt. Come and get it.", "@avalencia212 Distance is calling your name. How far this week?'", "@THESportsTechie Breaking barriers. What's in store tomorrow?", "@JenMcDav And more on the way. Let's go for 7 next time.", "@ohitsjustony97 Up the miles and watch your pace drop.", "@jjzombie13 Ready to branch out? Let's hit 25 miles this week.", "@jamielynettec Add it to the collection. You earned it. https://t.co/PTWumuB8fJ", "@Romiidaboss Records are made to be broken.", "@tril_lian Your dedication never rests.", "@suzywillow Unlimited growth. What's your plan to hit 100?", "@ShelbyMReardon Fresh air for fast feet. Welcome back.", "@sbntwrk Unleash the beast. https://t.co/RgJyHBlgyX", "@iamkelvinlee Petal to the metal.", "@DrumiMankad Dedication set in stone.", "@pazinger Always on the move. How's the training coming along?", "@homerborp https://t.co/Eybj4GzZxr", "@jnbdesigner The best feeling is what you get in return.", "@BillGregory23 Hearing your mileage loud and clear. What are you training for?", "@rickyl06 Keep the mileage climbing. https://t.co/wcNF0fNvJ6", "@dowhatulove247 Future so bright. Bring on the miles this week.", "@k_g_carey Starting your day on the bright foot.", "@TerrySpannJr We'll be waiting.", "@txrrel We can help with that. | https://t.co/czvVXPMmip", "@aimeen1 We like our pace like we like our coffee... smokin' hot.", "@bradwlamb Never run alone. https://t.co/305v03xpYD", "@Aida_Lutaj On the path to a faster you. What are you training for?", "@luis_pata Hungry for more Ks. What's your goal this week? https://t.co/aeljVDL30f", "@Kakavirk Sleeping in is overrated.", "@Nike @survey_marc No matter the weather... https://t.co/0jSUfKI3Dj", "@vishkad88 Time to celebrate. https://t.co/Ja4WedB3vV", "@TerrySpannJr Faster for it. How far will you take it today?", "@jamielynettec The suspense is too much, how'd it go?", "@tancheekwang Focus on recovery, race day is in sight. https://t.co/VzgwF4jioC", "@JAMES2296RED Setbacks make for the greatest comebacks.", "@joelnert Looking for adventure. When's the race?", "@taitaiitalia Welcome to your happy place.", "@KathrynM_BaH It's always a beautiful day for a run. Same time next week?", "@acwilber Time to get back to work.", "@jamielynettec All set for race day. What's your goal time?", "@slimja23 Half marathon, full effort.", "@jjzombie13 Tune in and turn up the pace.", "@RobertHrabluk Fresh air makes for a fast finish.", "@RaulgJr We'll hold you to it. https://t.co/k2oNuDRLYe", "@Ekid956 You know what comes next... https://t.co/ryRmYqdgl5", "@RaulgJr We know you've got more in you. What's your goal this week?", "@johnnyvisable We gave you a plan and you executed. Ready for a full?", "@miguelsdsu First of many. See you tomorrow.", "@tril_lian Faster you on the horizon.", "@Spideyellis Crushed it. What's your goal for the next? https://t.co/Z1EeTCEfCL", "@antonumberone New goals lead to new PRs. How far this week?", "@rupert1975 Double dedication. How far next time?", "@cardsdalisay Making the track your home away from home.", "@NiraMiTcHELL Your farthest is yet to come. Continue to push.", "@JenBeck1126 Then go chase that feeling. https://t.co/B4GWsFKByW", "@ChonnaParker Off the beaten path to a faster you.", "@julio_sarabia One day closer to 10k. | https://t.co/00AcPyMtCQ", "@JordanEbon We suggest checking with @NikeSeattle to see if that style is still available in-store.", "@justinrod You'll push past this week. Have a goal in mind?", "@RobertHrabluk Run to your own beat. https://t.co/hMilVqSlFf", "@avalencia212 Best way to kick off the weekend is with some long miles.", "@MrShea You've got a full schedule. If you're looking for training guidance, start a plan with Coach. | https://t.co/Hwdd6VJCNp", "@chaseheavener Got it. If you'd like more guidance, reach out to our running expert team. | https://t.co/2CdXjRb4Hv", "@SirGeorgeThamie Thirsty for KMs. https://t.co/JBeHlqQslR", "@brucemclean_mac KMs in the bank(s).", "@chaseheavener We've got what you need. | https://t.co/RpfOYfmLfd", "@jacobs_sibylle Best to work up an appetite first.", "@hurricanediana Respect. Make a plan with Coach for the fastest route to a PR. | https://t.co/EiX7aGsTcy", "@chaseheavener Best reward for a PB is a new pair of running shoes. What type of ride are you looking for?", "@AnjunaXio Your next run just got much brighter, and lighter.", "@RobertHrabluk Keeping it consistent.", "@orianagxmez Always stay a step ahead. https://t.co/JyOXnZCYmv", "@AE9941 Fastest cat out there.", "@robiyahyaa Fueling for fast.", "@hurricanediana Hard work requires no filter. Training for anything?", "@mymanhenri You've built up quite the fleet for speed.", "@GP4t0 La Flyknit Racer Multicolore est toujours disponible, ici : https://t.co/CqnxnXJOnA", "@pwned24k Runnin' on the wild side. https://t.co/mLd4QAoORW", "@levajsics The journey is always worth it. https://t.co/ofgWF7TMKW", "@chldshfilipino Another great option with a more responsive cushioning is the Air Zoom Pegasus 33. https://t.co/XOL5ReO6Hm", "@chldshfilipino Got it. The LunarEpic Low Flyknit 2 has lightweight, plush cushioning with a similar sock-like fit. https://t.co/btmr7CnuV3", "@chldshfilipino Help has arrived. We have a variety of shoes to match each running style. What have you previously run in?", "@KeithM28 You'll catch up fast. Follow Coach's lead.", "@Kakavirk No slowing you down. Come back stronger than ever with the right plan from Coach. | https://t.co/JFDIZalKe6", "@_AndrewGomez Prime for Multi-ple miles.", "@moJALDY And with a nice kick.", "@JennLeeDawson K's for days. What's your goal for the next run?", "@OSUluvingirl Trails &gt; Treadmill.", "@LeSucre173 The Flyknit Racer 'Multi' will be available in Men's sizes 4.5-13. Look here for additional details. https://t.co/gnCUaiGX0Z", "@steveserra Improvement never came from comfort zones. Check out these tips for recovery between runs. | https://t.co/c2YmpHq7i0", "@KingOfSymphony No word on that colorway yet. We recommend staying tuned to your SNKRS and @nikestore feeds for the latest updates.", "@JenBeck1126 Double digits for breakfast. You woke up hungry.", "@flyktsoda See you for more this weekend?", "@jeyzitonunez Fast gets faster. Time to take it another level with a plan from Coach. | https://t.co/SiClR8KSN3", "@JBlaze23 Run wild. https://t.co/4GOMv0DX2I", "@TonyWinward Progress that stems from pure dedication. Keep it up.", "@mostar_5 Spring into shape.", "@Jorgarell Distance that packs a punch. https://t.co/do8K10sx3Z", "@marialemajo You're always making progress.", "@KingOfSymphony We've got you covered. The Air Vapormax Asphalt launches 4/27. Check the link for more details: https://t.co/qbcRnKm5wy", "@Camryn_lane We got you. The upper on this Nike Free RN is Wolf Grey. And the Swoosh is Purple Earth.", "@shanetreynolds6 Faster by the minute, better by the mile.", "@nij1980 We'd race to get home to that face too.", "@Brendan_Speaks Ks in full bloom.", "@Codyleamy When you're on Cloud 9, it's all beneath you.", "@KalpanaPuljal Today's the day. Start your plan in the app. | https://t.co/UQAYGsqpj4", "@drobgarcia When running in circles gets you somewhere. What's your goal?", "@bharaj_rohan Fast lane is calling. https://t.co/HGGBYxpVua", "@zulukabongelani Coach can help you shave those minutes off. | https://t.co/LC81GXRtDq", "@rysullivan Reaching 2k like clockwork.", "@Jorgarell Telling your story one lap at at time.", "@superwomankw Life in the fast lane. https://t.co/d9MHWd2uAs", "@xoHelene We love long weekends.", "@JBlaze23 Passion &gt; Precipitation.", "@zulukabongelani You're committed. What's the race goal?", "@caitfieldx Run straight to bed. https://t.co/8NynYwSZE5", "@jjzombie13 We'd ask what you wished for but we already know: more miles.", "@Twinmumanddad New shoes, new PB. We like this correlation.", "@Chris81714 We recommend contacting your local authorized retailers directly to check on in-store availability.", "@nellychatenoud Let's make these mornings routine. 10k this week. | https://t.co/ScgpYmrLdn", "@bridgetpooley Only one word comes to mind. Dedication.", "@mostar_5 Stronger with every step. How'd it feel?", "@DianaMabie Hand the tissues to the competition. Time to master the snot rocket.", "@kandicecasey Start dreaming big.", "@OSUluvingirl Like the LunarGlide 8, the Air Zoom Wildhorse 4 fits true to size.", "@maartbru Way to go, Maarten. Welkom bij de club van 2000K. https://t.co/nB3CfhQQNx", "@jenncarroll76 One day at a time. We're with you.", "@jenncarroll76 https://t.co/xk963Cuj9v", "@lissyisthebest Sounds like an epic comeback story. See you at the finish line.", "@GabeSteller All the feels. Keep chasing it tomorrow. https://t.co/E4wklxxZLE", "@lissyisthebest Ks are looking strong. What's the goal for Sunday?", "@beansandmiles No better way to see the City of Lights than by foot.", "@OSUluvingirl The Air Zoom Wildhorse 4 has a combination of plush foam and responsive Air, designed for the trails. https://t.co/b2leuG82hq", "@Shand_ie Let your endorphins turn that frown upside down.", "@paceandlaces Times will only get better. What are you training for?", "@esicke We'll see you at the starting line. https://t.co/tylpYQAZ2v", "@steveserra Every mile counts.", "@_Maeeee All of the above.", "@BigShaun The Flyknit Racer 'Multi' will be available in Men's sizes 4.5-13. Check the link for additional details. https://t.co/nYtH18cFUT", "@antonumberone Getting back on your feet is the hardest part. Time to have some fun.", "@OSUluvingirl Mother Nature is the perfect running partner. https://t.co/rwnobMLeXi", "@ReneeMHamilton Continue to challenge yourself. The results will follow. | https://t.co/fTbgCAXi7T", "@YamePhirie A day's work isn't complete without the Ks.", "@esicke Hard work's about to pay off. Feeling ready?", "@vuillemincedric Pace on fire. Let's push it to 12k this week.", "@onerob24 You're moving up fast. Got a race on the calendar?", "@bharaj_rohan 5k in the bank. Time to up the mileage.", "@onerob24 Earning big rewards. What are you training for?", "@JenBeck1126 Watch the competition fall behind. https://t.co/RC7uOpPyK7", "@sip320 Leaving the competition in the dusk.", "@SirGeorgeThamie It doesn't get easier, you just get stronger. When's the next run?", "@BengalaMan A smile with a side of KM's. Now that's healthy living.", "@vickyrockstar11 Make your next one your fastest. | https://t.co/Trz1yV5rW5", "@ReneeMHamilton Looks like you found your rhythm. What's your goal? https://t.co/V0Ps2h45OR", "@paceandlaces A test you can't fail. Let us know how it goes.", "@NakulS21 Progress happens outside of your comfort zone.", "@BfreeBlake Progress starts with the first step. What are you training for? https://t.co/5zrBTYdzTq", "@kelybel628 That's what we like to hear. Start a plan with Coach if you need some training guidance. | https://t.co/Ca29fBkCRJ", "@deedeeOntherun 17 reasons to get out the door. How soon until Purple?", "@MarieAlojado Nothing like blue skies and open roads to get you to 100.", "@shanetreynolds6 Bring on the miles. https://t.co/AjYwB0zh6I", "@kandicecasey You'll find a way to blossom wherever you're planted.", "@brandon__snyder Treats all around.", "@hm_hakly Time to celebrate, let's get moving. https://t.co/Fa7Ps2AwN6", "@lebopee How's the training coming along?", "@tril_lian Every run has a purpose. Today was recovery and you crushed it.", "@daV_it_dV On a mission towards a faster you. Training for anything?", "@taitaiitalia Lightspeed. https://t.co/UEUEqEsgrR", "@k_g_carey What lane will you be running in for your PM run?", "@NoOneFearsAJeff At this time we are unable to accept donation requests outside of the US or Netherlands but we'll be cheering for you.", "@beansandmiles Feeling like a million bucks. https://t.co/gK8s4SYHNt", "@AnjunaXio Find a way, not an excuse. How far today?", "@gusyinxcanedo Master your morning. https://t.co/3WFWgw8ZUy", "@TonyWinward You're not April foolin'. Nicely done.", "@sumit6500 Can't wait for tomorrow's run. https://t.co/ZY679k1enR", "@CarJack80 Monday's are what you make them.", "@SirGeorgeThamie Anything worth doing is worth overdoing.", "@LaetitiaOuillet collecties in de aanbieding - misschien ook de Lunar Eclipse. Hier vind je onze Store locator. | https://t.co/tG3WlhH9wd", "@LaetitiaOuillet Wat je kunt proberen, is om naar een Nike Factory Store te gaan of eerst contact op te nemen met hen. Zij hebben oudere", "@LaetitiaOuillet We bieden de Lunareclipse helaas niet meer aan. Mocht je verder nog vragen hebben, laat het ons gerust weten.", "@LaetitiaOuillet Willen we je aanraden om te kijken naar de Zoom Odyssey 2, welke heel vergelijkbaar is. | https://t.co/UUiDJWHo5J", "@LaetitiaOuillet Wij pakken deze even op. De Lunareclipse was onze running shoe met de meeste stabiliteit. Als je hiernaar op zoek bent,", "@romankurys Same time next week (and every day in-between).", "@Fiorentino18 No news on that. We recommend reaching out to your local Nike store for more information on a Brussels run club.", "@instantv1ntage Cool down and chill out.", "@Jorr313Det Squaring up for a strong week.", "@k_g_carey On the fast track to 6.", "@Jozy_NutMegz https://t.co/OsLdPyeQNI", "@hitchinsIV Stick to the plan, your finish line awaits. https://t.co/2GuxPzAcDW", "@MarieAlojado Finishing your weekend like... https://t.co/mcmKopANpO", "@NiraMiTcHELL High five.", "@tril_lian Better late than never. Get after it again tomorrow.", "@bdrake25 Here's to making 13 your lucky number.", "@pgwinnipeg With you every step of the way. https://t.co/3Un6JJQOII", "@exiliado21 You've got the focus, Coach has the plan in the app. | https://t.co/OcjxpRfY0u", "@cdel31 Early bird gets the PR.", "@jjzombie13 Room for one in the fast lane.", "@Weligsander On the fast path to success. Training for anything?", "@londresita Up and at 'em. Miles to be conquered.", "@jnbdesigner Looks strong and steady to us. Keep it up.", "@AmaraHakak That's what we like to see.", "@robertokine See you out there. https://t.co/FC5a5GdxU4", "@LaurenLCoetzee In love with running. https://t.co/OAmyOPcCWu", "@MichaelCHooper Dedication that goes the distance.", "@igloo_australia Because no one ever got faster running on excuses.", "@lanifallis Going with the flow. What're you training for?", "@lissyisthebest You woke up hungry. https://t.co/SbNVnDOg0W", "@Nike @henryakuza Find your fast. | https://t.co/s7bVAMhFUj https://t.co/Y6AtU0mF21", "@ShaneRooD15 The grass is always greener where you run on it.", "@vuillemincedric We feel a streak coming. See you next Sunday.", "@Rbburhama Let your KMs do the talking.", "@ThomasGolding82 Done today but never finished. Let's keep it rollin'. https://t.co/1HAM5IdOsq", "@oleebranch High mileage leads to fast finishes.", "@MishuNaie Setting a new standard. When's the race?", "@hitchinsIV Keep pushing your limits. Have a goal in mind? | https://t.co/rk37SZMHTa", "@iAmArlynn Tell 'em to kiss your fast.", "@charliet0dd Rein in the miles. https://t.co/HpjNrw8r3c", "@vishkad88 Keeping the streak alive. How far this week?", "@JHairston2 Always better after a run.", "@Baptuitsme We knew you were up for the challenge.", "@gn46342 More like weekly warrior. Let's go even further.", "@exiliado21 Never looking back. Have a goal in mind?", "@bharaj_rohan Crushed it. How far today? https://t.co/equlPpCHcs", "@sip320 When the sun goes down, you pick up the pace.", "@rekipoca A full spectrum of motivation.", "@kevinjones_ Friends don't let friends skip Sunday.", "@taitaiitalia Outrunning the weather. https://t.co/qrPlVkZTZ7", "@destinedtowin34 Absolutely.", "@todd_nett Still lapping everyone on the couch. How far tomorrow?", "@caw21 We see 10,000 on your horizon.", "@JBlaze23 Brushed off the cobwebs, and you're ready for tomorrow.", "@ChristineZapa16 Recovered from your race... so when's the next one?", "@Smit_talks Quick feet make for a fast finish.", "@jamielynettec Your speed's blooming.", "@RobertHrabluk Let's kick things into gear. | https://t.co/uSghxcVyy5", "@romankurys The training has just begun. What's your goal?", "@TrizzInc Push it to 10k and then we'll answer.", "@SirAaron_ Welcome to the club. How much further will you take it?", "@joewillburn Unlimited dedication. What's your plan to get to 2,000?", "@sitnpurdy https://t.co/fZqIX93Mdf", "@absarpathan786 Focus on recovery with this. | https://t.co/CTXEMualHI", "@Fit_not_Skinny Run, rinse, repeat.", "@steveserra Square up for a 5k tomorrow.", "@AmaraHakak We'll hold you to it. https://t.co/6j2G0MJe8m", "@becky720 Farther and faster every time.", "@julio_sarabia Weekend warrior. Let's push it to 10 tomorrow.", "@ChonnaParker The long way home pays off.", "@CarJack80 Our kind of April fools.", "@cpasion8 1st one down in the books. Bring on the month. https://t.co/SV4KbLLO0p", "@ClintonSpel Exploring your fast.", "@InsurgentNL Now let's get to work. | https://t.co/dYbrTtCzhJ", "@AmaraHakak Like you never left. How far tomorrow?", "@absarpathan786 Hard today, stronger tomorrow.", "@RuntheDiff Competition better watch out.", "@NiraMiTcHELL You said it. Keep believing.", "@mpiatek Fitted for speed. How'd it go?", "@chaseheavener Unlimited miles on the horizon.", "@BarkwayRunner Out with the old, now let's get some mud on those new ones.", "@nooffseason Your mileage is no joke.", "@kasera_cb Sweat like you mean it. When's the race? | https://t.co/VInrUIqaJO", "@lady1676 Your weekend is off and runnin'. What're you training for?", "@sip320 Your dedication is no joke. https://t.co/NHzpBbuO1H", "@beansandmiles Ready for take-off. https://t.co/axjat6Fjxe", "@KplussM Use the 4 minutes to stay loose and lower your heart rate. We suggest walking and staying mobile to get ready for your next set.", "@hisnibsjones Time to cut down the net.", "@TasteofColorado 100% chance your better for it.", "@Welsh_PA No beach, no problem.", "@InsurgentNL Check out the Nike Air Zoom Span, which offers the same Dynamic Support and Zoom Air technology. | https://t.co/NEWC1sibOd", "@muma_murphy Here's something to make sure you're ready when you toe the line. | https://t.co/r4FYoEmMNP", "@SirAaron_ Dedication at it's strongest. There's no stopping you.", "@hitchinsIV Dedication &gt; precipitation.", "@jonruffell Set the bar and then raise it again. What records will you break in April?", "@TheLostGrad Squad goals.", "@CardinalBiggles Right on schedule. Keep raisin' the bar.", "@AmeliaZuleika We see a faster you already. How's it feel?", "@essie_dear And you can't live without it.", "@AirMagKnows What's for dessert? | https://t.co/VQTFSgbn2f", "@jjzombie13 It's not magic, it's hard work.", "@AE9941 Reflect on your success, visualize new goals.", "@superwomankw How are the legs feeling today?", "@brianv_graphics Running on air.", "@k_g_carey Progress never stops when you run.", "@sam_fantastic Catch you on the south side.", "@nikojans Rome wasn't built in a day.", "@vickibrightside Noted. What's the time to beat?", "@RobertHrabluk Big miles call for big gulps.", "@MalindaAnnHill You're defined by how you rise, not how you fall.", "@SuccessMalefa Legends never stop. When's the next run?", "@mwillingham89 Find your limit, then push past it.", "@OSUluvingirl Showing off your endurance. What's on the agenda today?", "@FourierTrans The spotlight is on you.", "@vickibrightside Your eyes are always focused ahead. May 20?", "@rhobouncer Time to fill that box with new memories.", "@haydendale_ Every K is worth the view.", "@MalindaAnnHill We knew you'd be up to the challenge. How'd it feel?", "@kyleravenscroft Make every run a 10/10.", "@jonomurphy7 Embrace the process. Celebrate the results.", "@firstmarathon_ You found your sweet pace.", "@JHairston2 The pace is strong with this one.", "@beansandmiles Keep the momentum running.", "@IfUSeekDrew Let go and run for 3.", "@chaseheavener Full speed ahead.", "@eraponi21 https://t.co/NAMfOHpX4p", "@eraponi21 Home run in our books. When's the next?", "@SoniaTyding No dates have been determined yet.  Be sure to check our events page for local NRC events near you. | https://t.co/5RLqMJewpd", "@JBlaze23 Entering brightspeed.", "@DARYLsaDIMEond Faster together. https://t.co/RWHHgymJh8", "@rickyl06 We see no problems, only PRs.", "@Running_Nick_NL Time for your victory lap.", "@mpiatek Stage is set for a comeback.", "@YamePhirie Always hungry for more. When's the next run?", "@CarJack80 Means another one in the bank. When are you cashin' out?", "@bocho Keep adding those zeros. https://t.co/xHS1absI7h", "@brianv_graphics Make every day a milestone.", "@lissyisthebest Focused on goals beyond today's finish line. https://t.co/mJOQFjoC0l", "@RobertHrabluk The biggest competition is always yourself.", "@bharaj_rohan Constant progress. We hear 6k calling your name.", "@WATCHME_W0RK Speed is no joke either. Let's get started | https://t.co/TT5JzT95Qp", "@TonyWinward Cruising through the milestones. Ready to take it up a notch? | https://t.co/vZAvuLmZWe", "@kandicecasey April ain't ready for you.", "@jjzombie13 Lightspeed. https://t.co/quY3Q45tso", "@dethabun Making 7K look easy. Feeling strong?", "@fitjetergirl Chat with our experts to find your perfect fit. | https://t.co/ASNwvzJrIN", "@Fromherlips Your miles are heating up.", "@Abbigator99 You'll be cheesin' at the finish line.", "@pwned24k It's like you never left.", "@bjsizelove Fuel for miles. When's the next run?", "@Welsh_PA Stacking Kms like... https://t.co/yagcbBk1uK", "@brandon__snyder Progress is made one step at a time. Welcome back.", "@Nike @pjblake2 It's speed season. Think you can keep up? https://t.co/5mToMYt5wJ", "@TomekKopec Coach can help you get ready for the season. | https://t.co/ZoLvFnMXja", "@BengalaMan All signs point to a faster you.", "@RobertHrabluk Stay consistent and your best will only get better.", "@Naturalbabydol We agree. https://t.co/6Ga3GONLGG", "@TomekKopec Hopefully the first of many. What are you training for?", "@haydendale_ The first mile is always the hardest.", "@bharaj_rohan Bring on the day. https://t.co/fQ9CVsAJPg", "@xoHelene See you in the fast lane. | https://t.co/UDFMVlT5dv", "@hitchinsIV Coach can help get you there. Have you started a plan yet? | https://t.co/Z0IAiTcXHf", "@tril_lian Ks are always in season.", "@hitchinsIV Any new goals for the new season?", "@jonruffell Clear skies call for more kilometers. Nicely done.", "@JenMcDav Wake up and smell the miles.", "@kandicecasey After the rain comes the rainbow.", "@brianv_graphics The best way to start the week.", "@music_mike25 Welcome back. Did you miss us?", "@hardikpalan7 Just done it. How far tomorrow?", "@run4thelove Play times over. Back to work.", "@JBlaze23 A strong start calls for a stronger finish. How many miles you got this week?", "@andrewmnguyen Hey Andrew. The women's version of the Vapormax will fit more narrow as it is a B width and the Men's is a D width.", "@dogispilot As a next step, we recommend visiting your nearest retailers to see if that style is available to try on.", "@dogispilot Seeing as though the Women's pair is a B width and the Men's is a D width, the Women's pair will run a bit narrow.", "@jenncarroll76 One hill of an improvement.", "@buckie01 The only run you regret is the one you didn't do.", "@LeanneDingle Back in full swing. What are you training for?", "@MarieAlojado Training just got personal.", "@brucemclean_mac Our calendar is marked.", "@foxinboutique Stay true to form. | https://t.co/eMZFXgoaJa", "@AggieRuns Our favorite one-two punch. https://t.co/x7KsqK6hqE", "@brucemclean_mac Nothin' like some fresh Air. How far tomorrow?", "@jonruffell Don't miss a step. Focus on recovery here. | https://t.co/VNPxV5eNb3", "@Guillex13 We'll help you get there faster. | https://t.co/NKQXhimnzm", "@sam_fantastic Outwork the competition.", "@beansandmiles Best way to end the week. Still on pace to reach your goal?", "@HannahPayne78 Right back at ya. https://t.co/wxWi12kMq5", "@adrian_mathena Boom. If you need training guidance, Coach is here to help. | https://t.co/6rGt8ooVoV", "@NiaSVaughn Miles are always in season. https://t.co/vsyq7rrWRG", "@cesardamian It's yours for the taking. | https://t.co/J90MVlB8vl", "@steveserra Running at all the right angles.", "@cesardamian And tomorrow, and the next day, and the day after that. https://t.co/Ae2aTayjsE", "@nooffseason One month out. Maintain focus and results will follow.", "@Greg_Gampel Time to reclaim the throne.", "@jamielynettec One run closer to that magic number. No slowing down now.", "@EthanDa05897769 Thank you for clarifying. Where are you currently located?", "@Meggzbeth No dates have been determined on a race series, but check out our events page for events near you. | https://t.co/NP2MmrTH2i", "@adrian_mathena The mind controls the body. What's your next goal?", "@PiR2quared Racking up the badges. What's next?", "@DavidSomers9 Stronger by the mile, better by the minute. Keep pushing.", "@Guillex13 Great accomplishment. What's next?", "@ChonnaParker One 10k down. Half-marathon is calling your name.", "@romankurys Oops, you just got faster. https://t.co/vgvjYSi7Sy", "@Tom3Spencer Like you never left. How far tomorrow?", "@dethabun We'll hold you to it.", "@listsandlabels Coach can get you there. | https://t.co/cTK4kTbFUF", "@TS2606 Proving every mile counts. https://t.co/MSHUOn92dq", "@dethabun Leave your mark in KMs. How far tomorrow?", "@moJALDY You like your coffee like your miles. Strong.", "@k_g_carey The best find a way. Continue to push.", "@bichro Branching out towards a faster you.", "@adam272012 Faster every time. What's the next goal?", "@NiraMiTcHELL Temperatures rise, and you rise to the occasion.", "@homerborp Keep up the good work. You know what comes next. https://t.co/DtVhd5SWsv", "@mondzr Breakthrough performance. https://t.co/cyeGiQL3qT", "@RobertHrabluk Make your streak memorable. Think you can get to 52?", "@jjzombie13 Time to shine. Keep pushing.", "@cpasion8 Serving up extra miles. Save room for tomorrow. https://t.co/WSG0ZVLVqL", "@sip320 Only one way to find out... See you tomorrow.", "@klyman841 The only cheerleader that fits in your pocket. https://t.co/1KC22xSV4r", "@listsandlabels Can't cloud dedication. Any races in your forecast?", "@DARYLsaDIMEond Going the distance. Check back in after you break the tape.", "@AbYwOoDs No days off.", "@strainey71 You always go the distance.", "@Running_Nick_NL The fast lane has your name on it.", "@cwnutrition Every step is an adventure. Follow along in the app. | https://t.co/enAghk2M2O https://t.co/EMpuM2Nfnj", "@meggieconway Commitment day after day. Keep at it.", "@JohnLoughton Crushed it. We know this isn't your last. https://t.co/eMkreSeMEO", "@FrankPucher Refreshed and recharged. Bring on the week.", "@joselinares323 Making running a life-long habit. Never slow down.", "@justinquirino Whatever gets you out the door. https://t.co/rfy1IUvOmA", "@ChonnaParker Every run has its purpose. When's the next race?", "@cwnutrition Adaptive for all surfaces. How far did you go?", "@taitaiitalia Clear the runway, we have takeoff. https://t.co/av7E39VuJL", "@ShaneRooD15 Getting your daily dose of vitamin d(istance).", "@frankfurter05 More bad hair days to come.", "@homerborp So... how's the training?", "@RaviRbhoite No word on NRC events in New Delhi. Contact your local Nike store for more info on the latest events. | https://t.co/k6xLVyWf2i", "@IfUSeekDrew The only mistake would be stopping. Keep pushing.", "@k_g_carey Say no more. Check here. | https://t.co/NZKB2ILrqW", "@Smit_talks And Sundays, Mondays, Tuesdays...", "@Olive9124 We'll meet you at the finish line. | https://t.co/K4Truo7B43", "@k_g_carey Progress only stops if you do. How far tomorrow?", "@jjzombie13 Fast ain't always pretty. https://t.co/PgBakUkU27", "@joelnert Turning your obstacles into opportunities. https://t.co/RYOwnTXPcn", "@TheBerner It's always worth it. Keep up the good work. https://t.co/1LWe90OHP1", "@Olive9124 He has a way with his words. What're you training for?", "@Nike @mirrorthought Find your fast. | https://t.co/3nQxRFia6Q", "@ZackMillsHealth Easy does it. Always good to be back.", "@jenncarroll76 Coach has a plan to get you there faster. | https://t.co/w6gH7PVItA", "@LaaganYola Hopping in the fast lane. Have any races lined up?", "@jenncarroll76 Continue the feeling tomorrow. https://t.co/5rbA1EyH3g", "@tril_lian Smooth sailing ahead.", "@cpasion8 Can't be tamed. https://t.co/SVLV5O6QLb", "@Ant_Judge With a team like yours, success is inevitable.", "@AliK_AliG Crossing off the miles. | https://t.co/e6FaVZhajq", "@daviDBWalker The daily grind. How far will you take them tomorrow?", "@Ant_Judge Rising to the occasion. What's your goal time?", "@Nike @cantbecontrold We'll find out. https://t.co/4pVpT7NynD", "@JBlaze23 Covering ground. We'll see you tomorrow.", "@RobertHrabluk Distance is calling. Ready to answer? https://t.co/XcJOe1rXLZ", "@romosapiens Always on the move. What's in store tomorrow?", "@OMGitsNATH Your hunger for Ks is unmatched. How far in April? https://t.co/YLCi132GUM", "@Partunia No news on that. Check out local events in your area here: https://t.co/Um6Hbx4f1z", "@brucemclean_mac Looks like you've got competition hot on your heels.", "@SmangaMad Fast is your only speed.", "@JackGaffney94 Faster and further each week. How far tomorrow?", "@Nike @vilibara Think you can keep up? | https://t.co/mmtpZw2DXO", "@pazinger Bring the heat. https://t.co/iwCMgebBos", "@FurkanKutlular Chasing your next PR. Have a goal in mind?", "@SinghShekhon What's black and white and fast all over?", "@strainey71 The calm before the storm. How far tomorrow?", "@rupert1975 Focus on the finish line. 25 minutes in sight.", "@miguelsdsu Earn every weekend. https://t.co/hVXwj6eRMD", "@cesardamian Reach 6 this weekend, howbow dah?", "@_Maeeee You've created quite the page-turner.", "@JennLeeDawson Finish it fast on Sunday.", "@NiraMiTcHELL Making that 10K distance look easy.", "@PilotProp New shoes, new adventure.", "@bobaulak Bring on the weekend.", "@karmafrazier Dress code for the track: sweat.", "@anz0la These will definitely shave some time off your PR. Be sure to check out our awesome 30-day return policy. https://t.co/MZGmPKbbzm", "@karenatran Words that will always hold true. https://t.co/fCqq1isitE", "@anz0la We got you. Are you looking for a half, 3/4, or full length tight?", "@sam_fantastic Forecast is showing a high-mileage weekend.", "@ShaneRooD15 Sounds like you're in fast company.", "@jnbdesigner Don't stop at good. https://t.co/jN2S13GugS", "@Spideyellis Do today what you will be proud of tomorrow.", "@JenBeck1126 Miles unleashed.", "@strainey71 The weekend gets here faster when you run.", "@SabinevanZeijl We'll be with you for every stride.", "@sip320 You've got this. Get ready for the starting line with these NRC tips. | https://t.co/KMHoywu50H https://t.co/dOOryztvcK", "@mentlemadness Small gains lead to big results. Continue pushing your limits.", "@ShaneRooD15 That's a lot of ground covered. What was your favorite run?", "@run4thelove Eatin' up the miles.", "@chickenails https://t.co/QBv81oS75o", "@Spideyellis Which record is going down first?", "@jonruffell You grew up fast.", "@RobertHrabluk Double down Fridays.", "@eyoste We're not mad, we're just disappointed...", "@mexidorian84 Looking good. When's the half?", "@JBlaze23 Turn up your turnover.", "@trentneil87 We have moved your trophies/achievements to Nike+ to make room for other improvements coming soon. | https://t.co/2w75Hvkxuf", "@sip320 No matter what, you'll be ready to put in work. When's the big race?", "@MoeDLeeIV Time to get your legs back. What's your next goal?", "@cooptyhebert Coach has one. Start here. | https://t.co/xbq7I3KTMI", "@Ant_Man85 If there isn't currently an NRC in your area, you can keep up with training tips and workout plans here: https://t.co/jD5glIs51k.", "@Nike @henryakuza He can go the distance. https://t.co/nr3wA1ULVy", "@sulcolake That's what we like to hear. Let us know how it goes.", "@mymanhenri It's coming up. Are you racing?", "@k_g_carey Welcome back. How'd it feel?", "@TheLostGrad Keep melting the competition.", "@thengel Break it down to build it up.", "@yeahwicaksana Make your feet smile. https://t.co/3fhcKlchgN", "@JenBeck1126 What doesn't knock you over makes you stronger.", "@juhiek Happiness is found in the Ks. Welcome back.", "@Kakavirk No map needed.", "@tancheekwang Your dedication is one for the books. https://t.co/0SEP48CLMG", "@xoHelene You've put in the miles. What's the goal time?", "@JulieImmel Here to help you find that shoe. Chat live with our running experts for guidance. | https://t.co/hHrDbCNE7w", "@jacobs_sibylle Run now, sleep later. | https://t.co/pgHcUkT57S", "@sulcolake Saving your run for the new kicks?", "@superwomankw One for the history books."]}