{"PrincessCruises": ["Find your bliss in beautiful balcony views. #ComeBackNew https://t.co/j0xE3zgDi3", "@Jassaj84 Hi Jasmin, you can find boarding information regarding your cruise in your Cruise Personlizer!", "@aniljohn61 Hi Anil, drink packages must be purchased for the full length of the cruise.", "@lodzau80 We're sorry you had a disappointing experience with one of our team members. We hope to exceed your expectations in the future.", "A fantastic evening awaits. https://t.co/SfVgyhblfo", "Our favorite color is sunset. \nPhoto by @jchongstudio https://t.co/c1bC4WhqQC", "Spend your weekend with a wake view. https://t.co/VryoFLzG4I", "Embrace adventure from every angle. #ComeBackNew https://t.co/F2QajD7ET4", "Naming ambassador @YaoMing shot some hoops onboard #MajesticPrincess! https://t.co/tDhSG74S2f", "Onward to new adventures. https://t.co/F21Y7reLJJ", "Stare in wonder at white-capped peaks. https://t.co/U7fKbOMAyr #ComeBackNew https://t.co/Cwe1NydD7I", "@derfrepooc Hi Fred, you can find the full details of your intinerary in your Cruise Personalizer.", "@BarryAdams86 No aspect of this issue compromises the safety of our guests and crew. We look forward to welcoming you onboard.", "@BarryAdams86 We are working to determine the next possible time for Caribbean Princess to be taken out of service to complete the repair.", "@BarryAdams86 The motor issue happened after the ship left its recent dry dock &amp; the repair requires the ship to be taken out of service...", "Greet greatness at the shoreline. https://t.co/0P6lI4OHJU", "RT if you agree that every day should start with coffee and croissants. #ComeBackNew https://t.co/tBZo0Fc5e2", "#MajesticPrincess made a splash debut! https://t.co/YBDkdHhHgA", "Dive into relaxation. https://t.co/mUWge3BIA5", "Greetings from _________! Fill in the blank with where you're heading next. https://t.co/b89OCFMuNI", "The best days begin like this.\nPhoto: https://t.co/yuxrWnk71l https://t.co/Tu011XvuwY", "@petercfuller Hi Peter, we deeply apologize for their frustration and hope they connect with our onboard Guest Services team to assist.", "@bag_cats Get your reading list ready!", "@CaptainVacation Can never the episodes too many times!", "@108kent Sounds lovely!", "Share in the excitement of the #MajesticPrincess naming ceremony! https://t.co/YIe78KBpSX", "@KRawat1989 Hi Kapil, our approved international recruiting partners can be found here: https://t.co/yi87Ph4DO2.", "A view that's worth its weight in gold. https://t.co/2zIciEAbyh https://t.co/JMEgdxhQe9", "Fill in the blank: My favorite way to pass time on the Lido Deck is ___________. https://t.co/Peu5YjLkC4", "Wake up to wake views. https://t.co/OKxaWydx2I", "Experience a sundown sailaway. #ComeBackNew https://t.co/mbq3zOP3L1", "RT if you're dreaming of a day on the Lido Deck. https://t.co/zJ8hFh036N", "@WheresWalterTV Hope to have you back onboard again soon!", "@badtzmoradito Hi Mariana, you can find employment information at https://t.co/hInRH5yxmd. Best of luck!", "Get wrapped up in awe-inspiring Alaska moments. https://t.co/l1iyiBoDmp https://t.co/0QINhlYvcH", "Always chase new adventures. #ComeBackNew https://t.co/I3HQVMQJk2", "RT if you wish this was your #SunsetSunday view. https://t.co/5taa4dLNBj", "Feel at home in a place you've never been. https://t.co/cT7EORaQvB", "Our naming ambassadors, @yaoming and Ye Li, officially named #MajesticPrincess during a ceremony in Shanghai! https://t.co/6VvEtf4xdJ", "Make a magical entrance on Majestic Princess. https://t.co/yDCQaWQWMn https://t.co/gjjTy8dUGq", "Spend a sea day poolside. #ComeBackNew https://t.co/zc3Yf6B3mB", "@_Mark1966 We appreciate your feedback, Mark. We will be sure to pass along your comment and we truly apologize for the frustration.", "@Kateisfly Hi Kate, we truly apologize for the difficulties. Were you able to get through today?", "@edd342 Our apologies for the waits during peak call times. You may find what you need at https://t.co/I8ZyZJm0gE as well.", "@leightontb Hi LJ, we hope guests enjoy meals/tea at their leisure while also being considerate of others waiting.", "@CMetel Glad you had a fantastic cruise, Chris! Hope to see you again soon.", "@ctravelerllc You are welcome to bring water onboard or purchase a beverage package that will include water and be hassle-free", "@jkrislc We truly apologize for the disappointment with longer waits during peak dining times. We will be sure to pass along your feedback.", "Catch a glimpse of grandeur. #ComeBackNew https://t.co/PsnDzBUGJx", "Scenic views await no matter which way you look. https://t.co/1GnGcXPa1f", "RT if you're dreaming of Belizean bungalows. https://t.co/vSatRGcJIe #ComeBackNew https://t.co/H342ORw1wd", "\"The sea, once it casts its spell, holds one in its net of wonder forever.\" \n- Jacques Cousteau #ComeBackNew https://t.co/s6whHaIJUw", "Be surrounded by serenity. https://t.co/NvJd0cdBCw https://t.co/EgFpL44V8e", "Chocolate speaks the universal language of \"delicious.\" Happy #WorldChocolateDay! https://t.co/Uk9fTtJZ8J", "We'll take our breakfast with a side of sea breeze. #ComeBackNew https://t.co/CIbaWWnkIF", "@HaileyNicoleYT Hi Hailey, we'd be happy to direct you with some additional info.", "@indecentsec We'll be sure to pass along your feedback to our web team!", "@CaroleSalinger We hope we get the opportunity to exceed your expectations in the future, Carole.", "Cross another adventure off your bucket list. https://t.co/MPmiQkzJl8 https://t.co/AjIWMERq4H", "RT if this is what your happy place looks like. #ComeBackNew https://t.co/wAlo1uxRdv", "@DLineTitan_94 We're so sorry to hear that -- could you DM us your Booking # so that we can look into this further for you?", "@BonVoyageurs Gorgeous photo! We can't get enough of your cruise snapshots.", "@nonameRdam010 We apologize for your frustration. Depending on your location you may need to book through a local agent.", "Every day of summer is worth celebrating. https://t.co/ZX7h05zICu", "Experience the majesty of the ocean. https://t.co/8vjDyLECoF", "RT if you're wishing this was your view today. https://t.co/Lk5du43hfi", "Find your paradise in the luxury of the Lotus Spa. #ComeBackNew https://t.co/F5m5wLcRkK", "@laur613 Hi Lauren, a number of 2019 cruise itineraries can be found at https://t.co/4NSRnJq1FN. Hope to have you onboard!", "@accountantsbfit Have a great cruise!", "@nonameRdam010 You are welcome to book using the website or through a local agent- whichever you prefer.", "Discover Majestic's heart of gold. https://t.co/X0TrsVzigk\\ https://t.co/yZg4skyVHS", "Get wrapped up in a scenic wake view. https://t.co/kMR62sfZhX #ComeBackNew https://t.co/rKLJdth6Jp", "Find your moment in Mykonos. https://t.co/vCwBicwgAv https://t.co/4NQZFurlMn", "Dreamworthy views from dawn to dusk. https://t.co/paZ9xMVjtU", "Revitalize your senses in the Sanctuary. https://t.co/tFhfjoTGpv #ComeBackNew https://t.co/8CuIuzp7GS", "Every hour is golden at sea. #ComeBackNew https://t.co/znc8HqJTFt", "Salty sea. Sweet memories. https://t.co/BukAdy6vRF", "#MajesticPrincess has made her maiden call to Taiwan! https://t.co/ARw2rfcblh", "@UKfamilycruise Have a great cruise!", "Toss your worries in the wake. https://t.co/C5DXddkZtw", "@klarsen4532 Thanks for your understanding. We hope you'll be able to sled with some adorable pups again soon!", "Embrace every beautiful moment in Alaska. https://t.co/0pq7uoM7NJ https://t.co/e1d6iBc4jQ", "The only thing better than a wake view is a wake view at sunrise.\nPhoto: https://t.co/AI8W8gmmgY #ComeBackNew https://t.co/kbQFVR7pie", "We're thrilled to be awarded Best Cruise Line Overall and Best Premium Cruise Line by Cruise Passenger Magazine! https://t.co/f0li4krekS", "Sunsets are better at sea. #ComeBackNew https://t.co/Jk4kLdE8RW", "The sweetest greeting. https://t.co/xp7yoSVysS", "@erinbrown28 Our apologies for any confusion or mixup, Erin. We hope you were able to get the chocolate beverage you were after!", "Discover shorelines splashed with color. #ComeBackNew https://t.co/BIpRhMWxEv", "Where's the most relaxing place you've ever been? https://t.co/auFyb9DQlo", "@soozzone Try so shoot us a DM now. https://t.co/7C4P4iFqcR", "@ElizeVStratton Hi Elize, on https://t.co/4NSRnJq1FN you can search ship and look at itineraries for that specific schedule.", "We're pining for palm tree views. https://t.co/xfaDOxt0O9", "@soozzone We truly apologize for your frustration. If you DM your booking number we'd be happy to have your Cruise Planner reach out.", "@dleehc Hi David, if you've provided your air details in your Cruise Personalizer a team member should be waiting for you in baggage claim.", "@Kish__1 All bar charges have an additional 15% gratuity. For the drink packages, there is the one-time charge instead of for each purchase.", "Get your day off to a bubbly start. https://t.co/YAks1QJWdw", "Bergen is a vibrant city with small-town charm. Discover the best of Norway. https://t.co/as0jqxZGxu https://t.co/93ANCU7p5C", "A deck fit for a princess. https://t.co/B7kYajEJ3Q", "@Sazon_Boricua We apologize for the frustration and will follow up with the BlogHer team regarding these concerns.", "@Sazon_Boricua team was not informed or aware that any confirmed attendees were denied entry to our reception. (continued)", "@Sazon_Boricua Hi Jeannette, we are deeply sorry to hear about your experience. The BlogHer team managed event check-in and the Princess...", "Onward to new adventures. https://t.co/IydntdmTw6", "Experience sun, sand, sky &amp; sea in Sydney: https://t.co/85hYtun4tu https://t.co/ols7NqUThn", "@calimesaguy Have a great cruise!", "@NancyCarroll Hi Nancy, our apologies for any confusion. Food is included on the cruise portion of a land and sea tour.", "@GSJ64 Let us know if this gives you the information you need: https://t.co/jO14RtqvHE", "@routerbad We deeply apologize for your frustration with the internet onboard. We've passed along your feedback to our team.", "@Kish__1 Hi Kish, you can find the various drinks packages here: https://t.co/jO14RtqvHE. 15% gratuity is in addition.", "Endless adventures by land and by sea. https://t.co/LlecHk2Ul0 https://t.co/LMQtHcyalB", "\"We take photos as a return ticket to a moment otherwise gone.\" \n- Katie Thurmes #ComeBackNew https://t.co/A0I0wTVrUe", "@beanie1706 Correct, The Retreat pool has no charge unless  you'd like to reserve a cabana.", "Adventure awaits on every coastline. https://t.co/GHWVREnx31 https://t.co/KWeam3ZOGA", "@WorldShowcased The Fly Boys have performed on various Princess ships- keep an eye out for them onboard in future!", "Good morning, sunshine. https://t.co/vPEkmMkiQO", "Have a crack at authentic axe throwing on our Alaska Cruise. https://t.co/gOJxpxibiS https://t.co/o0XUxPk7nC", "#MajesticPrincess arrived in Xiamen today celebrating her maiden call to China! https://t.co/JYgpL7DqqA", "Fill in the blank: My favorite evening activity at sea is ___________. #ComeBackNew https://t.co/l6peds3JND", "Escape the ordinary. https://t.co/DG1seTmoCL", "When in doubt, vacation. https://t.co/EsaC8tqlPC", "Happy Day of the Seafarer! Today we're celebrating the over 30,000 members of our seagoing family. https://t.co/9qKRw5RLnT", "Share a sunset with the ones you love. https://t.co/XnZRFXVu60", "Soak up a splash of sunshine. #ComeBackNew https://t.co/7xgtsiv3m7", "A view that will leave you speechless. https://t.co/HQrAsWSgQH https://t.co/t4bX11eRwy", "Never underestimate the magic of a sunrise at sea. #ComeBackNew https://t.co/2WLAsQMkhP", "@MrsDestinyJ We're excited to sail the Mediterranean with you! Have a great cruise!", "@piratesunshine Hope you had a wonderful day!", "@GSJ64 We have an all inclusive beverage package. Take a look at https://t.co/I8ZyZJm0gE for more info!", "@belfastbiker Although we don't have any planned itineraries starting in Belfast, we will be sure to pass along your suggestion.", "@washdoubt Hi Chad, we'd be happy to look into this if you send details via email to customerrelations@princesscruises.com.", "@bluefairy099 We apologize for the frustration, Megan. We are happy to resend if you call 1-800-Princess with your booking number.", "@mridulamohata Hi Ranju, we're truly sorry for your disappointing experience. We hope you reach out to customerrelations@princesscruises.com", "@lkundmue_08 Have a great cruise!", "@b_cmack Sure can! Happy to help over the phone if difficulties persist.", "The best seats in the house. #ComeBackNew https://t.co/OKAQrj3CQa", "Take a stroll with the seas. https://t.co/RsTjDQ4Yfi", "\"I haven't been everywhere, but it's on my list.\"\n- Susan Sontag #ComeBackNew https://t.co/0gBfBzYbAE", "Stare in awe at a morning masterpiece. #ComeBackNew https://t.co/gwmgmVTCrJ", "@washdoubt We're sorry to hear that, Chad. Please let us know if we can assist.", "@Geoffa30 Hi Geoff, we've offered similar promotions in the UK before so keep an eye out!", "@GSJ64 There are various offers and promotions applicable at any given time. Happy to search for the best applicable fare at 1-800-Princess.", "@Chayden87 We truly apologize for your frustration. Your cruise documents include info regarding our 24/7 en-rout assistance team.", "@edd342 Hi Ed, you will see additional information in you Cruise Personalizer regarding the number of formal nights for your itinerary.", "@VictoriaGault Hi Victoria, if you pre-order than you also pre-pay!", "@bmeckie Hi Becky, the Sanctuary has a nominal cost but well worth the extra pampering!", "True or false: The most magical sunsets are discovered at sea. \nPhoto: https://t.co/MEcgWqKNfx https://t.co/JSVagwdKMS", "RT if you wish you were spending the #FirstDayofSummer in Princess Cays. https://t.co/pGWsRxf5Wq", "Make Santorini the backdrop for your next selfie. #NationalSelfieDay https://t.co/5jBCoq6exP https://t.co/T7OEEDoxT4", "Wake up to wake views. https://t.co/8uESDKCqiQ", "\"Travel &amp; change of pace impart new vigor to the mind.\" \n- Lucius Annaeus Seneca #ComeBackNew https://t.co/c3KE2hQVtN", "A curbside pickup like no other. https://t.co/jy5lMTxZQc https://t.co/Xm01oXOhco", "The best days begin like this.\nPhoto: https://t.co/yuxrWnk71l https://t.co/DYgflcwndg", "Life is better by the pool. RT if you agree! https://t.co/ByOp12llcg", "Take a sip with the sea. https://t.co/FRvjxHCtA9", "This is what the face of adventure looks like. #ComeBackNew https://t.co/BkGQxBtV8K", "@_grammar_ Our apologies for the typo.", "@aj_jeans28 Hi Andrew, we apologize for your frustration. Let us know if you are still experiencing difficulties.", "@MercurialMoose Thanks for bringing this to our attention, Dan. We've let our web team know.", "@Amy_Urquhart Always a good idea!", "@addlee24 It sounds like your Captain's Circle is not on your current booking. Contact 1-800-Princess so we can update!", "Surround yourself with grandeur. https://t.co/Ib5evwJQqf", "Sunny days ahead. https://t.co/HOpZhdbpIH", "Happy #FathersDay from our Princess Cruises family to yours! \nWhat's your favorite travel memory with your dad? https://t.co/VSPvtk2e6K", "Who would you like to be sharing these seats with? #ComeBackNew https://t.co/5eXxHiYsaZ", "Get wrapped up in a scenic wake view. https://t.co/S1vpSqs3BV #ComeBackNew https://t.co/5EHeIEFzjN", "@drjanpyup Hopefully you can make your dreams a reality and join us on a cruise soon!", "@NZmaorichick29 Hi Ashley, you can check https://t.co/hInRH5yxmd for info!", "@vince7008 Wouldn't it be more fun to wait for your \"friend\" to find out on their own?;)", "@srcade Glad you had a great cruise!", "Cruisin' into the weekend. https://t.co/b6WGPIKlok", "@ImperialCruizer So happy we were able to help!", "@theRealLesleyT Hi Lesley, we deeply apologize for the frustration. We hope your are able to find a resolution with your travel agent soon.", "@TylerMcVaney We truly apologize for your frustration &amp; hope you reach out to our onboard team to discuss how we may improve your experience", "We find our happiness where the sun shines. https://t.co/T5kTzi7SNQ", "@BlueYonderCFC Hi Chris - Cheers to that!", "Our favorite color is sunset. \nPhoto by @jchongstudio https://t.co/WN9tGA1xQN", "@newietraveller Hi Greg, we're not certain of the date this image was taken. Perhaps you may have seen our photographer!", "RT if you're wishing this was your view today. https://t.co/nIpzIMSR68", "Dessert tastes even sweeter at sea. https://t.co/Xr8rCVq9Nq https://t.co/RKKRxwSh9Y", "RT if you're longing for Lido Deck views. #ComeBackNew https://t.co/v3T0sGkYcP", "Feel at home in a place you've never been. https://t.co/ZQx50PMWLK", "@truscom Hi Martin, we apologize for the delay. Although we aim to respond as quickly as possible, response time may be 2-4 weeks.", "@amaiznblugrl We sincerely apologize for your frustration. We hope you reach out to let us know how we can help rectify.", "@NicFawley Hi Nicola, you will get the cup as well.", "@dodgergirldrea Thanks for the feedback, Andrea. We truly apologize for your disappointing experience.", "@kinetiq We apologize for your frustration with booking policies. Depending on your location you may need to book through a local agent.", "Upgrade your window views. #ComeBackNew https://t.co/tH36MYSEvK", "Stop wishing, and start going. #ComeBackNew https://t.co/H3Nf4HD5g1", "@Guis168 Luggage is delivered in the evening &amp; dining dress is relaxed on the first night for this reason. Our apologies for the frustration", "A view that's worth its weight in gold. https://t.co/FaxndSWKQ7 https://t.co/J8Qg6DI7Yp", "@MommyPowers Hi Lynda, although our event is at capacity, we hope to meet you next week!", "@Coketz Hi Antonio, we apologize for the delay. Please DM us with details and his full name and we will do our best to assist.", "@sheriffkd Bon voyage!", "@Jerseyfamilyfun Hi Jennifer, we'll be around at the Friday lunchtime keynote. Be sure to say hi!", "@jenvargas Hi Jen! We hope to connect with you next week too. See you soon!", "Go with the flow. #ComeBackNew https://t.co/zFNpK5tK7k", "At sea, every route is a scenic one. #ComeBackNew https://t.co/S6MTax3XXZ", "Embark on the journey of a lifetime. https://t.co/DhEVA1gB5Z https://t.co/vekMG7FcCG", "The ocean is calling. https://t.co/sZbMEkT9nM", "@sheriffkd Now it's 5 sleeps! See you soon!", "Fill in the blank: When I'm relaxing in The Sanctuary, I'm sipping on _________. #ComeBackNew https://t.co/DTLlGiyMje", "Sink your toes into the sands of paradise. https://t.co/amOFronkZw https://t.co/it9aZFYaWy", "Discover where the waves kiss the stars. https://t.co/17il04xajU https://t.co/McL57btbFs", "No minute of sunshine is wasted at sea. #SunsetSunday https://t.co/hExbZx6kDH", "Find new perspectives. https://t.co/6axtL9BFcM", "Always err on the side of adventure. #ComeBackNew https://t.co/Gdi85cZGaW", "After a little peace and quiet? Escape to your own private cabana onboard at The Sanctuary. https://t.co/0KRscip03v https://t.co/XMucbBXMPY", "It's not just about where you're going, but how you're getting there. https://t.co/D2K2ObZwye", "Debark for a day. Make memories to last a lifetime. https://t.co/NSRFjGfrV4 https://t.co/W30jKgfers", "Enjoy a sweet start to your sea day. #ComeBackNew https://t.co/t52YAnQfLj", "Discover where culture, adventure and beauty collide. https://t.co/UYaz9A0V9S https://t.co/CPgI2gdLcI", "Time stands still on the Lido Deck. https://t.co/u77GUeK5sc", "The sound of the ocean is music to the soul. https://t.co/I9rGIpzYwS", "Light up your day on the Lido Deck. https://t.co/KYNXC1TiBW", "@ABCretivLearnin See you in a couple weeks, Victoria!", "@SandiMcKenna See you in a couple weeks, Sandi! We can't wait to reconnect!", "True friends are those you'd share your ice cream with. Happy #BestFriendsDay! https://t.co/rDgblo70iP", "\"So much of who we are is where we have been.\"\n- William Langewiesche https://t.co/5yoRfYHj1A", "Stare straight into the face of adventure. #ComeBackNew https://t.co/FP4rlhYsqK", "@Twirrim We'll be sure to pass along your feedback to our web team!", "@mcnuttsc Our thoughts are with you and your family during this difficult time, Scott.", "Seize the day on the high seas. \nhttps://t.co/VttymgI3CE https://t.co/q2VqheK64M", "A sense of adventure never diminshes. #TravelTuesday https://t.co/segTvpMWaU", "Embrace a moment of stillness. https://t.co/CCNjqsrh40", "Where's your favorite window seat onboard? #ComeBackNew https://t.co/GoCkLfq3jC", "Meet some of Alaska's furriest friends on the Husky Homestead Excursion. https://t.co/poFffiD1ib https://t.co/eJZofAaBW9", "@jody_calabrese We're truly sorry you had a disappointing experience. We hope you provide feedback to our shipboard shore excursion team.", "@lcfinns You can also check with your travel agent or call 1-800-Princess to inquire about a paid upgrade.", "@lcfinns If your booking is noted that you'd like an upgrade than there's a possibility you may receive one. Fingers crossed!", "@KarenLGermain Have a wonderful cruise, Karen!", "@mmcquilkin We hope that you reach out via email to customerrelations@princesscruises.com so we may address your concerns.", "@mmcquilkin We sincerely apologize for your disappointing experience.", "Make your grand entrance. https://t.co/tKeDfb8rVv", "RT if you're happiest with a wake view. https://t.co/eNr27kTZBO", "Catch a glimpse of beauty in every cove. https://t.co/urN7qOMcaI https://t.co/tZv63b2LoU", ".@MrJamesCosmo will be joining us onboard Crown Princess this week! https://t.co/sAmWlX4JDl", "Reflect on the beauty of another day at sea. #ComeBackNew https://t.co/Adi2zZicSc", "Magnificence awaits on Majestic Princess. https://t.co/9L6Aq3KUn6", "Find your paradise at the pool. #ComeBackNew https://t.co/bXI0AKG8fK", "Greet the waves from 128 feet above. https://t.co/q0d00EfsPy https://t.co/42VGeFBDNh", "Reflect on the beauty of another day at sea. #ComeBackNew https://t.co/dejSAxKfnK", "Captivating beauty from all angles. https://t.co/biwI15vk2r", "@Geoffa30 At this time, there are no plans for a specific replacement.", "@Geoffa30 Hi Geoff, although the Sea Witch beers have been discontinued we hope you enjoy the variety we still have onboard.", "@Erins_Best Hi Erin, there are various offers and promotions applicable at any given time and fares may fluctuate.", "@knicholas24 Hi Kylie, if you are experiencing delays we hope you reach out to our en-route assistance team.", "@VoteRemainWatch It sounds like your member number may not be accurate on both bookings. Give us a call so we can correct this!", "@BillBoone82 Have a great cruise!", "@DCCuban We deeply apologize for your continued frustration. We hope to exceed your expectations in the future.", "Light up your day on the Lido Deck. #ComeBackNew https://t.co/HepLIka4c3", "@tiffsho We're sorry to hear about your luggage. Be sure to reach out to a Princess team member on your tour to discuss how we can help!", "Relaxation on repeat. Happy #NationalRepeatDay! #ComeBackNew https://t.co/ZfVaIkEsUx", "Be inspired by a top-down deck view. https://t.co/KO2UjF5X1J", "RT if you're dreaming of this dreamy view. #ComeBackNew https://t.co/79cwPBSTWK", "An ocean of discovery awaits. https://t.co/210iyWw0X6", "True or false: There's no better place to watch a sunrise. https://t.co/VhdTYVA5v0", "@srankin8 See you soon!", "@BillPark69 Hi Bill, International Cafe and room service are both available for late night eats!", "@JackieSueCronin Hi Jackie, we apologize for your frustration. Are you in touch with our lost and found team?", "Tune into @NBCTheVoyager this Saturday as @mrjoshuagarcia docks in Barcelona &amp; dives deep into Catalan culture! https://t.co/WB52aVNeCp", "@theoryoferin We apologize for the frustration, Erin! We hope you get it all sorted ASAP.", "@JoanMaryAllen2 Hi Joan, all employees undergo a rigorous interview and training process. We will be sure to pass along your feedback.", "@jeffrey_thomson Hi Jeffrey, we were able to locate your booking and see that a resolution has been extended.", "Dive into relaxation. https://t.co/HshW5UsX3D", "Log off. \nBreathe in. \nIt's time for vacation. https://t.co/kxFmpeylJQ", "Excited for #SharkWeek? We're celebrating with Shark Week at Sea: https://t.co/AmNXpAbCxv https://t.co/OebRRvu8sx", "Floating into paradise. https://t.co/8DVi0uuQYE", "Brighter days await at sea. https://t.co/KkpfgqaINa", "@09Wright Hi Matt, there is a fitness center aboard each of ships with access free of charge!", "Climb the Spanish Steps and have a wander in St. Peter's Square on our Rome excursion. https://t.co/VKHfTR4DWm https://t.co/Olbql5MMRV", "@09Wright Hi Matt, although kettles are not supplied in staterooms for safety reasons, you can get tea delivered!", "@VictoriaGault We've let our web team know! Bridge cam availability is based on a number of factors, including weather.", "@CarolineF2007 We've let our web team know! Bridge cam availability is based on a number of factors, including weather.", "@jeanett15963844 We're sorry to hear you had a disappointing experience, Jen.", "@RhondaBlakey As of Fall 2017 voyages, all shorex must be prepaid.", "@RhondaBlakey We apologize for your disappointment with excursion pre-payment. Guests still have the option of waiting until onboard to book", "@accountantsbfit Hi Kyley, we apologize for your frustration. We hope you reach out to customerrelations@princesscrusies.com to address.", "@jaymeedelmundo Hi Jaymee, you can find details for what terminal will be used for your specific voyage in your Cruise Personalizer.", "@DCCuban Please reach out to a Princess customer service representative on your tour to discuss how to improve the remainder of your stay.", "@DCCuban We sincerely apologize for the disappointing experience at Denali Lodge.", "Relaxation awaits. https://t.co/ltm7J8PoMi #ComeBackNew https://t.co/TWaJRS3RtV", "Bask in a balcony breeze. https://t.co/SM3njv5pMq", "Fill in the blank: If I could go anywhere right now, I would sail to _________. #ComeBackNew https://t.co/e71aYGwDhP", "Make Monday Majestic. https://t.co/QAuuxLNhWl", "The sweetest greeting. https://t.co/K7amUKQlHp", "RT if you agree: Mondays are better with Mai Tais. https://t.co/UaR4NdM4e7 https://t.co/8VtkIPwC3O", "Experience the adventures that await on a vast horizon. #ComeBackNew https://t.co/USmEYTmbrP", "Share a sunset with the ones you love. https://t.co/jfrCY1Q7NX", "The ocean is calling. https://t.co/QyjBbADN7D", "@StephanoPavoni We apologize for the frustration with immigration requirements. We hope to exceed your expectations in the future.", "@StephanoPavoni Hi Steven, we apologize for the delay leaving Southampton due to a last minute medical disembarkation.", "@ScoresbyJR Hi Josh, Crown Princess was delayed  due to a last minute medical disembarkation. We apologize for the inconvenience.", "@MrDavidKirb Hi David, we apologize for your frustration.  Crown Princess was delayed due to a last minute medical disembarkation.", "@phoenixalpha We sincerely apologize for your frustration. Crown Princess was delayed due to a last minute medical disembarkation.", "@loobey41 Hi Lucy, Crown Princess was delayed due to a last minute medical disembarkation.", "@truscom Hi Martin, Crown Princess was delayed due to last minute medical disembarkation.", "@Geoffa30 Our apologies, Geoff! Let us check into this for you!", "@sheriffkd We look forward to welcoming you onboard!", "@KE4INM Hi Jim, we apologize for the long wait time. We hope to exceed your expectations in the future.", "@veggie_desserts Stop daydreaming and start planning! We'd love to have you onboard.", "@tonyiovino Hi Tony, we sincerely apologize for the delay. We hope to exceed your expectations for the remainder of your voyage.", "@Geoffa30 Hi Geoff, our new bear- Stanley- is making his way to all ships soon!", "@StephanoPavoni Hi Steven, we sincerely apologize for your frustration with necessary immigration processes. We pass along your feedback.", "See the world from a new perspective. #ComeBackNew https://t.co/ij5KSR4Jwt", "Celebrate #NationalBurgerDay with the Ernesto Burger, named Best Burger at Sea by @CruiseCritic! https://t.co/Gu9h6MAzIB", "\"Dance with the waves, move with the sea. Let the rhythm of the water set your soul free.\" \n- Christy Ann Martine https://t.co/jHEQLUnFa0", "Never lose your sense of wonder. https://t.co/EtAlU5nmQy", "The only trip you'll ever regret is the one you don't take. https://t.co/IoolOqS3IN", "@KE4INM We apologize for the delay.  You may experience longer waits at peak call times.", "111 days. 45 ports. The ultimate adventure. Hop onboard for a trip around the world: https://t.co/u6aibnzel3 https://t.co/7W3Hg51rGE", "Rise. Shine. Explore. Repeat. #ComeBackNew https://t.co/SP1KhCazTN", "An ocean of discovery awaits. https://t.co/fPDnmzQBKx", "Tune in this weekend to @OceanTreksTV as @jeffcorwinlive continues his unforgettable cruise in the South Pacific! https://t.co/jyF8BoGR8y", "Never underestimate the magic of a sunrise at sea. #ComeBackNew https://t.co/dLsCWhHWQK", "@jkoneman Hi Jason, we are very sorry, but since we do not hold your card details we are unable to control making of the refund ourselves.", "@SuzanneKorff Bon voyage!", "@SuzanneKorff So sweet!", "@barnydunk Our apologies David, we didn't see a question. We are deeply sorry for the inconvenience &amp; refunds have been processed.", "@SamNevsDC Best wishes on your upcoming nuptials! We look forward to having you onboard! #expediachat", "@SonofTertius We sincerely apologize for the inconvenience. Elavon, the third party card processor has reversed the second transaction.", "@19_shn Hi Sandra, there are limited collapsible infant beds available to request and high chairs available in the dining rooms.", "@jeffrey_thomson We apologize for the delay. Although we aim to respond as quickly as possible, response time to emails may take 2-4 weeks.", "@SarahMcClure10 Hi Sarah, we apologize for the frustration. We forwarded your info to our team to reach out.", "@klarsen4532 Hi Kelly, complimentary recognition includes balloons &amp; a sign on your stateroom door &amp; a special dessert in the dining room.", "An unforgettable moment. A lifetime of memories. https://t.co/T231AwtpB4 #ComeBackNew https://t.co/cUnWiC8p7a", "Life is meant for spectacular adventures. https://t.co/056Cguukrd", "Now this is what we call a balanced diet. Happy #NationalWineDay! https://t.co/VnsLYDu5Ld", "Catch a glimpse of grandeur. #ComeBackNew https://t.co/3Nk1ESiKnV", "@CMetel Hi Chris, this depends on the cabin configuration. Most staterooms with upper berths will not have room to accommodate this.", "@barnydunk Hi David, we apologize for the delay. We do our best to respond to all relevant inquiries but response times may vary.", "@JOESHAW2 Hi Joe. we strive to provide the best possible customer service. We are truly sorry this is not what you received.", "@prodgersracing HI Paul, were able to get in? There have been no reported system errors. We apologize for the frustration.", "Our favorite color is sunset. \nPhoto by @jchongstudio https://t.co/7VFqc0xWau", "Spend a sea day poolside. #ComeBackNew https://t.co/F0i5M1IoAK", "@_jpark3r We deeply apologize for the poor experience with one of our team members. We hope to exceed your expectations in the future.", "@wilpo28 Hi William, although the status is not transferable, you will be a member of our Captain's Circle after your first cruise.", "@recipespantry Never too excited!", "@alexbhlz We apologize for your frustration, Alex. We will be sure to pass along your comment to our web team.", "@Gidgee2012 We look forward to welcoming you onboard!", "@tm1329 HI Toby, please DM your phone number and we will see if anyone on our team can reach out and assist.", "@Ronst21 For the majority of banks and card providers, you should see refunds reflect within five bank working days.", "Marvel at moonlit mountain views. #ComeBackNew https://t.co/xW387S87sF", "@grandmaluvit Hi Cathy, the roll-out schedule hasn't been finalized as of yet. Stay tuned!", "@SarahMcClure10 Hi Sarah, please DM your booking number so we can have a member of our team reach out directly.", "Where to next? https://t.co/VuZatH62b2", "RT @TODAYshow: WATCH: We had a big surprise for the cast of The Love Boat! https://t.co/9MendNoy83", "@luminatelynne Such a fabulous view!", "@TXAggieChick Hi Lorrie, we apologize for the inconvenience. We hope to help your guests get booked ASAP.", "@maz42maz We truly apologise for the inconvenience caused, Mhairi. Our payment processor is currently reversing the incorrect transaction.", "@jeffrey_thomson Guest Services onboard to discuss how we may improve the remainder of your voyage.", "@jeffrey_thomson Hi Jeffery, we deeply apologize for your disappointment onboard Emerald Princess. We hope you connect with...", "Witness the beauty of a Syndey sunrise. https://t.co/DKCY7k43Vy #ComeBackNew https://t.co/oYTjQyYPnz", "@crigby88 Hi Craig, we truly apologise for the inconvenience. We've reached out to impacted guests via email.", "@SarahMcClure10 Hi Sarah, we truly apologize for the disappointing experience. We hope you reach out to guest services onboard to discuss.", "@klarsen4532 Hi Kelly, you can check pricing and availability for spa offerings in your Cruise Personalizer.", "@sa_mcclure We sincerely apologize for the disappointing experience. We hope you reach out to guest services onboard to discuss.", "@Ronst21 Effected guests have been contacted and our payment processor is currently reversing the erroneous transaction.", "@shastatroy We are working to get the channel reinstated ASAP. Thanks for bringing this to our attention. (3/3)", "@shastatroy The change onboard was not corporately sanctioned and we apologize to our guests for this inconvenience. (2/3)", "@shastatroy We strive to provide a variety of news coverage and viewpoints for the benefit and satisfaction of all of our guests. (1/3)", "Sail into an unforgettable sunrise. https://t.co/ieFU8BFb3I", "Experience a sundown sailaway. #ComeBackNew https://t.co/zekXoMF380", "\"Live your life by a compass, not a clock.\" \n- Stephen Covey #ComeBackNew https://t.co/n95gkDwoDd", "Endless adventures by land and by sea. https://t.co/a8Kb0XWwZm", "Ordinary occasions become extraordinary celebrations at sea. https://t.co/ObVdWf9NS0\nPhoto: @365DaysofBaking https://t.co/9VnirxupIG", "Be surrounded by serenity. https://t.co/i7KILW4N4R https://t.co/9P0mOumXdm", "RT if you're dreaming of a day on the Lido Deck. https://t.co/VP1S25DsCg", "@crigby88 Hi Craig, please DM us your phone number. We will have a member of our team follow up.", "@iNitrox1 We can't wait to follow along with your #OceanMedallion adventure next year!", "@crigby88 For the majority of banks and card providers, this should happen in the next five bank working days. (2/2)", "@crigby88 Hi Craig, we're deeply sorry for the inconvenience caused. Our payment processor is currently reversing the transaction. (1/2)", "Start each day with a full heart. https://t.co/BTlNhPZHyL #ComeBackNew https://t.co/kNHH3KzHd5", "Spend your weekend with a wake view. https://t.co/RXxf9rGz77", "@jade10b Please DM the information of the guest you are trying to reach so we can further assist.", "@jade10b Hi Donna, we apologize for the difficulties. The communication center onboard has limited availability.", "@klarsen4532 Hi Kelly, by completing the guest immigration information and printing boarding passes you are checked-in. Have a great cruise!", "@Ronst21 in the meantime we would like to apologize sincerely for any inconvenience caused.", "@Ronst21 cruise bookings with Princess Cruises between December 2016 and April 2017. We will be contacting affected guests and...", "@Ronst21 Due to an error by the third party processor, some guests may have had a second transaction processed in relation to...", "@kanso88 We sincerely apologize for the frustration. Internet connectivity onboard is impacted by a number of factors including, weather.", "Stare in wonder at white-capped peaks. https://t.co/BSP27fGkHp #ComeBackNew https://t.co/QCXlJ3sJSA", "@SavoryRoad Bon voyage!", "Discover Majestic's heart of gold. https://t.co/gjZhuIQoqn\\ https://t.co/hg5dM6InlK", "Fill in the blank: The best way to start the weekend is _________. #ComeBackNew https://t.co/IfiE935Bq2", "@Coppellhomes We apologize for the frustration, Patrick. We hope to exceed your expectations for the remainder of the voyage.", "@MurielFrancis Hopefully you find a cruise that meets your needs, Muriel!", "@J_E_S789 Hi Julie, we apologize for the delay in response. Caribbean Princess has already set sail!", "@TimHudgins1 Hi Timothy, we do provide travel agents with program releases and sale details slightly in advance to market to clients.", "@TimHudgins1 Hi Timothy, we apologize for your difficulties. You can email customerrelations@princesscruises.com.", "When in doubt, vacation. https://t.co/p3PhzCz3gZ", "An ocean of discovery awaits. https://t.co/ojJriQy4xp", "Mornings shine brighter at sea. https://t.co/qnvODPJJzf #ComeBackNew https://t.co/YvfNeVb27B", "@Selma_Anne Hi Selma, although we aren't able to offer all promotions to certain areas keep an eye out for one that include your region!", "Home sweet home, at least for a few days. https://t.co/hxGSirvs28 #ComeBackNew https://t.co/S2lItYDN07", "@greglockwood Contact 1300 551 853 for assistance or we're happy to help once onboard.", "@greglockwood Some of the excursions are offered only in Japanese for this voyage.", "@safeco10 Hi Andy, we are working diligently to get releases out ASAP. You should see some new voyages on sale very soon!", "Is mom a magician? Or maybe it's just the ease of #OceanMedallion. https://t.co/AUBmviAI13", "@Bossmanpaulo Hi Paul, this number if for our UK office! Let us know if that won't work for you and we can provide an alternative contact.", "Pining for picturesque Panama. https://t.co/qmRejtD6Ln", "@Bossmanpaulo Hi Paul, we'd be happy to help at 0843 374 4444.", "Discover where endless seas meet unforgettable adventure. https://t.co/UugXiySxBP #ComeBackNew https://t.co/0TBT3QqILm", "A view that's worth its weight in gold. https://t.co/fNMs7Um7EN https://t.co/5pKIVCuEbW", "Experience the majesty of the ocean. https://t.co/g4pYs0rOef", "Revitalize your senses in the Sanctuary. https://t.co/68hsXHvtVQ #ComeBackNew https://t.co/hIVIKoZj0J", "Escape to a cerulean seascape. #TravelTuesday https://t.co/XeXLpO3ame", "Never lose your sense of wonder. https://t.co/bGIZsd6X8Z", "@truscom We look forward to welcoming you onboard, Martin!", "@MoragAdamson Happy sailing!", "@laurenezack Hi Lauren, we truly apologize for your frustration. We hope you reach out to our air department so we can assist if needed.", "@submarinebill We strive to provide a top-notch dining experience &amp; we truly apologize that our dining did not meet your expectations.", "@MelissaSecord We look forward to celebrating with you!", "What's your favorite thing to do on the Lido Deck? https://t.co/JP58n7Qy7M", "\"People don't take trips. Trips take people.\"\n- John Steinbeck https://t.co/RnQzw6QIqe #ComeBackNew https://t.co/dhjiWEIyyU", "Dive into relaxation. https://t.co/1cEUI6gkdg", "Embark on the journey of a lifetime. https://t.co/iEgmoeexRF https://t.co/o7klGMNWPP", "Celebrating #MothersDay the sweet way! Treat your mom to the gift of a getaway. https://t.co/P0MZng4jD5 https://t.co/3w2LhoOZUM", "Dreamworthy views from dawn to dusk. https://t.co/R3mwNe4XCi", "@JohnCifelli Hi John, were you able to locate you transfer? You can always contact our en-route assistance team if needed as well.", "Sunny days abound. https://t.co/KGf2Ml693L", "Cross another adventure off your bucket list. https://t.co/YIcVuHiWxS https://t.co/dE8FOHA6Gt", "RT if you're wishing for this sunrise view. #ComeBackNew https://t.co/muLN6BqlsD", "Football legend @Redknapp will be joining us onboard Crown Princess this month! https://t.co/NZgTTz2zCX", "@MattHope4 Hi Matt, our voyages are launched about 18 months out. Please check back here: https://t.co/8I400OxLBs. Happy cruising!", "RT if you're wishing this was your view today. https://t.co/zB2tRtnPul", "\"The sea, once it casts its spell, holds one in its net of wonder forever.\" \n- Jacques Cousteau #ComeBackNew https://t.co/tsOsW06Gfx", "@grandmaluvit Our favorite way to start the day: a latte and a fresh pastry!", "@ColaAndLemonade The dream.... We can help make it a reality!", "Escape the ordinary. https://t.co/Fz6SI1YulH", "We find our happiness where the sun shines. https://t.co/Hp7Mc0iMPa", "Bask in a beautiful birds-eye view. #ComeBackNew https://t.co/bgp29xxpI2", "Get your day off to a shimmering start. https://t.co/UrA25j1xU0 https://t.co/mZBQVsbUKm", "@chrisking4495 We apologize for the long wait and hope to exceed your expectations on the remainder of your voyage, Chris.", "@rebelcontrol We apologize for your disappointment. We will be sure to pass along your comments to our shipboard team.", "@Br0wnMag1c Hi Sameer, can you please DM us your booking number?", "Onward to new adventures. https://t.co/tPWUj6Bxnx", "Get wrapped up in a scenic wake view. https://t.co/uWt1T1YccL #ComeBackNew https://t.co/8z70v4GzJZ", "Happiness is as simple as a cup of coffee and an ocean view. https://t.co/28nbuDX8XU", "@isadro22 HI Isa, shows and entertainment are not reserved in advance.", "@captaintau Hi Peter, we hope you and your dad are having a wonderful time onboard!", "@njsonja Hi Sonja, we appreciate your feedback and will be sure to pass along your comment to the appropriate department.", "@isadro22 Hi Isa, dining for the main dining room can be reserved once onboard. Have a wonderful cruise!", "At sea, every hour is happy hour. #ComeBackNew https://t.co/FZ7j2oJAU4", "Go with the flow. #ComeBackNew https://t.co/3A7DCtz4vF", "Take a ride on the winds of adventure. https://t.co/np7kSjyPVn https://t.co/LdJNFqDMOn", "William Roache joined us onboard this weekend as part of our Encounters with Discovery guest speaker programme! https://t.co/rzCC2Eikpw", "@kimmzillah We truly apologize for your disappointing experience &amp; hope you contact customerrelations@princesscruises to address.", "@njsonja Hi Sonja, although we don't currently offer unlimited internet we do offer free internet minutes as a Captain's Circle benefit!", "@chrisking4495 Hi Chris, we apologize for the delay. #CrownPrincess arrival into SOU was delayed due to adverse weather conditions.", "Travel makes your world a little more colorful. https://t.co/S1XkLje8Zr", "@AVGrizinski shipboard team.", "@AVGrizinski Hi Alex, we truly apologize for your disappointing experience during your current voyage. We've shared your concerns with our-", "@iNitrox1 #RubyPrincess is currently alongside in Juneau, AK!", "@dunkmasterflash Hi Ashley, we apologize for your frustration. Were you able to place your order?", "@Lucie_Spencer Hi Lucie, we apologize for the delay in response &amp; embarkation. We hope you enjoy the remainder of your cruise!", "What's your favorite part about cruising? #ComeBackNew", "@kimbesen with our shipboard team.", "@kimbesen Hi Kim, we deeply apologize for the Wi-Fi problems you are experiencing during your current voyage. We've shared your concerns -", "We hope @Schofe had a fantastic time onboard Royal Princess in the Med this weekend! https://t.co/AysP98uifQ", "Good morning, sunshine. https://t.co/oKaREbL71R", "Immerse yourself in an endless summer. https://t.co/EHCVCqePH9\nPhoto: https://t.co/jIAZiYJXop https://t.co/wYqUe6PDKf", "Sunny days ahead. https://t.co/hFkm6ITvWy", "Who would you like to be sharing these seats with? #ComeBackNew https://t.co/ljMUV59G8r", "Where lake meets the sea, discover the beauty of Stockholm on our Baltic Heritage Cruise. https://t.co/ivqbkcVIxu https://t.co/C3C0exqUda", "Take a stroll with the seas. https://t.co/V5tqVqGX1j", "Live every hour like it's happy hour. https://t.co/mm15Ygnjuh", "Poolside is our paradise. https://t.co/jdxBr5XsId #ComeBackNew https://t.co/zKUsLgfsCn", "The best seats in the house. #ComeBackNew https://t.co/sYD8idAGkP", "We're pining for palm tree views. https://t.co/wrpjk0PCQ2", "@Derekatchley If you didn't receive those msgs, please DM us your phone number so we can make sure we have the correct contact info.", "@Derekatchley Hi, Derek. Our Customer Relations agent reached out to you on 4/25 and 4/27 and left voicemails both times.", "@suekelso Hi Sue, our beverage package will be available on your voyage.", "A curbside pickup like no other. https://t.co/uQuwRdfjKh https://t.co/8WFe4DgpaZ", "Happy 40th anniversary to The Love Boat! The show premiered on May 5, 1977. https://t.co/OESRcCVY16", "@crissykulit Hi Crissy, you can find the time frame for disembarkation listed in your Cruise Personalizer!", "@Will_n_Skill Hi Sarang, you can find information on applying for shipboard employment at https://t.co/RLckcbZ2ul!", "Live every hour like it's happy hour. https://t.co/zxbahd6G5k", "\"I haven't been everywhere, but it's on my list.\"\n- Susan Sontag #ComeBackNew https://t.co/iOoRZ239HJ", "@suekelso offered onboard our Ocean Medallion class ships.", "@suekelso In order to accommodate this great new way to order beverages, our soda &amp; all-inclusive beverage package will initially not be -", "@suekelso Hi Sue, our Ocean Medallion Class ships allow you to order what you want, when you want it, in most locations throughout the ship.", "Ocean Medallion opens the doors to more than just your stateroom: https://t.co/9FHgrFYvEP #ComeBackNew https://t.co/2H13zuRYgo", "Take a starlit stroll over the sea. #ComeBackNew https://t.co/c0eWtiFSvM", "Life is better by the pool. RT if you agree! https://t.co/phEZBr42AM", "@garybembridge Hi Gary, you're making us hungry!", "@klarsen4532 Hi Kelly, you can contact Princess directly at 0843 374 4444. We look forward to welcoming you onboard!", "@alternageek_ Beautiful, Kerri!", "@MattBamber96 Hi Matthew, we deeply apologize for for the delayed response. You can reach Princess directly at 0843 374 4444.", "@andrewrowe_ be offered onboard our Ocean Medallion class ships.", "@andrewrowe_ the ship. To accommodate this great new way to order beverages, our soda and all-inclusive beverage package will initially not-", "Discover a Hawaiian hideaway. https://t.co/iwMlHFivPB https://t.co/szR9rNSSd2", "@mfhewson for the confusion and hope you enjoy the remainder of your voyage!", "@mfhewson Hi Cody, there was an error in the Princess Patter. Per voyage length of 4 days or less, there is no formal night. We apologize -", "@VisioMVP the onboard Guests Services Desk.", "@VisioMVP We sincerely apologize for your frustration. Guests can request to have their automatic gratuities removed from their folio at -", "@stephenescott2 need to take a shore excursion or public transportation. We look forward to welcoming you onboard!", "@stephenescott2 Hi Steve, there will be a complimentary shuttle from the pier to the Le Verdon town center. To get to Bordeaux, you will -", "Get your day off to a bubbly start. https://t.co/IVPSGvEGwv", "Take a sip with the sea. https://t.co/3cdyQiektK", "@MarvKirsch Hi Marvin! It's the Princess Messenger. You can learn about it here: https://t.co/na2U0vIG7l. See you soon!", "RT if you agree: Cruising and cocktails go hand in hand. #ComeBackNew https://t.co/Sdil8AgoXz", "@audiophile_mike Great answer!", "@familyoutdoors Hope you're able to cross the voyage off your list!", "@MarkKHewitt Hi Mark, we apologize for the frustration. Please contact Princess directly at 0843 374 4444  to trouble shoot. Happy cruising!", "@kitschfinder We appreciate your sense of humor! Our Captain's Circle team would be happy to correct for future mailers at 0845 355 0065.", "@PatmoreLorraine Again, we apologize for your poor experience and hope to exceed your expectations for the remainder of your voyage.", "@PatmoreLorraine Hi Lorriane, we deeply apologize for your inconvenience and have forwarded your request along to our shipboard staff. -", "Take in views of both city and sea. https://t.co/tg58rKBSaE #TravelTuesday https://t.co/cQ7DpmTnYB", "@jasonrawles Hi Jason, we truly apologize for this error and thank you for the heads up.", "@aniljohn61 129-228 Port Saeed, Airport Road\nDubai POB 122028\nUAE\nTel:  971 4 2999223\nFax:   971 4 2999227\nEmail:  sales@princesscruises.ae", "@aniljohn61 Hi Anil! Thank you for asking about our cruise vacations. Please contact: \nCruise Master LLC\nSuite 408, Golden Business Center -", "@lmf57 Hi Liane, we apologize for the difficulties. Access to regional versions of the website is based on your current IP location.", "The best days begin like this.\nPhoto: https://t.co/yuxrWnk71l https://t.co/TxNCbhABDk", "Drift away at sea. Find your zen onboard at our Lotus Spa. https://t.co/hpgZ1IpzG6", "A deck fit for a princess. https://t.co/kgLRRzJzVI", "@mev202 Please contact the Princess Dietary Coordinator (dietaryrequest@princesscruises.com) who will properly address your questions. We -", "Fill in the blank: There's no place I'd rather be than __________. #ComeBackNew https://t.co/2ajcJWat7S", "@klarsen4532 Please contact your Travel Agent or Princess directly at 0843 374 4444  for assistance. We look forward to seeing you soon!", "@klarsen4532 Hi Kelly, we were able to locate your booking. Unfortunately, we don't see a Lotus Spa reservation reflecting on your booking.", "Wake up to wake views. https://t.co/X5zugmJAu6", "No filter needed. #SunsetSunday https://t.co/bDfQDnXWb2", "Take a stroll with the seas. https://t.co/Io2HWfflgD", "Surround yourself with grandeur. https://t.co/xZyZlb2l55", "Feel at home in a place you've never been. https://t.co/82yMmqbiR4", "Grab your passport and set sail on a culinary adventure with Princess Cruises &amp; @bonappetit: https://t.co/pjGqqjqtSP https://t.co/Gbsywb5eoC", "Keep the wind at your back and new destinations ahead. #ComeBackNew https://t.co/MmEuZkLh9F", "Cruisin' into the weekend. https://t.co/Cpij7rFhv5", "@CreateIntrigue Hi Anne, please contact Princess directly at 0843 374 4444 to address your request. We look forward to seeing you soon!", "@bainbridge14 Hi Julie, we are having difficulty locating you in our system. Can you kindly provide your booking number &amp; adv issue via DM?", "RT if you're wishing this was your weekend backdrop. #ComeBackNew https://t.co/zdtDn8LoPT", "@gezthepez88 We invite you to read our response: https://t.co/NSBof9wTBf.", "@tracybwrites We're glad you enjoyed #MagicToDo Tracy!", "@quindesire Hi Linda! You can find our voyages here: https://t.co/8I400OPn02. Happy cruising!", "Debark for a day. Make memories to last a lifetime. https://t.co/iU2v7C58vy https://t.co/WUPdSvsWFl", "@Geoffa30 Hi Geoff, we look forward to welcoming you onboard Majestic Princess!", "@Imyafatha We sincerely apologize for your frustration. Can you kindly send up your booking number via DM?", "Are you onboard for an Australian adventure? Sail on Majestic Princess on her maiden season next year. https://t.co/vN2PcuxCND", "@chrishackers Hi Christopher, we invite you to read our response: https://t.co/NSBof9wTBf.", "\"Paradise isn't a place. It's a feeling.\"\n- L Boyer https://t.co/9is97oWfqN", "@Ronst21 The Lions Tour will broadcast onboard Crown Princess.", "@sixredstars We invite you to read our response: https://t.co/NSBof9wTBf.", "@BikermanAl Hi Alan, we invite you to read our response: https://t.co/NSBof9wTBf.", "@SophieHenRob @TonyJuniper We invite you to read our response: https://t.co/NSBof9wTBf.", "It's not just about where you're going, but how you're getting there. https://t.co/vrY1v6sGKP", "@Jonathangosky ensures that the best shore excursions inventory is being reserved by guests with firm interest.", "@Jonathangosky Hi Jonathan, moving to pre-purchase for shore excursions brings Princess Cruises in line with current industry practice and -", "@stephenescott2 Hi Steve, we are looking into your question and will follow up as soon as we can provide details.", "@marietweetss We sincerely apologize for the error. Please find our statement here: https://t.co/NSBof9wTBf.", "@Runtings09 (PCUK.CustomerRelations@princesscruises.co.uk) so we may address your concerns.", "@Runtings09 We are very sorry to learn of this incident. We hope you will contact our Customer Relations Department -", "@Geoffa30 Hi Geoff, we apologize for any technical issues. To help troubleshoot, please contact Princess directly at 0843 374 4444.", "@suekelso Hi Sue, we are looking into your question and will follow up once we can provide details.", "\"The ocean stirs the heart, inspires the imagination and brings eternal joy to the soul.\" - Wyland https://t.co/LlixMATSQc", "The sweetest greeting. #ComeBackNew https://t.co/GOEC5EpNhi", "@staceygmiller Alaska is in the U.S., but UK citizens don't need a visa to visit. It does get cold up there, so be sure to bring a jacket!", "Every sunrise is an invitation for exploration. #ComeBackNew https://t.co/8Bziir3sFj", "@Ronst21 Hi! Crown's Summer season sailing out of the UK ends on the 3rd Sept so unfortunately would be finished before the Rugby starts.", "@merchant_stu We're under CCL for our parent company, Carnival Corporation &amp; plc. And stock owners get special benefits when they cruise!", "Experience the majesty of the ocean. https://t.co/3YSN7YzXLM", "@staceygmiller You'll need an eTA to fly into Canada, Stacey. You can find out more information here: https://t.co/fNux9RvV6t.", "@aniljohn61 Hi, Anil. All of our Alaska cruise itineraries visit Canada, but you can plan a land-only tour with https://t.co/U1Vw5ifJKq.", "Fill every minute of sunshine with great adventure. https://t.co/N20649mvAe https://t.co/INFHSyhVtJ", "@DaisyWantsaBone regarding our dog policy. Happy cruising!", "@DaisyWantsaBone Hi Daisy! That's our beautiful #SunPrincess - Please contact the Access Office (accessofficeprincess@princesscruises.com) -", "@ChristineMaeM21 Hi ChristineMae, we look forward to welcoming you onboard!", "@klarsen4532 Hi Kelly! Can you kindly provide us your ship, sail date, and how your name appears on the booking?", "@stephenescott2 Hi Steve, we look forward to welcoming you onboard!", "At sea, the glass is always half full. #ComeBackNew https://t.co/hO5m33NGAQ", "@sharksterrr Hi Melissa! You can find information on our onboard Internet Packages here: https://t.co/7y1GRv2v8c. Happy cruising!", "RT if you're happiest with a wake view. https://t.co/aIQrp4VeNp", "@marietweetss We invite you to read our response here: https://t.co/x5P3e1XVmA.", "@alaskatravlnews Wouldn't miss it! #TravelAlaskaChat https://t.co/rcveJOIa6j", "@NeillGer We would love to see you onboard, Gerry!", "@esuohneerg Hi Stephen, we invite you to read our response here: https://t.co/NSBof9wTBf.", "Make Monday Majestic. https://t.co/XSzXY4kQt8", "@BelwalAjay Our approved international recruiting partners can be found here: https://t.co/ir5haZdTgD.", "@TaraNoland Just in time for brunch, Tara!", "@kristacullen15 We can't wait, Krista!", "RT if you wish this was your #SunsetSunday view. https://t.co/DoOH4fecTo", "Make your grand entrance. https://t.co/aD9Hj2WmaK", "Find your paradise at the pool. #ComeBackNew https://t.co/hqdAW0jVEQ", "Find yourself in the heart of the wilderness. https://t.co/mRrQVTZqxZ https://t.co/L9DlGhRTSA", "Linger a little longer. https://t.co/OkKEeSVGyH", "Embrace a moment of stillness. https://t.co/o1fuaSmiks", "Magnificence awaits on Majestic Princess. #ComeBackNew https://t.co/rbxOkJGkE1", "The sun never sets on adventure. https://t.co/d5tAaxt19Q", "It's better to see something once than to hear about it a thousand times. https://t.co/G0Mz6bjW7s", "Tune into @OceanTreksTV this Saturday as @jeffcorwinlive cruises to Brisbane to visit some adorable fuzzy friends! https://t.co/CqJLrtP8ZD", "@GreenMusicLady We love your beautiful smile, Trudee!", "There's no better feeling than an ocean breeze. https://t.co/p4sRKOqv6U", "@gozierj We can't wait either!", "@tweetsfrommeema We look forward to welcoming you onboard, Beth!", "@calimesaguy We look forward to welcoming you onboard, Russ!", "@seanizzle Hi Sean, we apologize for the inconvenience. We will forward your feedback to the appropriate department.", "@TDenton1313 Hi Tami, we hope to have you back onboard again soon!", "@lawro22 Hi Lawrence! Both Specialty venues will be in place for your voyage. We look forward to welcoming you onboard!", "@JBVacationPros Welcome aboard!", "@rebeccavalles1 Hi Rebecca, we're glad you had a good time!", "@HeliDonut We have a Bon Voyage Experience program for USA turn around ports. If you will be in the states, please contact us to learn more!", "\"So much of who we are is where we have been.\"\n- William Langewiesche https://t.co/m8J6qxZBUv", "Escape the ordinary. https://t.co/ehxkHDlWXK", "Salty sea. Sweet memories. https://t.co/5tVc2ON03P", "@stephenescott2 suspect that the item may be used to commit an act of violence.", "@stephenescott2 Hi Steve, knitting needles are allowed onboard, unless there is specific reason for not doing so, or there is reason to -", "Light up your day on the Lido Deck. #ComeBackNew https://t.co/HEJmpvItSw", "@Michelle0181 send flowers to shipboard team members.", "@Michelle0181 Hi Michelle, this field is to send gifts to guests who will be cruising with us. Unfortunately, there is no mechanism to -", "Relaxation awaits. https://t.co/lMDkhM7onx", "@Michelle0181 their assistance.", "@Michelle0181 not onboard, you do not have an account. We recommend contacting another shipboard team member who is onboard to ask for -", "@Michelle0181 Hi Michelle, we apologize for your frustration. Our onboard florist can only generate an order placed on account. As you are -", "@Lemonsforlulu You're making us hungry, Tanya!", "@Ronst21 We apologize for the frustration! We've passed along your feedback to our shipboard team.", "Point your sails towards new adventures. https://t.co/tkK3SyAYzO", "@LunaticAtLarge We appreciate the shout-out, Kristin!", "@Photobylogan Looking forward to welcoming you aboard Royal Princess, Julian!", "The next wave of vacation travel is coming. Will you be onboard? https://t.co/xeXhL4VTBg #ComeBackNew https://t.co/ofJDPiL12D", "@Shahid765 Hi Shahid, Our approved international recruiting partners can be found here: https://t.co/ir5haZdTgD.", "A sense of adventure never diminshes. #TravelTuesday https://t.co/7VGwUEGp07", "@BrownGJ2 We have #EmeraldPrincess sailing DEC 20th. You can find information here: https://t.co/if538CXZub. Hope to see you onboard soon!", "Time stands still on the Lido Deck. https://t.co/Gql9gJ7HcM", "Happiness is as simple as a cup of coffee and an ocean view. https://t.co/v7vTGlPF7d", "Captivating beauty from all angles. https://t.co/ykusA1U9Wz", "@Simonides69 may address your concerns.", "@Simonides69 that you will contact our Customer Relations Department                 (PCUK.CustomerRelations@princesscruises.co.uk) so we -", "@Simonides69 Hi Steve, we sincerely apologize for your disappointment with our onboard Guest Services desk from your recent cruise. We -", "@rinshad_booking Happy cruising!", "Take in a sunrise on the Seawalk. #ComeBackNew https://t.co/98dkKFdTh6", "@Gardener223 See our answer on Facebook, Donna, where we had more than 140 characters to explain!", "The perfect Sunday sunset. https://t.co/3st4jKpTof", "Kick back. Unplug. Rejuvenate. https://t.co/7sozfGgzwX", "Relax in a pastel paradise. \nPhoto: https://t.co/gsNlwkkhqT https://t.co/YCupFapaxO", "Experience the sweeter side of sea days. #ComeBackNew https://t.co/vGg1q3bD9Q", "The smaller you feel, the greater your perspective. https://t.co/Run0snxYu3", "Spend your weekend with a wake view. https://t.co/mdPKEjSLPD", "Today's sunrise is brought to you by Mexico. #ComeBackNew https://t.co/zvYhxzAV4L", "The sound of the ocean is music to the soul. https://t.co/npGkySc040", "@griffij09 Hi Joel! Yes, tea and coffee are included in your cruise fare.", "Happy #LookUpAtTheSkyDay! Take to the skies from the top deck with Discovery at Sea: https://t.co/IdySpXOL10 https://t.co/B0BBMdJdVy", "@ElizeVStratton Rotterdam, The Netherlands, April 15th arrival 7:00AM, depart 10:00PM. April 16th sea, April 17th Hamburg, arrival 5:00AM.", "@ElizeVStratton Hi Elize! You can find the current location of #RegalPrincess here: https://t.co/Lk2aDKnTll. Her remaining itinerary is -", "@elliexx2001 Hi Ellie, yes we do! You can find our voyage information here: https://t.co/lrlFiwz3Go. Happy cruising!", "Log off. \nBreathe in. \nIt's time for vacation. https://t.co/tb2UKCg09Q", "Let your heart lead the way to new adventures. https://t.co/hZ9X22xta4 https://t.co/bukAEuT7gu", "Indulge in tantalizing treats. https://t.co/bYeBuE0ES8", "@griffij09 Hi Joel, not that we publish. However, cocktails run up to about $8.95 and wine up to about $7.95. Cheers!", "@RayWilliams15 Hi, Ray. You can reach our UK Customer Services team at enquiry@princesscruises.co.uk", "An ocean of discovery awaits. https://t.co/iCYAkqiqU7", "Explore where serene seas meet captivating coastlines. #ComeBackNew https://t.co/z7R9yDlbg7", "Sun, sand, and a cold drink in hand. Discover an endless summer in the Caribbean: https://t.co/0v3oxbcTHQ https://t.co/blf8xtHrXo", "Take in a sunset from a world away. https://t.co/4wypz7MAok", "Our favorite days are spent on the water. https://t.co/StNo6mzQ9I", "@Geoffa30 Hi Geoff, we are thrilled that you are as excited as we are!", "Quiz: Do you know which ship Ocean Medallion will debut on this November? https://t.co/i7wVqQ7QRX https://t.co/SRL5XhdzBC", "An unforgettable moment. A lifetime of memories. https://t.co/qAlywrezEJ https://t.co/N6qcoVIBR9", "@TheCruiseDudes Just in time for lunch!", "@scotts_cruises Hi Scott! Thanks for sharing your new vlog with us. We're thrilled that you enjoyed #RegalPrincess", "@ImperialCruizer Thank you for the warm hospitality! Cheers!", "Encounter a world outside your own. https://t.co/03XylulXsf", "@Mikey_matic this photo is your own?", "@Mikey_matic Hi Michael! May we have permission to share this photo via social media &amp; our website? If so, will you please confirm that -", "@Geoffa30 Hi Geoff! Our cruises are launched about 18 months out. Please check back here:https://t.co/8I400OPn02. Happy cruising!", "@andreajonesPCL Just in time for brunch, Andrea!", "@Pamelaboggs4 Hi Pamela, we're excited too! :)", "The road to adventure might not be a road at all. https://t.co/Zym1bU4Nqz https://t.co/28Osaj2sJY", "@Mikey_matic Welcome aboard, Michael!", "Experience the splendor of sunsets at sea. https://t.co/ktV8djEseD", "@saxonandwendy Hi Babs! #SapphirePrincess will be in dry dock 14-28 March, 2018. We look forward to seeing you in August!", "Cuisine onboard Caribbean Princess is getting an upgrade. \nhttps://t.co/XH1idO7YgL via @travelpulse #CruiseNews https://t.co/R6FtESZBri", "@jgobble Hi Jann! That's our beauty -- #RoyalPrincess", "@gerryvanderwalt only), Juice (breakfast only), &amp; Milk.", "@gerryvanderwalt Hi Gerry, \nBeverages Included during Cruise:\nIced Tea, Hot Tea, Coffee (regular or decaf only), Lemonade (Horizon Court =", "@glamelitetravel Hi Heather! We're thrilled we could help make your day extra special. Here's to a life time of wedded bliss. Cheers!", "Wish you were here. #ComeBackNew https://t.co/n9rJZSt8Zw", "Never lose your sense of wonder. https://t.co/FjuYyTEMwm", "RT if you're dreaming of this dreamy view. #ComeBackNew https://t.co/FufUySU5C8", "The sweetest greeting. https://t.co/KaGsQfvP1z", "Start your Sunday with a sunrise. https://t.co/95TlA4SKEc https://t.co/WNwN1dLwna", "\"I know nothing with any certainty, but the sight of the stars makes me dream.\"\n- Vincent van Gogh #ComeBackNew https://t.co/Y4Jp8XoZVA", "Extraordinary moments are waiting to be discovered. https://t.co/QOjdUksNJZ", "Those who seek shall find. https://t.co/s9ThvLWinK", "From railways to ruins, discover unrivaled adventures in Panama! https://t.co/imCRj553TB https://t.co/7Cb5AukJSF", "\"Travelers are dreamers who make their desires for adventure a reality.\" https://t.co/eZOHAdLEJV", "@CruzinParadise Looks great, enjoy!", "Why do you cruise? https://t.co/DYqycDOnRv https://t.co/iDNJ5rXWUy", "@AlyssaEinDC Only four months to go! We're counting down :)", "@KerrieMBurke Cheers, Kerrie!", "Greet the shore at sunrise. https://t.co/WubSTRaCDS", "@CowGirlPoke Hi Elizabeth, we love your beautiful smile!", "Discover colors as bright as the sun. https://t.co/FblW6Sd94d", "@Erins_Best News UK are offered on select vessels in our fleet.", "@Erins_Best offerings accordingly to best please our guests. Although they're not available in all trades, both Sky News UK &amp; Sky Sports -", "@Erins_Best Hi Erin! Thanks for your suggestion. We take into account the nationalities of our guests onboard &amp; work hard to tailor our-", "The ocean is calling. https://t.co/Iaj4ULnj3V", "@IntrovertBaker Just in time for lunch. Jen, you are making us really hungry! #ComeBackNew", "@RondaReport Hi Rhonda! Due to the vessel's delay, embarkation will be at 5:00PM. We look forward to welcoming you onboard!", "@gvicharbour We appreciate the warm hospitality, and look forward to seeing you on Monday. Cheers!", "Discover a Broadway-caliber experience at sea: https://t.co/mCM1tnRtFC via @livedesignmag #CruiseNews https://t.co/B29sgnRRk8", "@TheOneTAR Hi Tiffany! Thanks for your feedback, We will pass along to the appropriate department. We hope you're enjoying #GrandPrincess", "@TheMuffinManFPS Thanking for alerting us. We have sent your feedback to the appropriate department to look into. Happy cruising!", "The only trip you'll ever regret is the one you don't take. https://t.co/9f4DRYyjX4", "Sail along stunning shorelines. https://t.co/A54n1E5FFt https://t.co/IbgCvJNLRc", "@Budspage We can't wait, Bud!", "@CruzinParadise We can't wait to help you #comebacknew :)", "@FarmgirlsDabble Cheers, Brenda! #comebacknew", "@ethnicweddings Please contact your Business Development Manager to address your request. Happy cruising!", "A good drink is the perfect poolside accessory. #ComeBackNew https://t.co/L7Gf1q4ofR", "Roam the seas to white-capped mountains. https://t.co/O1HUOwGlh3", "@gconklin93 Hi Camille! You can find our promotions here: https://t.co/i1dyZXaJO5. Hope to see you onboard soon!", "@fearless21 (customerrelations@princesscruises.com) so that we may address your concerns.", "@fearless21 Hi Heidi, we are truly sorry to learn of the A/C issue while on your recent cruise. We hope that you contact Customer Relations-", "Which of these 50 essential travel experiences have you crossed off your bucket list? https://t.co/RoOUv3O1Vq https://t.co/H6QbhvC3Sf", "@mwtheplumber Hi Mike! We apologize for the frustration. Please contact Princess directly at 0843 374 4444 to help troubleshoot.", "\"Live in the sunshine. Swim in the sea. Drink the wild air.\"\n- Ralph Waldo Emerson #ComeBackNew https://t.co/VMBs1tllVK", "Point your sails towards new adventures. https://t.co/ygKcuHinwg", "@dhoffkins Hi Deb, you may bring bottled water onboard and store it in your stateroom.", "@fearless21 Hi Heidi, we deeply apologize if your A/C was not operating correctly on your recent cruise. We hope that you contact Customer-", "Never lose your sense of wonder. https://t.co/n50wT2RIut", "@KafferJkaffer Hi Janice! We're glad Lynne could assist! Enjoy #RubyPrincess", "@lindsaypadover2 Hi Lindsay, we're sorry for your disappointing experience on your 2015 cruise. We'll have a team member contact you soon!", "@CaptGreybeard Just in time for brunch!", "@CaptGreybeard Hi John, you are making us hungry!", "Make Monday Majestic. https://t.co/rk1tUlsJ78", "Brighter days await at sea. https://t.co/7t64UWHDRr", "Bask in a balcony breeze. https://t.co/Opg1fAl7l9", "Beautiful day, beautiful ship, beautiful destination! https://t.co/B4ayHgF9zv", "Never underestimate the magic of a sunrise at sea. #ComeBackNew https://t.co/tR8zxHE1tf", "Share a sunset with the ones you love. https://t.co/XYpEssp3RV", "Dive into relaxation. https://t.co/70fE8Zv7AK", "RT if Alaska is on your bucket list! https://t.co/YCUek1Tad6 #ComeBackNew https://t.co/GvlWYmkcYQ", "Spend your weekend with a wake view. https://t.co/LhHzcWjsEh", "@guyorridge Hi Guy, Camp Discovery is available on #MajesticPrincess Happy cruising!", "@mrconorbyrne Hi Conor, is your mother in the UK? Please contact us directly for any questions at 0843 374 4444.", "Endless adventures by land and by sea. https://t.co/VQoK0QRR6h https://t.co/EAfUNpu6EJ", "@mrconorbyrne Hi Conor, we welcome guests from all countries as long as they have the correct documentation to travel!", "@stephenescott2 Hi Steve! You can now pre-reserve and pay for Crown Grill Specialty Dining through your Cruise Personalizer. Bon appetit!", "Sweet drinks, and an even sweeter view. #ComeBackNew https://t.co/KJtKma18W8", "@Ronst21 For #MajesticPrincess:\n1 x China socket 220V\n1 x Italian/Euro socket 220V\n1  xUS socket 110V\n2 x USB ports (base of night stand)", "@dhoffkins Hi Deb, you can speak to the onboard Guest Services Desk to see if there is space available &amp; what additional fare is.", "@njsonja experience. The teams are in advance stages of redesign and expect the launch new program sometime this year.", "@njsonja Hi Sonja! We're consistently working toward technological improvements to ensure that our networks are designed for optimal -", "An ocean of discovery awaits. https://t.co/uZktf6YKCm", "Fill your life with sweet drinks, wonderful adventures and beautiful sunsets. https://t.co/UXwx2py5hr #ComeBackNew https://t.co/iAdhPeaPB0", "@DiscoverTrieste Thank you for the warm hospitality. See you soon!", "@Valerie_Valise Not a bad way to spend a Thursday, Valerie! #comebacknew", "\"Do not stop thinking of life as an adventure.\" - Eleanor Roosevelt https://t.co/qakUTt2DN9", "@mfhewson Hi Cody! Thanks for asking about our Drop &amp; Go Deals. You can find information here: https://t.co/MiJtm28VS3. Happy sailing!", "@Baboo6451 Hi Tom! Congratulations on reaching Elite loyalty. We're so glad you had a good time!", "We've officially accepted delivery of #MajesticPrincess! RT &amp; share your wishes for the ship's crew. https://t.co/9i3XvKNYF6", "\"All happiness depends on a leisurely breakfast.\" \n- John Gunther https://t.co/ZcM0XQAwR0", "When in doubt, vacation. https://t.co/8I6HETM3m3", "@Jacqalac strive to be the consummate hosts for our guests, so we apologize if we did not meet your expectations.", "@Jacqalac Hi Jacqui, we truly apologize if our shipboard team did not provide warm, gracious service to you on your recent cruise. We -", "@pstcrds2seattle Marissa, we think there's nothing like a day at sea while sipping champagne to help you #comebacknew", "Floating into paradise. https://t.co/8BrzGuRlF7", "Relaxation awaits. https://t.co/sYfFX2yixN #ComeBackNew https://t.co/yExcuXwIO6", "@Ladewig select ships. Bon appetit!", "@Ladewig Hi Scott! We're glad you're excited about the new food offerings onboard #CaribbeanPrincess The changes will be rolled out to -", "Challenge yourself to discover new perspectives. https://t.co/biLJCPa6D7", "@IMinTHE305 Thank you! Happy cruising!", "@frugalaberdeen we look forward to welcoming you onboard!", "@frugalaberdeen We are implementing progressive cruise check-in to facilitate a smooth embarkation. Thank you for your understanding and -", "@pstcrds2seattle We like your style, Marissa! #comebacknew", "@adityan2511 What is your voyage number?", "@MommyIves We're ready when you are, Melissa! :)", "It's better to see something once than to hear about it a thousand times. https://t.co/Uvsb86GeHm", "@kwise1968 our team members will be contacting you to address your concerns.", "@kwise1968 Hi Kim. we responded to your Facebook post and have forwarded your feedback along to our Customer Relations Department. One of -", "@taveya Hi Taveya, we sincerely apologize for your frustration. Please follow us so we can provide information via DM.", "@RobKerr11 Thank you for your suggestion! We will keep in mind for our future planning. Happy cruising!", "Sunny days abound. https://t.co/NBEMxEGpXZ", "@PetePepiton assistance. We look forward to welcoming you onboard #RoyalPrincess", "@PetePepiton Hi Peter! We found your booking and see that you're booked through a travel agency,. Please contact your Travel Agent for -", "Home sweet home, at least for a few days. https://t.co/5NLp5LtQyl #ComeBackNew https://t.co/0SOp2qrXHi", "Let Ruby lead the way to new adventures. https://t.co/kMPVJ2Q18w https://t.co/SCAbnKniWP", "@smccune Hi Steven, it's dependent upon how soon local authorities will clear the ship for disembarkation.", "@kwise1968 Hi Kim, we are deeply sorry to learn of this incident. Can you please provide us your booking number via DM?", "@Valerie_Valise Hi Valerie! We look forward to welcoming you onboard and helping you #ComeBackNew", "@cflarsen Hi Christine, you are correct! Happy cruising!", "@dhoffkins upgrade. We look forward to welcoming you onboard!", "@dhoffkins Hi Deb, we apologize for your continued frustration. You booked IF inside &amp; received IB inside stateroom. That's a 5 category -", "@ky_amy Hi Amy, we apologize for the frustration!  Please contact 1-800-Princess to help troubleshoot.", "@AHuey12 Fares are based on double occupancy--1st and 2nd guest paying the same rate, and a reduced fare for the 3rd/4th guest .", "Sip on chocolate paradise. #ComeBackNew https://t.co/DAgwDFhBBx", "@goofybaker1 Setting a course for adventure!", "@icecube_ninja Hi Ginny! A shipboard team member will contact you to make arrangements. We look forward to welcoming you onboard!", "@KateEGrey Hi Katie, what is your mother's name?", "Sun and sea are all we need. https://t.co/JgReHR3xPk", "Embark on the journey of a lifetime. https://t.co/Ow211FMI3o https://t.co/kNwkEqmoeq", "You have nothing to lose and a world to see. https://t.co/NV8UihgWst", "\"The ocean stirs the heart, inspires the imagination and brings eternal joy to the soul.\" - Wyland https://t.co/MRPREihhzV", "Sundays are for the Sanctuary. RT if you agree! https://t.co/9KIEopEJjq", "A view that's worth its weight in gold. https://t.co/qr0ngAeYFl https://t.co/xNrfTvVsKc", "What's your favorite thing to do on the Lido Deck? https://t.co/6JZr30Fdbn", "Indulge in carefree, sun-soaked days in the Caribbean. https://t.co/R11jdlHZR5 https://t.co/v7Fzo2OhB7", "Fill in the blank: My favorite way to fuel up for a sea day is ___________.  #ComeBackNew https://t.co/Yhq8Uy0JJy", "The sun never sets on adventure. #ComeBackNew https://t.co/HA05F1dJNU", "It's not just about where you're going, but how you're getting there. https://t.co/DOxbS94sug", "Set sail. https://t.co/1KDOzyoWHJ", "Good day, sunshine. #ComeBackNew https://t.co/iVkOliFZpf", "@RayWilliams15 Hi Ray, we apologize for your disappointment and frustration. Do you currently have a booking number? If so send via DM.", "Encounter a world outside your own. https://t.co/DbdlijSmv1", "@thegrumpytravel You can find our gift information here: https://t.co/7y1GRv2v8c. Happy sailing!", "@KateEGrey Hi Kate, you can find the Princes fleet contact information here: https://t.co/beykqfhJjC.", "@LisaLConnect Grill was applied to your booking as goodwill. We look forward to welcoming you onboard #RoyalPrincess", "@LisaLConnect Hi Lisa, we sincerely apologize for the frustration. We located your active booking and see a Specialty Dining at the Crown -", "@okeydokeydebbie Hi Debbie, we are looking into your question and will follow up once we can provide details.", "@Graesonmm Hi Mo, St.Maarten is one of our favorite ports to call on!", "@mrgrumpy1956 We know, but it tastes divine!", "At sea, every hour is happy hour. #ComeBackNew https://t.co/ERfDxHkZKR", "@SLThom7614 Hi Steph, there's exciting news! The Rhapsody party band will be on your voyage. See you soon!", "Be surrounded by serenity. https://t.co/5Oz3JmtoZO https://t.co/gktJzNQzA9", "Happiness is as simple as a cup of coffee and an ocean view. https://t.co/0yOAWvqf8J", "Want to hang out with these furry friends? https://t.co/q8zpyQWNuu https://t.co/ubg84ZWANt", "@goofybaker1 Congratulations on 55 years of wedded bliss! We wish you many more!", "@till_gill Hi Gill, we apologize for the frustration. Are you still having difficulty?", "@harangue Hi Eugene, we deeply apologize for your frustration. Can you please provide us your email address or contact phone number via DM?", "Indulge in tantalizing treats. https://t.co/LRkGeI9aID https://t.co/erUseF8fC1", "@Jonathangosky your voyage.", "@Jonathangosky We hope you connect with the Guest Services Desk onboard to discuss how they can improve your experience during the rest of -", "Go with the flow. #ComeBackNew https://t.co/9HgbwgIXc0", "Sail into an unforgettable sunrise. https://t.co/7Rsim3q1FF", "Discover where the waves kiss the stars. https://t.co/3isO7URzAt https://t.co/VoezHZ0wMk", "@ShanaEmily Thanks for sharing with us birthday girl. Cheers! :)", "Take a stroll with the seas. https://t.co/0dXKNgnJbj", "How do you relax onboard? #TravelTuesday", "@Jonathangosky Hi Jonathan, we apologize for your disappointment! Are you currently onboard?", "@JT_Haynes36 Hi Josh, we apologize for the delay today and hope to exceed your expectations on the remainder of your voyage.", "Monday is nothing a cocktail can't fix. https://t.co/bGfeIKwBiY", "Sunny days ahead. https://t.co/lKE5DNZuYI", "Salty sea. Sweet memories. https://t.co/gRQ6HHmxZA #ComeBackNew https://t.co/uONAIUrOc6", "@jsrmsr Hi Johnny! We're glad that you had a great time!", "@ezbruin Hi Bob! That's our private island, Princess Cays! You can learn more here: https://t.co/oX0OBRKA0V. Happy cruising!", "@elkhorninn Cheers! :)", "Indulge your sweet tooth. https://t.co/l0UeeqLiwF https://t.co/uZKSuEUM2B", "We find our happiness where the sun shines. https://t.co/VH2ZdBJpiA", "Feel the sand of destinations unknown between your toes. https://t.co/GMe1JtQSJR", "Who would you like to spend a day on deck with? RT and tag them! https://t.co/xMeKfkNhze", "Roam the seas to white-capped mountains. https://t.co/tKcrbrilg0 #ComeBackNew https://t.co/yaO9O2D71Q", "Take your seat just in time for sunset. #ComeBackNew https://t.co/L42WDpD140", "Those who seek shall find. https://t.co/gG5U63vmJL", "Travel makes your world a little more colorful. https://t.co/O4aevIYzYX", "Discover dreamworthy destinations. https://t.co/jcrhgXm7P4 https://t.co/om0IJgtora", "Our favorite color is sunset. \nPhoto by @jchongstudio https://t.co/p4yhTMcKeP", "@tomboybc We have turn around ports all over the word! You can find information here: https://t.co/lrlFiwz3Go. Happy sailing!", "@dhoffkins Hi Deb, we apologize fro the frustration. Please contact us at 1-800-Princess to help troubleshoot.", "Onward to new adventures. https://t.co/Ckj9LQPl9L", "@Vanda_Vadas Hi Vanda, we're thrilled that you had a great time!", "Who needs a pot of gold when Royal Princess is at the end of the rainbow? Happy St. Patrick's Day! https://t.co/K1gXFHo7sI", "@MelissaSecord Hi Melissa that's New Zealand! Happy cruising!", "@mikepurdue fitting at the desk/dresser. We look forward to seeing you soon!", "@mikepurdue Hi Mike! Each stateroom is equipped with a pair 110-volt, 60-cycle alternating current (A.C.) with standard US (3 prong) plug -", "Make your grand entrance. https://t.co/A7XJE9olDQ", "@goofybaker1 Hi M.C., we can't either! :)", "@dhoffkins Hi Deb! Just click on \"Forgot your password\" link and insert your email address. Instructions will be emailed to you to reset!", "RT if you're wishing this was your view today. https://t.co/3MAP6XKDR4", "Adventure awaits just outside your windows. https://t.co/s5TyhUHHbv https://t.co/6O7g3fo7Ji", "Escape the ordinary. https://t.co/wPNoZIch6o", "Experience the majesty of the ocean. https://t.co/ZDuyPUN42W", "@mikesanuk Hi Mike! We're excited too. You can find Suite amenities here: https://t.co/m3hJCNu0YC.  See you in June!", "Relax, refresh, repeat. https://t.co/Jj1hI3ZDzi #ComeBackNew https://t.co/93amHxLgsX", "@LisaArmitage505 Hi Lisa, how may we assist you?", "Find new perspectives. https://t.co/DkaPAhdI8M", "@89Tribbey Hi Debi! Our voyages are launched about 18 months out. Please check back here: https://t.co/lrlFiwz3Go. Happy cruising!", "\"Live your life by a compass, not a clock.\" \n- Stephen Covey https://t.co/ILHq3vb1A5", "@sparkette123 (customerrelations@princesscruises.com) so that we may address your concerns.", "@sparkette123 We apologize for your disappointing experience from your recent cruise. We hope that you contact Customer Relations -", "@cronic1974 a wonderful time during our cruises and wish you had a better experience.", "@cronic1974 We're truly sorry if you had an unsatisfactory experience on your recent cruise.  We definitely intend for all guests to have-", "@gooskigo We apologize for your disappointment with our onboard food. While we don't have vegan offerings, we have vegetation selections.", "Kick back. Unplug. Rejuvenate. https://t.co/mjDxUeYOnY", "@kingkruncher Yes, click on the link of the vessel they are sailing on!", "@JimmyGlaister Hi Jimmy, congratulations on 25 year of wedded bliss! There weather will be about 18-20C. See you in August!", "\"With age comes wisdom. With travel comes understanding.\"\n- Sandra Lake #ComeBackNew https://t.co/iXNmA5HSMD", "@SpinDrMathis Hi Pamela, we sincerely apologize for your frustration. Can you please clarify your concern/question?", "@ftallarico Hi Frank! No fires, but we do have Fuji Sunsets. Bottoms up!", "@heatherjokcco Hi Heather, you can learn more about our Discovery at Sea program here: https://t.co/RkBCfrQkhC. Happy cruising!", "@icecube_ninja you onboard #GoldenPrincess", "@icecube_ninja Hi Ginny, please contact Princess directly at 1-800-Princess directly to address your request. We look forward to welcoming -", "Toss your worries in the wake. https://t.co/p0CGZXgn1q", "@kimmie1973 Hi Kim, we hope to see you onboard in the near future!", "Time stands still on the Lido Deck. #ComeBackNew https://t.co/xK28Yrm8mr", "@CaptBeermerica The Medallion does not give off signals. It is a passive devise, read by sensors throughout the ship.", "Caption this! https://t.co/zaFpdbvcK8", "Sunsets are better at sea. #ComeBackNew https://t.co/InE1oNX7GM", "The ocean is calling. https://t.co/iCiwifwFx3", "Extraordinary moments are waiting to be discovered. https://t.co/PQ8zRcYajN https://t.co/0emINcjXif", "Looking for something different? Tick the Panama Canal off your bucket list. https://t.co/ckszI0Bmb1 https://t.co/M78AgM8Bi5", "Find your perfect escape. https://t.co/tbYUXr1r04", "Where to next? https://t.co/POWoM2dq79", "@Chris_Heine Thanks for attending the panel, Chris! Give us a shout if you'd like any more info on our Ocean Medallion experience &amp; tech.", "Our President, Jan Swartz, is speaking at #SXSW in 5. \n\nWatch it live: https://t.co/8g4dJsXy75  #MPOMMA", "Upgrade your window views. #ComeBackNew https://t.co/9IfSrfBZJr", "Discover new adventures with every sunrise. #ComeBackNew https://t.co/nHiYsKSaTo", "Share a sunset with the ones you love. https://t.co/v31FcspThE", "Cruisin' into the weekend. https://t.co/kDcE7mRtkX", "Fill in the blank: My favorite way to spend a sea day is __________. https://t.co/37KCa1fUih", "@bloefeld437 So sorry, that voyage was cancelled last May due to deployment changes. Check out 5809N - 15 day South Australia &amp; SE Asia?", "Explore where colorful coastlines meet endless oceans. https://t.co/NMhtePR8dA #ComeBackNew https://t.co/9RdnBisMAx", "Experience the splendor of sunsets at sea. #ComeBackNew https://t.co/nSXlHb9FY1", "@kingkruncher You can peek at their location through the ship's Bridge Cam at https://t.co/2kFJa0zPCg. Hope they're having a great time!", "Our sights are set on paradise. https://t.co/B1HxvgAPLR", "@MyVirtualVaca So sorry their cruise was cut short, but glad we were able to help. Please pass on our best wishes.", "Bask in a balcony breeze. https://t.co/F7Q61ivv1H", "#WednesdayWisdom: Time spent in hammocks is time well spent. RT if you agree! https://t.co/xrUvEoUXD7", "Brighter days await at sea. #ComeBackNew https://t.co/gnDnEp5xE3", "The only trip you'll ever regret is the one you don't take. https://t.co/iax1Qgfdtd", "@ComedyOnly You can contact us at media@princesscruises.com. Happy cruising!", "The sweetest greeting. https://t.co/SWCBBTlw1o", "@atomines Hi Alan, we sincerely apologize for your frustration. Please DM your Captain's Circle number &amp; the FCC number you are disputing.", "Stare in wonder at white-capped peaks. https://t.co/dA0wI6pBjF #ComeBackNew https://t.co/rQyA605KvT", "What's next on your bucket list? #TravelTuesday", "Never lose your sense of wonder. https://t.co/5V8gbhQo9Y", "@benstonelive Hi Ben! Looks like a great time was had by all. Cheers!", "@bloefeld437 Our Cruise Atlas has a target date of 1 August. Smaller brochures have a target date of 1 June. Happy cruising!", "@raintinroofblog Hi Jenna, we think so too! Happy cruising!", "@Dharmpa13707478 Hi Dharmpal, our approved international recruiting partners can be found here: https://t.co/yi87Ph4DO2.", "@ComedyOnly We have visited Albania in the past and it is a destination we keep in consideration for the future!", "@CaptBeermerica The color is standard, but the guest's loyalty level will be contained within their unique digital identity.", "@26111974 Hi Ivan, our approved international recruiting partners can be found here: https://t.co/yi87Ph4DO2.", "@fcneun Our approved international recruiting partners can be found here: https://t.co/yi87Ph4DO2.", "@grrrrrrrrrrl Hi Marlee, onboard cocktails are about $8.95. Happy cruising!", "Always take the scenic route. https://t.co/lw12Affool", "@BrasgColin you had a better experience.", "@BrasgColin Hi Colin, we are truly sorry for the error on your name. We apologize for your continued disappointment on your cruise &amp; wish -", "Dreamworthy views from dawn to dusk. https://t.co/GKfatZNFO4", "Take a walk with the waves. https://t.co/hI0nNj6k6p", "Point your sails towards new adventures. https://t.co/y1blr3y4sI https://t.co/tudPRl7JM0", "RT if you're happiest with a wake view. https://t.co/N7H007tkSL", "Soak in moments at sea. https://t.co/XL2Bybw9CE", "\"Travelers are dreamers who make their desires for adventure a reality.\" https://t.co/5a3gVbBiJK", "Everyday at sea is a celebration. https://t.co/ERizyYETuM https://t.co/UI0BD8lyUg", "The best seats in the house. #ComeBackNew https://t.co/4nuRvwGnuQ", "A treat for all of your senses. https://t.co/0m7jOxSdwF https://t.co/eCNpMof0TV", "@srankin8 forward to welcoming you onboard!", "@srankin8 Hi Stacey, please contact your Travel Agent or Princess directly (depending on how you booked) to address your concerns. We look-", "Chase new coasts. https://t.co/BBbHS1K0jd", "@dhoffkins Hi Deb! We located your booking and see that you have received an upgrade. Please contact your Travel Agent to review!", "@TyrillaB To address your concerns, please contact Princess directly at 1-800-Princess to speak with Customer Relations. Happy cruising!", "@ctcolemanaz Hi Casey, you can contact us at 1-800-Princess to inquire. One of our team members will be happy to assist you. Happy cruising!", "@DCWriterMom Hi Renee! You can contact us at media@princesscruises.com.", "@02_lucylu Hi Lucy! Yes, in Pear and Strawberry Lime flavors. Bottoms up!", "@BrasgColin guests to have a wonderful time during our cruises and wish you had a better experience.", "@BrasgColin Hi Craig, we are truly sorry if you had an unsatisfactory experience onboard #CaribbeanPrincess We definitely intend for all-", "@tradeschooluk Disembarkation time is dependent on vessel clearance by Customs &amp; immigration.", "RT if you'd rather be cruising. #ComeBackNew https://t.co/K7dtK4uBct", "Embrace a moment of stillness. https://t.co/DvDoq889iC", "@travelmadtony Hi Tony, we sincerely apologize for your disappointment and frustration. Can you please send us your booking number via DM?", "@NouveauAdmin Greetings and happy cruising!", "Live every hour like it's happy hour. https://t.co/NmttTDoFJn", "@ezbruin Hi Bob, we think so too - especially while enjoying a cocktail. Cheers! https://t.co/2Nu8oU3EIW", "Simply irresistible. https://t.co/X2ch7uTStS https://t.co/0fXbE30hpc", "@KTVU We're excited to tune in for your segment with @thesleepdoctor!", "@valderbeebeshow We're excited to tune in for your segment with @thesleepdoctor!", "The best days are spent with sandy toes. #ComeBackNew https://t.co/79lQplhFOK", "We're pining for palm tree views. https://t.co/vXBY6WjE5V", "@calimesaguy That sounds really good to us right about now!", "@peterjhinton Hi Peter, we truly apologize for your frustration. Kindly provide us your email address so we can locate you in our system.", "Paradise begins here. https://t.co/W435jW86YP", "@calimesaguy We look forward to welcoming you onboard!", "@dermac80 Hi Derek, thank you for the heads up!", "@calimesaguy Thank you for the heads up!", "@ClareMBunting Hi Clare! We have singles, couples, friends/families, &amp; couples that sail w/ us. We hope to see you onboard soon!", "Dive into relaxation. https://t.co/WW31rjhilv #ComeBackNew https://t.co/n6Krqo6wlj", "The best days begin like this.\nPhoto: https://t.co/yuxrWnk71l https://t.co/YIkHRavtaG", "@domestic_rebel Happy Tuesday and happy cruising, Hayley!", "Who would you like to be watching the sunset with today? https://t.co/FCjs66THcZ", "@gavinc1321 onboard to discuss how they can improve your experience during the rest of your voyage.", "@gavinc1321 Hi Gavin, We deeply apologize for your disappointment on your current cruise.  We hope you connect with the Guest Services Desk-", "@iNitrox1 We wish we could help make the days go by faster. We look forward to welcoming you onboard!", "Log off. \nBreathe in. \nIt's time for vacation. https://t.co/jVXK6eFnM0", "@kdern Hi Kevin, from which country are you calling from?", "Happy birthday to our beloved Captain, Gavin MacLeod! https://t.co/2JJRRWBY46", "@slickersocial We invite you to read our response: https://t.co/NSBof9wTBf.", "@randomleigh , Thanks for asking about Princess! You can learn about us here:  https://t.co/1gsgnuzILD. Happy cruising!", "There's nothing sweeter than a sunrise at sea. https://t.co/kHwmzAN1jj", "Make your grand entrance. https://t.co/o4rccZJfPY", "@BrendaJarvis30 Hi Brenda, we apologize for your frustration! Please contact us at 0843 374 4444  to help troubleshoot.", "@Kimble_Ellen this promotion. We are however, looking forward to welcoming you onboard Crown Princess!", "@Kimble_Ellen Hi Ellen, we located your booking, &amp; see that it's paid in full. We also see that voyage 3814N is not applicable for -", "@BrendaJarvis30 Hi Brenda, #RoyalPrincess arrives in #DBV at 7:00AM and departs at 11:00PM on 25.May.17. Happy cruising!", "@ThompsonPR You're making us hungry! #TravelAlaskaChat", "@alaskatravlnews A9: One word: layers! #TravelAlaskaChat", "@akonthego A8: Our chefs prepare fish our guests catch in port. Nothing beats the taste of a fish you catch yourself! #TravelAlaskaChat", "@akonthego A7: Make your experience seamless with our Direct-to-the-Wilderness rail service! https://t.co/Ms55jUi9A0 #TravelAlaskaChat", "@SharmaViv1 Hi Vivek, thanks for your interest in joining our team! For employment information please visit: https://t.co/dOtZnFOuig.", "@akonthego A5: Do we have to choose?! #TravelAlaskaChat https://t.co/ImvjWoCKKg", "@alaskatravlnews A4: Kids &amp; teens love our Jr. Ranger Program, panning for gold, and Deadliest Catch Crab Sort Challenge. #TravelAlaskaChat", "@CruiseBuzz We agree! Alaska is best experienced by both land and sea. #TravelAlaskaChat https://t.co/cNetSFps2q", "@PeggyCoonley We think you'll love Alaska's beauty as much as we do! #TravelAlaskaChat https://t.co/RggqJU0bgj", "@CruiseBuzz A3: Helicopters, trains, and dog-sleds... oh my! #TravelAlaskaChat https://t.co/w50rGrG9AP", "@cruiseexplorer Sounds like 2017 is the time to go back! #TravelAlaskaChat", "@CruiseCritic Great snap! #TravelAlaskaChat", "@alaskatravlnews A2: We love meeting new friends on an Alaska cruise! #TravelAlaskaChat https://t.co/Ihjc9YOcgi", "@Jenthom11 Did someone say glacier?! #TravelAlaskaChat https://t.co/M5JZpw04aT", "@alaskatravlnews A1: We're excited to bring Alaska onboard with Puppies in the Piazza, local dive dishes &amp; more! #TravelAlaskaChat", "@akonthego We wouldn't miss #TravelAlaskaChat for anything! Except maybe an Alaska cruise :)", "@Travel_Visions Contact the Princess Community Foundation (communityfoundation@princesscruises.com) and a team member will respond.", "@RobertL13688288 Hi Robert, sounds good to us! You can find visa information here: https://t.co/8EF2ZDedlQ. Happy cruising!", "The sound of the ocean is music to the soul. #ComeBackNew https://t.co/y27T4w8r26", "Travel makes it easy to look at the bright side. https://t.co/yXBHTWzyC2", "Sunny days ahead. https://t.co/5cfx9oSbAT", "The perfect Sunday sunset. https://t.co/ewRXE3ikF8", "An unforgettable moment. A lifetime of memories. https://t.co/pr2IWhQyvg #ComeBackNew https://t.co/gyYpHG5sTn", "RT if you're dreaming of a day on the Lido Deck. https://t.co/HfJC9kXF16", "True or false: There's no better place to watch a sunrise. https://t.co/0X2zPH2hrA", "What's your favorite thing to do on the Lido Deck? https://t.co/Ql72rwm3d9", "Enjoy a Royal adventure. https://t.co/XsvU4kk6IR", "Be spellbound by beauty. https://t.co/kFMcvBGT1K #ComeBackNew https://t.co/7LxgYvwT01", "\"Do not stop thinking of life as an adventure.\"\n- Eleanor Roosevelt https://t.co/mqlJ8SHMXA", "Cruise along sun-kissed coastlines. https://t.co/BoL6t7wJIH", "Explore. Eat. Sleep. Repeat. https://t.co/bsJ9P9h9SV", "Find your perfect escape. https://t.co/wwIPHNJAMG https://t.co/txnYiJY3EZ", "Greet the shore at sunrise. https://t.co/ICXRZeEjqu", "Floating into paradise. https://t.co/V6DxVygNwj", "We may leave the cities behind, but the memories stay with us forever. https://t.co/UbbWiHrU0V", "@AndreSantanderB Hi Andre, our Sydney, AU team can be reached at 13 24 88 / 1300 551 853.", "@jamess9209 Hi James, we sincerely apologize. Can you please send us the name, address, CCN number via DM so we can locate in our system?", "@AndreSantanderB Hi Andre, you can reach us at 1 + 1 - 818-231-2138.", "Find wonder in the wild. https://t.co/1jFcpFaxZb #ComeBackNew https://t.co/B0zm1AoYFF", "RT and tag a friend you'd like to sip a cocktail with today! https://t.co/DZI3wHDQNO", "Linger a little longer. https://t.co/zqVlVsKx7l", "@adrian1evans Hi Adrian, you're making us hungry! :)", "Our favorite days are spent on the water. https://t.co/0BFq00UhzX", "@chelseycapri23 Our fares are based on double occupancy, w/ a reduced rate for 3rd/4th guest. Contact us at 1-800-Princess for assistance.", "@chelseycapri23 Hi Chelsey, the minimum age for most destinations is 6 months, item 5 in the passage contract: https://t.co/t6maYaqArw.", "The ocean is calling. https://t.co/RUMcsrI7Qt", "Immerse yourself in an endless summer. https://t.co/MY7MrzLU42 \nPhoto: https://t.co/jIAZiYJXop https://t.co/50uPS9gZi3", "\"Paradise isn't a place. It's a feeling.\"\n- L Boyer https://t.co/ViYRwNXLjU", "@Nao212A We apologize for the confusion! Select the cruise date first from the hyperlinks, then room type, then continue booking!", "@DaisyWantsaBone Hi Daisy! #SeaWalk is onboard #RoyalPrincess #RegalPrincess and #MajesticPrincess Happy cruising!", "@MeherSfi Hi Danish, our approved international recruiting partners can be found here: https://t.co/ir5haZdTgD.", "@johnrayt1207 Hi John, our approved international recruiting partners can be found here: https://t.co/ir5haZdTgD.", "Adventure at a higher altitude. #ComeBackNew https://t.co/VPyDXsuMT7", "@ShaneDeCoste Hi Shane, unfortunately, we can't tell you the location. The person who submitted the photo did not provide that information.", "Discover colors as bright as the sun. https://t.co/0d7PiqqheL https://t.co/jfRfPho9m6", "@tangiers33 Hi Christine, thanks for your interest in joining our team! For employment information please visit: https://t.co/7xBwlncTsn.", "@chike8mhn Hi Chike, we've sent your request to the appropriate department. Allow 30 days for emails to stop, as some remain in queue.", "Good morning, sunshine. https://t.co/1MVF0Wg6VL", "Life is meant for spectacular adventures. https://t.co/0bhR67ZHRj", "Take a stroll with the seas. https://t.co/FJA7ESTWF5", "It's the last day of our #Paperboyo takeover! See his take on a Princess Cruise here https://t.co/oi5eKMotPS https://t.co/zI9FUUSly4", "Sail through South America, or adventure in Asia -- What's next on your list? https://t.co/kq7ENLQNCh https://t.co/XwyGIBFaTz", "Happiness is as simple as a cup of coffee and an ocean view. #ComeBackNew https://t.co/ynBiZRMCri", "RT if you wish this was your #SunsetSunday view. https://t.co/OE28DiHtgO", "Endless adventures by land and by sea. https://t.co/XcTit2f5Wn", "\"Travel. It leaves you speechless, then turns you into a storyteller.\"\n- Ibn Battuta https://t.co/5BZXH1fRaf", "Encounter a world outside your own. https://t.co/5HGWHwQvWl https://t.co/jZkPcGCmxr", "Our sights are set on paradise. https://t.co/biOhA85ZVD", "Cruisin' into the weekend. https://t.co/e5JkBeqLWR", "Spend your weekend with a wake view. https://t.co/C3DIZVWdsn", "The sweetest greeting. #ComeBackNew https://t.co/O9nehZZAwU", "Rich McCor aka #Paperboyo has taken over our Instagram! Follow his Mediterranean Cruise here https://t.co/axt9gMWcgq https://t.co/DZw4qZK0ja", "\"Travelers are dreamers who make their desires for adventure a reality.\" https://t.co/fU6g1XMEv4", "@chike8mhn Hi Chike, we sincerely apologize for the frustration. Can you please provide your email address?", "@MarieEveDuguay Hi Marie, thank you for hosting such a lovely event! We loved meeting you and learning more about #Canada Cheers!", "@ExactlyCharley Hi Charley, we are very sorry to hear that. Can you kindly advise us of issue via DM?", "@bhupender1956 Hi Bhupender, sounds like a great plan! We're researching a travel partner in your area. Will follow up with details.", "Alluring adventures await. https://t.co/51qjNECsRI https://t.co/pxc7jW4xq9", "@jshuler06 @shopwithscrip welcome you onboard in the near future!", "@jshuler06 @shopwithscrip Hi Jason, for clarification, we do indeed accept scrip as payment. We apologize for the confusion and hope to -", "@ThatSaffa Hi Tristan, welcome aboard!", "@lynnnarraway Thanks Lynn! #waveawards", "@jshuler06 @shopwithscrip  Hi Jason, we are not familiar with this organization and they are not a brand partner of Princess Cruises.", "There's no better feeling than an ocean breeze. https://t.co/hs6F5t8t4Q", "@b_cmack Hi Brent, thank you for choosing Princess! Please contact Princess at 1-800-Princess for assistance.", "Set your sights on an Alaskan adventure. https://t.co/MxUjeEzPTe https://t.co/5mussjsPEJ", "Follow us on Instagram to take a look behind the scenes of our #Paperboyo takeover! https://t.co/Dbev8d21LM https://t.co/HFALEreYWu", "The smaller you feel, the greater your perspective. https://t.co/nKyPeydaU5", "You have nothing to lose and a world to see. https://t.co/2JcqymeNwg", "@scrosso Would you kindly advise us of your booking number via DM so we can locate you in our system?", "@joeg1953 Customer Relations (customerrelations@princesscruises.com) so that we may address your concerns.", "@joeg1953 Hi Joe, we're truly sorry to hear that you experienced noise issues on your recent cruise. We hope that you will contact -", "Set sail. https://t.co/rgox9PqXr7 https://t.co/1Kw9tTnZIN", "@bexbrands in queue to finish. We appreciate your understanding while we work to resolve this matter.", "@bexbrands We apologize for your frustration. Your email has been removed, from our marketing, but it may take 30 days for remaining emails-", "@AngelaMDiLoreto we regret the necessary decision to miss ports due to inclement weather.", "@AngelaMDiLoreto Hi Angela, we apologize for your frustrating cruise experience. We understand the disappointment of missing ports, and -", "@neonbubble or Alexandrinsky theaters. The other option is for a concert hall.", "@neonbubble Hi Mark, the upgraded option is for one of St. Petersburg's historic theaters - such as Mikhailovsky, Hermitage, -", "\"Traveling tends to magnify all human emotions.\"\n- Peter Hoeg #ComeBackNew https://t.co/EM8aDxh74Z", "Paperboyo is taking over our #Instagram for the next 5 days! Check it out at https://t.co/GD6IpEKZkw https://t.co/e0sZ5amVbE", "Take in a sunset from a world away. https://t.co/9m5ib5XWtL", "@princeton_walk Hi Ted, we sincerely apologize for your disappointing experience, Can you please advise the booking number and issue via DM?", "@lbk21 Hi Larry, can you please provide your booking number and briefly advise us of the issue via DM?", "Explore. Eat. Sleep. Repeat. https://t.co/ES4vscz47z", "@bhupender1956 What is your country of residence?", "@desireeheadley based ships run the event, but you can inquire/request at the Guest Services Desk. Happy cruising!", "@desireeheadley Hi Disiree, all ships have paddles &amp; balls but only #RegalPrincess &amp; #RoyalPirncess have the appropriate net. Only US -", "#WednesdayWisdom: Time spent in hammocks is time well spent. #ComeBackNew https://t.co/7hUJq9Rlnm", "@SMcWillis We invite you to read our response: https://t.co/NSBof9wTBf.", "\"The ocean stirs the heart, inspires the imagination and brings eternal joy to the soul.\" - Wyland https://t.co/xcZe9vpzgC", "True love is sharing your dessert. https://t.co/G7WuJsy3pz", "@PrMediaLink We invite you to read our response: https://t.co/NSBof9wTBf.", "@neonbubble Hi Mark, we are unable to provide you with the name of the performance at this time. Please check back closer to departure.", "@heathermaywest Hi Heather, we invite you to read our response: https://t.co/NSBof9wTBf.", "@AColettiGotHeem Hi Aileen, we invite you to read our response: https://t.co/NSBof9wTBf.", "@vegancruiser Hi Sanna! We're always chasing the horizon to help our guests #comebacknew", "@CalculateTravel You're making us hungry!", "@cucho2272 Hi George, it's a port we keep in consideration for our future planing.", "Happy Valentine's Day from the Love Boat! https://t.co/iPJOZuw2QP", "@sarahsmith131x Hi Sarah, we apologize for the delay. How can we assist you?", "@iam_thedele We have, but not at the present time.", "@neonbubble Hi Mark, we will look into your question and get back to you once we can provide details.", "See your favorite movie stars under the stars. https://t.co/IWPAnIusOl https://t.co/WRvQQqBfmV", "@Hubert1863 Hi Hubert, you can find our brochures here: https://t.co/bh2zxjYntF. Happy cruising!", "@Emmawesterman80 Hi Emma! Thanks for asking about our Cruise Vacation Planners. You can learn more here: https://t.co/g3qIGEncnz.", "@zoe_brookes your email address via DM so we can locate your profile. Which brochures did you request?", "@zoe_brookes Hi Zoe, we sincerely apologize for your frustration. You can download instantly here: https://t.co/bh2zxjYntF. Please adv-", "@bexbrands We sincerely apologize! Can you please send us your email address via DM so we can locate you in our system?", "@ClareMBunting Hi Clare, thank you for your kind words about the loss of our team member. We keep the family in our thoughts and prayers.", "Toss your worries in the wake. https://t.co/wEavmFSiWU", "A new world awaits.\nPhoto: https://t.co/NwcvxyQmWG https://t.co/PI6751zUqg", "Kick back. Unplug. Rejuvenate. https://t.co/NWYJzVU2EN #ComeBackNew https://t.co/mqoUKAq6Oh", "The only trip you'll ever regret is the one you don't take. https://t.co/WCo0WInYP9", "Experience dawn on deck. https://t.co/vhIvXjU428", "We're dreaming of cotton candy skies. https://t.co/UVZJQdkfae", "It's not just about where you're going, but how you're getting there. https://t.co/UwDonZ05HL", "Out-sparkle your champagne. https://t.co/dslnWavgPy https://t.co/9Fs821mTqI", "@racechic1414 It's the perfect week for a Caribbean getaway! See you soon, Whitney!", "@BethPar43844264 We're thrilled you had a great time! Hope to see you back onboard soon.", "Well done Victoria! We hope you've got your pink tools now! #TheCruise https://t.co/ekVjjQLWtN", "@Charl_Brailsf we definitely are!", "Indulge in carefree, sun-soaked days in the Caribbean. https://t.co/H4xFH4UEsX https://t.co/00cs8WsbJa", "Somewhere over the rainbow... \nYou'll find Royal Princess! https://t.co/L1eA1kWfyN https://t.co/rEHADI9dz4", "Need to catch up on @ITV's #TheCruise before the finale tonight? Last night's episode is on ITV Player now https://t.co/agKBoVddQX", "@officialbarnsey we know! It's gone so quickly!!!", "@BigHammerNZ Hi Stu, we appreciate your condolences. Our thoughts and prayers are with the crew member's loved ones at this time.", "@OneLeeMitchell great photo!", "@AuntiePegg so do we!", "Lauren doesn't seem to be minding that backseat driving, does she?  #TheCruise https://t.co/dTQEyBU5JJ", "@fikretsatiroglu Hi Fikret, how can we assist you?", "\"Man cannot discover new oceans unless he has the courage to lose sight of the shore.\" - Andre Gide #ComeBackNew https://t.co/6yRTJhoLfG", "@iam_thedele onboard in the near future!", "@iam_thedele Thanks for asking about our promotions! You can find information here: https://t.co/i1dyZXaJO5. We look forward to seeing you -", "@pmmorris1 be contacting you to address your concerns. We will pass along your additional feedback.", "@pmmorris1 Hi Marilea, we were able to locate your booking, and see that our Customer Relations Department has received your email and will-", "Where's your favorite place to spend a day at sea?", "@peg17ess Hi Peggy, we deeply appreciate your condolences. Our thoughts and prayers are with the crew member's family at this time.", "Experience sun soaked cities. https://t.co/GdRpagnpjp", "Dreaming of coladas in the Caribbean? Explore our summer 2018 itineraries: https://t.co/NdT7R5NiWq https://t.co/C9R6FFb5N1", "@HGoeschRDN Hi Heather, you can follow us and send via DM.", "@scattyvenusSF Travel Agent or Princess at 0843 374 4444. We hope to see you onboard in the near future!", "@scattyvenusSF Hi Steph, you can find our voyage information here: https://t.co/8I400OPn02. For further assistance, please contact your -", "@pmmorris1 H! We are having difficulty locating your booking. Can you please provide us with your email address?", "@HGoeschRDN Hi Heather, can you provide the name of the guest, ship, and sail date?", "@HGoeschRDN Hi Heather, you can find our ship's phone &amp; fax numbers here: https://t.co/beykqfhJjC.", "@OnlyMaryami Hi Maryam! You can find our current promotions here: https://t.co/i1dyZXaJO5. We hope to see you onboard in the near future!", "@vviivviieennnne For clarification, Coke Zero can't be pre-ordered, but you are welcome to bring your own onboard &amp; store in stateroom!", "\"Live your life by a compass, not a clock.\" \n- Stephen Covey #ComeBackNew https://t.co/aomCWdy1ws", "@vviivviieennnne request and pay for it prior to departure. Happy cruising!", "@vviivviieennnne We don't carry Coke Zero onboard, but you can contact the Dietary Coordinator (dietaryrequest@princesscruises.com) to -", "@LaceyOldson Per our pricing structure, there is a charge for each guest regardless of age.", "@JLR2049 Hi Jennie, we see that Customer Relations left a voicemail for you on Feb 6th at 12:00pm. We adv of your additional feedback.", "Seize every sunrise as a new opportunity for adventure. https://t.co/AwtHtWRexL https://t.co/xfivdcackV", "@scrosso There is no plan at this time, but we will pass along your request to the appropriate department.", "@scattyvenusSF Hi Steph, often we have single supplement fares of 150% to 160% of the double occupancy fare.", "Serenity for miles. https://t.co/Ao62gZ3pix", "@KingKwame89 Hi Kwame, we will pass your request along to the appropriate department.", "Dreams go farther here. https://t.co/A1mvqg0bR9", "@alfonsusgollu You can contact us at entertainment@princesscruises.com.", "@scrosso apologize if our service did not meet your expectations.", "@scrosso We are truly sorry for your disappointment in our onboard service. We strive to be the Consummate Host for our valued guests. We -", "Escape the ordinary. #ComeBackNew https://t.co/3lIaTrbAYv", "@KingKwame89 Hi Kwame, can you please advise us of your email address?", "Wake up to wake views. https://t.co/wRWbjkt3Xh", "@AmyHollandSmith Hi Amy, we apologize for any technical issues! Contact Princess directly at \n0843 374 4444  to help troubleshoot.", "You have nothing to lose and a world to see. https://t.co/HOMlVdDlCI", "@realmeateater Hi Arthur, looking good!", "@flankenfarms Platinum level loyalty members receive 500 minutes on voyages 21 days or longer: https://t.co/F2WRiYVnDT. Happy cruising!", "@BekiG Hi Beki! All of our cabins and suites have hair dryers. We look forward to welcoming you onboard!", "@Stacey99960 Hi Stacey, we love your beautiful smile!", "@MCappadocia Hi Mary! We apologize for the delay in response. We hope you enjoyed watching the game onboard #CaribbeanPrincess", "Experience dawn on deck. https://t.co/GYPwyL4UiD #ComeBackNew https://t.co/XqFCoZsulX", "@catabyte We can help with that! #ComeBackNew https://t.co/TS1gw9kJEx", "@sweetcsdesigns We hear Scandinavia is beautiful in May! :)", "Today's moments become tomorrow's precious memories. https://t.co/tVcR57gxQm", "Stay for an extra chapter. https://t.co/kPkwHuBkI5", "Nothing beats a breakfast in bed. https://t.co/nrR0VB5Kiq https://t.co/T8w0oucn4Y", "Soak in every bit of sunshine. https://t.co/Lwv86OmqmQ", "There's always time for tea and room for cake. RT if you agree! https://t.co/3uQMTamyyn", "Experience the majesty of the ocean. https://t.co/50K7dkgv5j #ComeBackNew https://t.co/2uh6M2pqFH", "Where's your favorite place to catch a sunrise onboard? https://t.co/oIy6dedKQh", "Sun and sea are all we need. https://t.co/xUTne9vNJC", "@stevieness Please send us your booking number via DM.", "@stevieness Did you pre-pay for a Specialty Dinner?", "@LouLasher Hi Lou, we invite you to read our response: https://t.co/NSBof9wTBf.", "@MichelleAFortin Hi Michelle, we were able to locate your information. Can you please advise us of what port of call you are referring to?", "@rentparisnow Hi! How can we assist you?", "@lolmadbro Hi Bill! Thanks for asking about our #PlacesToSea contest. We will announce here: https://t.co/RzFYnVCTC9. Stay tuned!", "Embrace a moment of stillness. https://t.co/S549cyC2ZI", "@ChantellAlyse Hi Chantell, you can find contact information to our ships here: https://t.co/beykqfhJjC.", "@Ronst21 Those are only available onboard the vessel.", "@AmyHollandSmith Hi Amy, you can contact Princess directly at 0843 374 4444.", "@TWeeks1996 Hi Tom, our approved international recruiting partners can be found here: https://t.co/ir5haZdTgD.", "Live every hour like it's happy hour. https://t.co/QbFGXRAL54 #ComeBackNew https://t.co/6ypGpnUTyD", "There was lots to celebrate in last night's episode of @ITV's #TheCruise! Catch up on ITV Player now https://t.co/iai0zD0efp", "Discover colorful coastlines. https://t.co/WzudybPuSF https://t.co/uhpaJeN0GV", "@tapeek amazing choice! It's hard to beat ceviche and a pisco sour!", "@CruiseMiss well that is a fairly good excuse... thank goodness for ITV Player!", "@gconklin93 it's hard to beat that Texas BBQ...", "@gigstarr good choice! Definitely one of our favourites", "@ethel_glover thanks!", "@Ronst21 Hi Ronst, you can find our port and shore excursion information here: https://t.co/L5pkL2LeSf.", "RT @ClaireG23: Can't wait for next week #thecruise in Gibraltar one of my fave ports #TheRock https://t.co/YPhC78RLCE", "Parallel parking at sea? All in a day's work for our superstar Lauren! #TheCruise https://t.co/6N5OdtsHVt", "How beautiful does Montenegro look? Sign us up! #TheCruise https://t.co/j5pLGJr7f4", "Royal Princess is in Montenegro in this week's episode of #TheCruise - starting now on @ITV! https://t.co/NiMkfXxASl", "@colleenepstein Wednesday, and your concerns were addressed. We look forward to welcoming you onboard #RegalPrincess", "@colleenepstein Hi Colleen, we truly apologize for your frustration. We found your booking &amp; see that you spoke to a member of our team on -", "@AmyHollandSmith Hi Amy! You can find our gift information here: https://t.co/kVtaea5zkv. We wish your dad a happy 60th birthday!", "@nousername4us Hi Jocelyn, we invite you to read our response: https://t.co/NSBof9wTBf.", "It's Thursday! You know what that means - catch up with the crew in @ITV's #TheCruise, tonight at 8:30pm. https://t.co/TxZ6nZI1z0", "@knight3084 Thanks for asking about our cruises! Yes we sail out of New York. Please find information here: https://t.co/lrlFiwz3Go.", "@BrendaJarvis30 Hi Brenda! You can find our voyage information here: https://t.co/lrlFiwz3Go. Happy cruising!", "@Mary5792 Hi Mary, we invite you to read our response: https://t.co/NSBof9wTBf.", "@mikeymikedoha Hi Michael, we invite you to read our response: https://t.co/NSBof9wTBf.", "@vacaysbyshaw We invite you to read our response: https://t.co/NSBof9wTBf.", "@mjb1911 Hi Mandy, you can learn about our beverage packages here; https://t.co/7y1GRv2v8c. Happy sailing!", "@kyblueblood Hi Robin, we invite you to read our response: https://t.co/NSBof9ficF.", "@kimvie We invite you to read our response: https://t.co/NSBof9wTBf.", "Sometimes living large means feeling small. https://t.co/08j5wOtJZU", "@TableFountainPs We invite you to read our response here: https://t.co/NSBof9wTBf.", "@JainsUSA We invite you to see our response here: https://t.co/NSBof9wTBf.", "@gilberti_water We invite you read our response: https://t.co/NSBof9wTBf.", "@TWeeks1996 Hi Tom! Can you please advise us what this is regarding so we can assist?", "@JLR2049 address your concerns.", "@JLR2049 Hi Jennie, we'll forward your feedback along to our Customer Relations Department so one of our team members can contact you to -", "@HaileyRosin Hi Hailey, we are truly sorry to hear of this. Can you please advise of her name, ship, and sail date via DM?", "Take a stroll with the seas. https://t.co/s6qqTtjCcb", "The journey may end, but the memories remain. #ComeBackNew https://t.co/bNiZzGlSvi", "Where to next? https://t.co/W3ijbTlfR6 https://t.co/TuKmwkbkmh", "Who would you like to be watching the sunset with today? https://t.co/ORrOaBLDwz", "@robyn_mf Hi Robyn, you can contact our Princess Cruises Community Foundation by emailing them at communityfoundation@princesscruises.com.", "@mjb1911 Hi Mandy, yes we do! You can find our voyage information here: https://t.co/lrlFiwz3Go. Happy cruising!", "@hautetravelgirl Hi Heather! You will just have to book a cruise &amp; come onboard to see! :)", "@Lauren_Heritage https://t.co/gIq5tNln2F. We hope to see you onboard in the near future!", "@Lauren_Heritage Hi Lauren! Thank you for inquiring about our #RoyalOceanEvents wedding programme. You can learn more here:", "@gconklin93 Princess directly at 1-800-Princess for assistance. We hope to welcome you onboard soon!", "@gconklin93 Hi Camille, our fares can fluctuate and we have promos/sales often in market place. Please contact your Travel Agent or -", "@karinaSME Hi Karina, Our approved international recruiting partners can be found here: https://t.co/ir5haZdTgD.", "Go roam. https://t.co/9ZiXLRk8AJ https://t.co/1z8X1CAn37", "It's better to see something once than to hear about it a thousand times. https://t.co/cb9NigqYJn https://t.co/O62nomQsen", "@rereborys January 26th, and a letter for your insurance company was provided. We have noted your additional feedback.", "@rereborys Hi Renee, we sincerely apologize for your continued frustration. We see that you spoke to our Customer Service Department on -", "A sunrise at sea is worth waking up for. #ComeBackNew https://t.co/8esuU3d5bl", "Celebrate over a romantic sunset at sea. We have every occasion covered. https://t.co/2As9p62oyb https://t.co/yGJsKBBQDp", "Surround yourself with grandeur. https://t.co/cyhF7LFK3G", "The sound of the ocean is music to the soul. #ComeBackNew https://t.co/NAlYtq0Yvw", "Good morning, sunshine. https://t.co/bYt7MPB0It", "RT if you're dreaming of cotton candy skies. #ComeBackNew https://t.co/NWHeV2D8ph", "Linger a little longer. https://t.co/xd2pY84uph", "Our favorite days are spent on the water. https://t.co/sdDhtc5IQp", "Challenge yourself to discover new perspectives. https://t.co/s3U0spnrBt", "When in doubt, vacation. https://t.co/5WpAOWpPOa", "Warm sands. Clear seas. Explore our summer Caribbean itineraries: https://t.co/wApOlyZBoK https://t.co/WcK9z8yqwl", "True or false: There's no better place to watch a sunrise. #ComeBackNew https://t.co/e7wv0EjRKg", "Catch up with the crew of Royal Princess in @ITV's #TheCruise, on ITV Player now https://t.co/QtVw4SFXGl", "@c_jupp we can't wait to have you back!", "@eellsinoc amazing - there's nothing more romantic than the Northern Lights! We hope you have an incredible time", "See your favorite (movie) stars under the stars. https://t.co/9rGjnm070A https://t.co/Owkx28BymD", "@PellyTrolls Hi Pelly! That is our classic #SeaPrincess", "@CelebStarzNews We invite you to  read our response: https://t.co/NSBof9wTBf.", "@neonbubble Good eye - and great photos too!", "@QuiTamGuru Hi Qui Tam, we invite you to read our response: https://t.co/NSBof9wTBf.", "@CruiseMiss It gets quicker every week!", "@boatbarrister Hi Brendan, we invite you to read our response: https://t.co/NSBof9wTBf.", "@travelnotcomple We're with you - definitely the chocolate!", "Good job Lauren! #TheCruise https://t.co/vIoht6CbFk", "What a gent @scottgrayson89! #TheCruise https://t.co/KNEPA1BxuX", "@CruiseMiss it's good to be back!", "Just a few minutes to go! Catch up with the crew onboard Royal Princess in the latest episode of @ITV's #TheCruise https://t.co/XT4prcfXhy", "@mitchos84 Hi Michael, we truly apologize for your disappointment. We charge for each guest on our cruise vacations, regardless of age.", "Ready for a Royal adventure? https://t.co/p7BzoC3BzM", "The best days begin like this. \nPhoto: https://t.co/yuxrWnk71l #ComeBackNew https://t.co/syJqWVxLTi", "Join the celebrations onboard Royal Princess in @ITV's #TheCruise, tonight at 8:30pm https://t.co/Pcp0slJ6m7", "There's no time to be bored in a world as beautiful as this. #ComeBackNew https://t.co/6XGmGa72qi", "@thatcoffeelord Hi George, we are truly sorry the cruise itinerary did not go as planned, especially for such a long awaited trip.", "\"Life is a journey, not a destination.\"\n- Ralph Waldo Emerson https://t.co/tubkZkvdXN", "@AndLiveAgain Hi Michael, we are truly sorry the cruise itinerary did not go as planned, especially for such a long awaited trip.", "@kimmmy_kay_ Hi Kimmy! That will depend on your spending habits! :)", "Make your grand entrance. https://t.co/IZFDVxLHPT https://t.co/DTemcfNLj9", "Get your day off to a bubbly start. https://t.co/CcmkeVJVXc", "There's always an excuse for champagne. https://t.co/ZRXCRZPZcq", "@lachgar1 Hi Youssef, we invite you to read our response: https://t.co/NSBof9wTBf.", "@OceanAssets Hi D. Michael, we invite you to read our response: https://t.co/NSBof9wTBf.", "@AndLiveAgain Hi Michael, can you kindly advise of the issue?", "@KimJago Hi Kim, the email for customer service for Steiner Leisure is shellem@steinerleisure.com. It may take two weeks for a response.", "Soar over destinations unknown. https://t.co/aE6YWKkSG6", "@cgogail Hi Gail, we apologize for any disappointment. Can you briefly advise us of the issue via DM?", "Dreaming of coladas in the Caribbean? Explore our summer 2018 itineraries: https://t.co/CmHmfyHtIg https://t.co/ouglt3x6hU", "@Davidhoj Hi David, please follow us so we can send you some contact information.", "Onward to new adventures. #ComeBackNew https://t.co/LN5x4EkXyR", "@AngelaMDiLoreto of our team members will contact you to address your concerns.", "@AngelaMDiLoreto Hi Angela, we were able to locate your booking. We will pass your feedback long to our Customer Relations Department. One -", "Live for the moments you can't put into words. \nPhoto by @jchongstudio https://t.co/LeCOQLFk8J", "@TAQUIZASDONCSAR authority for questions regarding other vaccinations, prophylactic medications. &amp; preventative health measures.", "@TAQUIZASDONCSAR Currently, this voyage doesn't require a Yellow Fever Vaccination.  Guests should contact their doctor or local health-", "@AngelaMDiLoreto Hi Angela, we are having difficulty locating you in our system. Can you please send us your booking number via DM?", "@JLR2049 Hi Jennie, please follow us and kindly advise is of your booking number so we can locate you in our system .", "@angie_blattner Hi Angie, we see that Customer Relations spoke to your Travel Agent today. We will pass along your additional comments.", "@Janabananaky Hi Jana, adorable!", "@TheREALStanP Hi Stan, you are welcome to contact us at entertainment@princesscruises.com", "@irishvikingette Hi Kara, we apologize for any delays this weekend and hope to exceed their expectations on the remainder of their voyage.", "Explore. Eat. Sleep. Repeat. https://t.co/KwzwTLOpCF", "@vaughan_jeffery Hi Jeffrey, happy almost 50th birthday! You can find our brochures now right here: https://t.co/bh2zxjYntF. Happy cruising!", "@balancia_marion Hi Marion, you can find our voyage information here:https://t.co/8I400OPn02. We  hope to see you onboard soon!", "@Nat3105_ Hi Natasha, cruise fares include some drinks such as tap water, milk, coffee, tea, and juice. Some locations/times charge fees.", "There's no better feeling than an ocean breeze. RT if you agree! https://t.co/6pqGFWqd1f", "Monday is nothing a cocktail can't fix. https://t.co/Q7abxjnItQ #ComeBackNew https://t.co/Td0AbkJA69", "Take in a sunset from a world away. #ComeBackNew https://t.co/WaDQQ3CcGT", "RT if you're imagining yourself here. #ComeBackNew https://t.co/PrOHFxiyCp", "Embrace a moment of stillness. https://t.co/82Z8JT50Yh", "Our favorite color is sunset. \nPhoto by @jchongstudio #ComeBackNew https://t.co/sjCeLdrL5m", "Sun and sea are all we need. https://t.co/e0y1uv4NDf", "Taste the world onboard - Food &amp; Wine Magazine rank us among the Best Cruises for Food Lovers. https://t.co/1wWbBjehye", "It's not just about where you're going, but how you're getting there. https://t.co/cX9VxTz2pQ", "Become a sea seeker. https://t.co/sTGdsMHcZj", "@Ronst21 Can you advise us of your booking number via DM?", "@Davidhoj Hi David, what is your country of residence?", "@mjb1911 Hi Mandy! You can sign up for our special offers at https://t.co/rn8UC8CWnq", "@crygreen2 We invite you read our response here: https://t.co/NSBof9wTBf", "Find comfort in a new point-of-view. https://t.co/vF4KiabDzD", "@rebsalguero confusion.", "@rebsalguero Hi Rebeca, we apologize for the last message regarding our Community Foundation. It was sent in error. Our apologizes for the -", "@rebsalguero Hi Rebeca, we invite you to read our response here: https://t.co/NSBof9wTBf.", "@dese2 We invite you read our response: https://t.co/NSBof9wTBf.", "@Netoxmcbo Hi Neil, we invite you read our response here: https://t.co/NSBof9wTBf.", "@Jonathangosky shipboard team.", "@Jonathangosky Hi Jonathan, we deeply apologize for this occurrence during your current voyage. We've shared your feedback with our -", "@annoc2 Personalizer. For all others, please contact the Lotus Spa once onboard!", "@annoc2 Hi Annie! Lotus Spa is onboard all of our vessels. Some services are available to book pre-boarding through your Cruise -", "Travel makes your world a little more colorful. https://t.co/5vGTqLWL4q", "Walking on sunshine. #ComeBackNew https://t.co/i2kPiWfEvD", "Missed last night's episode of @ITV's #TheCruise? Catch up on ITV Player now https://t.co/xpr8N9rg9P", "@honey260809 Hi Harleen, can you please provide your agency name, city/state/country, phone number, and email address via DM?", "Marvel at mountain views. https://t.co/qkMPtazzKq", "@travelbrewson Hi Cody, please keep checking here: https://t.co/i1dyZXaJO5 for our current promotions! Happy cruising!", "@jessikadamico23 Hi Jessika, you can contact us at 0843 374 4444. One of our team members will be happy to assist you! Happy cruising!", "@SeanLXIV we missed him too - we promise he'll be back next week though!", "@CruiseMiss time flies! We can't wait for next week!", "Want to find out more about life on board Royal Princess? #TheCruise https://t.co/ZAmcfAduvH https://t.co/Uy2u39DQZI", "@travelnotcomple thanks Angie! That's a great video!", "@travelnotcomple we think that sounds like a great idea!", "Discover a world of wonder and a sea of possibilities. https://t.co/ZlY6tQ6zQP", "Looking good Nico! #TheCruise https://t.co/tQaZ9ud0ue", "The definition of the scenic route. https://t.co/GUwzFShLFT #ComeBackNew https://t.co/G0zJTAdqm6", "RT if you wish you were soaking in this view today. https://t.co/BeHwdHvaYC", "Who's joining us tonight for Episode 2 of @ITV's #TheCruise? See you at 8:30pm! https://t.co/mjwFD8cjG9", "Soak in every bit of sunshine. #ComeBackNew https://t.co/Bmp99DhxRF", "@paulivory1963 Hi Paul, we apologize for your disappointment. Unfortunately, this sale is not available in your geographical area.", "Ready for a new adventure? https://t.co/guMNgTlg8J", "@Karrotsnsprouts @EvaVeggie Hi Victoria and Eva, we invite you to read our response here: https://t.co/NSBof9wTBf.", "@AvonvaleCarpets We sincerely apologize for your frustration. Can you please advise us of your booking number/promotion in question via DM?", "Rise. Shine. Dine. Repeat. https://t.co/Zj8M7zlIQA https://t.co/Xxn3EqlIo0", "@KimJago look forward to welcoming you onboard #SeaPrincess", "@KimJago Hi Kim! Lotus Spa is owned/operated by Steiner Leisure. Contact them at 305-358-9002 ex 1252  or shellem@steinerleisure.com. We -", "@angie_blattner Hi Angie, we see that we have received an email from Robert &amp; Mary. We will be in contact.", "@angie_blattner to our Customer Relations Department. One of our team members will contact you to address your concerns.", "@angie_blattner Hi Angie, unfortunately, we don't see that we have received any correspondence from you. We will pass your feedback along -", "@Aredeeof It's up to the individual to determine if they are able to travel, and enter the countries on the voyage.", "@sparky023rays We'd love to welcome you onboard, Sally!", "Feel at home in a place you've never been. https://t.co/zFshQblDOM", "@louised1989 Hi Louise! Our cruises are launched about 18 months prior to departure. Keep checking back! Happy cruising!", "@Mairi629521591 Hi Mairi, we can't wait either!", "@Ladewig Hi Scott, you are making us hungry!", "@mumlwhyte Hi Lisa! We look forward to welcoming you onboard #RubyPrincess and helping you #comebacknew", "@chrisflan3 Hi Chris! This is our new #oceanmedallion technology. You can learn more here: https://t.co/cktpdHmgSf. Happy cruising!", "Always save room for dessert. https://t.co/Q7abxjnItQ https://t.co/lebPxGxoOI", "@BalePaige Hi Paige! That's beautiful #CaboSanLucas", "@angie_blattner Relations (customerrelations@princesscruises.com) so that we may address your concerns.", "@angie_blattner Hi Angie, we sincerely apologize for your disappointing experience onboard #CrownPrincess We hope that you contact Customer-", "@rdhtp2t Hi Johnny, please follow us, then kindly provide your parents names, ship, and sail date via DM.", "@adebaby71 Hi Adrian, located your booking and see that you were in the Cruise Personalizer on 15JAN. Are you still having difficulties?", "@TCWalterColijn Customer Relations (customerrelations@princesscruises.com) to share their feedback about their experience.", "@TCWalterColijn Hi Walter, unfortunately, the survey can only be re-sent up to 2 weeks after disembarkation. They're welcome to contact -", "@jdmays on-off switch &amp; no charging.", "There's always time for tea and room for cake. https://t.co/P6IzUcWk1R", "@paulivory1963 a promotion that's available in your area!", "@paulivory1963 Hi Paul, we unfortunately aren't able to offer this particular promotion in certain regions. We hope you stay tuned for -", "A new world awaits.\nPhoto: https://t.co/NwcvxyQmWG #ComeBackNew https://t.co/Z8F2y7JSuc", "Life is meant for spectacular adventures. https://t.co/LhRvknLlEQ", "Surrender to moments of relaxation. https://t.co/CRISTYuJor #ComeBackNew https://t.co/68JwkhjZP1", "Sometimes, living large means feeling small. https://t.co/LcFXAujqDU", "Log off. Breathe in. It's time for vacation. https://t.co/GN0szBuoXC", "Those who seek shall find. https://t.co/iygd5Y6gdX", "Go roam. #ComeBackNew https://t.co/0fhj16iYof", "Take a stroll with the seas. https://t.co/u9ZVinYCoP", "Feel the sun on your face and the sand in your toes. https://t.co/k3VACoGoLd", "Toss your worries in the wake. #ComeBackNew https://t.co/ogAwnVY60a", "Feel the sand of destinations unknown between your toes. https://t.co/2Z7gSO43uW https://t.co/Hy0JA0x88d", "Missed out on @ITV's The Cruise? Catch up with life onboard Royal Princess on ITV Player now. https://t.co/1LQjD2rVxD", "Take in a sunset from a world away. #ComeBackNew https://t.co/KM2U15dhJB", "@Lewis_Yeardley Thanks Lewis!", "@travelnotcomple don't worry Angie! There's plenty to do inside... how about one of our amazing live shows? Or a spot of afternoon tea?", "RT @sjwalkerPCL: Enjoy Movies Under The Stars....a true sense of romance onboard #TheCruise #RoyalPrincess https://t.co/FMoo746o5b", "@MrsClaireLouisa Our hero!", "@chrisbarnaville Thanks Chris! Us too!", "@travelnotcomple So are we!!!", "@TallPaul86 Amazing! What perfect timing!", "And so it begins! We're on the edge of our seats... #TheCruise https://t.co/FZuzqB5hP5", "@PellyTrolls Hi Pelly! We are always looking for ways to improve our guests' onboard experience. Check https://t.co/rn8UC8CWnq for updates!", "You have nothing to lose and a world to see. https://t.co/0gBdN8STIu", "@Momto23 @ITV #TheCruise is broadcast in the UK on https://t.co/WjeqLk4lt7.", "@Mischy67 Hi Michelle, #TheCruise is currently playing on https://t.co/WjeqLk4lt7 in the UK.", "Adventures that will make your friends green with envy. https://t.co/3gpdGSCsBV https://t.co/xMZSod4H1b", "The wait is over! Series 2 of @ITV's #TheCruise starts tonight at 8:30pm #RoyalPrincess https://t.co/4zcCAWfZAN", "@Linda_Oz64 Hi Linda, Ocean Medallion Sweepstakes is not open to our Guests in Australia. Keep checking back for contests in your area!", "New beginnings deserve new adventures. #ComeBackNew https://t.co/r73UbzMxok", "Life is better by the pool. RT if you agree! https://t.co/H4ytrV07Sy", "https://t.co/3ZbbN6wm6G", "Who would you like to be watching the sunset with today? https://t.co/hytzXiA7Cx", "@KaAcco3 have a wonderful time during our cruises &amp; wish you had a better experience.", "@KaAcco3 Hi Ka, we are truly sorry if you had an unsatisfactory experience on your recent cruise..  We definitely intend for all guests to -", "@saintlybelieve Hi Emily, unfortunately, this is not something we can assist you with.", "@Aharakati Tel:  971 4 2999223\nFax:  971 4 2999227\nEmail:  sales@princesscruises.ae\nHappy cruising!", "@Aharakati You can contact:\nCruise Master LLC\nSuite 408, Golden Business Center\n129-228 Port Saeed, Airport Road\nDubai POB 122028\nUAE", "@ChicLuxuries Hi Barbara, thank you for your kind words. The safety of our Princess community and guests is our top priority.", "@cdysinger73 Hi Chris, are deeply sorry to learn of your delayed bag. We've shared your concerns with our shipboard team.", "@cdysinger73 Hi Chris, we apologize for the delay and hope to exceed your expectations on the remainder of your voyage.", "@gizmostripeycat Hi Vanessa! Yes we do. You can find our voyages here: https://t.co/8I400OPn02. Happy cruising!", "@FiesaHenstock Hi Fiesa, #CrownPrincess had a medical disembarkation, then right tidal conditions. She is currently en-route to #CapeHorn", "Take a sip with the sea. https://t.co/MpgZdmhic1", "@allanstewart75 Hi Allan, #oceanmedallion will be across our entire fleet in the next several years.", "Stay for an extra chapter. https://t.co/CRISTYuJor #ComeBackNew https://t.co/N75m339ibL", "@LARRYEDWARDCAL4 That is not a Princess owned or managed property. Happy cruising!", "2. The number of speciality dining restaurants onboard the star of @ITV's #TheCruise series 2, Royal Princess https://t.co/8lUR8oHuLH", "@RetireRuthEmBPZ You are welcome to contact us at communityfoundation@princesscruises.com.", "@CruzinParadise Hi Abigail n Brad! #oceanmedallion will be on #RegalPrincess in November. You can learn more here: https://t.co/cktpdHmgSf.", "@Tiorio1 We sail out of #PortEverglades. You can find our voyages here: https://t.co/lrlFiwz3Go. Happy cruising!", "@415RayRay If there are changes to the itinerary, we will notify our guests/travel partners. The Captain will adv guests of sea conditions.", "@JustinLaurenXO Hi Justin! Thanks for sharing with us. Looks like you had a great time!", "Discover where the mountains meet the sea. \nPhoto by @shazz72 https://t.co/HguhozXSkt", "@LloydZide appreciate your patience and look forward to addressing your concerns.", "@LloydZide Hi Lloyd, we apologize for your frustration. Customer Relations received your email &amp; will be contacting you shortly. We -", "@arjan_v_d_haar Hi Arjan, thank you for your feedback.", "@imcarolyn We are deeply sorry to lean of this incident. Please send us your booking number via DM.", "@Kgov81 Hi Govani, #CrownPrincess was delayed due to medical disembarkation &amp; tidal conditions. She is now at anchor off #Mondevideo", "Another day in paradise. https://t.co/nBc6uwZFFs https://t.co/8Kz8J249XF", "The smaller you feel, the greater your perspective. #ComeBackNew https://t.co/hqWGiwg9NM", "@OfLeonore Hi Leonore, we invite you to learn more about our response and corrective actions here: https://t.co/NSBof9wTBf.", "@CwHumanEcology We are very sorry that this incident took place and invite you to read our response here: https://t.co/NSBof9wTBf.", "@mreverton2015 When calling on Liverpool, we berth at Liverpool City Cruise Terminal.", "@ZRistevski Hi Zoran, #oceanmedallion is technology that will eventually be on all of our vessels. It is not country specific for guests.", "@jezza_flegg Hi Jerry, you can find those voyages in our Hawaii, Mexico &amp; California Coast Mini Brochure 2017-2018 brochure.", "Rise. Shine. Dine. Repeat. https://t.co/EEaaqKY7uj https://t.co/EVQA1TIUkC", "It's bad manners to keep a vacation waiting. https://t.co/eoEl7DLKjf", "Witness wonders.\nPhoto by @dayoung.cha https://t.co/2PijJBgFG3", "Chase new coasts. https://t.co/tfPE7WFtQs", "A deck fit for a princess. https://t.co/bSP1T4ZvIh", "Time for a siesta. #ComeBackNew https://t.co/X2RsKsST3m", "Surround yourself with grandeur. https://t.co/f4YIqb5NAd https://t.co/IGNdYUnjKZ", "RT if you're imagining yourself here. #ComeBackNew https://t.co/bpC8ssg8ik", "@Cecil4allofus We invite you to read our response here: https://t.co/NSBof9wTBf.", "@gconklin93 Hi Camille, you can learn more about #oceanmedallion here: https://t.co/cktpdHmgSf. Happy cruising!", "@VoyagingCouple Hi, how can we assist you?", "@JPW31 Hi Jack, you can find our vessel phone numbers here: https://t.co/beykqfhJjC.", "@kirkscubatweets Hi Kathy, we invite you to read our response here: https://t.co/QQZppz001X.", "@tapeek Hi Kevin, another update: the departure time for Caribbean Princess has been pushed back to 9 PM.", "@DannyVinDiaz Hi Danny, the departure time for Caribbean Princess has been pushed back to 9 PM.", "@tapeek Hi Kevin, Caribbean Princess will now depart at 6:30 PM tonight.", "@DannyVinDiaz Hi Danny, Caribbean Princess will now depart at 6:30 PM tonight.", "@thumbtacklist Hi Sally! We can't wait for you to experience #oceanmedallion", "Ready for a new adventure? https://t.co/ugGo40urD6", "@vany457 definitely intend for all guests to have a wonderful time during our cruises &amp; wish you had a better experience.", "@vany457 Hi Vanessa, we are truly sorry to learn of your disappointing experience from your recent cruise onboard #DiamondPrincess We -", "@_amandamckenzie Hi Amanda, you can find Ruby benefits here: https://t.co/kfNnKnjHsS. We hope to see you onboard in the near future!", "We're bubbling with excitement for the weekend! https://t.co/EEaaqKY7uj https://t.co/nADE8gbpAj", "\"Surely, of all the wonders of the world, the horizon is the greatest.\"\n- Freya Stark #ComeBackNew https://t.co/NBPJRFqJEq", "Feel at home in a place you've never been. #ComeBackNew https://t.co/dmXGqE1blP", "@itbeachaus That's Tracy Arm Fjord, Alaska!", "@newietraveller Hi Greg! We're excited for you to try the new #oceanmedallion experience!", "We're giving away an OCEAN Medallion Class cruise vacation! https://t.co/OnF4sSh99R", "@CAdams1984 Hi Corey! Yes, our brand new #oceanmedallion - you can learn about it here: https://t.co/cktpdHmgSf. Happy cruising!", "@johnrconley Hi John, we can't wait for you to experience #oceanmedallion", "We find our happiness where the sun shines. #ComeBackNew https://t.co/bADtOXEmvu", "@McAfeePhil Hi Phil, OCEAN Medallion will not be available for your sailing. It will be onboard Caribbean Princess starting March 18, 2018.", "Introducing OCEAN, the next wave of vacation travel. https://t.co/PLGPBh2eth", "Always seek new adventures. https://t.co/eow2W6jlIl", "@ruthsrock Hi Ruth, we apologize for the delay in boarding. We hope to exceed your expectations on the remainder of your voyage.", "@jonesy153 Hi Lynn, please send us that number so we can locate your profile.", "@hustleTillman Carnival Cruise Line is a sister brand to Princess under the Carnival Corporation umbrella.", "@Kent808Duck Hi Kent, please call us at 1-800-Princess to inquire about payment. Happy cruising!", "@AnArtfulPenguin Hi Steve, our #Alaska cruises go May-Sep round trip #SFO. You can find information here: https://t.co/lrlFiwz3Go.", "@ccwerl We apologize for your frustration! Please contact us at 1-800-Princess for assistance.", "@atmphillips Hi Andrew, we deeply apologize for this incident. We will pass along your feedback to our shipboard team.", "@FrozenEcho76 Hi Carol, we sincerely for your frustration. Please contact us at 0843 374 4444 for assistance.", "@tophersterling Congratulations!", "@jezza_flegg Hi Jerry, you can find our 2017/2018 brochures here: https://t.co/bh2zxjYntF. Happy cruising!", "\"I haven't been everywhere, but it's on my list.\"\n- Susan Sontag #ComeBackNew https://t.co/G7Ia8GOy61", "@SabrinaTenney Hi Sabrina, you can find employment information here: https://t.co/dOtZnFOuig.", "@MarchingBeast onboard to discuss how they can improve your experience during the rest of your voyage.", "@MarchingBeast We sincerely apologize for your disappointment on your current voyage. We We hope that you stop buy the Guest Services Desk -", "@amystrattonn Hi Amy, we apologize for the delay this weekend and hope to exceed your expectations on the remainder of your voyage.", "@keeleymum Hi Vicky, Princess and P&amp;O recognize loyalty tiers/status between brands. Happy cruising!", "@srankin8 Hi Stacey, we were able to locate your booking and see that you are working with one of our CVPs. We will have her contact you.", "@klw370 Hi Kristina, we apologize for your frustration. Please advise past sail date and ship via DM so we can locate you in our system.", "@Ladewig Hi Scott, we apologize for the technical difficulties. The link is working now: https://t.co/wpvW0vvbez. Happy cruising!", "Marvel at mountain views. https://t.co/DOJI4Zb0Dc #ComeBackNew https://t.co/7baPH140yt", "@Catthetrainer Hi Catherine, we apologize for your frustration. Contact us at 1-800 -Princess. One of our team members will assist you.", "@allen3rd Hi Allen, we truly apologize for noise disturbance during your current voyage. We've shared your concerns with our shipboard team.", "@philacus Hi Phil, we truly apologize for your frustration. Were you able to speak to one of our team members?", "@carbear805 Hi Carrie, we apologize for your frustration. Please follow us &amp; provide the ship, sail date and briefly describe issue via DM.", "We're told to live large. But what if we dared to feel small? #ComeBackNew https://t.co/gpWYEjzbJ4", "@jonesy153 Hi Lynn, we apologize for your frustration. Can you please DM your Captain's Circle Number?", "@LloydZide concerns.", "@LloydZide Hi Lloyd, we apologize for your frustration. Contact us at cusomerrelations@princesscruises.com so we can address your", "@jennnnabear Hi Jenna, the Princess@sea messenger is now located through your browser. Learn more here: https://t.co/na2U0vIG7l. HNY!", "Watching #CelebApprentice?\n\nVote for your favorite at https://t.co/JNpV3chLmY for a chance to win a cruise a year for life!", "New beginnings deserve new adventures. #ComeBackNew https://t.co/lVbK4FeEUX", "We wish you a world of wonder and a sea of possibilities this year. #ComeBackNew https://t.co/Abu4bZDdFq", "We're reflecting on a year of great adventures in grand destinations. \n\nTell us: what was your favorite travel memory in 2016?", "@Swedeinbarca Happy New Year, Malins!", "You have nothing to lose and a world to see. #ComeBackNew https://t.co/uV9QHCbz9i", "@ethel_glover See you in February, Ethel!", "Log off. \nBreathe in. \nIt's time for vacation. #ComeBackNew https://t.co/6MUpzvOkgF", "@GingWrites Cheers, Ginger!", "We'll save you a seat. https://t.co/7Y2W05mlNt", "@WVUmac Mmm... you're making us hungry!", "The weekend is knocking on our door. #ComeBackNew https://t.co/hE5pqF6wbx", "Those who seek shall find. https://t.co/BrpuR0divr #ComeBackNew https://t.co/0vPgo7s3U8", "\"Paradise isn't a place. It's a feeling.\" \n- L. Boyer https://t.co/i357DGGfqV", "Carefully crafted. Divinely delicious. https://t.co/BDnjhmPjZP https://t.co/vaDYfeO6M7", "@seasidecitrus Hi Katie, voyage A636 was adjusted to eight days.", "@seasidecitrus Hi Katie, if any delays we will notify you or your TA if applicable. We look forward to welcoming you onboard #GrandPrincess", "@415RayRay Yes, you can, as long as it is stored in your stateroom. Happy cruising!", "@ChrisCaggs Hi Chris, you should receive the survey in 24-48 hours from Customerrelations@princesscruises.com.", "@GerowKristine Hi Kristine, You can find our voyage information here: https://t.co/lrlFiwz3Go. Happy cruising!", "@TimHudgins1 Hi Timothy, for further assistance, please contact us at 1-800-Princess. One of our team members will be happy to assist you.", "@curlyice12 Hi Laura, we sincerely apologize for your disappointment. Can you please send us your booking number via DM?", "Become a sea seeker. #ComeBackNew https://t.co/JeGm41pcEr", "@vonne621 during the rest of your voyage.", "@vonne621 inclement weather. We hope you connect with the Guest Services Desk onboard to discuss how they can improve your experience-", "@vonne621 Hi Yvonne, we understand the disappointment of missing a port, &amp; we regret the necessary decision to miss ports due to-", "@avi1215 for each guest. We wish you and your family a speedy recovery.", "@avi1215 We are truly sorry to learn of your health circumstance. When visiting our onboard medical center, we charge for visits/treatments-", "We like our Mondays with a side of margaritas. https://t.co/288hcoCJS3 https://t.co/iQL9X3JFur", "Fill your life with adventure. #ComeBackNew https://t.co/7AS07S3jtD", "Merry Christmas to all, and to all a good night. https://t.co/39Syioa7tX", "Near and far, we wish you a very merry Christmas. https://t.co/qLkFTLA28b", "@CruiseTipsTV Merry Christmas! We bet those cookies taste as good as they look.", "@ethel_glover Merry Christmas, Ethel!", "Our kind of sleigh ride. https://t.co/bDYDundmAH https://t.co/8kGLjsI909", "Seashells and jingle bells. Merry Christmas Eve! https://t.co/DTtgUtJol3", "End every day beautifully. #ComeBackNew https://t.co/dJqjrOPlVx", "@TimHudgins1 Hi Timothy! You can find our deals here: https://t.co/i1dyZXaJO5. Happy cruising!", "@jdogcisco Hi Justin, we see that #GrandPrincess is en-route to #CaboSanLucas We wish you Bon Voyage!", "@colleen1216 Hi Colleen, we invite you to learn more about our response and corrective actions here: http://bit.ly2hZgtFQ.", "Live every hour like it's happy hour. https://t.co/mW5RSiJOnv https://t.co/O3s9YqbOK5", "@BabyBoomerWritr We invite you to learn more about our response and corrective actions here: http://bit.ly2hZgtFQ.", "@Betty9121 Hi Betty, we invite you to learn more about our response and corrective actions here: http://bit.ly2hZgtFQ.", "@dennisjansen Hi Dennis, we invite you to learn more about our response and corrective actions here: http://bit.ly2hZgtFQ.", "@joey_travel We invite you to learn more about our response and corrective actions here: http://bit.ly2hZgtFQ.", "@magtell Hi Maggie, we invite you to learn more about our response and corrective actions here: http://bit.ly2hZgtFQ.", "@zjrosenberg Hi Zach, your email has been removed from our email marketing.", "@NasimMirdamad Hi Nasim, we invite you to learn more about our response and corrective actions here: http://bit.ly2hZgtFQ.", "@WinterlyHome We invite you to learn more about our response and corrective actions here: http://bit.ly2hZgtFQ.", "@BrickellJames Hi James, we invite you to learn more about our response and corrective actions here: http://bit.ly2hZgtFQ.", "@Neglah Hi Neglah, we invite you to learn more about our response and corrective actions here: http://bit.ly2hZgtFQ.", "@michell96453343 We invite you to learn more about our response and corrective actions here: http://bit.ly2hZgtFQ.", "@PennySadler Hi Penny, we invite you to learn more about our response and corrective actions here: http://bit.ly2hZgtFQ.", "@IvoryElIaCEO We invite you to learn more about our response and corrective actions here: http://bit.ly2hZgtFQ", "@SJCParkbench We invite you to learn more about our response and corrective actions here: http://bit.ly2hZgtFQ.", "@PacificCouncil We invite you to learn more about our response and corrective actions here: http://bit.ly2hZgtFQ", "\"I haven't been everywhere, but it's on my list.\" - Susan Sontag \n#ComeBackNew https://t.co/T2hODBN7fV", "@Crockdog1 Hi John, we sincerely apologize for your continued frustration and wish you had a better experience.", "@drazin Hi Matt, we sincerely apologize for your frustration. Can you please confirm your email via DM?", "RT if you're imagining yourself here today. #ComeBackNew https://t.co/x3UsvngKl3", "@CalkinMatthew Hi Matthew! We no longer own/operate #OceanPrincess You can find our current  ships here: https://t.co/2kFJa0zPCg.", "@marisieau Hi Marisie, you can contact us at 13 24 88 / 1300 551 853. Happy cruising!", "@johnnywaiver Hi Johnny, we are truly sorry to hear this! Please DM us your booking number and briefly advise the issue.", "But first, coffee. https://t.co/ABITHS41aU", "@m52go Hi Steve, we were able to locate your record and pass long your request.", "@RayWilliams15 Hi Ray, we are truly sorry for your wait. We you able to speak to one of our team members?", "@pulsedial Hi Greg, we sincerely apologize for the transfer delay and hope to exceed your expectations on your voyage.", "@Russ16507 Hi Mark, the shipboard team onboard #SunPrincess will plan accordingly. We look forward to welcoming you onboard!", "@zjrosenberg Hi Zach, we truly apologize for your frustration. We will pass your comments along to the appropriate department.", "@mpober Hi Maria! Yes, all of our staterooms have hair dryers. We look forward to welcoming you onboard #RegalPrincess", "@manorquay onboard #CoralPrincess", "@manorquay check in and printing e-boarding passes. Contact your Travel Agent if further questions. We look forward to welcoming you -", "@manorquay summary/cruise boarding passes/flight summary from your Cruise Personalizer. Go directly to the carrier's website for -", "@manorquay Hi Craig, we were able to locate your booking, &amp; see that you are working with a travel agency. Print out your cruise -", "Time for a siesta. #ComeBackNew https://t.co/mVWPmAPcrC", "@mrgrumpy1956 Hi Brian! That's Cabo San Lucas. Happy cruising!", "It's #TravelTuesday! What's next on your bucket list? https://t.co/I0ubtCDJDJ https://t.co/UdypZbyLww", "@MCityzen1 Merry Christmas, Brian! Happy cruising!", "@Migcortina Hi Miguel! #PrincessCays - 83, #STT 77, #SJU 81, #AmberCover 81/71. See you soon!", "@ebencott We truly apologize for your frustration. Follow us, then send us your email/name/address via DM to locate you in our system.", "@nida_neuron We truly apologize for your frustration. Please follow us then send your name/email/address so we can find you in our system.", "@cruisetotravel Hi Rick, please follow us, &amp; send your full name &amp; address via DM. We will look into seeing if your holiday card went out.", "@m52go Hi Steve, we sincerely apologize for your frustration. We have forward your request to the appropriate department for removal.", "@GlutenFreeAdv Hi Alexis, please follow us, then DM your email address.", "Now this is how you do a Monday. https://t.co/QuQwhjLwNW #ComeBackNew https://t.co/sTrZNSBJ43", "@spammermc Hi Samantha, we see that you spoke with our en-route department &amp; arrived into #NS today Welcome onboard #RegalPrincess", "@sheryldarbins Hi Sheryl! Where are you thinking of sailing with us?", "Coffee with a side of sunrise, please. #ComeBackNew https://t.co/UehoCv89ok", "Settle in at The Sanctuary. https://t.co/PbMUODeffY https://t.co/YWALDoWoP3", "A toast to you. #ComeBackNew https://t.co/MTlVuxU2A4", "Life is meant for spectacular adventures. https://t.co/xpn1KplAdE", "Vote for Princess Cruises in the @10Best Readers' Choice Awards! https://t.co/zXThJPVvbP", "Sometimes it's not just about where you're going, but how you're getting there. https://t.co/vxuNhAx0s4", "Wake up on the right side of the bed. https://t.co/71NrfHNRNT", "Sun and sea are all we need. #ComeBackNew https://t.co/R5BjN937BK", "@melodytravels Hi Melody, we invite you to learn more about our response and corrective actions here: https://t.co/EGqUJX9vgA.", "@antoniodivine Hi Antonio, we invite you to learn more about our response and corrective actions here: https://t.co/EGqUJX9vgA.", "@Pitbullpearl We invite you to learn more about our response and corrective actions here: https://t.co/EGqUJX9vgA.", "@Caroli_neScott Hi Chloe, we invite you to learn more about our response and corrective actions here: https://t.co/EGqUJX9vgA.", "@Syreena2 We invite you to learn more about our response and corrective actions here: https://t.co/EGqUJX9vgA.", "@evan_fieger Hi Evan, we invite you to learn more about our response and corrective actions here: https://t.co/EGqUJX9vgA.", "@ALizziehow33 Hi Elizabeth, we invite you to learn more about our response and corrective actions here: https://t.co/EGqUJX9vgA.", "@southcoastnav Hi Paul, we invite you to learn more about our response and corrective actions here: https://t.co/EGqUJX9vgA.", "@thefreakywave We invite you to learn more about our response and corrective actions here: https://t.co/EGqUJX9vgA.", "@AngelRTalk Hi Angel, please follow us to DM your entire email. We show 490 people in our system with your name. :)", "@EOB100 Hi Elaine! We're excited too! We look forward to bringing you #TheCruise", "@mwats05 Hi Matt, we truly apologize for your frustration. Can you please provide your email address so we can locate you on our system?", "@AngelRTalk Hi Angel, we truly apologize for your frustration. Can you please advise us of your email so we can locate you on our system?", "@GlutenFreeAdv Hi Alexis, we sincerely apologize for your frustration. Please advise us of your email, to help locate you in our system.", "@danimeen Hi Danielle! We're glad you're excited for #TheCruise Happy sailing!", "@pwellman1209 Hi Pete! We're excited you are looking forward to #TheCruise", "@CleanDropMobile we invite you to learn more about our response and corrective actions here: https://t.co/EGqUJX9vgA.", "@Private_Lab we invite you to learn more about our response and corrective actions here: https://t.co/EGqUJX9vgA.", "Explore. Eat. Sleep. Repeat. https://t.co/g0MxjZaxig", "@1chefdiva Hi Christine, we invite you to learn more about our response and corrective actions here: https://t.co/EGqUJX9vgA.", "@MIRICA1955 We invite you to learn more about our response and corrective actions here: https://t.co/EGqUJX9vgA.", "@Niello_ @cfo We invite you to learn more about our response and corrective actions here: https://t.co/EGqUJX9vgA.", "@DianeMinerNYC We invite you to learn more about our response and corrective actions here: https://t.co/EGqUJX9vgA.", "@Mr_Spock @zesty_nature We invite you to learn more about our response and corrective actions here: https://t.co/EGqUJX9vgA.", "@Eloy2161 Hi Elroy, we invite you to learn more about our response and corrective actions here: https://t.co/EGqUJX9vgA.", "@jadewalker Hi Jade, we invite you to learn more about our response and corrective actions here: https://t.co/EGqUJX9vgA.", "@ntrsfrml We invite you to learn more about our response and corrective actions here: https://t.co/EGqUJX9vgA.", "@AlexDavidRogers Hi Alex, you can learn about Planet Princess here: https://t.co/2Y8wHMSKLM.", "Let your sweet tooth do the talking. https://t.co/Yzuk8hdFUc https://t.co/q9u1FJK3tS", "@Ecoartproject We invite you to learn more about our response and corrective actions here: https://t.co/EGqUJX9vgA.", "Every sunrise beckons new beginnings. https://t.co/SAEjPBfF54", "Views like this are all the inspiration we need. https://t.co/De3a9FECpO https://t.co/KQ4vvoE8rQ", "@AlexDavidRogers Hi Alex, we invite you to learn more about our response and corrective actions here: https://t.co/EGqUJX9vgA.", "@cathygreen We invite you to learn more about our response and corrective actions here: https://t.co/EGqUJX9vgA.", "@ShanishaYSmith @EnergyLaw360 We invite you to learn more about our response and corrective actions here: https://t.co/EGqUJX9vgA.", "@UberSalesDude We invite you to learn more about our response and corrective actions here: https://t.co/EGqUJX9vgA.", "@christelle59830 We invite you to learn more about our response and corrective actions here: https://t.co/EGqUJX9vgA.", "@Gaur_Anil @LonnieShekhtman We invite you to learn more about our response and corrective actions here: https://t.co/EGqUJX9vgA.", "@NormSeavey @foe_us We invite you to learn more about our response and corrective actions here: https://t.co/EGqUJX9vgA.", "Live for the moments you can't put into words. #ComeBackNew https://t.co/SXHoDMwI5d", "@scotts_cruises Hi Scott, we're so glad you had such a great time. We look forward to seeing you in 2017!", "@imaginemystrobe Hi Plamen, our approved international recruiting partners can be found here: https://t.co/ir5haZdTgD.", "Chase new coasts. https://t.co/2mLIT2K2O1", "@PressGabe Our cruise fares are per person. You can find info here: https://t.co/8I400OPn02  or contact us @ 1-800-Princess. Happy cruising!", "@deannehansen Hi Deanne, we can't wait to help you #comebacknew", "@scotts_cruises Hi Scott! Thanks for sharing your cruise adventures with us! #comebacknew", "@PPMConsultants we invite you to learn more about our response and corrective actions here: https://t.co/EGqUJX9vgA.", "@BLUEEYES6612 Hi Donna, We invite you to learn more about our response and corrective actions here: https://t.co/EGqUJX9vgA.", "@johnrayt1207 Hi John, Our approved international recruiting partners can be found here: https://t.co/ir5haZdTgD.", "@JohnSwinton Hi John! To purchase Lotus Spa products, please visit https://t.co/bYJjd8tSSK or contact Steiner Leisure at 800-423-5293.", "@MikeTilleyUGA Hi Mike, we apologize for the delay this weekend and hope to exceed your expectations on the remainder of your voyage.", "Soar over destinations unknown. https://t.co/KxX9ebi7QY https://t.co/lqfQeIm90H", "Get your day off to a bubbly start. https://t.co/IxW9GdhBWw", "@MJB_SF onboard. We look forward to welcoming you onbard #GrandPrincess", "@MJB_SF Hi Melinda, we sincerely apologize for your frustration. Shore excursion information for the revised itinerary will be provided -", "@CathyHDecarolis our team members will contact you soon to address your concerns.", "@CathyHDecarolis Hi Cathy, we were able to locate your booking &amp; see our Customer Relations Dept. has received your correspondence. One of -", "@CathyHDecarolis Hi Cathy, we truly apologize for your disappointment with your recent cruise. Can you please adv us your ship/sail date?", "@JuiceKanon Thanks for your interest in joining our team! For employment information please visit: https://t.co/LmpNp6G38F.", "We dream in colors borrowed from the sea. #ComeBackNew https://t.co/vf9HAVZNaM", "'Tis the season to sparkle. https://t.co/A6WZgsus7H", "There's always an excuse for champagne. https://t.co/ZQeP9pXHpx", "A treat for all of your senses. https://t.co/tQgm1i0g2s", "\"Life is a journey, not a destination.\" \n- Ralph Waldo Emerson https://t.co/Zmhj2SwgO5", "Experience sun soaked adventures. https://t.co/KSFppPfL4S", "All is calm, all is bright. #ComeBackNew https://t.co/jWc0exwKi5", "Happy hours are best enjoyed at sea. https://t.co/t5m8hpIYwg https://t.co/sO4ScCu4Py", "@LagunaNiguelPB We invite you to learn more about our response and corrective actions here: https://t.co/EGqUJX9vgA.", "@EdsoRealtyGroup We invite you to learn more about our response and corrective actions here: https://t.co/EGqUJX9vgA.", "@JohnBar92936624 We're glad that you had a great time!", "@gsarvas Hi Greg, we truly apologize for your frustration. We see that Jennifer spoke to one of our team members adv of drivers location.", "@Marix82 Hi Marica, our sincerest apologies for the misspelling of your name. We wish you happy holidays!", "@mmqc52 Hi Mary, we have passed your comments along to our Customer Relations Department. One of our team members will contact you.", "@stevensteph2000 Hi Stephen! Please enter here: https://t.co/RzFYnVCTC9. Good luck!", "@Sarah_L_Jackson Hi Sarah, we invite you to learn more about our response and corrective actions here: https://t.co/EGqUJX9vgA.", "@sam4ur Hi Salim, our approved international recruiting partners can be found here: https://t.co/ir5haZdTgD.", "@Royalory We invite you to learn more about our response and corrective actions here: https://t.co/EGqUJX9vgA.", "@SJCParkbench We invite you to learn more about our response and corrective actions here: https://t.co/EGqUJX9vgA.", "@midislandnews We invite you to learn more about our response and corrective actions here: https://t.co/EGqUJX9vgA.", "@ArizonaNotebook Hi Mike, we invite you to learn more about our response and corrective actions here: https://t.co/EGqUJX9vgA.", "@dailynews537 We invite you to learn more about our response and corrective actions here: https://t.co/EGqUJX9vgA.", "@GraceDelivers Hi Kristin, we invite you to learn more about our response and corrective actions here: https://t.co/EGqUJX9vgA.", "@JBNAVictoria We invite you to learn more about our response and corrective actions here: https://t.co/EGqUJX9vgA.", "@_CruiseNews We invite you to learn more about our response and corrective actions here: https://t.co/EGqUJX9vgA.", "@Nvr2Old2Travel Hi Gary, we invite you to learn more about our response and corrective actions here: https://t.co/EGqUJX9vgA.", "@b600003592 We invite you to learn more about our response and corrective actions here: https://t.co/EGqUJX9vgA.", "@FrancoisFNE @CristinaBarreau We invite you to learn more about our response and corrective actions here: https://t.co/EGqUJX9vgA.", "@AntiRacismTv We invite you to learn more about our response and corrective actions here: https://t.co/EGqUJX9vgA.", "@JustinLaurenXO Hi Justin, thank you for choosing Princess!", "@Hirecars_co_uk We invite you to learn more about our response and corrective actions here: https://t.co/EGqUJX9vgA.", "@Swatimeshram16 We invite you to learn more about our response and corrective actions here: https://t.co/EGqUJX9vgA.", "@LittleBearLodge We invite you to learn more about our response and corrective actions here: https://t.co/EGqUJX9vgA.", "@Petalsandherbs We invite you to learn more about our response and corrective actions here: https://t.co/EGqUJX9vgA.", "@KarstenMoran Hi Karsten, we invite you to learn more about our response and corrective actions here: https://t.co/EGqUJX9vgA.", "@DownrightNat Hi Kirby, we invite you to learn more about our response and corrective actions here: https://t.co/EGqUJX9vgA.", "@OrganicLife We invite you to learn more about our response and corrective actions here: https://t.co/EGqUJX9vgA.", "@PeterSGreenberg Hi Peter, we invite you to learn more about our response and corrective actions here: https://t.co/EGqUJX9vgA.", "@bojanmilojevic5 Hi Bojan, #GrandPrincess is en-route to #Portland for her scheduled dry dock.", "@EtomeSmith Hi Dee Dee, we invite you to learn more about our response and corrective actions here: https://t.co/EGqUJX9vgA.", "@davisesq212 https://t.co/EGqUJX9vgA. (3/3)", "@davisesq212 onboard again soon. We'd like to share our response as well as details on the corrective actions we've taken: (2/3)", "@davisesq212 Hi Dave, we're grateful for your loyalty to Princess over the years, &amp; we hope to have the opportunity to welcome you (1/3)", "@Antonina_russ Hi Antonia, we have forwarded your request to our Customer Relations Department. One of our team members will contact you.", "@magparadis Princess. One of our team members will be happy to assist you.", "@magparadis Hi Marguerite, we sincerely apologize for your frustration. Please contact us at captainscircle@princesscruises.com or 1-800-", "It's #NationalPastryDay! Hope your day is extra sweet. https://t.co/pB6uf8UbY7", "Every photo tells a story. https://t.co/p1yfIyBbfq", "Let curiosity lead the way. https://t.co/QRPxemWqAZ", "@klugesan Hi John, we invite you to learn more about our response and corrective actions here: https://t.co/EGqUJX9vgA.", "@Monica26Renee Hi Monica, we invite you to learn more about our response and corrective actions here: https://t.co/EGqUJX9vgA.", "@mmqc52 Hi Mary, please us send your booking number or Captain's Circle number via DM.", "@angela_js Hi Angela! Thank you for the kudos about our shipboard team. We're thrilled that you had a great time!", "Answer the call of the sea. https://t.co/G5jHeL8P2O #ComeBackNew https://t.co/ljaE5AkIk1", "We're ready for a Royal adventure. https://t.co/NDfxfkla52", "Today's moments become tomorrow's precious memories. https://t.co/giU0sqGhgG", "@LouBeeby Hi Lou, #GrandPrincess is enroute to #Portland, OR. You can follow the ship here: https://t.co/2kFJa0zPCg.", "@IAmWitWitWoo Hi Kate, thank you for sharing with us!", "When in doubt, vacation. #ComeBackNew https://t.co/IOgyNXCpJQ", "@Marix82 Hi Marcia, we invite you to learn more about our response and corrective actions here: https://t.co/EGqUJX9vgA.", "@Sparkles_Blog Hi Hayley! Thanks for sharing with us. Happy cruising!", "@ElenaRCrete Hi Elena, we invite you to learn more about our response and corrective actions here: https://t.co/EGqUJX9vgA.", "@Sketch9999 Hi Tara, we invite you to learn more about our response and corrective actions here: https://t.co/EGqUJX9vgA.", "@Hugh_De_Mann Congratulations on earning the Platinum loyalty tier!", "Sink your paws into new adventures. https://t.co/Wi7CcyKvqY https://t.co/3FZZZ6TqSO", "@Wilsonwanders We look forward to welcoming you onboard!", "@OMtheMoment Hi Michelle, we invite you to read our response and corrective actions here: https://t.co/EGqUJX9vgA.", "@NYCTravelGal Hi Karen, we invite you to read our response and corrective actions here: https://t.co/EGqUJX9vgA.", "Make memories all over the world. https://t.co/JKkZdB3V4O", "@CruiseNavyFL Hi Captain Mark, we invite you to read our response and corrective actions here: https://t.co/EGqUJX9vgA.", "Take a walk on the wild side. https://t.co/Mo7KcS1ARx", "@V3RSPE10 Hi Brad, all senior officers involved have been fired.", "@beckyonisland to setting a high standard for environmental excellence and responsibility. \n(4/4)", "@beckyonisland protect and preserve the oceans. With the steps we have and will continue to take to improve our compliance we commit (3/4)", "@beckyonisland environmental law. We want our guests to know that we are using this experience to further improve operations to (2/4)", "@beckyonisland Hi Becky, Princess cares deeply about the oceans &amp; marine environment. We are very sorry for this violation of (1/4)", "@S22Syd We invite you to read our response and corrective actions here: https://t.co/EGqUJX9vgA.", "@Doc_Pow for environmental excellence and responsibility. We invite you to learn more by visiting, https://t.co/EGqUJX9vgA. (4/4)", "@Doc_Pow oceans. With the steps we have and will continue to take to improve our compliance we commit to setting a high standard (3/4)", "@Doc_Pow We want our guests to know that we are using this experience to further improve operations to protect and preserve the (2/4)", "@Doc_Pow Princess cares deeply about the oceans &amp; marine environment. We are very sorry for this violation of environmental law. (1/4)", "@ptxdhuske Hi Gabi! We apologize for the delay. Check in started at 1:00PM. Welcome aboard #IslandPrincess", "@Broadwayescapee Thank you! We're glad our shipboard team provided you with excellent service!", "@karung99 Welcome aboard!", "@Jason_Wright Hi Jason! Happy 4 year wedding anniversary to you and Kayley. We wish you a life time of wedded bliss!", "@swamiphoto Hi Swami, we truly apologize for your frustration! You can contact us at 1-800-Princess. One of team members will assist you.", "@usta_2515 your concerns.", "@usta_2515 You can contact our Customer Relations Department (customerrelations@princesscruises.com) so one of our team members can address-", "@MalibuEric1 for environmental excellence and responsibility. (4/4)", "@MalibuEric1 oceans. With the steps we have and will continue to take to improve our compliance we commit to setting a high standard (3/4)", "@MalibuEric1 We want our guests to know that we are using this experience to further improve operations to protect and preserve the (2/4)", "@MalibuEric1 Princess cares deeply about the oceans &amp; marine environment. We are very sorry for this violation of  environmental law.(1/4)", "@audreyhirschl Hi Audrey! Thank you for sharing with us. We are glad that you had a great time!", "@11_aside to setting a high standard for environmental excellence and responsibility. (4/4)", "@11_aside and preserve the oceans. With the steps we have and will continue to take to improve our compliance we commit (3/4)", "@11_aside environmental law. We want our guests to know that we are using this experience to further improve operations to protect (2/ 4)", "@11_aside Hi, Tammy. Princess cares deeply about the oceans and marine environment. We are very sorry for this violation of (1/4)", "@christerry the same amount of this cruise fare refund.  Princess Cruises will assume the costs to fly guests back to San Francisco.", "@christerry on Monday afternoon. All guests will receive a refund of 50% of their cruise fare and a future cruise credit equal to...", "@christerry and fly all guests back to San Francisco.  We very much regret this disruption. Grand Princess will arrive in Honolulu...", "@christerry The ship is now returning to Honolulu in order to initiate a repair.  This unfortunately requires us to end the cruise early...", "@christerry confirmed that the ship is safe and secure and he is communicating updates to guests on a regular basis.", "@christerry of the vessel, as a result of it opening, the hull sustained minor localized damage which has been secured. The Captain has...", "@christerry The platform sustained damage, such that it could not be closed. Although the platform is not part of the watertight integrity..", "@christerry Hi Chris, while at sea after departing from Maui, a tender platform on the starboard side of Grand Princess opened (cont.)", "@mayaashleyy Hi Maya, please DM us your email address and we'll send you a statement.", "@katiedistefano Grand Princess will arrive in Honolulu Monday afternoon.", "@katiedistefano to fly guests back to San Francisco including overnight accommodations and transfers as needed.", "@katiedistefano and a future cruise credit equal to the same amount of this cruise fare refund.  Princess Cruises will assume the costs...", "@katiedistefano in Honolulu on Monday, December 5 in the afternoon. All guests will receive a refund of 50% of their cruise fare...", "@katiedistefano early and fly all guests back to San Francisco.  We very much regret this disruption. Grand Princess will arrive...", "@katiedistefano The ship is now returning to Honolulu in order to initiate a repair.  This unfortunately requires us to end the cruise...", "@katiedistefano The Captain has confirmed that the ship is safe and secure and he is communicating updates to guests on a regular basis.", "@katiedistefano integrity of the vessel, as a result of it opening, the hull sustained minor localized damage which has been secured.", "@katiedistefano The platform sustained damage, such that it could not be closed. Although the platform is not part of the watertight...", "@katiedistefano Hi Katie, While at sea after departing from Maui, a tender platform on the starboard side of Grand Princess opened (cont.)", "@CruiseLaw Hi Jim, we'll share an update shortly via email.", "@IMAPRINCESSBlog Thank you for the birthday wishes! https://t.co/MWyTC8NtQh", "@bojanmilojevic5 on Monday, 12/5 (evening time TBD).  Further details on the itinerary impact will be communicated later today.", "@bojanmilojevic5 initiate a repair which will impact the current itinerary. Grand Princess is estimated to arrive in Honolulu...", "@bojanmilojevic5 The Captain has confirmed that the ship is safe and secure. The decision has been made to return to Honolulu in order to...", "@bojanmilojevic5 Hi Bojan, crew members discovered damage to a tender platform on the starboard side of the ship (cont.)", "@twuskip1 initiate a repair which will impact the current itinerary. Grand Princess is estimated to arrive in Honolulu on Monday, 12/5...", "@twuskip1 The Captain has confirmed that the ship is safe and secure. The decision has been made to return to Honolulu in order to...", "@twuskip1 Hi Skip, crew members aboard Grand Princess discovered damage to a tender platform on the starboard side of the ship. (cont.)", "@KaplanABC11 https://t.co/EGqUJX9vgA (2/3)", "@KaplanABC11 like to share our official response with you, including details on the corrective measures we have taken: (2/2)", "@KaplanABC11 Hi Jonah, we've appreciated your loyalty and look forward to the opportunity to welcome you aboard on January 8th. We'd (1/2)", "@kws_atlarge corrective actions we've taken: https://t.co/EGqUJX9vgA (2/2)", "@kws_atlarge We're grateful for your loyalty to Princess over the years. We'd like to share our response as well as details on the (1/2)", "@JMEdbrooke Absolutely! You can contact us at Customerrelations@princesscruises.com", "@butchroberts16 Hi Butch, please see our Passage Contract, number 7: https://t.co/t6maYaqArw.", "@MatthewSharfman Hi Matthew, information is available at https://t.co/EGqUJX9vgA.", "@SLCMKing Hi Matthew, details on the corrective actions we've taken are available here: https://t.co/EGqUJX9vgA", "@kelelse We recommend addressing your concerns with the Travel Agent or contacting us at  0843 374 4444.", "@kelelse Onboard credit is dependent upon the promotion attached to a booking, or gifted by someone to you. It is not auto extended.", "@kelelse Hi Kelly, please send us your booking number via DM.", "@penelopekill for environmental excellence and responsibility. 4/4", "@penelopekill With the steps we have and will continue to take to improve our compliance we commit to setting a high standard... 3/4", "@penelopekill We want our guests to know that we're using this experience to further improve operations to protect &amp; preserve the ocean. 2/4", "@penelopekill Princess cares deeply about the oceans &amp; marine environment. We are very sorry for this violation of environmental law. (1/4)", "@butchroberts16 Hi Butch, we are truly sorry for the change in itinerary, especially for such a long awaited trip.", "@ALMPLS Hi Al, we've appreciated your loyalty. We'd like to share our response, inc. corrective actions we've taken: https://t.co/EGqUJX9vgA", "@kelelse Hi Kelly, we sincerely apologize for your frustration. We charge per person, with a reduced fare for the 3rd/4th guest in cabin.", "@Davekosar2 Hi Dave, information is available at https://t.co/EGqUJX9vgA.", "@darrylzuk Hi Darryl, we can't wait either!", "@darrylzuk Hi Darryl, we've appreciated your loyalty. We'd like to share details of corrective measures we've taken: https://t.co/EGqUJX9vgA", "@bigredmatt Hi Matt, we sincerely apologize for your disappointment with our entertainment offerings. Can you DM us your ship and sail date?", "@gracefantle Could you kindly DM us your booking # and preferred phone number? We'll contact you tomorrow.", "@gracefantle Hi Grace, our response is available here: https://t.co/EGqUJX9vgA. Please let us know if we can have a rep reach out via phone.", "@SLCMKing U.S. and international laws, and all of the corrective measures we have taken were with that commitment in mind. (5/5)", "@SLCMKing to upgrade our equipment. We are fully committed to operating with maritime environmental practices that meet or exceed... (4/5)", "@SLCMKing We also increased the scope &amp; frequency of our ship visits, crew training, &amp; proactively invested millions of dollars... (3/5)", "@SLCMKing We completely restructured our entire fleet operations organization including new leadership.  (2/4)", "@SLCMKing In the past three years, we have taken a number of important actions to improve our oversight and compliance.  (1/4)", "@WeLoveFoodTweet Hi Saff and Ade, thank you for choosing Princess!", "@CruiseRuss Hi Nancy, we truly apologize for your disappointing experience with one of our team members. Please DM the booking number.", "@ChrisCaggs Hi Chis, we can't wait to help you #comebacknew", "@keladewig Hi Kristin, please see our video statement at https://t.co/XkiWzh5uZ7.", "@stocksjunky Information is available at https://t.co/EGqUJX9vgA.", "@tablefortwoblog Mmm... we'll take a serving of that any day.", "@BonVoyageurs Glorious photo!", "Congratulations to @CurtisStone on being named @EaterLA Chef of the Year! We're thrilled to feature his cuisine onboard at SHARE.", "Cruise along sun-kissed coastlines. #ComeBackNew https://t.co/gxxQaHLAt4", "Hold on tight. https://t.co/2G0E944hBp https://t.co/sCNMBr26FZ", "Stroll along pathways lined with palms. https://t.co/99RJtGxO8z", "Decadent. \n\nDreamy. \n\nDelicious. \nhttps://t.co/QB5oufq5qr https://t.co/l3UhHhTQMB", "@hil_walker Please try again.", "\"Travelers are dreamers who make their desires for adventure a reality.\" #ComeBackNew https://t.co/Z5EZr73Ouw", "@TXAggieChick Hi Lorrie, we sincerely apologize for your frustration. Were you able to speak to one of our team members?", "@vlbembry Hi Lisa, we apologize for your frustration. Can you please send us your booking number via DM?", "@kctrvl Hi Enrique, we apologize for the difficulty in contacting us. Were you able to speak to one of our team members?", "@deannehansen Hi Deanne, that's our beauty, #CaribbeanPrincess Happy sailing!", "Our favorite Tuesdays are spent on the water. https://t.co/AgdXwiJhS7", "@Broadwayescapee Welcome aboard!", "@DonnaDamato1 Hi Donna, we apologize for the delay this weekend and hope to exceed your expectations on the remainder of your voyage.", "@sandiemallan Hi Sandie, yes, Mariachi's are featured on our LA / west-coast based ships visiting Mexico. See you in December!", "@DefTaker We are having difficulty locating your booking number. Can you please send via DM?", "@sandiemallan Hi Sandie, we are looking into your question and will follow up once we can provide information.", "@birdiecanfly Hi Jill, Thanks for reaching out. Please send your booking number and questions via DM.", "@BlafDog necessary decision to miss ports due to unfavorable weather conditions.", "@BlafDog Hi Amy, we apologize for your frustrating cruise experience. We understand the disappointment of missing a port, &amp; we regret the -", "@iNitrox1 Happy Belated Birthday! :)", "@Arichmanfl Hi Al! #RubyPrincess was returning to CA. Happy cruising!", "Soak in moments at sea. https://t.co/KURElZbimU", "Discover the destinations of your dreams. https://t.co/OmY5mpdLLy https://t.co/cxFxM34Ypl", "@hil_walker Hi Elaine, we sincerely apologize for your frustration. Can you please send us your booking number via DM?", "@RGroblewski Hi Richard, contact our Customer Relations Department (Customerrelations@princesscruises.com) so we may address your concerns.", "Linger a little longer. #ComeBackNew https://t.co/eACEwGe7uD", "@BlafDog Hi Amy! Thank you for your kind words about wait staff member Srdjan. We love to impress our guests!", "@mleland8 Hi Michael, please have the guest contact AON Affinity at (877) 846-8833 for status  update.", "@truscom Hi Martin, we apologize for your frustration! Contact us at 0843 374 4444. One of our team members will be happy to assist you.", "Dreamworthy views from dawn to dusk. #ComeBackNew https://t.co/xFpTcHQMkr", "From cruise to kayak -- how will you discover your next destination? https://t.co/0qZrjPByZk https://t.co/NiCLCXVh0A", "Take a walk with the waves. https://t.co/WM77LwjaKP", "Never stop exploring. https://t.co/G1zxPK9Yfb", "Extend your weekend. #ComeBackNew https://t.co/CdAOVRFyeJ", "Always take the scenic route. https://t.co/hU1BQaCDwp", "Sailing through Saturday. https://t.co/y7LqbIMFJ0", "Enjoy a weekend off the grid. https://t.co/A4u1GBI8yo https://t.co/bWBHXvTPxU", "The best stories can be found between the pages of a passport. https://t.co/rDclk4dYhP", "Never lose your sense of wonder. #ComeBackNew https://t.co/v9rEpFAr3y", "Make a splash with those you love. https://t.co/NuXMomAjsx", "The best place to spend #BlackFriday. https://t.co/mOetsP3mrv", "Smooth seas, an ocean breeze, balcony views -- what are you most thankful for this Thanksgiving? https://t.co/42kNYAXN1M", "@shaan_dude_007 Correct! :)", "@JaysFan22 Hi Lee, that's correct! Happy cruising!", "@Arichmanfl You're correct, Al!", "@gconklin93 Hi Camille, you are correct!", "@iNitrox1 Correct! Happy cruising!", "@KojiFlowers Hi Koji! It's #CaboSanLucas in #Mexico You can find our cruise itineraries here: https://t.co/8I400OPn02. Happy cruising!", "@bmplett Hi Brandon, you are correct! Happy cruising!", "@So_Tweetie You can contact us at entertainment@Princesscruises.com.", "@chitownstarcon You can contact us at meda@princesscruises.com.", "@ThuisInUwWijk We do not have any vaccination requirements for this cruise. Happy sailing!", "Let the waves wash away your worries. #ComeBackNew https://t.co/LpyjWahct8", "Reflect on magnificent memories. https://t.co/OHIb3gjR7a", "Some call it the lido deck. We call it paradise. https://t.co/mPk1JEXLmV", "Dive deep into new adventures. https://t.co/z31VzBUdPY https://t.co/9tPotCjTsl", "@ChezChangnFaces Hi Frank! We are thrilled that you are enjoying #RubyPrincess sailing the Mexican Rivera! Happy Thanksgiving!", "@scotts_cruises Hi Scott, thanks for sharing!", "\"Surely, of all the wonders of the world, the horizon is the greatest.\" \n- Freya Stark #ComeBackNew https://t.co/q1D9Yvm7Me", "@barbputnam Hi Barbara! Thanks for reaching out. Find our latest promotions here: https://t.co/XlmPw2KV99. Happy cruising!", "@JWynk booking experience for our guests and travel partners. Happy cruising!", "@JWynk Hi Julie, we apologize for your frustration! We were making some enhancements to our EZ air tool to provide a better booking -", "@SandyCoughlinRE Hi Sandy, we love all of your smiles!", "@MStyxs Happy (belated) birthday Missy! We hope to see you onboard in the near future!", "@SallyEtheridge team members can address your concerns.", "@SallyEtheridge Hi Sally, please contact our Customer Relations Department (PCUK.CustomerRelations@princesscruises.co.uk) so one of our-", "Settle in. #ComeBackNew https://t.co/mt7G8z2i2w", "Let your eyes marvel. https://t.co/uYkxC1PWSw https://t.co/uFqFh1IrFr", "A new adventure around every corner. https://t.co/651sor5Rdj", "@BroomesFabian Hi Fabian, we sincerely apologize for your disappointment with our onboard activities. We strive to provide a wide range -", "@scotts_cruises Hi Scott, thanks for sharing with us!", "@Gladyswyer Please try again.", "RT if you wish you were spending your Monday mushing. https://t.co/I9JmQGada2", "@NewViolet22 We sincerely apologize for your frustration! Please contact us at 1-800-Princess so we can troubleshoot.", "@traycolgan their geographic area where they do offer promotions that would be applicable to the geographic area they live in.", "@traycolgan Hi Tracey, we're very sorry to hear this.  We urge all guests to book through an authorized Princess Cruises sales agent in-", "@hayley_bopp your dietary needs to their attention. Once booked, you can also contact us at dietaryrequest@princesscruises.com.", "@hayley_bopp Hi Hayley! While vegan dishes are not listed on our menu, our Maitre D Hotel and Head Waiter will work with you if you bring -", "@ADashofSanity Hi Sandra, you are making us hungry! Thank you for showcasing our culinary delights onboard #RubyPrincess", "@BonVoyageurs Thank you for sharing with us Lynn and Denis! We're thrilled that we could help you #comebacknew", "@So_Tweetie persist please contact 1-800-Princess to help troubleshoot.", "@So_Tweetie We apologize for the frustration! In the 2nd filter, please select Los Angeles, then   click \"View Results.\"  If problems -", "@AlyssaEinDC Hi Alyssa, you're welcome! :) We look forward to welcoming you onboard #CaribbeanPrincess in 2017!", "Find serenity in The Sanctuary. https://t.co/ZFCz5aV3NY https://t.co/WhwigtCfku", "Wander often, wonder always. #ComeBackNew https://t.co/fWEdj7uhDz", "RT if you wish you were spending the weekend here! https://t.co/LCbQtvWtiw", "Seek the sea. https://t.co/OVnA1rgVqZ", "Lighting the way toward new adventures. https://t.co/ixSverRPcF", "We'll bring the popcorn: https://t.co/3KWHuGz5Tj https://t.co/mbBMVuIk0T", "Our sights are set on paradise. #ComeBackNew https://t.co/PQbv4n61kM", "Calling all beach lovers! https://t.co/HROxHxDTDg https://t.co/ap39iH6DpW", "Cruisin' into the weekend. https://t.co/isYcedzNzi", "A world awaits outside your window. https://t.co/ayt2DMzru7 https://t.co/l75udinviG", "@77Williamsld Hi Lori, we will be ready when you are to help you #comebacknew", "@lazooooo You can contact us at media@princesscruises.com", "@CruisinTamara Hi Tamara, we look forward to welcoming you onboard!", "@Antonina_russ What country do you reside in?", "@Maria216 to our Customer Relations Department. One of our team member will contact you to address your concerns.", "@Maria216 Hi Maria, we sincerely apologize for your disappointment. We were able to locate your booking, and will pass your comments along-", "@educatingchic We sincerely apologize. Please send the booking number and question via DM.", "@educatingchic Hi Angie Marie, we truly apologize for the delay. We're you able to get your question answered, or still need assistance?", "Head for the hills. It's #TakeAHikeDay! https://t.co/FI95G0DlY4", "\"Travel brings power and love back into your life.\" \n- Rumi https://t.co/DtT15Uc0VG", "We spy with our little eye... Regal Princess! https://t.co/buImlXS9I6 https://t.co/iO7UfLWqOQ", "Views from the top. https://t.co/3FQRxVF9hr", "Who's your favorite cruise companion? https://t.co/q613AIPb1r", "@Antonina_russ Hi Antonia, you can make two different transactions using two credit cards.", "@RossPar33127020 Hi Eilidh, our approved international recruiting partners can be found here: https://t.co/yi87Ph4DO2", "@Antonina_russ #CrownPrincess", "@Antonina_russ Hi Antonia, you can pay through your Cruise Personalizer: https://t.co/UlrhKaRg0S. We look forward to welcoming you onboard-", "@TAQUIZASDONCSAR We see that the booking is now paid in full. Happy cruising!", "@bendray1 Hi Ben, thank you for sharing with us!", "@irenechaffee announced in the #PrincessPatter onboard. We hope to see you onboard in the near future!", "@irenechaffee Hi Irene! We welcome singles and couples! The Cruise Director and his/her team will plan singles events, which will be -", "@MattMaddenHB onboard #EmeraldPrincess in 2017!", "@MattMaddenHB Hi Matthew! You can learn more about our Alaska program here: https://t.co/Cax95FFP92. We look forward to welcoming you -", "@Antonina_russ Hi Antonia, please provide us your booking number via DM.", "Follow along on our Instagram today as @thelittlekitchn recaps her cruise along the Mexican Riviera! \n\nhttps://t.co/Eg2FXSvhbz", "@RHODESOUTDOOR You can contact us at media@princesscruises.com.", "Wake up refreshed. #ComeBackNew https://t.co/UZsXcFlY9b https://t.co/cqsV226669", "Experience the colors of the world. https://t.co/7HXQgNWonQ #ComeBackNew https://t.co/zlbqZierAK", "What kind of adventure are you dreaming of next? https://t.co/5Lop0n5WBK", "@TimMcDaniel Hi Tim, we sincerely apologize for your frustration. Can you please briefly advise the issue via DM?", "Treat your tastebuds -- it's #TacoTuesday, Mexican Riviera style! https://t.co/6i4SrTJ00t", "@zanniej Hi Zan, our upgrades are random and system generated. We look forward to welcoming you onboard #RoyalPrincess for your honeymoon!", "Vacation Mode: On. #ComeBackNew https://t.co/QydMZX6EKO", "Explore Skagway in all its splendor. https://t.co/pc3um2CX9o https://t.co/LeJHND0yfz", "@crapshoot946 Hi Mark, this is the #SeaViewBar onboard #RegalPrincess and #RoyalPrincess #SunDeck. Happy cruising!", "@Gladyswyer Hi Gladys, an you please send us your Captain's Circle number via DM so we can locate you in our system?", "@sdbaral monitor the situation and will inform guests should any changes be necessary.", "@sdbaral Hi Stefan, our thoughts are with those in the affected area. At this time no voyages have been affected, but we will continue to -", "Postcards from Puerto Vallarta. https://t.co/CfU3SY392R https://t.co/2Hrm9cyJPO", "New adventures spotted on the horizon. #ComeBackNew https://t.co/MdFyOJbx64", "Sunday calls for tea time. https://t.co/fFkAWtT9W2", "Replenish your mind, body and soul. #ComeBackNew https://t.co/Yt95T1AqOD", "Chase the waves. https://t.co/q3dED8k5to https://t.co/XV1TY6mIvO", "\"Travel. It leaves you speechless, then turns you into a storyteller.\"\n- Ibn Battuta https://t.co/DPxmUX8gGh", "Take a seat. #ComeBackNew https://t.co/IGuLqB2joA", "@DonnaDamato1 Hi Donna, we are truly sorry to learn of the loss of your mom. We will keep you in our thoughts and prayers.", "@MarieBahl1 pass your comments along to our Customer Relations Department. A team member will contact you to address your concerns.", "@MarieBahl1 Hi Marie, we are truly sorry to learn of the loss of your family member, &amp; will keep you in our thoughts &amp; prayers. We will -", "Life is better with sandy toes. https://t.co/CM4NP2Aizj https://t.co/qEOywzyWBz", "If you could turn back time, what moment would you live again? https://t.co/DMQrvpLLy3", "@HippieHickChick @MBPartsguy We can't wait either! #comebacknew", "Savor moments at sea. #ComeBackNew https://t.co/Mg7CfKcYPk", "@andysimmo88 of our team members will contact you to go over the Casino Division's   response.", "@andysimmo88 Hi Andy, we sincerely apologize for your disappointment. We will pass your comments along to our Customer Relations Dept. One -", "@DarciR777 Hi Darci! We think it's Marseille, France. Happy cruising!", "Gaze into the horizon. #ComeBackNew https://t.co/NTsENfIZvT", "Time for another scoop! https://t.co/GiTYcOkx5D", "Bienvenidos to your dream destination. https://t.co/PU4HHrUXVc https://t.co/Jw5w58RlQB", "@Leahwilkinson17 her Travel Agent or us directly at 0843 374 4444 directly to address her concerns.", "@Leahwilkinson17 Hi Leah, please have your sister check our passenger contract for age requirements: https://t.co/t6maYaqArw, and contact -", "@Katanos4 Cruising the oceans of the world to exciting destinations to help our guests #comebacknew", "@gconklin93 address your concerns.", "@gconklin93 Hi Camille, we will pass your comments along to our Customer Relations Department. One of our team members will contact you to -", "@SimonTravels A4: Our Club Class mini-suites offer exclusive dining, elevated service &amp; best sleep at sea! https://t.co/i2MtTlsw7o #TWchats", "@TWtravelnews A1: The cuisine from Michelin-starred chefs &amp; dazzling entertainment on #MajesticPrincess! https://t.co/xwTeMJioFp #TWchats", "@Barryr27 Hi Barry, you are correct! #comebacknew", "@photochika4291 Hi Brianna! What destination are you thinking of?", "@DannyMJOliver Hi Danny, you can contact us at entertainment@princesscruises.com.", "@KevinKe22082913 Hi Kevin, we're glad you had a good time!", "@RecipeGirl Lori, you are making us hungry! #RubyPrincess #comebacknew", "@AaronJK1 Hi Aaron, each vessel has a separate schedule for installing holiday decorations. Happy cruising!", "Discover new perspectives. #ComeBackNew https://t.co/s3tz9qu7gE", "@mfhewson customer service to our guests. We apologize if that was not your experience.", "@mfhewson Hi Cody, we are truly sorry for your disappointment when speaking with our team member. We strive to provide gracious, warm -", "@Ladyjane6313 service, and we apologize if it did not meet your expectations.", "@Ladyjane6313 We are truly sorry for your disappointment with our tender service. We strive to provide our guests with fast and efficient -", "@JackSchoolrock1 Hi Jack, thanks for the feedback. We will pass along to the appropriate department for consideration. Happy cruising!", "@later_taters Hi Marj, from the Philippines, you can contact our ISA - Cruise Professionals Inc. at 63 2 813 7407 to 09.", "Get your day off to an extra foamy start -- It's #NationalCappuccinoDay! https://t.co/gpbTZ805PA", "Dreaming with our eyes wide open. https://t.co/kzh8eWAYZd", "Let the Monday blues bubble away. #ComeBackNew https://t.co/DHJ9lAe29x", "@JLR2049 Relations (customerrelations@princesscruises.com) so that we may address your concerns.", "@JLR2049 Hi Jennie, we sincerely apologize for your disappointment with our onboard Cruise Director. We hope that you contact Customer -", "@Leahwilkinson17 Hi Leah, we charge per guest regardless of age. We hope that  your sister will book the rate that best meets her needs.", "@martintday Hi Martin, can you please send us your booking number via DM?", "Memories are made when gathered around the table. https://t.co/Rs4rJ2SsmG https://t.co/XHcEpskBjr", "Always seek new adventures. https://t.co/OMy7WN6s2M", "@stephenescott2 deposit information. We look forward to seeing you onboard soon!", "@stephenescott2 Hi Scott! Thanks for asking about our JP &amp; Voyages of the Glaciers GA. Please contact us at 0843 374 4444 for pricing and -", "@gconklin93 guests with a top-notch dining experience, &amp; we apologize that our dining did not meet your expectations.", "@gconklin93 Hi Camille, we're deeply sorry for your disappointment with the food onboard your recent cruise. We strive to provide our -", "\"The world is a book, and those who do not travel read only one page.\" https://t.co/0az9AS2zE0", "RT if you're ready to dive in. #ComeBackNew https://t.co/YYeyvIy2FF", "Portofino is perfectly picturesque. https://t.co/u0ueC78eoy", "All that glitters... https://t.co/ZzbNo2j0ZC https://t.co/iVARd6Rzvz", "There's no better feeling than a sea breeze. #ComeBackNew https://t.co/oqQ25o9jDq", "Salty sea. Sweet views. https://t.co/MUT2F9k8hR", "Embracing sunny moments at sea. https://t.co/O2DKYaJHI0", "What's your favorite way to start the day? https://t.co/GC4u8ml8XM https://t.co/9OqCZfPfFT", "We're dreaming in Caribbean colors. https://t.co/0vjY2GOPim #ComeBackNew https://t.co/dhyvKKPY2v", "Happy birthday to our partner, Chef @CurtisStone!", "Coffee? Check. \nCamera? Check. \nNew adventures? Coming right up. https://t.co/xuhxF6IRdz", "It's bad manners to keep a vacation waiting. https://t.co/z9bANOnRxJ https://t.co/2EtvKgTe1s", "Let your worries melt away. #ComeBackNew https://t.co/00ktwjmUFR", "@amazzer43 Hi Carly, Caribe Deck is Deck 10 on #CoralPrincess. You can see the deck plan here: https://t.co/E5QnxC0Lbx. Happy cruising!", "@sanjie1965 Hi Julie, we sincerely apologize for your continued frustration in attempting to contact us. Please DM your phone number.", "@HohoGone Hi Heather, please try again.", "@KennaLeeLovely to the appropriate department.", "@KennaLeeLovely Hi Kenna, we sincerely apologize for your disappointment in our onboard Karaoke library. We will pass along your feedback -", "@SuCeeBhead top-notch dining experience, and we apologize that our dining did not meet your expectations.", "@SuCeeBhead We're deeply sorry for your disappointment with the food onboard your recent cruise. We strive to provide our guests with a -", "@CajunazcuteLynn Hi Jennifer! Thanks for asking about our #Alaska cruises! Please contact us at 1-800-Princess for assistance!", "A deck fit for a princess. https://t.co/POsp7hVVTT", "Adventure in Alaska, or marvel at the Mediterranean -- which will you cross off your bucket list first? https://t.co/j8Ms0yfz6m", "What tasty treasures will you discover out at sea? https://t.co/nszpx83e2z https://t.co/vRkMsCQhc8", "Embrace the adventures and enjoy the journey. #ComeBackNew https://t.co/KgexT9GUmE", "@amazzer43 Hi Carly, what is your sail date?", "@zanniej Hi Zan, we can't wait! We look forward to helping you #comebacknew", "@HohoGone Hi Heather, can you please send us your booking number via DM?", "@RosieMoo your concerns.", "@RosieMoo Hi Rosie, please contact our Customer Relations Department (PCUK.CustomerRelations@princesscruises.co.uk) so that we may address -", "@WeLoveFoodTweet That is the #SeaWalk onboard #RoyalPrincess &amp; #RegalPrincess - Happy cruising!", "What's your favorite way to explore a new city? https://t.co/fDpPZEOiMV", "@amazzer43 Hi Carly, on which of our ships will you be sailing with us?", "@Arichmanfl Hi Al! We're not sure of the exactly which ship for the photo of #SeaWalk - as the fellow guest who sent in didn't advise us.", "@EmilioWriedt Hi Emilio! That's our #SeaWalk that you will find onboard #RoyalPrincess and #RegalPrincess - Happy Cruising!", "@tezzah1959 Hi Terry, you can contact our Captain's Circle Department at 0843 355 0065. One of our team members will be happy to assist you!", "A bridge to new adventures. https://t.co/9EZwkf9dDK", "@shipfriendMax Hi Max! We launch our voyages about 18 months out. Please keep checking back here: https://t.co/lrlFiwz3Go. Happy cruising!", "@RosieMoo Hi Rosie, what is your country of residence?", "@amazzer43 Hi Carly, C209 is on the Caribe Deck!", "@RecipeGirl Hi Lori! Thank your for showcasing our beauty, #RubyPrincess - we're glad we could help you #comebacknew", "Make waves. #ComeBackNew https://t.co/lw92iGAx19", "@foley_design Unfortunately, Princess was unable to secure the maritime rights for that event.", "@Charlie_Trumpet We enjoyed having you onboard with us, Charlie!", "@SpaTravelGal Aww, we miss you too, Ava! #comebacknew", "@SpaTravelGal We like your style, Ava!", "@lrpinkoff Hi Lorna, we sincerely apologize for your disappointment with #GrandPrincess Her dry dock is scheduled for early December.", "See things from a different perspective. https://t.co/IxPqd9Xjzp", "What's your favorite sweet treat onboard? https://t.co/y0jpDE4Cnq https://t.co/dOAOPVNAh6", "@TaraHusband look forward to seeing you onboard in the new year!", "@TaraHusband Hi Tara! We would love to help! You can find information here: https://t.co/8I400OPn02 or contact us at 1-800-Princess. We -", "Our version of the Monday blues. https://t.co/DULAPjgxLi", "@UltimaAmaterasu Hi Donna! That's #RubyPrincess :)", "Coffee and a great view make Monday a little more bearable. https://t.co/TyXGjQvmxM", "@keladewig Hi Kristin! Yes, #ChocolateJourneys is onboard all of our ships fleetwide: https://t.co/5dFsXsXzT9. #princesschocilate", "@tommygunn01 Hi Tommy, we are experiencing difficulty locating your booking. Please send your booking number via DM.", "@Andrew_SW Glad you like it, Andrew!", "Trick or treat? (We choose treat!)\n#HappyHalloween https://t.co/8SOumKZc87", "What's on your cruise playlist? https://t.co/lClRkRK7IT", "The perfect place to spend a lazy Sunday. https://t.co/1LIrrMhzXm #ComeBackNew https://t.co/8TFE4Qw2Jb", "We may leave the cities behind, but the memories stay with us forever. https://t.co/INuzHxXXeK", "Floating into paradise. https://t.co/f1tjMB1uHW", "\"The sea, once it casts its spell, holds one in its net of wonder forever.\"\n- Jacques Cousteau https://t.co/XfI7VsU7JK", "Adventure starts here. https://t.co/x0zOAwW1m4 #ComeBackNew https://t.co/UPUxHqwzEc", "Nothing can rival a sunset at sea. https://t.co/p1OttM9qkl", "We'll save you a seat. https://t.co/oIBtPkpyZ1", "@JamesStevenson Hi James! Here's some champagne to pair with the #princesschocolate https://t.co/sWJiAJpQ7b", "@acalagias Hi Alethia, thanks for sharing with us! We are very proud of @bpoconnor to received this honor from @SCVSignal", "This weekend's forecast: sunny with a chance of mini-golf. https://t.co/BgXgINaef6", "Let the ocean breeze put your mind at ease. https://t.co/LMvvrdTxwR", "Relaxation takes on a whole new meaning. #ComeBackNew https://t.co/pZByxx9cap", "There's no place we'd rather be than out on the sea. https://t.co/czzcKrEQbi", "Vacation is a great time to make new friends. https://t.co/6caU5b8a57 https://t.co/PzTCjk8Ri2", "@pyhc001 Please try again.", "Time to turn on your \"Out of Office.\" https://t.co/1h5jYjj3Nd https://t.co/Qf0vwbIlUd", "Wave goodbye to all your troubles. #ComeBackNew https://t.co/pfUFDgkQhB", "@bigbosscoaching Email: mundocruceros@mundocruceros.cl", "@bigbosscoaching Please contact: \nMultitour Mundo Cruceros\nMiguel Claro 195 of 505\nSCL\n750 0611 Chile\nTel: 562 2235 1690\nFax: 562 2235 1691", "@telliot22 Please send us the name, ship, and sail date of your relative via DM.", "Perched on the edge of a new adventure. https://t.co/nD0IkZJf0s", "@luisgbenji Hi Luis, our approved international recruiting partners can be found here: https://t.co/ir5haZdTgD.", "@pattyapaw Hi Patty! Thank you for sharing with us. We say you can't have too much #princesschocolate", "#NoFilter https://t.co/AdPvl5Hf09", "@SenoritaHappy in SHG, she can only be booked by residents of the PRC.", "@SenoritaHappy Hi Christina! #MajesticPrincess can be booked here: https://t.co/8I400OPn02 for April, May, &amp; June, 2017. Once she arrives -", "@pyhc001 We are having difficulty locating your record. Can you please send your booking number via DM?", "Paradise awaits. https://t.co/VKiiWVTAFB", "Life is better at sea. #ComeBackNew https://t.co/6LFfXTQbRr", "@DarciR777 We like your style, Darci! Cheers! https://t.co/aX0obcbB7P", "@mleland8 Hi Michael, thank you for reaching out. Our CARE office will be contacting Mr. Maidment today.", "@simplybeingmom We're glad you enjoyed your sweet treat!", "What will you cross off your bucket list next? https://t.co/OHdhHUYKF0 #TravelTuesday https://t.co/qNNlCqQ8Jf", "@SSerenaGao Hi Serena, our approved international recruiting partners can be found here: https://t.co/ir5haZdTgD.", "@SandyCoughlinRE Hi Sandy, we hope you had as much fun as we did! Glad we could help you #comebacknew", "@cookincanuck Hi Dara, we will join you with a strawberry margarita. Cheers! #comebacknew https://t.co/RhFeNJ1Inw", "@NutmegNanny Hi Brandy, we love that for an afternoon snack! #comebacknew", "@SandyCoughlinRE Hi Sandy, we love this adorable photo! #comebacknew", "@Cameravixen We sincerely apologize for your disappointment. Please send us your booking number via DM.", "A day worth dreaming about. #ComeBackNew https://t.co/JQqFcTVWJA", "@UltimaAmaterasu Hi Donna! #EmeraldPrincess &amp; #RubyPrincess are sister ships along with 7 other vessels in our Grand Class of ships.", "@TheSavvyTrvler That's our beauty #RubyPrincess #comebacknew", "@taminflight You can contact us at 1-800-Princess for availability. Happy cruising!", "@HeffySuzanne Hi Suzanne, our voyages are launched about 18 months out. Please check back here: https://t.co/8I400OPn02. Happy cruising!", "@DGN914 Hi Daniel! The winner has not been announced yet. Check back here: https://t.co/RzFYnVCTC9. Happy cruising!", "@robare53 &amp; Tracey, we will extend to each of you an additional cruise credit, therefore elevating you both to Elite loyalty status.", "@robare53 Hi Robert, we're truly sorry to learn of your health circumstances &amp; wish you a speedy recovery. As a one time goodwill for you -", "@guywaters our shipboard team.", "@guywaters Hi Guy, we deeply apologize for the elevator service interruption during your current voyage. We've shared your concerns with -", "As delicious as it is beautiful! https://t.co/VY5l9FsY1r", "@combatcatm a wonderful time during our cruises and wish you had a better experience.", "@combatcatm We are truly sorry if you had an unsatisfactory experience while sailing with us.  We definitely intend for all guests to have -", "@chmalu Hi Colin! Our voyages are launched about 18 months out. Check here: https://t.co/lrlFiwz3Go. Happy cruising!", "@RecipeGirl Hi Lori, we're thrilled that you enjoyed it! #comebacknew", "@dragonfire629 Hi Mindy, for a list of our shore excursions at St. Thomas &amp; St. John, please see information here: https://t.co/quiRPqAlcZ.", "A supper worth savoring. https://t.co/xemVYCt5K8", "Go island-hopping. #ComeBackNew https://t.co/eefhC6adc4", "Where fleeting moments become lasting memories. #ComeBackNew https://t.co/jDUyORNJlp", "At sea, every day is an ice cream kind of day! https://t.co/XOP0pDPx5l", "Your passport to tranquility. #ComeBackNew https://t.co/KjGulcXiYG", "Coffee + this view = blissful morning. https://t.co/Tvf15Y2BFz", "@nimiq2011 Beautiful!", "@martinb747 Department (PCUK.CustomerRelations@princesscruises.co.uk) so that we can address your concerns.", "@martinb747 Hi Marin, we located your booking, but do not see that we have received your email. Please forward to our Customer Relations-", "Tweet us your favorite way to spend an evening at sea! #ComeBackNew https://t.co/3V6ZKpvsh0", "@LondonFoodSpy Apologies for any confusion--the rules just changed this month, and our tour operator and port agent were working the issue.", "@LondonFoodSpy David, we've just heard from our agent in Shanghai that you may visit Shanghai visa-free. You will need a visa for Beijing.", "Jawdropping! https://t.co/SmTCz1AaR0", "@shipfriendMax Hi Max, we can't wait either!", "@JayLJohnston Thank you, Jay! We look forward to welcoming you onboard #PacificPrincess", "@FeliciaForbes Hi Felicia! We're thrilled to know that John took good care of you so you could #comebacknew", "@SandyCoughlinRE Hi Sandy! Happy 25th wedding anniversary. We wish you a lifetime of wedded bliss!", "@crazywithtwins Hi Emma, how can we help you?", "@LetMeEatCake We like your style, Nastassia! #comebacknew", "@NutmegNanny Hi Brandy! Sounds good to us. Cheers!", "Discover an endless summer. #ComeBackNew https://t.co/vliMOAoJS6", "Any time is margarita time on a Mexico cruise! https://t.co/C0O7bvtmiX", "@thelittlekitchn Hi Julie, here's some champagne to pair with the Princess Love Boat Dream dessert! #comebacknew https://t.co/1TISAaYFJU", "@NutmegNanny Glad that you're having fun, Brandy! #comebacknew", "Pinkies out! Who else has relaxed with our afternoon tea? https://t.co/8W32mtyrdc", "@principian Hi CB! Princess does not price match. However you decide to book our cruises, we hope to see you onboard soon!", "@zschmeez Hi Zack! Instead of purchasing a package, you have the option to purchase our 'Pay as You Go\" which is $0.79/minute.", "@RecipeGirl Hi Lori! We could use one of those right about now. #comebacknew", "@PatWoods1 Thank you, Pat. We appreciate the honor!", "@guychurchward We appreciate your understanding, Guy.", "@tophersterling We look forward to welcoming you onboard #RegalPrincess on Saturday!", "@DarthTeddy93 Yes, we will have full play off coverage. Happy cruising!", "@JackSchoolrock1 Thanks for your suggestion, Jack! We will pass it along to the appropriate department for consideration.", "@sweetcsdesigns Hi Courtney, we're thrilled to hear that! We love helping our guests #comebacknew", "@armymuseumhfx Thank you for the warm hospitality! Cheers!", "@cookincanuck Hi Dara, we like that combination! #comebacknew", "@cookincanuck Hi Dara! That looks like a nice start for brunch! #comebacknew", "@RecipeGirl Hi Lori, we love your smile! Enjoy #PuertoVallarta #comebacknew", "@edd342 Hi Ed! You can find information here: https://t.co/beykqfhJjC. Happy cruising!", "@thelittlekitchn Hi Julie, you are making us hungry! #comebacknew", "@LetMeEatCake Hi Nastassia! Enjoy your time in #PuertoVallarta today! #comebacknew", "@jchongstudio Hi Jennifer! We like it for mid - morning too! #RubyPrincess #comebacknew", "@thelittlekitchn Hi Julie! We're glad you are enjoying #RubyPrincess What's exciting today? #coembacknew", "@dragonfire629 Hi Mindy! On 3.26.17, #RegalPrincess is back in #FLL to begin another 7 day voyage. Did you mean 3.22.17?", "@sweetcsdesigns Hi Courtney, we are so glad you are having a great time on #RubyPrincess What's exciting today? #comebacknew", "@NutmegNanny Hi Brandy! We're thrilled that you are enjoying #RubyPrincess #comebacknew", "@SandyCoughlinRE Hi Sandy, we are glad to see you are enjoying #RubyPrincess and her offerings. What's in store for today? #comebacknew", "@tablefortwoblog Hi Julie, glad you are having a great time. Cheers! #ComeBackNew https://t.co/PQS9PAtzfj", "Memories begin here. #ComeBackNew https://t.co/a5fV5RLyZu", "@Alcove7 Hi Lisa, we apologize for the delay. #SunPrincess is en-route to Brisbane, due to arrive at 7:00AM 19OCT.", "@LacrossFan Hi CRob, that's Charred Asparagus and Toasted Haloumi Cheese served onboard at #TheSaltyDogGastropub: https://t.co/NvXm8zRPjR.", "@Chibeau Hi Joyce! That's our beauty #RubyPrincess on her #CulinaryCruise", "@nuturbizniz Hi Andre, we apologize for the delay. Were you able to find a Princess representative to assist you?", "@ClareTrippier Hi Clare, yes,1 British pound equals to USD $1.33 for that day.", "@JackSchoolrock1 Hi Jack, thanks for the suggestion!", "@lawro22 Hi Lawrence, can you send us specifics via DM?", "Bon appetit! https://t.co/PNmoZ7iFYG", "RT if this is how you feel about relaxing days at sea! #ComeBackNew https://t.co/ScYqjbqURk", "Share new horizons. https://t.co/RirW4YZd1g", "Savor every moment. https://t.co/wamlQWfEvt https://t.co/u8KgWAk1CZ", "Happiness is smooth seas and a warm breeze. https://t.co/k9kHtqxTQ0", "Enhanced. Elevated. Exclusive. \n\nCurious? https://t.co/d3HSwBcn3J https://t.co/Bq4xJaEusE", "We're celebrating #NationalDessertDay today, tomorrow, and the 363 days after that. https://t.co/USK9RXcvyY", "@srankin8 Hi Stacey! We are helping our guests #ComeBackNew", "@panda_k8 Hi Kate, please follow us so we can DM you.", "@nuturbizniz Additionally, there are at least two #Princess representatives at your hotel to assist  you. We appreciate your patience.", "@nuturbizniz Hi Andre, all luggage has been off-loaded from the ship and and in the process of being dispatched to the different hotels.", "@jack_kershaw_ @BBCNews @SkyNewsBreak Pacific Princess is safely alongside. One compartment experienced flooding. All guests and crew safe.", "The beauty of Alaska will stick with you long after you return home. #ComeBackNew https://t.co/uZSX7fabyW https://t.co/rEg4ATkhAb", "@cosmos504 Thanks for asking about our cruises! We're going to St. Kitts in December, departing from FLL: https://t.co/8I400OPn02.", "We're proud to be honored for helping our guests #ComeBackNew. https://t.co/ctN8Q3CCZE", "@paulfowler077 Hi Paul, thanks for sharing with us!", "@cbigs6 Hi Cass, we love this beautiful photo!", "@jacurmac Hi Johnny, we truly apologize for your discomfort during your current voyage. We've shared your concerns with our shipboard team.", "@Master_Schnief Hi Flo, we're thrilled that you like it! #RoyalPrincess", "@jacurmac Hi Johnny, we deeply apologize for your frustration. Please send your booking number via DM.", "@LondonFoodSpy David, because your cruise starts in China and then visits a second Chinese port, a double-entry visa is required.", "RT &amp; tell us your dream destination! https://t.co/iSe6ba69N9", "@JackSchoolrock1 Hi Jack, we will pass along your request to the appropriate department.", "@NicolesChoice1 Hi Nicole, we love your beautiful smile!", "Discover the misty city. #ComeBackNew https://t.co/HK1gY7o4iN https://t.co/Qkj5gP5dkM", "@Frm1Mom2Another Beautiful!", "@melissakuttan Hi MK, we have passed your request along. Happy sailing!", "@BethkazV Hi Beth! We love your beautiful smiles!", "Don't miss your chance to win an unforgettable Mediterranean vacation! https://t.co/i3NG8SfKXA", "@ClareTrippier Hi Clare! The sell rate today is 1.330554. We look forward to welcoming you onboard #RoyalPrincess", "@travelbrewson Hi Cody, please see https://t.co/zXnj8kcsqh for our clothing recommendations!", "Share a sunset with the ones you love. #ComeBackNew https://t.co/h6pY6LrgZ6", "@OfficiallyLisaM Hi Lisa, thanks for your interest in joining our team! For employment information please visit: https://t.co/LmpNp6G38F.", "@BonVoyageurs Lynn &amp; Denis, you are making us hungry!", "@CherlynG problems persist please contact 1-800-Princess to help troubleshoot.", "@CherlynG Hi Cherlyn, we apologize for the frustration! Have you tried clearing your cookies &amp; cache, or using a different browser? If -", "@reasonstocruise Hi David, we can't get enough #PrincessChocolate https://t.co/64Zq6MNFBa", "@panda_k8 Hi Kate, we offer shore excursion, Snorkel at Marietas Islands. You can learn more here: https://t.co/Qx1vMXVr1V. Happy cruising!", "@lawro22 Hi Lawrence! Our Luxury Bed will roll out to #CrownPrincess in April of 2018. Find information here: https://t.co/Wiz2m76oxj.", "@rayannchick369 Here you go: https://t.co/H1kSdMQa7D. Good luck!", "@jgobble Hi Jann, thanks for asking about our Luxury Bed! It will be in all staterooms onboard. Learn more here: https://t.co/Wiz2m76oxj.", "@LondonFoodSpy Hi, David. Guests from the UK need a double-entry China visa before the cruise &amp; will receive the Vietnam visa on arrival.", "@StaceTheAce87 Hi Stacey, we are having a difficult time locating your record. Can you please send us your booking number via DM?", "Glimpse unforgettable natural wonders. https://t.co/EHzqdQjtND #ComeBackNew https://t.co/nQ8bsXLK5J", "@d_riggan Hi D.G., #CoralPrincess has a combination of diesel engines and gas turbines.", "@methhamfetabean Hi Kim, please try to DM now.", "@methhamfetabean Hi Kim, we apologize for your disappointment when speaking with members of our team. Please DM us your booking number.", "@SK269 Hi Gillian, we're glad that you had a great time!", "@tmtex4life Hi Tony! Thank you for the kudos. We're thrilled that you liked our new Luxury Beds!", "@thewillowchick We are having difficulty locating your information. Please send us your booking number via DM.", "@racerboy221 Hi William! We apologize for the delay in responding. Welcome onboard #DiamondPrincess for the Grand Asia &amp; Japan voyage!", "Where mornings are magical and evenings are unforgettable. #ComeBackNew https://t.co/3Mn1W68GWd", "It's true -- there's no better night of sleep! Tweet us if you've experienced our Princess Luxury Bed already. https://t.co/M9KRIgJDwj", "Endless adventures by land and by sea. https://t.co/Pgk5BhuWjk", "Curious about cruise cuisine? Whet your appetite with the rundown on our fine dining from @travelocity. https://t.co/Ca5DqZ83MI", "A deck full of delights. https://t.co/Vvt4ndU93x", "@fgomeza Hi Fernanda, the storm has passed FLL and Port Everglades has re-opened for business.", "RT @ktlaENT: .@WhelanJill on Why Everyone Should Go on a @PrincessCruises https://t.co/5CFsOl0092 via @ktla", "@NZanicchi We like your style!", "Tell us what you'd love to be watching on Movies Under the Stars this weekend! https://t.co/pgFLjIORdW", "Reflect on nature's wonders. #ComeBackNew https://t.co/PxxSzBuXXq", "@fgomeza Hi Fernanda, #CoralPrincess departed Los Angeles on SEPT24 and will arrive in FLL on OCT9 at 7:00am.", "Discover Alaska's first city. https://t.co/BDuXW9ct6b", "@fgomeza Hi Fernanda, are you referring to the #CoralPrincess voyage?", "@stephaniesmyth We are keeping a close watch on the situation &amp; will notify guests &amp; travel consultants should other voyages be impacted.", "@stephaniesmyth Hi Stephanie, Island Princess canceled its call to Aruba yesterday &amp; replaced it with a call to Grand Cayman.", "What's your favorite part of a cruise? \n\nRT for sea days, favorite for port days! https://t.co/ExJ4duzPH5", "@DarciR777 advise guests/travel consultants should the itinerary be affected. We look forward to welcoming you onboard #CoralPrincess", "@DarciR777 Hi Darci, at this time, the itinerary has not changed. Our Marine experts are keeping a close watch on the situation &amp; we will -", "@BenBheis Hi Ben, we will share your request with the appropriate department. Happy cruising!", "@menupluscln Yes, it is! We are very proud of our #RegalPrincess shipboard team!", "Congrats to the #RegalPrincess crew for their perfect score on a recent unannounced public health inspection! https://t.co/csOSnDL7SH", "@MLuedee Hi Michael! #CaribbeanPrincess departs Corner Brook today at 5:00PM. Happy cruising!", "@ktlaENT That's our lovely Celebrations Ambassador, @WhelanJill sharing why you should take a #PrincessCruise so you can #ComeBackNew", "@mfhewson Hi Cody, we will have the schedule of games we will be able to broadcast onboard next week. You are welcome to check back.", "Leave your cares in your wake. #ComeBackNew https://t.co/KDjxm9QQtS", "@RickGriffin @Travel_boomer  We think there is nothing quite like #PrincessChocolate #CruiseChat", "@nickandriani Hi Nicholas, we hope to see you onboard in the near future!", "@mariamichle29 of you onboard #CrownPrincess sailing to Hawaii! https://t.co/QFO3s9IP2S", "@mariamichle29 Hi Maria &amp; Janet! Congratulations on your marriage! We wish you a life time of happiness, and look forward to welcoming both-", "@bajabex look forward to welcoming you onboard #RegalPrincess", "@bajabex Matthew with relevant authorities. If there are any updates we will be sure to communicate them to our Travel Agents/guests. We-", "@bajabex Hi Dawn, we understand your concern &amp; we would like to reassure you that we continue to monitor the situation with Hurricane-", "Where ancient tradition meets postmodern culture. https://t.co/An6ktuZdCf https://t.co/Jx6ZCfEtJ2", "One of the world's best sailaways, wouldn't you agree? https://t.co/YQV8nPIF48", "@JackSchoolrock1 there are any updates we will be sure to communicate them to our guests &amp; Travel Agents.", "@JackSchoolrock1 Hi Jack, there are no changes at this time. We continue to monitor Tropical Storm Matthew with relevant authorities. If-", "@Maria216 Hi Maria, we're sorry to learn your disappointing experience onboard #EmeraldPrincess. Can you briefly advise issue via DM?", "@MissAmandasands understanding &amp; look forward to addressing your concerns.", "@MissAmandasands we aim to respond to our guests as quickly as possible, response time may take 2 - 4 weeks. We appreciate your -", "@MissAmandasands Hi Amanda, we apologize for the delay. Our Customer Relations Department received your correspondence on 30SEP. Although-", "@tascy_tweet Hi Tascy we sincerely apologize for your frustration. Can you please send us your Captain's Circle number via DM?", "@meerenai Hi Meerenai, please send us your parents booking number and names via DM.", "Your gateway to fun in the sun. https://t.co/MLc9XPx70T https://t.co/KOnuwoeGtQ", "Bliss is closer than you think. #ComeBackNew https://t.co/ep3ZMOajcK https://t.co/AI3X6LY5Tq", "Surround yourself with natural beauty. #comebacknew https://t.co/PpBC5qtJke", "See dreams come true aboard #RoyalPrincess. Tune into @CWVacation this morning!", "One for the bucket list! https://t.co/yy3jonzGJF", "@travelbrewson Hi Cody, please review travel documents required with your Travel Agent or in your Cruise Personalizer. See you in two weeks!", "@MissAmandasands Hi Amanda, we're glad that you had a good time!", "@WhelanJill Happy Birthday, Jill! We're thrilled that you could celebrate with us. We love that color on you! #ComeBackNew", "@SpaTravelGal Hi Ava, the #LotusSpa slippers look good on you! #ComeBackNew", "@SpaTravelGal Good morning, Ava! What's for breakfast today? #ComeBackNew", "Congrats to the Caribbean Princess crew for their perfect score on a recent unannounced public health inspection! https://t.co/kCo25vH915", "Embrace the sun-kissed California coast. #ComeBackNew https://t.co/pGcM0KD9Fw https://t.co/5b0Mq4RJen", "The best pairing for a latte is a sea breeze. #NationalCoffeeDay https://t.co/zIdCQFMbW3", "@johnSsquared Hi John, looks like a good time is being had by all!", "@Elliocor Hi Samantha, we sincerely apologize for your disappointing experience. Can you please send us your booking number via DM?", "@travelbrewson Hi Cody, unfortunately, no. Sign up is done onboard.", "Set a course for a world of discoveries. https://t.co/LgkjHe4iWQ", "A perfect day for wine-tasting and California cuisine! https://t.co/ilZaZWFDkh", "@travelbrewson Hi Cody, OBC can be applied against any purchase made onboard except the casino or transferred into casino credit.", "@MyLastBite Hi Jo, sounds like a perfect plan to us. Cheers! https://t.co/ZyU0gj5C57", "@wanderwwonder Cheers, ladies! https://t.co/0di9ntGDkl", "@PaxtonKelly3 Hi Paxton, we hope you are enjoying your time in Santa Barbara!", "@WhelanJill Hi Jill! We hope you are enjoying #SantaBarbara and our beauty, #RubyPrincess so you can #ComeBackNew What's exciting for today?", "@BonVoyageurs Hi Denis and Lynn! We hope you are having a great time in #Alaska", "@MyLastBite Good morning Jo! We hope you are enjoying your #RubyPrincess cruise. What fun-filled plans are in the works today?", "@OliviaBraddick Congratulations on five years Olivia! Here's to many more!", "@TKAmaterasu We are thrilled that you had a great time. Thanks for choosing Princess!", "Tell us where you'd love to sail next! #ComeBackNew https://t.co/QXdKpzAHJU", "@srankin8 Hi Stacey, thanks for your interest in joining our team. You can find information here: https://t.co/dOtZnFOuig.", "@MyLastBite Hi Jo, yes #TheLoveBoatDiscoDeckParty will be held onboard. Happy cruising!", "@bellstarz Hi Jenny, our promos are not classified by occupation. We offer US and CA veterans a military benefit: https://t.co/Tyd4cnrYI2.", "@Jen_cha consummate host, and provide our guests with gracious hospitality. We are truly sorry if that was not your experience.", "@Jen_cha Hi Jenny, we sincerely apologize for any unpleasant interaction with members of our shipboard team.  We strive to be the-", "Your adventure starts here. #ComeBackNew https://t.co/DE07lH0uR8", "Bon voyage! https://t.co/N4fE0AuWJy", "@babyhippo99 Hi Kelvin! Congratulations on 19 years. Cheers!", "@Urkidy Hi Yojan, if you send us their name, your name/contact info via DM, we will pass along. It's up to the team member to respond.", "RT @Hayleydaviez: Woke up to a beautiful sunrise on @princesscruises #emeraldprincess #funchal #madera https://t.co/xrRhAcqsVR", "@MyLastBite We can't wait to see what #TravelJoJo packed for formal night!", "Go ahead -- indulge a little. https://t.co/OV3GsMYbIn", "Summer doesn't have to be over. https://t.co/e3xVZkEfOO", "Gorgeous! https://t.co/L5mpYzAgcd", "RT if this is your favorite view! https://t.co/1vEjixHDyD", "@EthanFifield We'd love to welcome you aboard!", "The best way to recover from a long week? \n\nA sea day. https://t.co/Io3uSLxRtK", "There's no better place to catch a movie. https://t.co/fKH0LTLWuh https://t.co/RGkJmgVz3u", "@travelbrewson Hi Cody, it's called The Ultimate Ship Tour. You can read more about it here: https://t.co/AQi5PKchmp.", "@travelbrewson departure. We look forward to welcoming you back onboard #RubyPrincess sailing to Mexico!", "@travelbrewson Hi Cody, we're glad you're looking forward to your cruise! You will be receiving three more pre-cruise emails prior to your-", "@Loopsalot68 Hi Louise, thank you for choosing Princess!", "@PIER39 Thanks for the warm hospitality! Cheers! https://t.co/9pmUWHpi3v", "Glimpse where blue skies meet snow-capped peaks. #ComeBackNew https://t.co/E4uEKbYqHy", "@Cameravixen authorizations will be made to verify funds based on your spending. We hope to see you onboard soon!", "@Cameravixen Hi Cameravixen. You can learn about our cashless cruising here: https://t.co/rwWc6bpMF9. Debt cards are accepted, but charge-", "RT @DilaraLit: Lunch with this view in #Corfu today @princesscruises #comebacknew https://t.co/JmlG0y3Shp", "@HugoAvelar1 Hi Hugo, thanks for your interest in joining our team! For employment information please visit: https://t.co/EC2yc3vH8w", "@gconklin93 Hi Camille, thanks for asking about our #SailAwayTV programming. Learn more here: https://t.co/bwexEjZ13f. Happy Cruising!", "@stamatiad Hi Stamatia, we are thrilled that you had a great time!", "@lawlitta Hi Lolitta, please contact us at 1-800-Princess. One of our team members will be happy to assist you.", "@eleanorbechtho1 Hi Eleanor, we wish you the best with your new endeavors!", "Discover a land you've only seen in dreams. #ComeBackNew https://t.co/IBzntHhADc", "@KathyNgo1 two weeks after the voyage ended. You are welcome to send your feedback to customerrelations@princesscruises.com.", "@KathyNgo1 Hi Kathy, we located your booking and see that the onboard Evaluation was sent on June 18th at 8:18PM. We can only resend up to -", "What's your favorite thing to do on the Lido Deck? https://t.co/jPS31KVNKb", "See the world in bloom. https://t.co/NRMB6Motgw", "Start your weekend right. #ComeBackNew https://t.co/u2YU1UdSnX", "@Seattlejo Hi Deborah, we are attempting to call you, but are reaching a business recording. Please send your contact number via DM.", "@EvaJenner Hi Eva! Looks like you and John are having a good time. Cheers!", "Raise a glass to days at sea. #ComeBackNew https://t.co/q9zk74MVJM", "@Erins_Best Hi Erin we truly apologize if you had disappointing experience with any of our shipboard team. We thank you for your feedback.", "@Seattlejo Hi Deborah, can you advise us of your question so we can get it to the correct department?", "@EmmaCouherd Hi Emma, you can contact us at 0843 374 4444. Happy Cruising!", "RT &amp; tell us where you wish you were cruising today! #ComeBackNew https://t.co/DMNbNNrvX6", "@tchp96 Hi Tristan, we are thrilled that you enjoyed #RegalPrincess We hope to see you onboard again in the near future!", "@GizaTomm Hi Tom, we sincerely apologize for your frustration with the delays. We hope you enjoy the remainder of your voyage.", "See the greatest show on earth. #ComeBackNew https://t.co/QgTPxxKqFb", "@KittySparkles1 Kitty, you are making us hungry!", "@Lewis_Yeardley Hi Lewis! We're thrilled that you enjoyed #RegalPrincess", "@lawro22 Hi Lawrence, you can request feather pillows your Cruise Personalizer. We look forward to welcoming you onboard #CrownPrincess", "@Sihpromatum Hi Savannah, that's our beauty, #RoyalPrincess", "@Sihpromatum Hi Savannah! You can contact us at media@princesscruises.com.", "@K_hardy1990 Hi Karl, we look forward to welcoming you onboard #EmeraldPrincess", "@Pegasus2866 Hi Peggy! We're thrilled that you like our #PrincessChocolate", "@gibraltarport Thanks for the warm welcome! Cheers! https://t.co/GcFa4mAESh", "Play on picturesque islands. https://t.co/IpATe6Vn1P", "@mrswatson27 Hi Elaine, our voyages are launched about 18 months out. Please check back here: https://t.co/8I400OPn02. Happy cruising!", "@lakeaspen1987 W'e're glad you had a great time!", "We know a thing or two about celebrating #InternationalChocolateDay:\n1) Travel internationally. \n2) Eat chocolate. https://t.co/ehMxXjkBUU", "RT @BonVoyageurs: The magnificent glaciers of the Alaska mountain range ! @PrincessCruises #Alaska #cruise #travel https://t.co/s5tdNzP4Cz", "@SassyLass1220 address your concerns.", "@SassyLass1220 has received your Onboard Evaluation. We will pass your comments along &amp; one of our team members will contact you to-", "@SassyLass1220 Hi Jessica, we truly apologize for your frustration. We located your booking, &amp; see that our Customer Relations Department-", "@SterlingMA Hi Michael, once #MajesticPrincess arrives in China, she will only be open to book through charters to residents of the PRC.", "We're excited to announce that we've won six Magellan Awards from @TWtravelnews! https://t.co/4y5wmj8KiQ", "@tuckerjr4478 Beautiful!", "@stephenescott2 Hi Steve, you can reserve massages through your Cruise Personalizer. Find information here: https://t.co/ygnuhQPkPw.", "Chart a course for adventure. https://t.co/0UDWxwkjuq", "@acadogan77 We are deeply sorry to learn of her health circumstance. Can you please provide her booking number, name, &amp; postal code via DM?", "@rjone22 Hi AR, thanks for asking about our Culinary cruise. The line up and events will be announced soon!", "@Loopsalot68 Hi Louise! Thanks for the kudos about our shipboard team!", "@amazzer43 Hi Carly! You can learn more about our drink packages here: https://t.co/7y1GRv2v8c. Happy cruising!", "@Mkat85 Hi Meagan, we truly apologize for your disappointment. We're having difficulty locating your booking. Can you please send via DM?", "@rudylflores Hi Rudy, we're happy to learn that our shipboard team member could be of assistance!", "@arieltheanglo Hi Ariel, thanks for asking about our promotions! You can find information here: https://t.co/eQY8WgjeOC. Happy cruising!", "@skinnylc Hi Laura, thank you for choosing Princess!", "RT if you'd rather be gazing at this view! https://t.co/TWqECXYpP9", "Discover Hawaii's infinite beauty. https://t.co/kajdups4pZ https://t.co/6pRltONRZj", "Love our production show \"Magic to Do\"? The soundtrack is now available on iTunes! https://t.co/x1QNbVXHCG", "@spacedognj Hi Billy, we see that Crown Princess called in Ketchikan on schedule and apologize if you may have had a poor experience.", "Bask in warm seabreezes. #ComeBackNew https://t.co/gBmqth3pHW", "Delight in the center of it all. #ComeBackNew https://t.co/8J5WIxwW86", "Look to the skies. #ComeBackNew https://t.co/EYYJknbOmh https://t.co/lV6dyVbGzp", "Chocoholics, rejoice. https://t.co/khteff3T2z https://t.co/Uyx4YSHlr6", "@russjparker1812 Hi Russ, and you please provide the crew members name?", "@LacrossFan Reservations are made at The Sanctuary. Happy sailing!", "@LacrossFan You can book Al Fresco massages once onboard. Find more information here: https://t.co/hT20l9EoBe. Happy cruising!", "@MotorCarnage Please see the Guest Relations Desk onboard for assistance.", "@MotorCarnage What are the names on the booking, postal code, ship, and sail date?", "@lanfromnam You can send the request to media@princesscruises.com. We look forward to welcoming you onboard!", "@SoWhatEnt You can contact us at Entertainment@princesscruises.com.", "@MotorCarnage Hi Shaun, can you please provide your booking number via DM?", "@stephenescott2 Thank you for choosing Princess, Steve. We can't wait to see you again next year!", "@ahigham27 Relations (PCUK.CustomerRelations@princesscruises.co.uk) so that we may address your concerns.", "@ahigham27 Hi Amanda, We sincerely apologize for your disappointing experience onboard #EmeraldPrincess We hope that you contact Customer -", "@cjaycy Hi Caroline, we're thrilled that you had a great time!", "@ensredshirt We show it active and current: https://t.co/2kFJa0zPCg", "Come back refreshed. https://t.co/LTXpcmC1gT", "@edd342 are pastries and coffee's still available. We look forward to welcoming you onboard!", "@edd342 Hi Ed, coffee cards are available on #PacificPrincess in machines in the Horizon Court &amp; Deck 5 outside the Club Restaurant. There", "@TiffanyK0622 Hi Tiffany, can you please provide your parent's booking number via DM?", "@zabmanic members. Do you still need assistance?", "@zabmanic Hi Barry, we apologize for the delay. We were able to locate your booking and see that you were working with one of our team -", "Discover timeless treasures and unexpected architecture. #ComeBackNew https://t.co/gguCdu0b1S https://t.co/0tz8xnGpds", "@tarynnasauruss Hi Taryn, can you please send us their booking number via DM?", "@angelalhorton Hi Angela, we're glad you had a great time!", "Our kind of day!  https://t.co/lQMT0RFAtx", "@currymonsteruk https://t.co/1MvJJeACA1. We look forward to seeing you onboard soon!", "@currymonsteruk Hi Terry, the $25.00 is a processing fee for all issued-upon-arrival visas. For more information please see-", "@snipster25 One of our team members will be happy to assist you. We look forward to seeing you onboard in the near future!", "@snipster25 Hi Ian, we sincerely apologize for your frustration with booking a cruise on our website. Please contact us at 0843 374 4444. -", "@mrsluckymomma shipboard team.", "@mrsluckymomma Hi Vicki, we're truly sorry to learn of this incident during your current voyage, We've shared your concerns with our -", "@bloefeld437 Hi Michael! We're thrilled we were able to help you #Comebacknew To what destination are you sailing with us to next?", "Find adventure wherever you sail. #ComeBackNew https://t.co/GBsC12VIY4", "Your next indulgence. #ChocolateJourneys https://t.co/YoDSzmsfu0", "Serenity at sea. #ComeBackNew https://t.co/NcQmTPRi7B", "RT if your idea of a perfect afternoon is cobblestone streets and freshly-made gelato! https://t.co/WjoMxWCWiY https://t.co/XUgAXhWEAg", "Find your happy place. #ComeBackNew https://t.co/Xz0KX9L1pC", "@QVCtchr We're thrilled to hear that you are enjoying them!", "@QVCtchr Excursions Desk onboard to discuss your concerns &amp; how they can improve your experience during the rest of your voyage.", "@QVCtchr Hi Denise, we deeply apologize for your disappointment with your shore excursion in Edinburgh, We hope you connect with the Shore -", "@thismodernliz of our team members will be happy to assist you.", "@thismodernliz Hi Liz, we apologize for your frustration. If you wish to stop receiving mailers from us, contact us at 1-800-Princess. One -", "Sunny days ahead. #ComeBackNew https://t.co/ooaeljvzeL", "@AbFabSkyLife Hi Scott, we sincerely apologize for your frustration. Can you please DM your booking number?", "@kctrvl as we assist each guest or Travel Agent. We appreciate your understanding and look forward to serving you.", "@kctrvl Hi Enrique, we truly apologize for the delay. Although we strive to answer each call as quickly as possible, there can be delays -", "@combatcatm We apologize for your frustration. Suites and mini suites on #DiamondPrincess are fitted with electric bidets. Happy cruising!", "@StevenPhillipp Hi Steven! #CaribbeanPrincess will sail transit through the new locks in the 2017/18 Panama Canal season. Happy cruising!", "@ProblemPrinces2 We sincerely apologize for your frustration! Can you please provide your name and booking number via DM?", "@tbentley2010 Hi Tony, you can contact our UK team at 0843 374 4444.", "Be spellbound by the Alaska sky. #ComeBackNew https://t.co/gpTBZrBm0v", "@KimJago Hi Kim! That's #RoyalPrincess", "@tangelicanew Hi Tangelica, you can email us at entertainment@princesscruisies.com to inquire about guest performers.", "@Johnvernon74 Hi John! Your booking reflects a queen bed configuration request. We look forward to welcoming you onboard #RoyalPrincess", "@sallyshaw5 Hi Sally! That's in Costa Rica!", "@Lea_b25 Hi Leanne, please try now.", "@iGrowCash Hi Manoj, Glad you enjoyed #CrownPrincess to Alaska!  We will pass along your request to the appropriate department.", "@bluedelphi76 We are truly sorry to learn of this. Can you please send us your booking number via DM?", "@MUSANIPHOTO Hi Phil, for the security of hour guests and crew, we made the necessary decision to change the itinerary.", "@ahigham27 Hi Amanda, we truly apologize your disappointment during your current voyage. We've shared your concerns with our shipboard team.", "@Lea_b25 Hi Leanne, please send us your parent's booking number via DM.", "@tjdaniels88 Hi Tyrone, we are having difficulty locating your booking number. Please send via DM.", "@psychstud69 We apologize for delay of disembarkation due to high winds. Thanks for choosing Princess, we hope to see you again soon!", "An unforgettable night starts here. https://t.co/2YNjt5Z3V1", "@joanna1945 Hi Joan! Thanks for asking about our cruises. You can find information here: https://t.co/lrlFiwz3Go. Happy cruising!", "@KRFaire Thanks for reaching out! You can contact us at media@princesscruises.com. Cheers!", "@TDorsey86 Hi Trey, thank you for your service! Yes, we have a Military Cruise Benefit Program:  https://t.co/Tyd4cnrYI2. Happy cruising!", "@tangelicanew Hi Tangelica, can you please clarify your request?", "Discover what a little sea spray can do for the soul. #ComeBackNew https://t.co/ag31TMrsUC", "@ahigham27 We sincerely apologize for your disappointment. Can you please send your booking number via DM?", "Check out their gorgeous European adventures here: https://t.co/4QMqgR7clK https://t.co/Y1IAFqdU07", "RT @CoachDebLuxton: Loving this incredible view! #Denali30percentclub #Alaska @PrincessCruises https://t.co/ILweo02Gvz", "Fall in love with places unknown. #ComeBackNew https://t.co/dDrVMH9f4l", "@sezzyh27 We appreciate your understanding for these necessary changes &amp; look forward to welcoming you onboard #RoyalPrincess", "@sezzyh27 Hi Sarah, we sincerely apologize for your disappointment with the change of itinerary for the safety of our guests &amp; crew.", "@vj2w Hi Vishal, we sincerely apologize for your disappointment. Can you please send your booking number via DM?", "Choose adventure. #ComeBackNew https://t.co/T2zriRELiE", "So many bucket list experiences! https://t.co/ZbMAqGlBJb", "Indulge in carefree, sun-soaked days in the Caribbean. #ComeBackNew https://t.co/hXfp09WHdV", "Happy #NationalDogDay from our friends up north! https://t.co/evhCaO7B5u", "The only question is where to go next. https://t.co/6dNkkD1xX4", "RT @MatthewLebbern: Great view from the bridge tonight onboard Royal Princess #TheCruise https://t.co/ikJOtyWYah", "Happy 100th birthday, @NatlParkService! #NPS100 https://t.co/5bNKAc7wu0", "@NoreneWilliams Hi Norene, our Community Foundation Department will respond to your email shortly.", "@MUSANIPHOTO Hi Phil, https://t.co/rn8UC8CWnq should be updated by end of next week.We look forward to seeing you soon!", "ICYMI: Meet our newest ship, #MajesticPrincess! https://t.co/xwTeMJA03Z", "@PlayPartyPlan Hi Britni, we'll be ready when you are!", "@MUSANIPHOTO Hi Phil, we are looking into your question and will follow up once we have details.", "Steal away for a quiet coffee from a sidewalk cafe. #ComeBackNew https://t.co/vGLR2O71fi https://t.co/rsqxm1oXaB", "@KellyLyons8 Nicely done!", "@HarryCotterill Hi Harry! Deck plans for #MajesticPrincess are being updated now. Check back here: https://t.co/BTHvD6tvsD.", "@bibliojoan We apologize for the frustration! If problems persist please contact 1-800-Princess to help troubleshoot.", "@benmling Hi Ben! We're thrilled that you like the new features on #Majestic Princess and hope to see you onboard soon!", "@drleebailey Hi Lee, please follow us so we can respond via DM.", "Introducing #MajesticPrincess! https://t.co/xwTeMJA03Z", "@kgeldis your voyage itinerary given the evolving situation &amp; circumstances. We look forward to welcoming you aboard Royal Princess.", "@kgeldis Hi Kali, we're sorry for any disappointment this change may cause &amp; appreciate your understanding for the multiple changes to -", "@webb_beemr65 Hi Brenda, we like planning ahead. See you in November!", "@MichelleMansze not available to share, we look forward to serving it to you on your next cruise!", "@MichelleMansze Hi Michelle, we're glad you enjoyed the Goat Cheese, Roasted Bell Pepper and Orzo Pasta Salad! Although the recipe is -", "@JohannaACastro Gorgeous!", "@travelbrewson information here: https://t.co/tTT87xJ7nG. We look forward to seeing you soon!", "@travelbrewson Hi Cody! Cub Class benefits for select mini suites will go into effect on December 10th on #RubyPrincess You can find", "Roll call! RT if you're planning to cruise this autumn. https://t.co/xj6gGRtg0w", "Meet new furry friends in the Great Land. https://t.co/0p3XNWU5MG https://t.co/4nwjEVPNP2", "@Rosi_chun Hi Rosichun, thanks for your interest in joining our team! For employment information please visit: https://t.co/EC2yc3vH8w.", "@TurinAramaia Please advise us of  the ship, sail date, your name as it appears on your booking, and zip code.", "@JohannaACastro Looking good, Johanna!", "Come back captivated. https://t.co/pyvXPPlfYJ", "Find paradise in colorful side streets on a quiet afternoon. #ComeBackNew https://t.co/BAVwuUh7fN", "@VagabondNL Until you can join us onboard, here is some champagne to go with our #PrincessChocolate https://t.co/7Jv1X88dQ7", "@twilightmelfina You are correct! We're so glad you enjoyed our #PrincessChocolate", "RT if you want a bite! #ChocolateJourneys https://t.co/wMzblKca0D", "@JJHOUDE Hi Jean! We're thrilled that you had a great time!", "@TurinAramaia We sincerely apologize for your frustration. Can you please send us your booking number via DM?", "@ivagripe We sincerely apologize for your frustration. We are having difficulty locating your booking number. Can you please send via DM?", "@JayScottRadio Hi Jaime, thanks for your interest in joining our team! For employment information please visit: https://t.co/EC2yc3vH8w.", "@neonbubble Hi Mark, we apologize for your frustration! Can you please send us your booking number via DM?", "Relax on sun-kissed shores. #ComeBackNew https://t.co/NpZACkMikV", "Bon appetit! https://t.co/RiaiW7vTLb", "At sea, every day feels like the weekend. #ComeBackNew https://t.co/VPeUa6OHS4", "We're thrilled to feature William Ivey Long's tremendous designs in our new production show, Born to Dance! https://t.co/Su2Sfya4nJ", "Marvel at glaciers. #ComeBackNew https://t.co/uBIsKWorzI", "@scotts_cruises Beautiful!", "@SueGarner02 eye out for special offers for your area!", "@SueGarner02 Hi Sue, we have different promotions, offers, and pricing for all regions inside and outside of the U.S.  Be sure to keep an -", "Discover a world of colors. #ComeBackNew https://t.co/DJ05McKVMx", ".@AbbeyWeitzeil We're so proud that our hometown hero brought home the gold! Can we give you a cruise to help you relax &amp; #ComeBackNew?", ".@AnthonyErvin We're so proud that our hometown hero brought home the gold! Can we give you a cruise to help you relax &amp; #ComeBackNew?", "@Geoffa30 Hi Geoff, we're thrilled that you enjoyed #Bergen &amp; wished we could have stayed for a longer visit.", "@ReneeGrebe Hi Renee, unfortunately, #TheCruise program is not broadcast in the USA.", "@travelbrewson Hi Cody, unfortunately, #TheCruise program is not available in the USA.", "@georgemunro_cam Hi George! Thank you for the warm welcome! Cheers!", "@SeanLXIV Hi Sean, until you can enjoy #PrincessChocolate again, here''s some champagne as a nice accompaniment. https://t.co/HFRytOWKN2", "There's always room for dessert. Always. https://t.co/dPcKtPEpiV", "@harker_79 sport coverage onboard #EmeraldPrincess", "@harker_79 Unfortunately, it's not a channel we have on any of our ships. We do have ESPn &amp; Sport 24 which both offer a wide variety of -", "Wherever there's an ocean, we'll take you there. https://t.co/oMCEeGYLg5", "@JohncVGP Hi John! You can contact us at media@princesscruises.com. Happy cruising!", "@Arichmanfl Hi Al, we can't wait either! #ComeBackNew", "@Arichmanfl guest who didn't advise us of that information. Hope to see you onboard soon!", "@Arichmanfl Hi Al! Unfortunately, we can't tell you the name of the ship or the year this photo was taken. It was submitted by a fellow", "Dreams go farther here. https://t.co/QORRfIhPQF", "@methhamfetabean https://t.co/rn8UC8CWnq for updates. Happy cruising!", "@methhamfetabean Hi Kim! Glad you are excited to see #MajesticPrincess She's still under construction at the ship yard. Please check -", "@mariamichle29 onboard #CrownPrincess in October!", "@mariamichle29 Hi Maria! Congratulations to you and Janet! We wish you a life time of wedded bliss and look forward to welcoming you both -", "@keithcleer pricing. Please contact us at 1-800-Princess. One of our team members will be happy to assist you. Happy cruising!", "@keithcleer Hi Keith, we apologize for your frustration. Club Class MS and MS - M1 &amp; MB are two separate categories with different  -", "Check out the results of our #NationalRelaxationDay survey!  https://t.co/uRrVSYLLNy", "@fluffyflo Hi Florence, we are having difficulty locating your booking in our system. Can you please send your booking number via DM?", "RT if you've ever taken a day off just to sleep! #NationalRelaxationDay https://t.co/loNyY8ampn", "@jetsetpam Hi Pamela! We love your adorable photo! Cheers!", "Private lounger and a good book? Yes, please! #NationalRelaxationDay https://t.co/VGaHUmIdsP", "Bliss out with this Princess-inspired DIY argan oil chocolate mask from @SmartSchoolHous: https://t.co/OI9Ltii9a1 #NationalRelaxationDay", "@RayMariano Hi Ray, apologize for your unsatisfactory experience in our Lotus Spa. We're sharing your comments with our onboard team.", "@SCVEDC But on a cruise, even Mondays feel like Saturdays!", "It's #NationalRelaxationDay! Tweet us a pic of your favorite way to relax during a cruise.", "@CaroDunelm Hi Carolyn! We're thrilled that you had a great time. We hope to see you onboard again soon!", "@Greg_Pomes Hi Greg, we do sail out of New York! You can find information here: https://t.co/lrlFiwz3Go. We hope to see you onboard soon!", "Great tips for taking video of your cruise!  https://t.co/JsjRKT8dS5", "California dreaming. https://t.co/3OV7WsCOEq https://t.co/nMmaXI0aw4", "Discover a new point of view. #ComeBackNew https://t.co/36UCINXJF5", "Dinner: irresistible. https://t.co/yLUY7D2VKv https://t.co/9Wj0xAfRqu", "RT @CruiseCritique: Even on a cloudy day the Fjords are still stunning @PrincessCruises #EmeraldPrincess https://t.co/5FZ410vIVT", "@KateShez don't worry Kate, we're filming a new series as we speak and series 2 will be out early next year :)", "@LoveLovecaz 217 foot high, 1,083 foot long and weighing a mighty 141,000 tonnes, the Regal Princess is quite a big ship!", "Sea days are the sweetest. RT if you agree! https://t.co/6gMD4WkwQ6", "What daydreams are made of. #ComeBackNew https://t.co/yexdx2PPca https://t.co/SKW4rJ7wrO", "@laceyhowie Hi Lacey!  We wish we could help make the days go by faster. We look forward to welcoming you onboard!", "@mynameisrob Hi Rob, thanks for your interest in joining our team! For employment information please visit: https://t.co/EC2yc3vH8w.", "Eat your way through Alaska with @ByronTalbott. https://t.co/IXPYudT0LC \n\nTell us: what's your favorite food to eat on an Alaska cruise?", "@hottotrot1 You're making us hungry!", "@lisa_eatsworld Hi Lisa! You can contact us at media@princesscruises.com. Happy cruising!", "@mrandmrs_photo We are thrilled to hear that you are having a great time! #ComeBackNew", "@MylesssDev Hi, it's airing on ITV from 8.30 until 9 this evening - let us know what you think!", "@netrix_ Hi Netrix - it's a repeat of the first series. Hope you enjoy!", "RT if you're wishing for a wake view right about now! #ComeBackNew https://t.co/fsC9b1aiy9", "Celebrate Alaska Wild Salmon Day at home with this pine nut crusted salmon recipe: https://t.co/Octdana2hv #AskForAlaska", "@vacationplantom Hi Tom! We are so glad you enjoyed your #Alaska cruise onboard #RubyPrincess What destination are you thinking of next?", "@Wraslar Hi Andrew, we apologize for the delay. Please contact us at 0843 374 4444. One of our team members will assist you.", "@zakolly0814 Your email has been received  by our Property Claims Department. One of our team members will contact you soon!", "@mcmusic73 Hi Amy, we apologize for your disappointment. We are having difficulty locating your booking. Can you please send via DM?", "Give your daydreams a better backdrop. #ComeBackNew https://t.co/nNg1q3Ahlt", "@DavidLTrench Hi David, we apologize for the delay yesterday, and hope to exceed your expectations on the remainder of your voyage.", "@TurinAramaia We are having difficulty locating your booking number. Can you please send it to us via DM?", "@WineGrapeStone Hi Tricia, you're making us hungry!", "@chitownstarcon Hi Melanie! You can contact us at media@princesscruises.com. Happy cruising!", "Float your cares away. #ComeBackNew https://t.co/Tws0IyJY4d", "@brianltabor Breathtaking!", "@gvicharbour Thanks for the warm welcome GVHA! Cheers! https://t.co/FGQbPp23KW", "@JohannaACastro Thank you for sharing with us Johanna!  We love meeting people and making new friends around the world!", "@travelbrewson Hi Cody, we think our #LuxuryBed will help you #ComeBackNew", "@LemonDroppp69 Hi Asian, you can learn about our cabin amenities here: https://t.co/xny8l5lYNp. Happy cruising!", "@NoreneWilliams Hi Norene, contact our Princess Cruises Community Foundation (communityfoundation@princesscruises.com) for consideration.", "@VijPunjabi2000 for assistance in booking one of our cruises. We look forward to seeing you onboard in the near future!", "@VijPunjabi2000 Hi Vijay, We sincerely apologize for your frustration. Please contact Daphne Barbeito (daphne@grandeventspr.com) at GETS -", "@mmaayah concerns with our shipboard team.", "@mmaayah Hi Malek, we deeply apologize for the stateroom odor &amp; your discomfort during your current voyage. We've shared your comments &amp;", "@_jordanperry remainder of your voyage.", "@_jordanperry Hi Jordan, sincerely apologize for your frustration in trying to contact us. We hope to exceed your expectations on the -", "@iNitrox1 it depends ship to ship, which one are you travelling on?", "@desertgene where are you head to? Not long now!", "Delights in every direction. #ComeBackNew https://t.co/i5QYj481Ig", "See the best of Bruges, Belgium, in a day. #PrincessRTW https://t.co/T4O5si4tBK", "Adventure's on the horizon. #ComeBackNew https://t.co/UE9xrF4zoM", "A moment you'll treasure in a place you won't forget. https://t.co/vGEjaCRQZz", "@JohannaACastro Hi Johanna! The #PanamaCanal is one of our favorites. Enjoy!", "For those days when you need a little paradise in your life... #ComeBackNew https://t.co/4vmVlZg5N5", "Plan the perfect day in Lisbon with help from blogger @JohannaACastro. #PrincessRTW https://t.co/YCOTiDcUp8", "Spend a carefree day by crystal-clear waters. #ComeBackNew https://t.co/oJQwuY8oi0", "@travelbrewson Hi Cody! Changes to #RubyPrincess have not been announced yet. We look forward to welcoming you onboard again in October!", "There's no better place to celebrate #IPAday than at sea, especially when our Seawitch West Coast IPA is involved. https://t.co/0YPIpjPxpt", "@CruiseBuzz Hi Carrie, the Wine Maker's Dinner must be made onboard the vessel. Happy cruising!", "@methhamfetabean Hi Kim! Glad you had a great time!", "Discover what it's like to cruise the Suez Canal. https://t.co/iHzd8HcoTX #PrincessRTW (via @JohannaACastro)", "Bask in pristine beauty. #ComeBackNew https://t.co/brlQu5XLBj", "Tonight's craving. https://t.co/pzB290uS3a", "@davidbranigan impact power to the rest of the ship.", "@davidbranigan Hi David, the cause of the temp loss of propulsion was a glitch in the electrical system in the engine room. It did not -", "@Garryc Hi Garry, we apologize that  we were not able to take you to Dublin today. We look forward to taking you to Belfast!", "@ShedOnBeach We do not have kettles in our staterooms onboard our vessels.", "@SLThom7614 Hi Steph, we are having difficulty locating you on our system. Can you please send us your booking number via DM?", "@ShedOnBeach We look forward to welcoming you onboard #EmeraldPrincess", "@ShedOnBeach Did you mean Anything Dining? That would be the Michelangelo Dining Room. You can learn more here: https://t.co/ymfGEGnSMS, -", "@kerry33au1 you onboard #DawnPrincess", "@kerry33au1 Hi Kerry! The Premium Coffee Card is $36.00 AUD and the Ultimate Soda package is $7.00/Day AUD. We look forward to welcoming -", "@davidbranigan restored propulsion.", "@davidbranigan Our Fleet Technical experts, working in collaboration w/ the Captain and Chief Engineer aboard the ship, have successfully...", "@davidbranigan All guests and crew are safe and secure.", "@davidbranigan The ship has electrical power and is operating full ship/hotel services, inc. air conditioning, galleys, lighting &amp; toilets.", "@davidbranigan Hi David, Caribbean Princess lost propulsion approximately 25 nautical miles southeast of Dublin in the Irish Sea.  (cont.)", "@CaroDunelm Hi Carolyn, we apologize that we are unable to visit Dublin today. We look forward to taking you to Belfast!", "@irishetchings The ship is now enroute to Belfast, the next port of call on the itinerary.", "@Arichmanfl Can't say we disagree...", "@lindadrakequack Those all look lovely Linda!", "@comerford11 Time flies on a cruise! Enjoy your last two days!", "@BeverleyBooth Enjoy Gibraltar, Beverley!", "@Tarpaflex will automatically receive a refund to their shipboard hotel folio. Further impact on the itinerary is not yet known at this time", "@Tarpaflex assistance has been called in the form of a tug boat to tow the ship to a nearby port w/ the resources to assist in restoring...", "@Tarpaflex working in collaboration with the Captain and Chief Engineer aboard the ship. While the technical issue is being assessed...", "@Tarpaflex All guests and crew are safe and secure. The cause is unknown at this time &amp; is being assessed by our Fleet Technical experts...", "@Tarpaflex Hi, the ship has electrical power and is operating full ship/hotel services, including AC, galleys, lighting &amp; toilets. (cont.)", "@Garryc assistance has been called in the form of a tug boat to tow the ship to a nearby port with the resources to assist in restoring...", "@Garryc working in collaboration with the Captain and Chief Engineer aboard the ship. While the technical issue is being assessed...", "@Garryc All guests and crew are safe and secure. The cause is unknown at this time and is being assessed by our Fleet Technical experts...", "@Garryc Hi Garry, the ship has electrical power and is operating full ship/hotel services inc. air conditioning, galleys, lighting, toilets.", "Experience the 2016 Sea Princess World Cruise with @JohannaACastro as she passes the halfway point! #PrincessRTW https://t.co/YF1tDG1qOP", "Sit back and take in the ocean view. #ComeBackNew https://t.co/4QtRhgkX1v", "@NZanicchi That sounds really good to us right about now!", "@ianpowl Hi Ian! The #CaribbeanPrincess bridge cam is up and running. You can see it here: https://t.co/2kFJa0zPCg. Happy cruising!", "@jscavo We sincerely apologize for this oversight when preparing your cabin for your arrival. Please send us your booking number via DM.", "The journey is as extraordinary as the destination. #ComeBackNew https://t.co/fzEcmBXxQh", "@anmuggianu Hi Annalisa! Thanks for reaching out, but that is not a Princess owned ship. Happy cruising!", "@VisionCruise_UK Sure! You can pair it with some #PrincessChocolate https://t.co/fYatzFppd1", "@scottlara1961 Hi Scott! Cheers! https://t.co/K2HZ64tlQK", "@CruiseRadio Hi Doug! Thanks for the shout out. Cheers! https://t.co/axELcYrsey", "RT @newdarlings: Our time in Portofino, Italy with @PrincessCruises on the blog: https://t.co/4ZKOIrPMQS https://t.co/NFNEjNbeJ8", "@zakolly0814 (pcuk.customerrelations@princesscruises.co.uk) and one of our team members will assist you.", "@zakolly0814 For the UK, you can call 0843 374 4444, and request Property Claims, or you can email them at -", "@bikeguy916 Hi J! We're thrilled that you had such a great time! #ComeBackNew", "Your next great journey could be closer than you think. #ComeBackNew https://t.co/SNFx0JbnfY", "Venture through history. https://t.co/3n11PWrJtB", "Time for weekend wanderlust. #ComeBacknew https://t.co/mqmKcyUX5c", "Which of these #7CruiseWonders are on your bucket list? https://t.co/u6IMifwXFS", "Explore a whirlwind of ancient sites and breathtaking vistas. #PrincessRTW https://t.co/1dbfYIZU2G\n\n(via @JohannaACastro)", "Your place to play. https://t.co/jycfUjEPbG", "Daydreaming about the Mediterranean? Get the scoop on cruising Europe from @ppinkygirl! https://t.co/C9v0HOL9aW", "Find your own oasis of calm. #ComeBackNew https://t.co/HBP4izaG8y", "@JamesStevenson Consider it done. https://t.co/95pZvI4JQs", "With indulgences like these, it's easy to save room for dessert! https://t.co/ZOXUEiUX6V", "@katmartinartist Hi Kat, we truly apologize for your frustration. Please send us your booking number via DM.", "@stryax Hi Helen, we apologize for your frustration. Please see: https://t.co/2kFJa0zPCg.", "@MelBaker16 Hi Mel, that is not a Princess managed page. Find our ship bridge cams here: https://t.co/2kFJa0zPCg. Happy sailing!", "Come back with stories to share. https://t.co/kAqb0Demud", "@kcessna Hi Kassie, can you please send us your booking number via DM?", "@sarahbuckx Hi Sarah! You can search our cruise itineraries here: https://t.co/lrlFiwz3Go. Happy cruising!", "@Aquasan Hayley Richardson - Vocals. They are a couple from the UK. Happy cruising!", "@Aquasan Hi Aqua! We're thrilled that you enjoyed Atomic, onboard #DiamondPrincess The members are: Peter Newberry - Guitar + Vocals &amp;", "@nicoleraudonis Hi Nicole! Thanks for reaching out! You can contact us at media@Princesscruises.com. Happy cruising!", "@brianltabor Hi Brian! What a beautiful photo. Thank you for sharing with us!", "Which of our top 10 cocktails have you tried onboard? https://t.co/VBd6ABiAyZ", "@DrKenBMoody @PeterHowarthXXX  Hi David, nice photo! Isn't Peter wonderful? Thank you for sharing with us. Happy cruising!", "@MelBaker16 Hi Mel, we apologize for any technical issues. #SeaPrincess bridge cam is now current. Happy cruising!", "@ASalmins89 Hi Andrea! Thanks for choosing Princess!", "@BeverleyBooth Adorable!", "@Vmattei Thanks for reaching out. We will keep in mind for our future planning.", "@ImAPrincessBlog Hi Danny! We're glad you are having a great time onboard #EmeraldPrincess", "@Tivoli_Travel Looking good!", "@richardcross7 Hi Richard! We appreciate the warm welcome. Cheers! https://t.co/yjUDZQmh4S", "@cruiseforsaving Hi Claire and Dave! You're making us hungry!", "@xdp75x We've shared your concerns with our shipboard team.", "@xdp75x Hi Dionne, we deeply apologize for your disappointment with the service in the Da Vinci Dining Room during your current voyage. -", "@DonaDean9 Hi Dona, you are welcome to email our Comminity Foundation at communityfoundation@princesscruises.com", "Escape to breathtaking ocean views, fresh, local flavors &amp; the chance to see someone you love in awe of the world. https://t.co/wjnTfuSwJK", "Sail into serenity. #ComeBackNew https://t.co/JGczM0QcNV", "Say aloha to island adventure. #ComeBackNew https://t.co/WdOLMTlfof", "Elegance never goes out of style. https://t.co/r48qB06XiR", "Roll call! RT if you've ever experienced an Alaska cruise. #ComeBackNew https://t.co/m324IwwPcL", "Want to meet these cuties? You don't have to go any further than the Piazza! https://t.co/F2izYQL6rK https://t.co/3wOKlG2aIO", "@WeezWalker have any security/safety concerns. We thank you for your understanding &amp; look forward to welcoming you onboard #RoyalPrincess", "@WeezWalker Hi Louisa, we sincerely apologize for your disappointment. We have in the past, and will continue to, cancel any ports if we-", "@AlmaLKlein #StarPrincess", "@AlmaLKlein Hi Alma! You can speak to the onboard Guests Services Desk regarding spending limits. We look forward to welcoming you onboard -", "Need a stress-free day at sea? https://t.co/G7JmB3AcQc", "@paulsnum14sure #MajesticPrincess which you can learn about here: https://t.co/BTHvD6tvsD Happy Cruising!", "@paulsnum14sure Hi Paul! Thanks for reaching out! You can find photos of #RubyPrincess here: https://t.co/L9FmN0Oy70. Our new ship is -", "Got wanderlust? Tweet where you wish you were cruising this weekend and tag #ComeBackNew!", "It's not a vacation until your jaw drops. https://t.co/yurCsF9LSV", "@rjone22 Hi Alan! Thanks for asking about our exciting Culinary Cruise. We will be making announcements soon. Stay tuned!", "RT if you need a sea day! #ComeBackNew https://t.co/8DqhG4oX2H", "See glaciers that dazzle. #ComeBackNew https://t.co/KUldjrinZJ", "@Mistyrobert hi there, we cannot confirm the exact date yet but we will be sure to let you know when do!", "Explore a world of color. https://t.co/0vrrILWxlX", "Because dining should be an experience. https://t.co/7mIQSMVha2 https://t.co/1DSZSTKXzJ", "Discover a technicolor paradise. https://t.co/0rJhQUL8dh https://t.co/2SzFsCnZGW", "@georgemunro_cam Hi George! Thanks for sharing with us!", "@mtrostler members today. We have contacted #GrandPrincess to advise of your delay.", "@mtrostler Hi Michelle, we empathize with your situation/frustration. We located your bookings and see that you spoke to one of our team -", "@zzoass our team members. We have contacted #GrandPrincess to advise of your delay.", "@zzoass Hi Mark, we empathize with what must be a very stressful situation. We located your bookings and see that Michelle spoke to one of -", "@JackSchoolrock1 Hi Jack, thanks for your feedback. Happy cruising!", "@andyaldy1974 https://t.co/341L4Vd1lP", "@andyaldy1974 Hi Andrew! We would love to have you have you onboard with us! Find information here for what's new and exciting:", "Raise a glass to summer at sea. #ComeBackNew https://t.co/2IUdaxebYY", "Eat your way through Alaska with Chef @ByronTalbott. https://t.co/IXPYudT0LC", "@sarahjbc123 Hi Sarah, we sincerely apologize for your disappointment. Can you please send your booking number via DM?", "@audal29 Hi Audrey! That's St. Thomas!", "@ABOfmyheart We agree, Marsha!", "Alaska's beauty is spellbinding in the summertime! https://t.co/qL11JXL09x", "@Michael_Gator Hi Michael! We can't wait either!", "@Jolly_76 Hi Lynn, thank you for reaching out. Please contact us at propertyclaims@princesscruises.com", "@naeem_qayyum Hi Naeem, thanks for your interest in joining our team! For employment information please visit: https://t.co/EC2yc3vH8w .", "@Sexyktcat Hi Cathlynn, you can contact Royal Ocean Events at info@royalwed.com. We hope to see you onboard in the near future!", "@toddnelmes Hi Todd, thank you for letting us know about the lost name badge. Can you please follow us back so we can DM?", "@canuckfanmdm Hi Maureen, we apologize for your frustration! Please contact us at 1-800-Princess to help troubleshoot.", "Destination: paradise. https://t.co/aNUexLhNoW", "Wind down with sunset at sea. #ComeBackNew https://t.co/FDat2nSeFQ", "@ChristinaLinaG Hi Christina! Thanks for sharing with us! #ComeBackNew", "@cruiseboston Thank you for the warm welcome! Cheers!", "@mrbenny58 @VisitLiverpool Hi Rick! #CaribbeanPrincess is scheduled to arrive at #Liverpool at 8:00AM and depart at 9:00AM. Cheers!", "@JohannaACastro We love your smile, Johanna!", "@lorenkaho unfortunately it's currently only available in the UK but we will keep you updated :) - and you may see a crew on board!", "@LanzerPhotoArt the views are so spectacular that a camera is a must!", "Celebrate #NationalIceCreamDay with sunshine on your back and sea breezes in your hair. https://t.co/Gk9AxIjVxV", "Unwind on sun-kissed beaches. #ComeBackNew https://t.co/ePlojJKfiH https://t.co/ljG58Yht2q", "@KarimAmr74 Hi Karim, we will reach out our guests directly if their itineraries are impacted.", "@Matt5553 Hi Matt, due to security concerns, we have made the necessary decision to cancel the July 28 Royal Princess visit to Istanbul.", "@jrgsstuff We look forward to helping you #ComeBackNew next year! And if we don't see you, we'll know you had a visit from the stork :)", "Embrace that Friday feeling. #ComeBackNew https://t.co/F7VSBY31Qm", "@dearjackhq We appreciate the important work that you do. Glad to be involved!", "@EatSleepCruise We're excited you'll be joining us onboard to #ComeBackNew!", "Want to travel around the world? Get the scoop from @johannaAcastro! #PrincessRTW https://t.co/5dw7esBp0y", "Venture where rich history and breathtaking landscapes meet. #ComeBackNew https://t.co/8nd2VjnpZY", "@beanie1706 Hi Sophie! The areas on the outside edge of those cabins are ship structure. Happy cruising!", "@BozinovicJelena to see you onboard in the near future!", "@BozinovicJelena Hi Jelena! Thanks for reaching out! You can search for a Travel Agent from our site here: https://t.co/F7c2GqBGtu. We hope-", "@tangerinect Hi Lia, you can contact us at 1-800-Princess or customerrelations@princesscruises.com", "@tangerinect team members can address your concerns.", "@tangerinect Hi Lia, please contact our Customer Relations Department (PCUK.CustomerRelations@princesscruises.co.uk) so that one of our -", "@JohannaACastro Hi Johanna! Thanks for sharing. That looks really good to us right about now!", "@etherbert Hi Evan! Which of our fabulous destinations are you thinking of cruising to next?", "Explore Golden Princess on your very own virtual cruise. https://t.co/9i3E0uVHXW", "@ChuckDean3 us your booking number via DM and a brief description of the issue?", "@ChuckDean3 Hi Chuck, we sincerely apologize for your frustration. We are having difficulty locating you in our system. Can you please -", "Indulge your adventurous spirit. #ComeBackNew https://t.co/T004v0wyjL", "Quench your thirst with exclusive craft beers you can only find at sea. https://t.co/eYwEju17SZ https://t.co/L7byXbSih5", "@zakolly0814 you onboard #RoyalPrincess", "@zakolly0814 We have self-serve launderettes onboard! You can find information here: https://t.co/xny8l5lYNp. We look forward to welcoming -", "@MatthewNoles Hi Matthew, we love the adorable photo!", "@exist1980 Hi Kenny! Thanks for sharing these great photos from #CaribbeanPrincess with us! Happy cruising!", "@LemonDroppp69 Our Princess Messenger is available through a web browser. The APP is not available yet, were are doing some fine tuning!", "Pool days never go out of style! https://t.co/p9PKPOwhaS", "Find yourself at sea. #ComeBackNew https://t.co/naX1tmxUhZ", "@bethanykhenson briefly advise us of the situation via DM?", "@bethanykhenson Hi Bethany, we sincerely apologize for your unsatisfactory experience. We were able to locate your bookings. Can you -", "@AlixL82 Hi Alexandra! You can contact us at 0843 374 4444. One of our team members will be happy to assist you!", "@everyavenuemag Fjordland National Park, NZ.!", "@JeremyPalmer7 Hi Jerry! We carry Bacardi White &amp; Cruzan Coconut Rum onboard. Happy cruising!", "@Lucy_Huxley Hi Lucy! It's our pleasure. Enjoy!", "@TheTravelProUS Hi Carl &amp; Jamie! Thanks for sharing with us. We're thrilled that you enjoyed your Alaska cruise onboard #RubyPrincess", "@ROBINSONSBAR Thank you for the warm hospitality! Cheers! https://t.co/Wx3sxM3KpB", "@themomjen Hi Jen! We're thrilled that you enjoyed your #CrownPrincess cruise. Thanks for sharing with us! #ComeBackNew", "@TGPickern We'll be ready when you are!", "@walterbiscardi Hi Walter! We're thrilled that you enjoyed your #SapphirePrincess cruise to #Alaska so you could #ComeBackNew", "@african_sol Ahh,  thank you Bell family for your kind words! We love taking you to beautiful destinations around the world! #ComeBackNew", "@TheSpartacat Hi Kenny! We're thrilled that you enjoyed it! Who was your favorite performer? #ComeBackNew", "@DaphneBarbeito Hi Daphne! We love your beautiful smiles! #ComeBackNew", "@baycentrevic Thank you Bay Centre! We always enjoy our visits with you. Cheers! https://t.co/bMSaK8M7M9", "@babygoats5 We sincerely apologize for the error. Can you please send your Captain's Circle number via DM?", "@everyavenuemag We like your style! #ComeBackNew", "Surround yourself with beauty. #ComeBackNew https://t.co/eCDAZv60Xe", "@janisbjones Hi Janis! Thanks for sharing with us!", "@SalV1953 Hi Saul! Glad you had a great time. Thank you for choosing Princess!", "@JohnMcManus40 Hi John! Congratulations!", "@soucruise Good morning, Justin!  Thanks, as always for the warm hospitality. Cheers! https://t.co/dxoHok2Cx8", "True or false: four islands are better than one. https://t.co/MET7rTGKmZ https://t.co/pU3rFW0mmB", "@JenG217 Relations (customerrelations@princesscruises.com) so that we may address your concerns.", "@JenG217 Hi Jen, we sincerely apologize for your disappointing experience onboard Crown Princess. We hope that you contact Customer -", "@livvylandblog Hi Olivia! Looking good!", "Get close to the world's wonders. #ComeBackNew https://t.co/dlhVesGlUA", "The Voice of the Ocean can't be missed! https://t.co/J7QMuFNHhW", "RT if you daydream about this view! #ComeBackNew https://t.co/LNzXw9ZMjJ", "Come back rested. https://t.co/HlijM5zupD", "@nestorsaludo 800-367-4777 and their Twitter handle is @MorganStanley.", "@nestorsaludo Hi Nestor, you will need to contact Morgan Stanley, Their website is https://t.co/wxAcXQfY5c. Their phone number is -", "@nestorsaludo Hi Nestor, we are looking into your inquiry and will follow up once we can provide more details.", "@Retired103 We are having difficulty locating you in our system, Can you please send your booking number via DM?", "@D3TShaw Hi Tim! Welcome onboard #RoyalPrincess #ComeBackNew", "Color your world with wonder. #ComeBackNew https://t.co/DnalqjPJRd", "@DineandDish And they all pair well with a pina colada!", "@PurBldPrincess Hi Sarah! We'll have plenty of #PrincessChocolate ready for you! https://t.co/lqcSrKvEPa", "We couldn't decide between milk, dark or white chocolate for #WorldChocolateDay.\n\nSo we picked \"all of the above\". https://t.co/qbigM6SYLs", "@JenG217 Hi Jen! We love your smiles! #ComeBackNew", "@benjithfc180 Hi Martin! Thanks for asking about our itineraries! You can search information here: https://t.co/lrlFiwz3Go. Happy cruising!", "@t_harwood1980 Hi Thomas! Enjoy #CaribbeanPrincess Cheers! https://t.co/QhV7MmVOOE", "@Kanoo_Soton Thank you for the warm welcome! Cheers! https://t.co/bGPKX5Pn5M", "@Change_2day Not  classified as \"prenatal\" but we have other onboard offerings to choose from!", "@Change_2day $160 - $350. This price range is dependent on length of message selected.", "@vanessahhyde Unfortunately, we were not able to secure rights to broadcast the Olympic games onboard #RegalPrincess.", "@Change_2day It's $45.00 for a 45 minute procedure, and available on sea days only. See you on Saturday!", "@vanessahhyde Hi Vanessahh, we are looking into your question and will follow up once we can  provide details.", "@SeanDanielOH Hi Sean, we sincerely apologize for the delay.  We will pass your comments along to the appropriate department.", "@K_Dudders07 Hi Kristy! Our onboard Cruise Director and team will plan/announce any themed programming for the evening. Happy cruising!", "@ksrichman Please inquire with your Travel Agent for next time. Happy Cruising!", "@ksrichman Hi Katharine! We're thrilled that you enjoyed your #RegalPrincess cruise! We offer post cruise shore excursions &amp; packages. -", "@gconklin93 Hi Camille, we can't wait either!", "@bayouwriter https://t.co/8I400OPn02. We hope to see you onboard soon!", "@bayouwriter Hi Browne, #RoyalPrincess is doing a ten day Eastern Caribbean itinerary on OCT26. You can find information here:", "@ASalmins89 Hi Andrea! We can't wait either!", "@Change_2day service/treatment you are interested in?", "@Change_2day Lotus Spa prices are in Cruise Personalizer. However you are now too close to departure to access. Can you advise us of the -", "@Chantie22 We will notify your sponsor of your concerns. We look forward to welcoming you onobard #RegalPrincess", "@Chantie22 Hi Chantal, we apologize for your frustration. We were able to locate your booking and see that you are on a sponsored booking.", "Sea views everywhere you look. #ComeBackNew https://t.co/WGhF6DRJRW", "@lawro22 Thanks for asking about Carnival Shareholder benefits. You can find information here: https://t.co/KOKzLJwrDi.  Happy cruising!", "Dive into adventure. #ComeBackNew https://t.co/mhRoU98gHW https://t.co/f49jsGp4O3", "There's no place quite like the Mediterranean coast! https://t.co/qhSRy3zxUL", "RT if you're traveling this weekend! #ComeBackNew https://t.co/HmDPtwy0l2", "Cheers to that! https://t.co/xWWTDcPgqM", "Our piece of paradise. https://t.co/Gff1mFFbiX", "It's summertime. Treat yourself. https://t.co/zg5qXBCO8K", "Sail away with us. #ComeBackNew https://t.co/T9wLf7nWKy", "A journey as extraordinary as the destination. #ComeBackNew https://t.co/NxsuAHXG6E", "RT @Ellie_Krieger: Morning coffee on the Mediterranean #vacationhighlight @PrincessCruises #comebacknew https://t.co/ymDyzkX0PW", "@Petewaugh24 Hi Peter! Nice to #sea you too! Thanks for sharing with us. #ComeBackNew", "@gconklin93 https://t.co/YrrioeUwvK. We hope to see you onboard in the near future!", "@gconklin93 Hi Camille, this is a promotion for select voyages from Summer of 2017 - Spring of 2018. You can learn more here:", "@quizgal Hi Deb! We're thrilled to hear our Denali team made a great impression on you. We hope you can join us onboard soon! #ComeBackNew", "@koolkb Hi Krista, we were able to locate Cheryl's walker. A member of our Logistics team was able to contact her. Thanks for reaching out!", "Leave your everyday behind. #ComeBackNew https://t.co/k1YqL4dYJC", "Chances are, it's always 5 o'clock somewhere we sail. https://t.co/VRka8ASE96", "@brucewildertx Hi Bruce! Thanks for your interest in performing with us! You can send information here: entertainment@princesscruises.com", "@valmg Hi Valerie! That's the beautiful state of Alaska. We hope to see you onboard in the near future! #ComeBackNew", "@BalePaige Hi Paige! We think so too! That's #RoyalPrincess #ComeBackNew", "@Crockdog1 contact them directly for assistance at (800) 525-3663. See you in October!", "@Crockdog1 Hi John, we were able to add the seats per your request - with the exception of flight AA8482, operated by Japan Airlines Please-", "@KirtanContact Hi Kirtan! Thanks for sharing such a beautiful photo with us!", "@MerryJewelhound Hi Merry! We sincerely apologize for your frustration. Please contact us at 1-800-Princess so we can help troubleshoot!", "The blissful life. #ComeBackNew https://t.co/2rgSFUXh1X", "@ebsmith We sincerely apologize for their frustration. Can you please DM us your parent's booking number, or ship, sail date and names?", "@Jahilianaire Stunning! May we have permission to share this photo via SM/website? Will you please confirm that this photo is your own?", "Now that's a dinner date to remember!  https://t.co/fXfKnP7gZv", "@darrylzuk Hi Darryl! We'll be ready when you are!", "@JohannaACastro Hi Johanna, we love the beautiful photo!", "@SusanSutherlin Hi Susan! Thanks for sharing with us. Glad that you had a great time!", "@LBryantPR Hi Lorraine, you're making us hungry!", "@DavidSiao problems persist please contact 1-800-Princess to help troubleshoot.", "@DavidSiao Hi David, we apologize for the frustration! Have you tried clearing your cookies &amp; cache, or using a different browser? If -", "@wildcoasttales Stunning, Danielle! Thanks for sharing with us!", "@jcrueda91 top notch shore/land experiences when cruising with us and wish you had a better experience.", "@jcrueda91 Hi Juan, we sincerely apologize for your disappointing experience onboard the high speed rail in Berlin. We strive to offer top-", "@RandiWachtel Hi Randi! We can't wait either! #ComeBackNew", "@Browny01 Don't worry - Emerald and Royal Princess are also showing the Euros, as well as Wimbledon, the F1 and the Ryder Cup!", "@baycentrevic Thanks for the warm hospitality! Cheers! https://t.co/xgILLgzS4D", "@AnaDays1 Hi Ana! Thanks for sharing with us! #ComeBackNew", "@cseguinart Hi Chantal, we apologize for your frustration. Can you advise what this is regarding so we can direct to the correct Department?", "We're celebrating #SharkWeek as part of #DiscoveryAtSea. RT if you're watching at home! https://t.co/qt4ZkYzehz", "@gavinsharp87 welcoming you onboard #RegalPrincess &amp; helping you celebrate your honeymoon!", "@gavinsharp87 along to our Customer Relations Department &amp; have a team member contact you to address your concerns. We look forward to-", "@gavinsharp87 Hi Gavin, we sincerely apologize for your frustration. We were able to locate your booking. We will pass your comments-", "@Crockdog1 was able to assist you with your flights. We appreciate your patience, and look forward to welcoming you onobard #DiamondPrincess", "@Crockdog1 Hi John, we sincerely apologize for your frustration. We were able to locate your booking, and see that one of our team members-", "@audal29 Hi Audrey! Thank you for your kind words!", "@matthew87003203 Hi Matthew, we apologize for your frustration. We're having difficulty locating your booking. Can you please send via DM?", "@JohannaACastro Hi Johanna, you are making us hungry! We are so glad that you are enjoying your World Cruise onboard #SeaPrincess", "Gladly. :) https://t.co/1zHRMKXi22", "Who's cruising this summer vacation? https://t.co/fXngvtX2F9", "High-flying fun. #ComeBackNew https://t.co/XbHyIlNIfi", "Last chance! Vote for your favorite @PrincessCruises ship in the @CNTraveler #ReadersChoiceAwards! https://t.co/M8faeOrkpZ", "Happy #DayOfTheSeafarer! Join us in thanking our seafarers by tweeting your fave memory of our crew. #AtSeaForAll https://t.co/CWpnIzoiLO", "That Friday feeling!  https://t.co/BmVJ6DdSjO", "@Budspage Nice photo, Bud! Thank you for sharing with us!", "@wildcoasttales Stunning!", "@JohannaACastro you please confirm that this photo is your own?", "@JohannaACastro Hi Johanna! We love this photo! May we have permission to share this photo via social media and our website? If so, will -", "@CruiseZeebr Thanks for the warm welcome! Cheers! https://t.co/Xt7Y6d0mvn", "@jonzie8312 Hi Amanda! What a gorgeous photo!", "@Dvidcrapinshitz Hi David, thanks for sharing with us!", "@KimJago @Doug362 welcoming you onboard #SeaPrincess sailing the Word Cruise!", "@KimJago @Doug362 Hi Kim! We were able to locate your booking and see that our Access office is working with you. We look forward to -", "@lisabelle778 Hi Lisa! Glad you had a good time. Thanks for sharing with us!", "@dradzo Hi Dennis! Thanks for sharing with us!", "@nclagrange Breathtaking!", "@FarmgirlsDabble Beautiful!", "@shannonkate523 Beautiful!", "@JanaTheTeacher We love your smile, Jana!", "@earthchild83 Nice one, Lucy!", "@AlgerLuke We love it Luke, thanks for sharing!", "@dbvirago Hi Darryl, what a stunning photo!", "Tweet us your best wake view shot! #ComeBackNew https://t.co/NAkUZ8kZMM", "@Ladewig @JayLJohnston Hi Scott, that just gives you an excuse to book another cruise! #ComeBackNew", "@gibraltarport Thanks for the warm hospitality! Cheers! https://t.co/ikmsvga0R5", "Come back an explorer. https://t.co/AHuzaFfjo2", "Let the sunshine in. #ComeBackNew https://t.co/EtsUFTxKBi", "@piratesunshine Our pleasure!  #ComeBackNew", "@wildcoasttales Hi Danielle! Thank you for sharing such gorgeous photos with us! #ComeBackNew", "@alanwhiteford Hi Alan! We love this photo of #CaribbeanPrincess", "@janisbjones Hi Janis, you're making us hungry! #ComeBackNew", "@FarmgirlsDabble Breathtaking! #ComeBackNew", "@sixtyandme Hi Margaret! You can contact us at media@princesscruises.com. Happy cruising!", "@RichardToplis Hi Richard! Thanks for sharing with us! #ComeBackNew", "@desertgene Hi Gene! We look forward to welcoming you onboard #RubyPrincess", "Adventure that defies description. #ComeBackNew https://t.co/sqUH2IDkm1", "@ukcomic Hi Jeff! We're glad that you enjoyed it! #ComeBackNew", "@beeckysx Hi Becky-Anne, looking sharp!", "@VisitBelfast We look forward to seeing you soon!", "@tonienblanc Hi Toni! You can contact us at media@princesscruises.com. Happy cruising!", "@viptours020 submit an application.", "@viptours020 If you are interested in offering a tour for Princess please visit our Tour Operator Gateway at https://t.co/zdgBP7NMTh to -", "Home of the best burger at sea, too! https://t.co/XqOr4Uwnn5", "@FarmgirlsDabble Hi Brenda! Thank you for sharing such a beautiful photo with us!", "@viptours020 Thank you VIP Tours Holland! We have passed your comments along to the appropriate department.", "@JohannaACastro Thanks for sharing with us, Johanna!", "Tell us your favorite port memory! #ComeBackNew https://t.co/of9iv4OEbH", "@PaulRenfrew1 Hi Paul, thanks for sharing with us!", "@Victoria_Alex28 Hi Victoria! Thanks for choosing Princess!", "@WhelanJill Hi Jill! Glad you had as much fun as we did! #ComeBackNew", "@Set18Turner Hi Simon! We can't wait either!", "@stjohnsbeacon Always appreciate the warm hospitality! Cheers! https://t.co/E8QpuGBquW", "@spikeysnapperJ Hi Jason!  Cheers! https://t.co/fIs0FOSAKp", "Roll call! Who's taken the railroad during a port visit to Skagway? https://t.co/zX8lomb32u", "@BWalks47 Hi Ben! Can you advise us who you are trying to contact onboard? We may be able to assist.", "@Lee_cruises Hi Lee, that looks really good right about now! #comebacknew", "@VisitBelfast Thank you for the warm hospitality! Cheers! https://t.co/3g7GkDBjHj", "@alivelydragon Cheers, Anitra! https://t.co/j1NiedieYS", "@TheTypical_Mom Hi Justine! We'll be ready when you are!", "@allanstewart75 Hi Allan, please contact us at 0843 374 4444. One of our team members will be happy to review. See you on Saturday!", "@richardmissingh concerns with our shipboard team.", "@richardmissingh Hi Richard, we deeply apologize for your frustration with our onboard WIFI during your current voyage. We've shared your-", "@BrettySpaghetti with one of our Cruise Vacation Planners. We will pass your comments along so they can contact you.", "@BrettySpaghetti Hi Brett, we sincerely apologize for your frustration. We were able to locate your booking and see that you are working -", "Wishing dads everywhere another year of unforgettable adventures. Happy Father's Day! https://t.co/PAF7Xc23DC", "A perfect day for a sun-soaked stroll. #ComeBackNew https://t.co/aLGIAw0bLx", "Because weekends are meant to savor. #ComeBackNew https://t.co/fhgu31LFVL", "Romance never goes out of style. https://t.co/HFvxDFYt9K", "RT if you love to cruise! #ComeBackNew https://t.co/w0P7p10KAx", "@johnblair66 Cheers to that! https://t.co/edEe5kpiqB", "Tell us what you'd be doing if you were on a Princess ship today! https://t.co/LlwgdTrFQc", "@AlaskaPhotog Beautiful!", "@LucyStokes_ Looking sharp, Lucy!", "@RedShoesRedWine Beautiful!", "@EatSleepCruise Hi Heidi and Don, not that we know of! Hope to see you onboard soon!", "@Carole_Baume Hi Carole! We're thrilled that you're enjoying your cruise onboard #DiamondPrincess #EscapeCompletely", "@karasaumure Maitre D Hotel to discuss how they can improve your experience during the rest of your voyage.", "@karasaumure Hi Kara, we deeply apologize for your disappointment with our onboard cuisine. We hope you connect with the Head Waiter and -", "@JonathanaRamsey mates would be happy to assist you. We hope to see you onboard soon!", "@JonathanaRamsey Hi Jonathan! #Alaska is one of our favorite destinations! We hope you will contact us at 1-800-Princess. One of our team -", "@JohannaACastro Thanks for sharing with us, Johanna! Glad you are enjoying #SeaPrincess #EscapeCompletely", "#WineWednesday is the perfect time to dock in the south of France! https://t.co/fXO6QvWObL", "@DannyVinDiaz Hi Danny! We're so glad you like it! #EscapeCompletely", "Caption this photo from a recent #RoyalPrincess visit to Gibraltar! https://t.co/yMSPYdxoLX", "@nokiboi We apologize for your disappointment! Our tours can sell out very quickly, depending on supply and demand.", "@prizedeck You can contact us at media@princesscruises.com.", "@deidret424 for an upgrade request. Please contact 1-800-Princess for assistance. We look forward to seeing you onboard soon!", "@deidret424 Hi Deidre! Thanks for choosing Princess! Our upgrades are random and system generated. However, you can have your booking coded-", "@Port_of_Dover Thank you for the warm welcome! Cheers! https://t.co/fW0AxQTvCm", "@Ladylottie101 Hi Sam &amp; Lucy! Thank you for the warm hospitality!", "@lensdan Hi Dan! Thanks for sharing your video of #CarbbeanPrincess with us!", "@srichert49 Hi Sharon! We're excited too! We look forward to welcoming you onboard Ruby Princess!", "@Blarney_Mills Thanks for the warm hospitality!  Cheers! https://t.co/tdRi9CImTG", "@Gazlarrr180 Hi Gareth! We wish we could help make the days go by faster. We look forward to welcoming you onboard!", "@JTMVacations It's the #ChocolateJourneys Chocolate Pistachio Dome!", "@Mefnyc Hi Michael! We're so glad you're having a great time! #EscapeCompletely", "@mrsb2006x Hi Linda! We can't wait to help you celebrate ten years of wedded bliss! We look forward to welcoming onboard #RoyalPrincess", "@soucruise Good morning, Justin! Thanks for the warm welcome!", "@SherlockDean Hi Carrie!  We're thrilled to learn that Tamas took such good care of you. We think we have the best team on the high seas!", "Anticipate awe. https://t.co/APcygBXV2Q", "@gsyharbours Thanks for the warm welcome! Cheers! https://t.co/Jt7HuwFD5t", "@TablePlanDesign You can reach us at media@princesscruises.com", "@georgia1303 Hi Georgia! Looking sharp!", "@mstngmom1 Hi Mary! That beauty is #IslandPrincess We hope to see you onboard soon!", "Surround yourself with wonder. https://t.co/lzat5RR9CG", "@Bunnipunch Hi Lois! You can contact us at media@princesscruises.com. Happy sailing!", "@Arutak1 While we don't offer toothpaste, our standard amenities start with shampoo/conditioner, bath gel &amp; soap. Happy cruising!", "@bigdwags Ahhh, thank you! We love you too, and look forward to seeing you onboard again soon. Cheers! https://t.co/1zFzjdUyIj", "@barrybernstein the rest of your cruise.", "@barrybernstein to find a solution ASAP. Again, we are very sorry for the odor and look forward to exceeding your expectations during -", "@barrybernstein Hi Barry, we deeply apologize for your inconvenience. We've reached out to onboard staff to ensure that they're working-", "@YodaBear2214 Excursions. You can find information here: https://t.co/YcnrUUjEBT. We hope to see you onboard again in the near future!", "@YodaBear2214 Hi Joanna! Thanks for asking about  our onboard \"Puppies in the Piazza\" program. Our partner company is Alaska Excursions-", "@theyoderfamily Hi Matt, we are deeply sorry to learn of your in-law's lost luggage. Can you please send us their booking number via DM?", "Step into sophistication. https://t.co/xc5Ormify6", "Cheers to weekend wanderlust! https://t.co/xeqk58mwIc", "Make every night unforgettable. #ComeBackNew https://t.co/xUjUWM8drI", "@sanfoan Hi Anthony, we sincerely apologize! Hope to see you onboard in the near future. Cheers! https://t.co/pJJETZLhPg", "@bigdwags Here's a perfect accompaniment with to go with the #PrincessChocolate Cheers! https://t.co/wPvXxmuRo0", "@marnags98 about waitlisting. We hope you can join us onboard soon!", "@marnags98 Hi Maria, we are showing the voyage sold is out, however, inventory is fluid. Please contact us at 1-800-Princess to inquire-", "@bigdwags Hi there! Here's a little #PrincessChocolate for your afternoon snack!  #EscapeCompletely https://t.co/inH400ZgH0", "@Bunnipunch Hi Lois! The best email to reach us will depend on reason for contact. How can we help you?", "@marnags98 Hi Maria, we apologize for any confusion!  What is your country of residence? What is the ship and sail date?", "@nimiq2011 Hi Eric! We say, as long as it's #PrincessChocolate https://t.co/Ux43TxhAq8", "Make this summer magical. https://t.co/SRVDHQiqej", "We'll give you a reason to save room for dessert. #ChocolateJourneys https://t.co/Lqa8wvcDDK", "@bigdwags Cheers! to #EscapeCompletely https://t.co/LMUV7Ql6bc", "@liviaellis Hi Livia, we sincerely apologize for your frustration. Can you DM us your booking number &amp; advise of the issue?", "Sea days cure the midweek blues. https://t.co/fgV7guL9gU", "Today and everyday, we celebrate our precious home: the oceans. Happy World Oceans Day! https://t.co/Zk0v8iMS5b https://t.co/IMdgydScwi", "@phat_cupcake Hi Keeley! Thanks for checking out our cruises! Our 3rd and 4th person rates are  not age dependent. Happy cruising!", "@eeKiptoo Hi Kiptoo, the first agency on the list: Blue Ensign, Mauritius, South Africa. Their email is info@blueensign.co.za. Good luck!", "@eeKiptoo Hi Kiptoo, our approved international recruiting partners can be found here: https://t.co/Y3RQb3FJwF.", "@mcnuttsc Hi Scott! Here you go! #PrincessChocolate https://t.co/jgOMgrJ4vM", "@newietraveller Hi Greg, glad you are enjoying #GrandPrincess Cheers! https://t.co/DKG98IPc6Y", "@eeKiptoo Hi Kiptoo! How can we help you?", "RT &amp; describe your perfect day at sea! #ComeBackNew https://t.co/a9DXFGQq4y", "@WrayDuncan Hi Duncan, thank you for sharing this majestic beauty with us!", "@TiffanyFMS Hi Tiffany! Thanks for recognizing members of our onboard team! You can find our mailing address here: https://t.co/lVwqLpmlkx.", "@JoeRockstri Hi Joe, we sincerely apologize for your frustration. Can you please DM us with your booking number and briefly advise issue?", "@ocangelsfan Hi DJ, you can contact our Princess Cruises Community Foundation (communityfoundation@princesscruises.com) with your request.", "@LinHumphrey the itinerary, and #RoyalPrincess is on schedule to call in Istanbul.  If there are any changes our guests will be advised.", "@LinHumphrey side Security Department works with US &amp; local government officials in the event of any concerns.  We have not changed-", "@LinHumphrey Hi Lin, the safety &amp; security of our guests &amp; crew is our priority.  We are always monitoring travel warnings &amp; our shore--"]}