{"ritazwiee": ["@dogqueen411 https://t.co/A4VImGkWQL", "RT @astrologyheaux: the signs as parks and rec screencaps - pisces: https://t.co/tTnPc8r33X", "RT @KamalaHarris: Remember this: as long as we stay strong and use our voices as a coalition of Americans, we can win.", "RT @generino_: he tried to catch the ball but it hit his face https://t.co/CB2xfcElbV", "@Jesskidding_ flowy shorts &amp; a tank top!! and comfy sandals too", "RT @andrewlowe: my signature accessory is a half empty reusable water bottle dangling from my hand", "@MimiRuthStiver been there", "RT @TWLOHA: You are needed here. Please continue.", "RT @DoveCameron: :) https://t.co/mMa7FsBiJm", "RT @bustle: trying to dodge my responsibilities like https://t.co/d9rkcL05le", "today is my last day of finals, tomorrow is my last day of work, and Saturday I fly home!! https://t.co/36LW9KVTNN", "me leaving for Florida on Saturday: https://t.co/QyWXK9A82j", "@kaitlynwoodsss Glowing Up, Strong Opinions Loosely Held, Hidden Brain, and a Piece of Work!", "RT @bottlerocket: Wife had a bunch of rum drinks  tonight and we somehow ended up at Target https://t.co/kM0OxcA7No", "@dogqueen411 this is a bad episode of house hunters", "are any of my florida friends murderinos/want to go see @MyFavMurder live in november?!", "carpet is your goal??? get outta here https://t.co/T4vOcXJpEe", "RT @gang_greenE: Bro the lil egg alone is 30 bucks....its not happening wit just 50 bucks https://t.co/tr2bzJOIB8", "it is so frustrating and disheartening to not feel like your voice is making a difference", "@berkingbad HELL YES", "RT @NYTMinusContext: Try not to drink more than half a bottle of Pinot Grigio on weeknights", "if ur a lady and love skincare and makeup and all things girly check it out!!", "you guys this is my new favorite podcast https://t.co/h1owbHudts", "@erinmaewalsh YESS their eyebrow gel is my favorite product right now", "@royal_bri omg honestly I'm on ep10 and there's like ten storylines that keep getting introduced", "@erkngarcia this is what I wish I could do https://t.co/mx6lpkizEz", "also there's free shipping today sooooo", "can everyone relax pls", "riverdale is getting way more dramatic than I anticipated dear lord", "RT @StephenVanasco: Above it. https://t.co/nDXbsnQ4zi", "RT @lSABABE: https://t.co/KnvHc2jJgj", "RT @bustle: when the iced coffee doesn't kick in https://t.co/fvuZhoJDAt", "@lauraaamarin @royal_bri this is a good plan!!! get any fast passes for rides you want in MK and then hop over there from epcot or wherever", "RT @desireehayy: I saw a lot of disappointed tourists today but they need to love and appreciate @KarlTheFog https://t.co/ZG6XEITgWl", "@Huertas_Val girl I barely know how LMAO", "@lulztxtit my bff is GORGEOUS", "I think I found my new favorite feminist Spanish author", "@hcshiccup @erinmaewalsh @MyFavMurder YES AND YAY!!!", "RT @erinmaewalsh: When we both listen to way too much @MyFavMurder @ritazwiee https://t.co/ZVB0LBRIoo", "90.10!!!!!! https://t.co/VrsiTrEAAt", "RT @KarlTheFog: Go out without a jacket. I dare you.", "RT @bustle: weekend vibes https://t.co/PVWFk1K85i", "RT @wildejenna: dropping a hydroflask https://t.co/El9vGBirDe", "RT @orionnichole: cause if i had my way, you would always stay.", "ok I just can't understand why high schoolers on TV wear heels everywhere and it's COMPLETELY unrealistic https://t.co/8Y8mqHMSQ1", "@mmack_3 I'm twenty mins into the first episode and I'm hooked LOL", "Riverdale is so good!!!", "RT @womensmarch: Women, look what we did! #6MonthsSinceWomensMarch\n\n(Video via @KerryGFleming) https://t.co/GMGqk2aoT1", "RT @puppieswhearts: very nosy ghost https://t.co/vvPr8ChWFN", "@70MultipliedBy7 hell yes", "if the 'documentary' What The Health made you want to be ~vegan,~ you're pretty freaking gullible", "RT @enf: SF Chronicle recipe for Avocado Toast, April 8, 1927 https://t.co/UMnH7YCnLM https://t.co/AZ4NI2MZky", "RT @NYTMinusContext: a smart, sensible, reliable person who is also very FUN", "my dad added me to a facebook group for our breed of dogs and it is so wholesome and cute", "RT @johnmulaneybot: Well you can't marry everyone who's funny, because then you'd be married to too many people.", "@damjyy I like it but I'm disappointed in the fact that I do", "@grahamarpolice it is honestly such a work of art with calendars and plans for posts and everything across all social media channels", "get you a bff like @erinmaewalsh so you can discuss serial killers and murderers in regular conversation", "me realizing this task was basically pointless: https://t.co/Ly6hlo8oxk", "me: creates social media plan for the office\nalso me: checks their twitter to see the last tweet from the office was from March 21st", "RT @iasipmeme: https://t.co/5yQBjmdEQr", "I've listened to Gravity way too many times tonight than I care to admit", "just keep me where the light is", "RT @orionnichole: finally you and me are the lucky ones this time", "@imalxssa no beaches and you'll freeze in the winter, 0/10 do not recommend", "RT @figgled: Oh what so only roosters are allowed to start the day with screaming", "RT @sunkiss_flower: I just wanna be as happy as this pup in a sunflower field https://t.co/0d9ypwaZwn", "@genopereyraa say it again for the people in the back!!", "this is the podcast I'm listening to btw https://t.co/gL86PmD6Va", "RT @ziwe: hot take: being nice is cool", "@BuzzFeed when you listen to @MyFavMurder and already knew most of these", "handlettering drills and feminist podcasts make me happy", "RT @netflix: \"Chicago\" is now streaming but really just needed an excuse to RT this https://t.co/SrZ4obsE2t", "@gabycee_ @mishallem does it!!", "RT @MasterofNone: Dev and Arnold's greatest hits. https://t.co/RNqWEXxBKO", "when you immediately recognize @Lin_Manuel's voice in moana", "RT @carohasfrecks: a happy and healthy life with my man by my side. that is all https://t.co/II3VQbKLC3", "RT @_ArianaRomero: I have never felt more invested in an alleged celebrity pregnancy than Mindy Kaling's. https://t.co/El2U3ndPJs", "RT @ashleyandsun: my \"eh i'll get paid again\" attitude gets me in trouble", "@margaretpottah whole30 destroyed my food budget", "RT @avocagod: how i'm tryna be like: https://t.co/cz2oUswAfL", "RT @Brittenelle: I hate going to bed without you.", "RT @luvrlys: i'm begging you to look at this https://t.co/87C9FUrn7G", "@berkingbad today is a multiple cups of coffee kind of day", "RT @poetastrologers: BREAKING: Somehow, love continues to be possible", "RT @theclassicmax: Florida horror story: sharing a publix with your ex", "RT @KarlTheFog: Game of Thrones: \"winter is coming\"\n\nEveryone in SF: \"dear god it can't come soon enough\"", "RT @NHL: It's a long wait. #IsItOctoberYet https://t.co/KsHjMdiTBV", "@MimiRuthStiver LMAO guess I will have to come visit you", "RT @restot50: https://t.co/gwBbbzVSfl", "@grahamarpolice I'll check there too!! I remember old navy had some at one point too", "RT @DoveCameron: just drink your water, get your sleep, be a dope human being and forget about all the rest", "@Huertas_Val ooh ok!!", "@Kaitlyn_Ashley5 THANK U I've been like scouring ebay for these dang overalls", "tag urself I'm \"binge new Netflix series\" https://t.co/d9Ti06tuG7", "RT @GerrardsPrime: Think I've found my favourite ever GIF https://t.co/CVDDwthfBw", "like these https://t.co/vXkdL0TV40", "RT @bymariandrew: This guy also decides what's racist or not https://t.co/y3HL0ilUac", "RT @merrittk: when one of your brows is perfect and the other is always a mess https://t.co/PTBnXGgfyE", "RT @migosactivity: I'd make u a grilled cheese at 2am", "friday feeling https://t.co/F8qX9z6Joa", "@annavoig101 I did!!! and I wasn't hooked at all", "@annavoig101  https://t.co/2eb8AVCXjE", "@annavoig101 I've tried watching it and I can't get into it AT ALL", "I genuinely don't understand the hype over Game of Thrones", "RT @PoeticalIylost: https://t.co/qMytwAtjuv", "RT @theyearofelan: I want to be full of coffee in the way that a balloon is full of air", "RT @holyscum: why have a kid when i can take care of my combination skin", "RT @mikemchargue: ...other than, \"I love you and I affirm your right to exist.\"", "RT @iasipmeme: https://t.co/6HLrthiZf7", "I had Samantha oh dear https://t.co/M1bLOyDfxg", "RT @ericwareheim: MASTER OF NOMS https://t.co/oKT0LBXobG", "the skincare reddit is a dangerous rabbit hole to fall into", "I ACTUALLY SAW HIM TONIGHT HES REAL https://t.co/aQr2Vx2SXe", "RT @OutfitsHeaven: https://t.co/j2UDH0O0ab", "RT @McJesse: https://t.co/f3o8lyoRfF", "SERIOUSLY? https://t.co/8Ek7mX29dQ", "this is my new favorite picture https://t.co/nLHyRlWOmA", "@margaretpottah what we're getting ourselves into.", "@margaretpottah I mostly shared it so you would see it LMAO", "TL;DR: don't dismiss an entire field just because your experience wasn't what you expected, and don't lose hope over one setback.", "like us, who want to see those changes reflected in institutions, are going into these fields. don't quit bc change doesn't happen instantly", "and office that you work in. you can't expect a huge system, like education, to change as quickly as the times do, and that's why people", "while I'm not discrediting the author's experiences in higher ed, I think that everyone has a different experience depending on the school", "I'm annoyed by this premise bc it's easy to point fingers to a ~broken system~ and blame the Man for your troubles", "if you're pursuing higher ed, pls read this article &amp; let's discuss: https://t.co/obntdfD8T0", "RT @MimiRuthStiver: @ritazwiee it's you https://t.co/oU2Y6PM9a4", "@MimiRuthStiver I also want the Curb Your Enthusiasm theme playing at certain points", "RT @ashleyandsun: True love is when they know ur coffee order", "@yliiime san francisco too?? maybe??", "RT @ianbremmer: https://t.co/lhkTiHkRmC", "RT @IsoJoeJR: Gringos not understanding how Cuban coffee works is never not funny https://t.co/ztWvrX8Rd0", "this whole headline is an oxymoron &amp; tbh I'm not even surprised anymore https://t.co/Nydznkr4QH", "@margaretpottah leslie is my mood always https://t.co/0UrNPlwdcD", "I make my dad send me pics of my plants so I can make sure he's keeping them alive https://t.co/EULNrx8qJD", "RT @jonlovett: We gave the most important job on planet earth to our worst person and so far it has been going very poorly.", "RT @JYSexton: This is the most baffling day in a long, long stretch of baffling days.", "RT @HerCampus: about how well my week is going https://t.co/0KUvHln3iS", "@margaretpottah I have student loans coming out my ears but I know what panchetta and baguettes are", "RT @margaretpottah: This David Brooks piece is simultaneously condescending and idiotic. https://t.co/q79uA2wbA9", "RT @evepeyser: for any woman who has ever felt overwhelmed or scared by a sandwich menu, david brooks is here for you sweetie. he'll help.", "I would give anything for a large cafe con leche y un tostada this morning", "@royal_bri aw!! thank you!!", "RT @orionnichole: i see pieces of you in everything", "RT @HBO: Larry David is back. #CurbYourEnthusiasm returns for Season 9 on October 1. https://t.co/mijjn4OQdy", "RT @iasipmeme: https://t.co/8TNzr27859", "@annavoig101 I'm hoping one day mine gets to where yours is", "@annavoig101 your skin is BEAUTIFUL", "follow ya girl if you're interested https://t.co/wzpeK1lZ8P", "update: I made it https://t.co/bpsi8psNPk", "RT @onlywreckage: i kissed you once in a dream and i don't know how to stay awake", "RT @itsashlyperez: Good morning! https://t.co/a2m6FfllLc", "@kaitlynwoodsss I feel like that's gonna be my exact vibe if I wear one", "@berkingbad YAY!!!", "I wish I was hip enough to pull off these cute lil neck scarves https://t.co/8w3D0JgeMR", "@70MultipliedBy7 ok wow pls don't", "@lulztxtit https://t.co/6q6ZDZEVS1", "@grahamarpolice LMAOOO you're welcome", "RT @taquitoelcabron: me siento bien cute https://t.co/EG9aQQJNil", "@Huertas_Val says you LMAO", "should I make an insta for my hand lettering?? would anyone follow it?? is that extra??", "@70MultipliedBy7 https://t.co/hn36KHaYUc", "@saltysofff @Disney girrrrrl yes they are the best", "RT @promisexnothing: how i'm trying to be https://t.co/NlWHL1kEMy", "@Maddybake https://t.co/hjaOsRAh2j", "he didn't like that at all", "in my defense it was an argument about how the state structure is European and therefore by definition LA states are European....", "RT @halsey: Miami is always schwifty.", "@margaretpottah I feel like this with my orientation kiddos and old residents", "RT @JoshClements403: @TheBlueDevils in Hillsboro, OR https://t.co/s0JdvgWy9Q", "@berkingbad if it has ur stamp of approval I'm gonna go see it", "RT @tarashoe: astrology is not a scam because i like it", "@joneechay woohoo!! crossing fingers! https://t.co/yT4hwP3hu3", "@abuinheaven isn't that shitty?! the filmmaker didn't really talk to anyone with true qualifications and a lot of the info is biased", "@abuinheaven dude is it What the Health", "@NOTVIKING yes LOL", "today is a great day bc I finished my whole30 and the new haim album is out", "edited bc my mom follows me (hi mom!!) but I'm so proud of how this turned out!!! https://t.co/jHz0zOWQbz", "@Huertas_Val I always ruin ours LOL", "Rob is making fun of me for zodiac shit and I feel extremely attacked", "RT @turnoverva: good nature 8.25 https://t.co/z3s4fo4krQ", "RT @MasterofNone: Hi cutie! https://t.co/Bg8X9Fz7rY", "RT @katie_brinker: Instead of making a GoFundMe for a new car, boob job and whatever else, how about you get a JOB &amp; save money.", "who hurt you https://t.co/gxEa3Yhh8W", "@AngieGigiFierce I have gif keyboard and I like it!!", "RT @doIIpxrts: ok I gave my dog a red solo cup and I've never laughed harder in my life she loves it https://t.co/ey45f93klj", "@lulztxtit omg I'm trying to find it and I can't wtf", "RT @hamiltonmikewaz: GODDAMMIT, I'M WILLING TO WAIT FOR IT https://t.co/RhSGzoD15N", "RT @deray: Chance The Rapper. \nJuke Jam. \nTiny Desk. https://t.co/7gPHmfzB3f", "RT @sadtaires: PISCES: \n\nbubble baths, candies, soft blankets, bright lipstick, trampolines, lakes, pastel colors, watermelons", "help I listened to too many episodes of my favorite murder before bed and now I can't sleep", "RT @41Strange: 'I will paint living people who breathe and feel and suffer and love.' \n- Edvard Munch https://t.co/5NoxlPiyP9", "RT @_DanielleNieto_: When you're up, count your blessings. When you're down, count em twice.", "@kaitlynwoodsss I'll have to try that!!", "@margaretpottah this is forever one of my favorite scenes", "RT @Carrie_Bradsh4w: I drink coffee because I need it and wine because I deserve it", "RT @TWLOHA: You are worth infinitely more than words could ever explain.", "I just entered the #Ham4Ham lottery to win $10 #Hamiltour tickets! https://t.co/9HD8pdMTtL via @Lucky_Seat", "america, you great unfinished symphony #FourthOfJuly", "RT @KamalaHarris: This #FourthofJuly, a reminder that eight immigrants signed the Declaration of Independence.", "RT @doree: wait so you're telling me it's not the avocado toast https://t.co/tol4f5nWbX", "hi, sorry to break it to you, but being \"savage\" won't earn you any friends in the long run &amp; it's not a cute personality trait :-)", "RT @MasterHandFD: I present to you all an avodoggo https://t.co/8FbR3d7q03", "RT @trajectoryuk: she tastes of books, red lipstick and heartbreak", "s/out to the random people I asked to take these pictures for me https://t.co/RUxMh0Tskg", "RT @henchgirl_comic: Someone definitely got their car stolen at this IHOP https://t.co/N3lC93WgVF", "long distance really, really sucks. I can't wait to come home to you (and Publix) https://t.co/7FLU9Q86vA", "RT @iasipmeme: https://t.co/Mrqeh8wfbN", "@cafecitx it's so sad that the rest of the world isn't up to par with cuban food", "@Huertas_Val I'm just gonna bury myself in pastelitos and eat my way out", "@amateuroracle check instagram &amp; etsy!! there's one called Little Arrow Shop that has some really cute ones", "RT @morgannrose__: The Dayman and Nightman are Raging Inside Me. https://t.co/rziUHGbSnD", "@70MultipliedBy7 still funny", "@70MultipliedBy7 https://t.co/qI3r3fp20x", "I put my mediocre handletteting on instagram and it's very scary to have it out in the world and suck :-)", "@MimiRuthStiver SAME", "RT @tabletopcircus: sleepy sweet talk", "@vibesofmiami *whispers* he was an american minister to france in the revolutionary era and helped build a bond btwn the countries", "days like this I miss listening to records, making coffee together", "people who have well-cultivated instagram aesthetics are intimidating", "@amateuroracle you look SO CUTE with short hair", "the student loans episode of @deathsexmoney is SO REAL and kinda makes me feel better about my loans", "@_julily DUDE. I CRIED. AND I KNEW IT WAS COMING.", "RT @1942bs: me finding out who's been spending all my money https://t.co/TSxUquv3RI", "like trader joe's is great and all but publix has my heart", "I miss publix y'all", "RT @farwzz: this is the greatest meme that ever lived https://t.co/bN4BkRq8Qh", "RT @ariesjpeg: this is literally how discussing politics today feels like https://t.co/vUyGRTRiXc", "@dogqueen411 oh my god I LOVE THIS AND YOU", "@dogqueen411 this is true", "@dogqueen411 do they have cafe con leche and pastelitos", "RT @sarah_grace125: I love this thread https://t.co/cWhuJADc5h", "good morning to everyone but donald trump and senators who voted to take away women's health rights", "RT @sashasantti: @ritazwiee I appreciate you on so many different levels now boo #FutureSABesties", "RT @dazeofcandy: PISCES https://t.co/wN3TALXkXx", "RT @norab_baron: Tryna b like this https://t.co/aYWdNm0k5c", "\"be persistent, be passionate, and be persuasive\"", "chris d'elia has the same voice for almost all his impressions and I strongly identify with that", "@margaretpottah @MyFavMurder YES YAY", "@MyFavMurder it starts in July &amp; you best bet I'm doing it", "THERE'S A HANDLETTERING CHALLENGE FOR @MyFavMurder!!! https://t.co/U8n3IkJqkm", "@lulztxtit chicken pad thai is everything", "RT @TheBlueDevils: We love our Devils Food Crew!! https://t.co/tebThIcRzN", "@layyy_x0 YOOOOOOOO THATS WILD!! they're so good!", "@layyy_x0 FOR REAL??? OMG WHAT", "@StoicBallad $6.99 at trader joe's", "RT @kenzwitalilbenz: need that kiss me at a red light type of love", "rob got us tickets to see @turnoverva in october and I'm so freaking excited", "@ccmacgg this is the truest thing", "RT @onlywreckage: you and me kissing like the universe is connecting the dots", "RT @joshgondelman: Hands touching hands. Reaching out. Puggin' me, puggin' youuuu. https://t.co/1EMT5dydim", "my mom made a bitmoji and WE CHOSE THE SAME OUTFIT", "I've gone through two jars of almond butter on whole30", "@genopereyraa cursing and coffee are way more important than numbers", "@mishallem LOL TRUE", "@lulztxtit can I be ur plus one", "day 17 of whole30: I just want some bread https://t.co/FAK2CqtIpL", "@dogqueen411 this makes me happy", "@royal_bri yep! I'm lactose intolerant too and those are life savers; they also make a lactose free milk that's good!!", "@royal_bri lactaid pills!!!", "I have a mouse in my apartment and I'm about to start charging him rent", "RT @juptrix: NO ONE UNDERSTANDS HOW FUNNY THIS IS TO ME https://t.co/BIdoLmPZh8", "RT @viennakendall: damn girl, are you an avocado cause ur the good kind of fat", "@annavoig101 this is my favorite movie", "RT @annavoig101: Mood https://t.co/xkZDavwWTv", "RT @KarlTheFog: It's good to be home https://t.co/lPlK3ovBce", "RT @onlywreckage: you'll still be you in the morning and i like that so much about you", "@Huertas_Val um yes obvs", "I'm so used to Miami that walking into a somewhat warm room is confusing", "the fact no building in SF has air conditioning is uncomfortable", "RT @filmartbox: Parks and Recreation (2012) https://t.co/QLEwviLCx9", "@margaretpottah as a former sorority girl and res life staff, I appreciate it on many levels", "@margaretpottah this is ART", "RT @SICKOFWOLVES: SURE I COULD BE GETTING WORK DONE BUT THEN WHO WOULD MAKE SURE ALL THESE TACOS GET EATEN ON TIME", "RT @Brittenelle: counting down the sleeps until I get to see you", "all things are delicately interconnected", "RT @indiebreakfast: silhouette\nloose sundress\nlow sunset", "@berkingbad hiiii https://t.co/pD01OPkTJb", "RT @spookperson: constant anxiety level: https://t.co/CeOR3mEYC2", "@sabrinastinks it's even cuter when little kids sing it", "@sabrinastinks I stage managed this show and I love this dang song", "RT @Cinemartistry: Psycho (1960) \nDirector: Alfred Hitchcock \nCinematographer: John L. Russell https://t.co/6AlEhhGsIp", "@UniqloUSA the tuck flare wide front pants in pink!", "@camiweinstock I wanna retweet this so bad", "RT @ritazwiee: https://t.co/aoDjioIFwn", "RT @orionnichole: our days and nights perfumed with obsession\nhalf of my wardrobe is on your bedroom floor", "I just bought the coolest pants from @UniqloUSA and now I never want to wear anything else", "RT @poetastrologers: Pisces as weather: Winter rain", "RT @thisisinsider: This place makes hand-crafted ice cream pops in Miami. https://t.co/gnqTqGz1o0", "@70MultipliedBy7 https://t.co/ymnhZvHiI9", "RT @orionnichole: https://t.co/BZ2GTQjcPP", "like feminism shouldn't automatically translate to misandry", "why do some people latch onto a concept or ideology and take it WAY too far??", "RT @Cinemartistry: The Aviator (2004) \nDirector: Martin Scorsese \nCinematographer: Robert Richardson https://t.co/gerhRl31Nd", "RT @JoelakaMaG: the best version\nof you may scare\naway some folks.\n\ngood.", "RT @KamalaHarris: No one should have to be afraid to walk home from their place of worship. This is devastating. \nhttps://t.co/vB36unj3M7", "I love being a Spanish major bc it means reading Sor Juana for every course", "RT @alexadicembrino: there are ways to be beautiful that don't involve your appearance", "RT @BuzzFeed: 10 times dad knew best in Calvin and Hobbes https://t.co/KA1TAGV6BJ https://t.co/pJbsqzdjTY", "RT @KarlTheFog: \"Holy shit it's so hot\" -everyone in San Francisco", "me on whole30 https://t.co/gM7dJAaSHa", "RT @ilooklikelilbil: ma ya MCM would not believe his eyes if 10 million fireflies lit up the world as he fell asleep LMFAOOO", "@mckennaprynn where do you go!! I'm trying to get one this summer in SF", "y'all go listen to #Melodrama RIGHT NOW", "RT @KarlTheFog: Shitty day ahead in San Francisco. Avoid at all costs. https://t.co/sVQM8YBonP", "@allietrigs FEELS on this one", "@David_Merida at least you got a warning, Rob asked me to do it right when he started", "RT @poetastrologers: Pisces life motto: Despite my act, I really saw everything.", "chicken tender pub subs are on sale this week!!! too bad I'm on the west coast where no one has experienced this delicacy", "psa: my boyfriend is a saint when I have carb-related meltdowns while both of us are doing whole30", "RT @ArtPicsChannel: by Gustav Klimt https://t.co/zbZ39HTmpl", "RT @itsmanuuuu: Being a grown up is exhausting", "@amateuroracle this is me to a T", "@MimiRuthStiver I don't even remember where I went in all honestly", "@MimiRuthStiver same girl https://t.co/xsIuRuFAPR", "thank goodness you can eat chipotle on #Whole30", "california avocados are so gross compared to florida ones", "@abuinheaven ahhhh now it makes sense; still, what a cruel trick", "@abuinheaven how does this happen???", "RT @omgitsjudie: See good in all things", "Y'ALL THIS SONG https://t.co/SUC6G86PbC", "@Huertas_Val this is my fave scene honestly", "RT @citybeautiful: We will always #RememberThe49.\n\n#OrlandoUnitedDay https://t.co/WnmBSFv1wi", "RT @priyavprabhakar: i hate this celebratory genre of \"be on the constant verge of death under late capitalism\" https://t.co/oDgDcqUCvO", "work ~looks~ https://t.co/NT3HE8ihO5", "me looking at old pics and trying to figure out where I went wrong with my skin: https://t.co/StR7W5ysVu", "I peaked as an RA with this bulletin board https://t.co/U8nR5X1ZQk", "RT @tjchambersLA: Girl you must be Hamilton on shuffle, cuz you unpredictable and perfect", "@erkngarcia HAHAHA oh my god SAME", "@erkngarcia it could be a magnolia too idk flowers are hard LOL", "@erkngarcia maybe like an iris?", "RT @nowthisnews: John Mulaney said Trump's presidency is 'like there's a horse loose in a hospital' https://t.co/9gkI1kLcX8", "sweet potato fries don't deserve this https://t.co/kBFWdi7l2G", "SARA FROM CHUCK IS IN HANDMAID'S TALE!!!", "RT @WorIdStarComedy: When your squad is cool AF https://t.co/rmFg3hUVmF", "RT @crissymilazzo: how will i explain millenial pink to my children", "RT @gianitals: Miami will always be home but I don't think it's where I'm meant to spend the rest of my life.", "RT @Wolfe321: @realDonaldTrump A politician twisting words to create fear and garner control -- that's fascism.", "RT @mackyallen: Who are my 700+ followers on instagram that don't like my pictures I just wanna have a quick chat", "@milanstarr dude YES", "wel technically day 1.5 since I started last night", "#whole30 day 2 lunch: leftover chicken stir fry w/ coconut aminos + cauliflower rice https://t.co/wz8NBbBx1R", "RT @TWLOHA: You are an infinite light even in your darkest days.", "RT @Amy_Siskind: Kamala wasn't courteous\nElizabeth persisted\nSally informed\nMaxine \"shoved\"\nApril rolled her eyes\nSusan did her job\n#resist", "@kaitlynwoodsss I love you LOL", "RT @kaitlynwoodsss: @ritazwiee  https://t.co/QOJv4lSqgJ", "someone pls send me pizza thank you", "RT @sexpains: art museum date??? coffee shop date???? library date??? walk in the park date??? downtown date??? concert date???", "RT @orionnichole: all i want is more time with you", "RT @alexxpiazza: Hey sun I miss you pls come back ty", "RT @FreddyAmazin: Me calling my mom to get advice on any adult inconvenience https://t.co/F17Au9cEhI", "RT @gaby_j_h: Maybe it might be helpful to someone? about 200 places to go in Florida from North Miami to Homestead. https://t.co/cc3f2uHtRD", "!!! https://t.co/vdRjz2JQXK", "RT @zim2918: In Hyde Park, Chicago https://t.co/bcliUpa7j6", "@lulztxtit  https://t.co/4GR86uFwdY", "RT @iasipmeme: https://t.co/scyWOm9jcS", "RT @Jeshica_: Nothing quit as awk as Miami-cheek kissing someone who doesn't miami cheek kiss", "@madylauu I had a math class with him LOL", "RT @almostlionking: this season of master of none makes me wanna go to Italy, make pasta, fall in love, and get my heart broken", "RT @laurenduca: *That's because the U.K. has strict gun control regulation! https://t.co/K1DJbyPTbV", "RT @TristanRBoyd: @ritazwiee $6 charge for just breathing in Whole Foods", "@TristanRBoyd yeah I bought like a plate of food and I thought it would be $8.99... it was not", "@literallyale have you seen Happy Endings? it's on hulu and it's so cute", "might start working at lush just bc of the 50% discount y'all", "@MimiRuthStiver @MyFavMurder murderinos unite", "RT @MikeDelMoro: Countries committed to the Paris Climate Accord shaded in blue, via @mashable https://t.co/1RGVGjUUyu", "RT @kaitlynwoodsss: https://t.co/siLpWSJrlm", "RT @lSABABE: if ur having a bad day, here's this https://t.co/jhaEhFvcm3", "https://t.co/CT2hl7sfmg", "RT @Cinemartistry: Breaking Bad (2008-2013) \nCreator: Vince Gilligan \nCinematographer: Michael Slovis https://t.co/AgBvzyrKfB", "I JUST APPLIED FOR GRADUATION https://t.co/OvTx5oxB57", "RT @KataZwiefel: When your puppy looks for #thunder and seems perplexed when can't find it. https://t.co/DLuROZawON", "@abuinheaven where did you find it?! now I'm curious of mine LOL", "another fun thing: when you realize your fridge isn't working and you end up throwing out all the groceries that you just bought yesterday", "RT @_gillianthomas: ur wcw is a woman who u have a crush on. also it's wednesday", "RT @gIumkid: art in wes anderson films. https://t.co/yvSzZEs7Lc", "RT @wonderdianas: \"why is wonder woman even so important???\"\n\nme: https://t.co/rPV9AuBbS8", "RT @SICKOFWOLVES: AMAZING NEWS I HAVE EMERGED FROM MY WEEKEND SOMEHOW MORE TIRED THAN BEFORE", "hey uh @instagram can you put my timeline in chronological order instead of whatever is happening now???", "RT @bioreconstruct: Floating mountains of Pandora at night. https://t.co/yPS1w2FIxV", "RT @JonErlichman: On this day in 1937: The Golden Gate Bridge opened \n\nPictures during bridge construction: https://t.co/r9AZ6oy6Yi", "that's ME!! https://t.co/oHYItnFVZf", "(i'm mostly posting this bc i'm finally happy with how my skin looks)", "@ClaireHolt5 dude i've been here a week and no in n out yet", "I didn't realize how Miami I am until I moved to SF and called an old lady a \"vieja\" and no one knew what I was talking about", "@Bootybrooke LMAO BROOKE I LOVE U", "@mishallem YES this is the only reason I hate traveling alone", "my favorite thing is hearing Rob rant about hockey and how much the Penguins suck", "RT @jk_rowling: You tiny, tiny, tiny little man.\n https://t.co/mP3mad6cMt", "RT @wtvrnatalie: u had 2 hours buddy https://t.co/IRwTfOFd07", "RT @dorrismccomics: oh no https://t.co/W2muyWPZ6j", "RT @IssaRae: Sometimes I have to \"Aww baby, what is you doin\" myself.", "my dad sent me an email and it's just a bunch of gifs", "RT @eleanorbate: vanity fair just released some new portraits from their star wars shoot. no, you're crying. https://t.co/dJKmHbnDYp", "RT @effies: Language is awesome, https://t.co/XqIFRkmLW9", "anyone with any social media account needs to listen to ep68 of @HiddenBrain and think about how we all use these networks", "RT @bustle: me getting through the week https://t.co/JlvYa8FarT", "RT @shutupmay: one of the most generous things women can do for ourselves and other women is to not shit talk our own bodies", "honestly i'm mostly impressed girls in SF can wear birkenstocks no problem in 60 degree weather", "RT @Seinfeld2000: Pope Your Enthusiasm https://t.co/joAC3sk5oe", "RT @chrisdelia: One time I was on the set of Whitney and the prop guy called my iced coffee a \"pop\" and I think about that every day.", "RT @poetastrologers: Pisces Summer Plans: Plotting revenge, masking huge insecurities poorly with arrogance, slow dancing at dusk", "RT @sabs0ul: how i'm tryna be forever https://t.co/vCNuc6bT9C", "when ur favorite pair of black tights rips at work :-)", "RT @emmaladyrose: In the wake of the Manchester attack, let us remember that teen girls are fucking magical and resilient", "RT @TheOnion: Onion Exclusive: Trump's Presidential Briefings https://t.co/DsSr4616XT #TrumpDocuments https://t.co/8DcuZd2l36", "@70MultipliedBy7 goddammit", "why is everyone in Europe", "RT @Lin_Manuel: Good morning. \nTake care of each other.\nTake care of yourself. \nRepeat.", "RT @orionnichole: missing u every second we're apart", "who is watching the new season of twin peaks bc I am so confused", "@Jesskidding_ girl you are so tan", "RT @ohhijackie: \"Who paid for you?\" he whispered. But the old wall keeps her secrets. https://t.co/xplQhXvzQ3", "RT @KarlTheFog: Wake up San Francisco it's beautiful outside https://t.co/dQEaIE0ZDw", "white boys can do anything and everyone gets excited https://t.co/H2jiKU4Pab", "RT @worddiction: https://t.co/8b1U0qz7ZO", "update: what is happening", "#TwinPeaks !!!!!! https://t.co/I01TYl1mQK", "if you haven't seen master of none yet you are sorely missing out", "thank goodness I wear glasses; otherwise all my sunglasses sunburns would look even more awkward", "RT @lSABABE: me texting someone i love and care about https://t.co/mmvv5cpGQU", "RT @priya_ebooks: one of the most annoying things about being a woman is that it's very hard to ignore other people's opinions of you", "RT @ramenthot: Me: say something sexy \nGuy: I have a 401k", "@sashasantti ok down", "RT @natissss: @ritazwiee You are my favorite white girl", "@natissss  https://t.co/pTcHO6JF8d", "@margaretpottah holding your breath??", "my heart has felt a million different things, but nothing like this", "@vibesofmiami like we have breakfast burritos on campus but vicky's breakfast special is far superior", "I already miss Cuban food and I haven't even been gone a week", "@Maytalala Asheville and Raleigh! super funky and amazing beer scene", "RT @NHL: Every OT goal from the 2017 #StanleyCup Playoffs.\n\nAlllllllllllll 26 of 'em! https://t.co/L6tiQ8plmx", "\"you're in a cult, call your dad\" @MyFavMurder", "RT @MagicRealismBot: A Californian queen sees a flock of birds in the shape of a broken heart.", "RT @amateuroracle: i look down at my watch and notice the hour hand is at \"miss my bf\" and the minute hand is at \"tweet about it\"", "RT @ditzkoff: Perfectly normal to have a special counsel appointed at 117 days in office. Really, a tradition.", "@margaretpottah I have so many questions", "@margaretpottah it's better than immediately asking for nudes or something equally gross", "RT @colorschemez: desperate lavender pink\ntingliest very light blue\nsplashy light cyan https://t.co/V71Tgy9DLO", "PSA: don't wear new flats to work bc you might end up getting sent to walk around SF and you're gonna get hella blisters", "RT @DiagonAbbey: Orlando doesn't suck, your attitude does.", "RT @thethermals: THREAD: https://t.co/OsToaf4VbK", "RT @netflix: .@MerriamWebster how many RTs to make \"allorrrrrraaa!\" word of the year @MasterofNone", "@TristanRBoyd no thank you", "RT @bjnovak: I'm starting to think maybe we shouldn't have built our whole country on an Indian burial ground", "needless to say I am cold https://t.co/DzXqQQ6cwJ", "RT @Lin_Manuel: Good morning!\nGood morning!\nLet's make some new mistakes!\nLet's find the things worth saving in the mess our living makes!", "@meeeeeeems eat less bread! drink more water than anything else (it'll benefit your skin too)! and find an activity that you enjoy doing!", "RT @sadmexi: Pisces: https://t.co/sIs1h9dvq8", "there's a trader joe's right by campus and I am so happy", "RT @filmartbox: Parks and Recreation (2014) https://t.co/eWObUzthVK", "got my hair cut and got a free latte so it's been a good day https://t.co/dvg6bVAund", "RT @lSABABE: eternal sunshine of the spotless mind (2004) https://t.co/Yus5yQEU0a", "RT @BlessedZvy: Serial killer documentaries &amp; chill", "RT @SeanLowe09: If I had to choose my favorite food, I'd probably go with carbs.", "RT @okaypompeii: being active on twitter like https://t.co/qc4VJ5s9Xw", "me leaving for California on Friday: https://t.co/09R88VwoQI", "@annavoig101 westworld, breaking bad, master of none, man in high castle, good girls revolt!", "RT @mikemchargue: I'm afraid we're about to find out what would have happened if Congress backed Nixon.", "RT @flahertykeely: here is anderson cooper rolling his eyes at kellyanne conway https://t.co/duwZIfZ7VP", "RT @ChaseVan21: We're here for a good time AND a long time https://t.co/U54d2Rkb4U", "@annavoig101 i have haskell tooooo!! twins!", "@70MultipliedBy7 no", "RT @poetastrologers: Top Pisces hardware store purchase: A trash can they can \"chill out in\"", "random coffee roasters follow me on instagram all the time and i think that truly sums up my aesthetic", "RT @LuisLovesGoats: that's why she my wcw https://t.co/PceAhDeDdk", "RT @naancaayftw: i want ur mom to like me more than u like me lol https://t.co/IuRVIrbZmx", "have you been to publix though https://t.co/Xb8KSsxWsn", "honestly just trying to get as tan as possible before leaving for california bc I am a pale excuse for a miami girl", "RT @rachsyme: real https://t.co/7hmwZku0qE", "@70MultipliedBy7 https://t.co/Lx72gsJO3c", "long distance relationships mean helping your boyfriend pick out ikea furniture over the phone while he's at the store", "RT @8bitfiction: You look like your favorite color.", "RT @poetastrologers: Pisces as Poetic Form: (Sentimental) Ballad", "RT @SATC_BestQuotes: https://t.co/11zxxvZ3I1", "@genopereyraa I love you", "RT @sarahcpr: 2016 vs 2017 https://t.co/bbxQdMoLIh", "RT @steenfox: Cinco de Mayo isn't an excuse to drink margaritas because I don't NEED an excuse to drink margaritas. Imma do that anyway.", "RT @jaboukie: me: *buys aloe vera plant* i'll name you healthcare", "americans LOVE mexican culture but don't give a crap about actual mexican people", "before you wear a sombrero and drink excessive amounts of tequila bc of \"cinco de drinko,\" please reconsider your life choices", "RT @turnoverva: two years of peripheral vision", "@meeeeeeems UR GONNA KILL IT", "is it weird that I'm more maternal towards college freshman and puppers than actual small children??", "@meeeeeeems your personal playlist or one that you're subscribed to?", "RT @cityt0city: at this age u gotta realize everyone has a lot of growing to do so u either grow together or outgrow each other", "RT @kitttenqueen: trump declared april sexual assault awareness month and then took insurance away from survivors and victims in may.", "RT @trashlord5000: bob is dead https://t.co/MPT59IB8Pa", "RT @hamilbots: And I could be enough.\n\nAnd we could be enough.\n\nThat would be enough.", "@alienlover6669 that's good to know!! i've wanted to order from them but i was skeptical", "I bought a ticket to Orlando at 2:30pm to leave at 2:55pm; and somehow, by the grace of God, I made it onto the bus with two mins to spare", "RT @orionnichole: it's like every time i see you, i find something new to fall for.", "RT @victoriateske: @ritazwiee Thank you for being you and always working so hard. It's inspiring and admirable.", "@victoriateske it's just a good landmark honestly", "@victoriateske omg I have driven by this place so many times", "RT @Faithfulasf: my mom told me \"make sure u marry someone who makes u laugh when ur mad\" and that's some of the best advice i've heard", "@wrettbalsh u know you made it when a parody account steals ur tweet https://t.co/QNY86S65HG", "@smfigs I saw they released the promo code and I already had the suit in my cart so I HOPPED on it", "@Dory @kalesalad this account stole this pic from @wrettbalsh", "@smfigs I can't swim but I got the suit in black; so am I okay?", "@abuinheaven I have honestly done this before", "@Jesskidding_ @vibesofmiami SAME GIRL YES", "@erinmaewalsh and don't look anything alike", "RT @genopereyraa: Y'all are really pressured that girls want a free bathing suit https://t.co/IW6scpUn2e", "RT @Ivanibr: time I wake up: 11am\ntime I actually get out of bed and start my day: 12pm, October 22nd 2045", "people get mad when their IG timeline gets spammed up, but are the same ones to overpost for fraternity/sorority pageants", "RT @mikemchargue: \"Trump isn't as bad as we feared,\" is a sentiment I've only heard from middle-class, straight, white people.", "@lulztxtit https://t.co/qgyBxhViwL", "RT @itsmanuuuu: Do good to all.", "@Bootybrooke YES THANK U", "@alexadicembrino my overall gpa one semester was a 3.487 and i honestly cried LOL", "@alexadicembrino that is the most annoying thing", "man living with roommates next semester means i can't laugh at vine threads at 12:30 in the morning", "RT @yliiime: Fall in love with the ordinary stuff.", "trying to decide what planner I want to get next year is like choosing a favorite TV show", "RT @reaIfrosty: Me: hi\nPerson with a hydro flask: Yeah it stays cold all day", "RT @terrified: girls know everything except where they wanna eat", "@70MultipliedBy7 https://t.co/GBOs1VwXch", "RT @kashanacauley: Looking forward to the future, when we have a president who knows why the Civil War happened. https://t.co/PDYM0w0k5i", "RT @HouseofCards: The American people don't know what's best for them... I do. May 30. https://t.co/EhGUKb8eOb", "@Jaggerlarson @70MultipliedBy7 he has better taste in clothing", "RT @martindiabIo: Isn't this a Front Bottoms song? https://t.co/JthPYGZWxS", "preparing for the worst, praying for the best", "plus bangs + cowlick = one day of loving it and the rest crying about how it'll never look the same as the day I got them", "I wish I could pull off front bangs but I've already committed to glasses full time so I don't think I can't do both", "RT @jackieaina: stop asking for directions from people who've never been where you're going", "RT @FreddyAmazin: Me: *buys more clothes to workout in*\n\nMe: *wears those clothes to sit around and eat in*", "today was a horrible no good very bad day all around", "@lauraaamarin  https://t.co/GLDT4wzbJQ", "@genopereyraa it makes me so annoyed LOL like who cares what you know", "RT @irin: This is a photo of RBG carrying a tote bag with her face and \"I DISSENT\" https://t.co/9LVrgI7g7E", "RT @myhairisblue: How long until someone comes out w unicorn mayo", "@genopereyraa you can always go shopping", "why does everyone hashtag \"if you know you know\" on instagram now??#grandma", "RT @DuckFanAccount: can u guys just drink coffee like a normal person https://t.co/1NMSmjZ8As", "RT @okmarz: Get rid of ppl who make you feel like you're asking for too much", "you're cute and I miss you https://t.co/qep2TLDhfU", "RT @kellylarsen22: tourist: disney springs \n\nme, an intellectual: downtown disney", "RT @lindseyeryn: keep your eyes open,\nyour heart ready,\nand your hands empty.", "@70MultipliedBy7 I WAS GOING TO TELL YOU THAT LAST NIGHT LOL", "why is it during finals week I always find a new show to watch", "\"people don't want to get jobs so they just go and sing on instagram\" #congratulationspod", "@70MultipliedBy7 how bored are you", "@victoriateske I listen to ted talks while getting ready in the morning! and news podcasts", "hmu if you can make this happen", "attn everyone: I will be in Miami for two more weeks, so I would like to go to wynwood and eat donuts and drink coffee and go to the beach", "@berkingbad omgggg I watched a refinery29 vid about that today and almost bought it too", "@berkingbad which!!", "@70MultipliedBy7 https://t.co/l3F6KM0YnT", "RT @RheaButcher: I know we still need feminism because women get shit for being feminists and men are the shit for being feminists.", "RT @FourCM: #ScienceMarch #marchforscience https://t.co/7pWGh2sdP7", "RT @reynoldscriss: Pisces | Charlie Kelly\n- imaginative, sensitive, creative\n- indecisive, moody, submissive https://t.co/1U8NhwmjfJ", "@erinmaewalsh me", "RT @gIumkid: *watches pulp fiction (1994) once* https://t.co/Nop4PUgiRi", "RT @mishallem: the only man who deserves you is the one who thinks he doesn't", "RT @cafecitx: the lack of coladas nationwide is truly why america outside of miami is problematic", "RT @TrisAlexandra: 39. Epcot&lt;33333 https://t.co/NKSLkBgNCi", "I never thought I'd willingly listen to Spanish music but here we are https://t.co/zWdoa6IeTS", "@Jesskidding_ girl. yes.", "adult acne is one of the most frustrating things to deal with", "RT @HamillHimself: #HarrisonPointing https://t.co/aPHlmUC72p", "RT @TrisAlexandra: 14. HAHAHAHAHHAHA https://t.co/c1yQRRI8j5", "RT @orionnichole: these nights are lonely without you by my side", "oh my https://t.co/AC7Dukmncw", "RT @robbybarr1: Here at FGCU, diversity thrives https://t.co/bYgfXdIqSz", "my mom calls me her \"fiercely independent suffragette daughter\" and that's probably my favorite thing she's said to me (among other momisms)", "RT @emilyelisabethh: I really doubt anyone who says they're from California but also calls it Cali", "@vibesofmiami at Vicky's!!!", "RT @patgarcii: you don't realize how Miami you are until you leave Miami", "me, a classy lady: drinks wine out of an FIU Tervis because all my wine glasses are dirty", "RT @_IeekJack_: Date someone who you could have fun at the grocery store with", "RT @meowritt: daily reminder that you are completely capable of manifesting the life u want!", "RT @TheCIassicJams: *Gasolina starts playing* \n\nFriend: don't do it\n\nMe: https://t.co/XyHiJgJmpj", "RT @BuzzFeed: 17 inexpensive products that'll make you love journaling even more https://t.co/eZlnJfYUnT https://t.co/DL6blfDtU4", "RT @Subtweetg0d: Let's gooooooo. Let them prices drop baby. I'm about to be in first class for $35.78 round trip https://t.co/0smf9cQwgN", "@lulztxtit me realizing that too https://t.co/2MgcV7ShBe", "I just registered for my last semesters in undergrad y'all", "RT @djbbgar: showed my boyfriend this tweet and now https://t.co/FbAMJUz6Br", "RT @AbbyCamenisch: How am I supposed to just live my life when I want to eat tortilla chips all the time", "RT @rachsyme: Fitzgerald's ideas for future projects scrawled in his notebooks always make me lol https://t.co/cLHt3HZX9D", "@70MultipliedBy7 me https://t.co/f8chEDGg6S", "RT @orionnichole: the kind of kiss that makes you completely forget about any other mouth you've ever kissed once before", "RT @frncissdominc: I miss Magic Kingdom.. https://t.co/6uLlzn1K9S", "RT @marigaabyy: too full of life to be half loved", "@margaretpottah were they arguing over bulletproof coffee bc that is something I cannot get behind", "RT @yarrrow: idk what this meme is but i love it https://t.co/q1N60EgF9q", "I get to see Rob in a few hours and I am so excited it's not even funny", "RT @devhochuli: Does anybody else lie in bed at night and think about the coffee they're going to drink the next day?", "RT @preemptivelove: This thread. https://t.co/WPbbFU46Jm", "RT @unsmokabIe: https://t.co/sUSYbpbDHm", "RT @orionnichole: i could get used to writing about you", "@Kaitlyn_Ashley5 omg I bought a bag of them last time I was at target", "@70MultipliedBy7 https://t.co/CsWl21FEOU", "RT @iasipmeme: https://t.co/lcG3vxttOe", "RT @HeyCurlyGirly: How I call my dad when I go to get an oil change &amp; they tell me all the other things my car needs https://t.co/aG7Csi6lW2", "if I see one more recycled \"x will now have stories\" meme https://t.co/qvcClAggHF", "RT @cubanvelvet: she takes so long getting ready https://t.co/o82ych8QOt", "@meeeeeeems I 100% agree", "your 5 year plan is not the most important thing about you. you are just as worthy in this moment as you would be if you figured it all out.", "thinking about my future and this is all I want to do now: https://t.co/BlWi8zTCcD", "RT @cydney: https://t.co/2ufIgRDhiA", "@David_Merida @mandaxyz I binged all the episodes before the finale by accident and I'm so glad I did", "@dsaldarriagax I had a feeling but I didn't know who it would be and I was shook", "oh my gosh #BigLittleLies season finale OH MY GOSH", "when you call me dramatic @70MultipliedBy7 https://t.co/i29fNjBjZF", "RT @rachsyme: re-watching twin peaks from the beginning and dang young kyle mclachlan can get it forever", "RT @fettyGonz: Chick-fil-a not being open on sundays is the reason for the teardrops on my guitar", "@berkingbad @meeeeeeems this is so extra but I love it", "RT @BuzzFeed: 17 cheat sheets every home cook should know about https://t.co/dGtmjEvIaG https://t.co/3FDG9wKQw5", "RT @RonFunches: When you're watching When Harry Met Sally and finally realize who @drake got his style from. https://t.co/WoBv6uN7Vv", "RT @bustle: when you see your friends in public https://t.co/dMIr9fE9no", "RT @ohkayewhatever: I want everything in my life to be millennial pink", "@stephatdisney NorCal or SoCal?", "RT @indiebreakfast: forget the days we'd waste in bed, tangled, the smoke still on your breath, undressed and pinning you up to the wall.", "RT @actionshackson: when Mike Flynn testifies https://t.co/ZN7KXB3YA2", "@camiweinstock obviously omg I can't believe how I forgot I was begging for attention from some rando when I accidentally make eye contact!!", "@alienlover6669 you get what you pay for and I'd rather pay $30 for a nose piercing for it to heal properly instead of $5 to suffer", "RT @unsmokabIe: https://t.co/Za91G6HMk7", "I have my headphones in, listening to a podcast, and working on my laptop... isn't that enough indication not to approach someone?", "@smfigs THANK YOU", "oh heck yes https://t.co/o5eladm8un", "@70MultipliedBy7 when you call me out on twitter but don't text me back", "me, a RA: tie dying will be such a good program idea! https://t.co/HioYr4YZii", "RT @aparnapkin: i bet mike pence's safe word is patriarchy", "RT @tessie_the_mess: everything gets easier when you learn to assume everyone is an idiot", "RT @leonbridges: This is a blessing. Thank you #BigLittleLies @RWitherspoon and everyone that bought the record. https://t.co/TL1sJFDJ09", "@layyy_x0 @annavoig101 YESSSS like I'm gonna love people that I love and not treats \"feelings\" like a disease", "@annavoig101 being bitter takes too much energy lmao just relax about trying to be cool, who cares in the long run", "@annavoig101 @layyy_x0 I was thinking about this too!! feelings are a good thing, i don't know why people are ashamed to like things/people", "RT @AsiaCato: yes https://t.co/DNU4ofJL9m", "RT @harto: \"If they don't give you a seat at the table, bring a folding chair.\"\n\n - Shirley Chisholm", "@meeeeeeems I don't even know dude", "RT @Complex: Boss: \"Ready to meet?\"\nMe: \"Yep, just wrapping up some research! Be right there!\"\n*pauses this video* https://t.co/tS27mmDG5M", "\"to love and lose and still be kind.\" -warsan shire", "RT @perlapell: Hey Young Girls, finish your sentences no matter what look someone is giving you while you speak.", "@genopereyraa https://t.co/1XobxAG0VA", "me all today: https://t.co/yZMjvJLDYl", "@mishallem literally me", "@meeeeeeems https://t.co/E2tgokKHys", "RT @jfkantrowitz: \"There are years that ask questions and years that answer.\"\n~Zora Neale Hurston", "me: sneezes onces \nmy mother: \"put on a jacket, it's cold in the house\"", "RT @offlineshawty: when I'm not getting what I want https://t.co/PtMIyG9RZL", "RT @orionnichole: never water yourself down for someone else", "RT @wizardkelli: checking blackboard after I skipped all my classes for a \"me\" day https://t.co/cnkBIpCkU7", "RT @BabesWhoHustle: AMEN. Happy Friday, gal pals. https://t.co/wD0Fw5xLiD", "@_supgoddess TRUE", "how does anyone willingly wake up earlier than 9am I don't understand", "RT @joshbegley: Every NYT front page since 1852 https://t.co/ODtqJe18u8", "@FIU_AXO https://t.co/Vnzf07CTTq", "still my favorite thing I've ever googled https://t.co/RuzAe55asC", "RT @chooses: rt if ur dating the coolest person ever", "coffee naps are a real and wonderful thing", "RT @UglyGod: I never said this. I was talking about booty and toes the whole interview. https://t.co/HXE8QdRSxE", "whoops https://t.co/mDhZcIL8oX", "\"you showed up late, per usual, but you wore my favorite dress\"", "\"women represent the future... feminist perspectives represent the future\" #FIUWWL", "\"demonstrations are rehearsals for revolution\" -angela davis discussing the women's march #FIUWWL", "RT @bethnicole91: I'm in the same room as Angela Davis and my life will never be this cool again. #FIUWWL", "@70MultipliedBy7 gottem", "RT @WomensCenterFIU: \"This is really an opportune time to reflect on the leadership potential of women.\" -Angela Y. Davis #FIUWWL", "RT @WomensCenterFIU: \"I implore everyone to think about who is behind us and how can we bring them along.\" #FIUWWL", "RT @milanstarr: outkast: alright alright alright alright alright alright OKAY NOW LADIES \nladies: YEAH https://t.co/cNU4DMc8T5", "@70MultipliedBy7 https://t.co/7CMEH4vyin", "RT @matthaig1: Kafka's diaries show the real fun side of writing. https://t.co/h7UWC7UFVR", "y'all I just found my first white hair https://t.co/q6laDuFUuK", "RT @tinegreene: Me opening my planner after spring break https://t.co/xe2es4uKnu", "RT @Reductress: Woman Who Says She Needs Coffee Actually Needs Entirely New Life: https://t.co/TlG41hgFhb https://t.co/gUxlCDbOWS", "RT @karzizzle: Me, an intellectual from miami: \"day jam\" https://t.co/HgES1dMBQl", "RT @cmpriest: Lucy, outnumbered by cats. https://t.co/2J8x9dbnNz", "this is me #pickyeatersanonymous https://t.co/UnnahWd7O5", "RT @CoryBooker: Love this: https://t.co/4H97kCp677", "RT @hamiltonmikewaz: BUT WHAT DO HAVE IN COMMON? WERE RELIABLE WITH THE LADIES https://t.co/tnB9DMU7Km", "RT @merrittk: me: im in my mid 20s and nobody should look up to me\nme after a single glass of wine: im everyones wise mom", "RT @uncrtainty: i don't know where we'll stand a year from now but i hope we're still holding hands even if we're standing still", "RT @NYTMinusContext: scared, happy, tired, curious, ready", "Arts Advocates, it's time to ORGANIZE! Sign our petition to @realDonaldTrump to support the arts in America https://t.co/AXhnnBmRkZ", "RT @poetastrologers: Pisces on commitment: \"I love the way the light looks right now, don't you?\"", "they say it's hard to fall in love, maybe they never learned how to patiently wait", "\"not having a screen protector makes me feel like a wild man Dan\"", "did you really spring break if you don't post a bikini pic? asking for a friend", "@chloe_adams34 YES IM HERE FOR IT", "RT @theyearofelan: If you don't know what to put as your Instagram caption you can always just write \"mood\" or \"vibes\"", "RT @netflix: Love is sharing a password.", "RT @HouseofCards: Your loyalty has not gone unnoticed. https://t.co/ba1kz1yvXF", "RT @chelseaperetti: Good thing a woman isnt president! Too erratic and emotional", "RT @ArtenisaKulla: \"College is just sitting in different places with your laptop\"", "RT @chrisdelia: The shortest girls are like 3 years old so what you're saying is creepy. https://t.co/kHAFzT0FIa", "@DreadChapo @70MultipliedBy7 bring the rat", "when the evening pulls the sun down, and the day is almost through/oh, the whole world is sleeping, but my world is you", "RT @rupikaur_: #IWD2017 https://t.co/TpvdrTujGC", "RT @colesprouse: \"BUT WHAT ABOUT MEN-\" shhhhhh SHHHHHHHHHHHHHhhhHhhhhhhhhh\nhush now sweet boy shhhhhhh now is time to rest", "RT @parksandrecnbc: Say it loud and proud, Goddesses. Happy #InternationalWomensDay from #ParksandRec! https://t.co/2qqbEJ3XTY", "@smfigs oh no", "RT @voxdotcom: Today, #InternationalWomensDay, aims to raise awareness of women's issues worldwide. https://t.co/zFZF9GwclK", "if your feminism isn't intersectional, do a little more research #IWD2017", "I love this podcast y'all https://t.co/dT88tYwADn", "RT @bimadew: anyway, bye. https://t.co/oquZqFeid2", "RT @Phil_Lewis_: A successful woman https://t.co/z3mlH3z5pO", "RT @HerCampus: Getting out of your Monday class early like https://t.co/GmL2F7PJ7J", "@smfigs a good tear or sad tear", "RT @rmdrk: because when you fall in love, you fall out of self-control, and sometimes loving someone is the craziest thing in the world.", "RT @chelseaperetti: WHEN PPL GIVE ME UNSOLICITED ADVICE https://t.co/IRQ6cOpzRo", "RT @poetastrologers: I put a spell on you\nBecause you're mine\nYou're mine\n\n-Nina Simone, Pisces", "@_supgoddess that was our first stop OOPS but my mom got a macchiato there", "when my dad gets artsy with our photo shoot https://t.co/frGCTBwdC9", "I took my @PopSockets off my phone and it feels totally naked", "@_supgoddess I'm milking 21 for all it's worth", "calories consumed during your birthday weekend don't count right? bc I had flan and then later cheesecake and I just love dessert y'all", "@hey_rachh is it on netflix or?", "RT @PPFA: What Happens If Affordable Birth Control Isn't Available: https://t.co/h4MT05o1ts via @teenvogue #IStandWithPP", "RT @feministculture: Watch a European lawmaker stand up for women against her sexist colleague: https://t.co/4Qc2NNoAFY", "when your boyfriend sends this to you https://t.co/PC1In0Ewbm", "@_supgoddess girl GOOD LUCK", "RT @HerCampus: Sitting in class and counting down the seconds until the weekend like https://t.co/Hr7KFZk0Lt", "@saintalexaa I have a pinterest board of crockpot recipes", "@lauraaamarin I'm like halfway through that one, the ESPN documentary is 5 parts, like an hour each one but you can skip ep1", "@lauraaamarin OJ vs the people is on netflix!!", "has anyone else seen the ESPN documentary about OJ Simpson bc I am 100% hooked on this case", "RT @HereIsGina: #WomensHistoryMonth be about it ladies. Support yourself, support other women.", "RT @FlaPanthers: HUBY DUBY DOOOOOOOO\n\nCATS WIIIIIIINNNNNNN https://t.co/tJSPkc8kuG", "RT @tyler_struble: My aesthetic: Brie Larson not clapping for literal trash hole casey affleck https://t.co/Ci5LWXLkCr", "RT @von_owie: Modern discourse https://t.co/JwIroGpq1w", "RT @MatPatGT: Oscar loser for Best Makeup vs Oscar Winner for Best Makeup https://t.co/x9zKOyYGcE", "like I can actually order a beer at a bar and not lie about leaving my ID in the car??", "my birthday is in a week and it hit me that soon I'll actually be able to order alcohol when I go out??", "RT @pettyblackgirI: Let us not forget the time Lupita Nyongo invented the Academy Awards #Oscars https://t.co/bjL8OZawZ6", "RT @txctile: she has her own gravity pull", "RT @ErinChack: Ryan Gosling has had it up to HERE with your La La Land/Moonlight jokes https://t.co/K06RN10oJk", "RT @samuraiguit: It's Always Sunny In La La Land https://t.co/7UW4QNDARS", "THE ONE YEAR I DONT FINISH WATCHING THE OSCARS THIS HAPPENS", "RT @BuzzFeed: https://t.co/g5sriUfs9a", "RT @africabytotobot: [instrumental break]", "@vibesofmiami I think about this dress every awards season", "RT @SICKOFWOLVES: I LOVED LA LA LAND BECAUSE I ALSO CANNOT SING VERY WELL", "RT @michaelgungor: The future is female.", "RT @ColinxMC: when she been roasting you on the TL all day but you still love her to death. https://t.co/Jaj9zlaMrO", "RT @imcolenewton: Wot in constellation https://t.co/1eBJZyr1AT", "RT @saraabeann: wot in taxation without representation https://t.co/qPYmztJMey", "@laughingliz16 haulover beach in north miami!! it's near bbc", "occasionally my tattoos make an appearance https://t.co/rtbSAJQ1XC", "@Maddybake like a bandana kind of thing? or more French", "RT @KamalaHarris: Let me be clear: equal rights are not extra rights.", "@genopereyraa yes", "RT @cquinnyc19: Chick-fil-A doesn't effect my diet bc those are The Lords calories", "RT @haarleyquin: OK BUT THE GOOGLE DOODLE FOR THE NASA DISCOVERY IS THE CUTEST THING EVER https://t.co/SEN9XGB9mI", "RT @acornfriend: ambivert comics https://t.co/0IcPeAqgjO", "RT @SICKOFWOLVES: DO YOU TAKE YOUR COFFEE BLACK OR DO YOU LEAVE ROOM FOR JOY IN YOUR LIFE", "RT @Khanoisseur: Trump is first US president in 125 years without a pet https://t.co/z7Sy8JkLf1", "RT @funcoolmami: me when my friends romantic partners hurt them and I find out about it https://t.co/Gjuaq7O4VC", "whenever someone asks how I am on ACUHO-I &amp; NASPA offer day https://t.co/VGCihfKAPp", "@erkngarcia you're too famous for me now", "RT @unsmokabIe: https://t.co/CDj64BhDVx", "RT @MatthewACherry: Black women unbothered by the police: A Photo Series #BlackHistoryMonth https://t.co/n3XldzCUZ5", "thankful for cold brew coffee and dresses so I look like I have my life together with minimal effort", "@AngieGigiFierce there's a list of cheaper/better quality dupes from Refinery29!", "RT @Tarunitar: Donald Trump on the Campaign Trail \n(2016, historical photography) https://t.co/KqGv1WxpqU", "\"is this a friends documentary?! friends 2.0?!\" -Rob on the OJ Simpson vs The People documentary", "@thejessicacouto he's a red and tan Gordon setter!", "@ritazwiee @dog_rates how does Huck rate?", "@berkingbad look how handsome he is https://t.co/rglTTtN5sY", "@berkingbad his nose is tan and he has greenish eyes too I'm in love", "@berkingbad omg girl I know he's SO CUTE", "@meeeeeeems that goes without saying, my parents have been sending me pics and he's the cutest thing ever", "my parents got a puppy and he is the cutest thing ever (his name is Huck) https://t.co/ayVAsOb8LT", "RT @VagueMoi: YOU'RE MY, MY, MY, MY KINDA WOMAAAAAN. MY, OHHHHHH MY, WHAT A GIRL. https://t.co/cKqJast0gY", "RT @unsmokabIe: https://t.co/WbTgYbSlcG", "@_patriciaalexis dude me too like HONOR ME ON MY DAY OF BIRTH FOR THE WHOLE WEEK and I'm gonna milk turning 21 for a long time", "RT @cana_merula: #SondheimGifs  @Lin_Manuel \nIt takes two.\nI thought one was enough,\nIt's not true:\nIt takes https://t.co/EEAnMIyBhz", "RT @FlaPanthers: [insert one million goat emojis] https://t.co/9OAd8D9P29", "RT @8bitfiction: I miss you. This is all I am going to write until I see you again.", "RT @BeauWillimon: Learn from history, or be doomed to repeat it. https://t.co/wr4uROXK92", "RT @erinmaewalsh: @ritazwiee dream date: listening to/watching crime documentaries and podcasts", "\"girls, if a boy says something that isn't funny, you don't have to laugh\" -comedy saint amy poehler https://t.co/yfSRq8GwQd", "I've never seen something more accurate https://t.co/51QiFX17h9", "why do so many guys in Miami dress like they're trying to look like their Cuban grandpas", "RT @unsmokabIe: https://t.co/LQMhOZxQXc", "RT @DailyKerouac: We agreed to love each other madly.", "RT @unsmokabIe: photos from stranger things, season 2 (2017). https://t.co/FftPqqA4X4", "RT @dog_rates: Roses are red\nViolets are blue\nNo valentine?\nA pupper will do", "RT @Refinery29: #valentinesday2017 https://t.co/p4zLba7cfc", "slowly starving in class and my professor keeps starting a new topic every time I think she's going to end class", "your definition of feminism is very interesting https://t.co/wrMmyrx6Ja", "RT @onlywreckage: i'm more me with you. i'm more than me with you.", "RT @unsmokabIe: wes anderson + books. https://t.co/W7amNRB54i", "RT @nbcsnl: Don't even get Spicey started on Nordstrom pulling Ivanka Trump's clothing line. #SNL https://t.co/pmf08pQNUq", "behind the scenes: I had to beg Rob to take this pic for me https://t.co/TS4WxNdmiv", "RT @kailynn_bonilla: https://t.co/Rou7FOxouX", "RT @michaelgungor: GROWNUPS DO NOT TWEET IN ALL CAPS", "RT @mcmirandax: did hairspray not teach y'all anything??? be a tracy turnblad in a world full of amber von tussles", "RT @sorkinese: We've got separation of powers, checks and balances, and Margaret vetoing things and sending them back to the Hill.", "RT @Thomas_A_Moore: DeVos just released her proposal for the public school system https://t.co/VTahfLn72E", "was it foggy this morning? couldn't tell from everyone's snap story", "are raccoons included? https://t.co/jJ3O6m3bq3", "RT @callmeanjelito: when your spanish vocabularly is limited but your job application asks if you're bilingual https://t.co/AC7yx7FZln", "RT @GQMagazine: Words are hard. https://t.co/TifBKVrGpZ", "RT @orionnichole: all that you are is all that i need", "me rn: https://t.co/Pz8XLvHePB", "RT @papertimelady: \"Nevertheless, she persisted\" will seriously carry me through the day today.", "RT @Lin_Manuel: Good morning. \nBrains.\nHeart. \nCourage.\nDope shoes.\nYou're ready, Dorothy. Let's go.", "@70MutipliedBy7 get out of here", "@70MutipliedBy7 https://t.co/IsBF9YhDUc", "@genopereyraa the tinder date disaster you retweeted is so gross LOL", "@genopereyraa oh my god", "@70MutipliedBy7 I was distraught, please don't analyze my word choice", "so excited to see every student get screwed over by #DeVos!! what a fun thing to look forward to over the next four years!", "RT @ApocalypseHow: Are You Smarter Than An Education Secretary?", "RT @besthues: Her https://t.co/LjDIVSYFYa", "@dia_garciaa omg it was on facebook so don't look at their page", "RT @AbrasiveGhost: ME:[defending myself] Oh yeah?? Well I got 5 words for you buddy: please be nice to me", "I just read the hugest spoiler for jane the virgin by accident and lmao i'm so sad", "RT @DisneyPixar: \"It's a beautiful day, winds out of the east at 10 knots. Visibility: unlimited.\" #MondayMotivation https://t.co/rdUMJIUOtF", "@genopereyraa omg geno keep watching bc it's so much back and forth", "RT @rachelheldevans: Don't kid yourself. In this climate, silence is a political statement too.", "RT @bustle: just mentally preparing for Valentine's Day over here https://t.co/G7cJiqfq40", "RT @VeepHBO: No amount of coffee can save this morning. #MondayMotivation #Veep @OfficialJLD https://t.co/fDlUWiobmt", "RT @uhhmmily: Yes I love sports. The Falcons and *looks at smudged writing on my hand* the patriarchy", "trump is president, women still don't make equal pay, the patriots won again, what's next America?", "RT @portlandia: Time is running out. In general. #FeministSuperbowl", "RT @Lin_Manuel: AND SISTERHOOD. https://t.co/2Zx8Sg9XmW", "RT @portlandia: We will not celebrate a man scoring. #FeministSuperbowl", "@genopereyraa ur the cutest", "caring about politics and caring about makeup shouldn't be two separate things- I can wear red lipstick while dismantling the patriarchy", "RT @N0TEVA: https://t.co/bVEcHcd0vI", "RT @laurenduca: Pretty much https://t.co/iRJ17y95Ad", "I took a nap at 9pm and my perception of time right now is completely wrong", "RT @nicolespiezio: What if there was another theme for a party besides Great Gatsby?", "RT @BuzzFeed: 19 times Schmidt was the best part of \"New Girl\" https://t.co/7bo2LXKgYp https://t.co/L2gNhNy5Xd", "@70MutipliedBy7 https://t.co/KU2VXFEcih", "RT @littlest_sprout: I hope to day your coffee is extra good &amp; someone hugs you extra tight &amp; you just have an extra happy day", "@stephyjara @_patriciaalexis it was so beautiful and well done and ugh my heart", "excited to be in Orlando next week for Rob of course but also Lazy Moon pizza", "RT @TWLOHA: \"You are unrepeatable. There is a magic about you that is all your own.\" - David Dellinger", "hello everyone I just finished La La Land and WHY DID I NOT SEE THIS EARLIER", "RT @baeryl: im Asian and even I know it's called orchestra https://t.co/yeaXL8IQt5", "JANE IS FINALLY GETTING MARRIED IM SO HAPPY IM SO BEHIND ON JANE THE VIRGIN", "RT @SFBART: Another day, another commute! Stay safe and courteous- especially you, @KarlTheFog. https://t.co/G0Stipzrdy", "RT @Nate_Cohn: Striking that Alaska Senator Murkowksi is a no vote on Devos, given that the state contains 98% of US brown bears", "RT @PamelaPaulNYT: A full page in @nytimes today dedicated to a poem. One that everyone should read and reread. https://t.co/sNHr60xUvH", "@genopereyraa i'm so confused by males sometimes", "RT @Real_Expression: If you ever wanna see some stupid shit, go on I95 when there's traffic and watch everyone try to merge at the same time", "@Jaggerlarson hi jagger", "RT @hamilbots: I am the one thing in life I can control. I am inimitable, I am an original", "RT @ahandsomefir: how we always love harder after it rains.", "RT @xannyhanny: Venmo me $5 and I'll DM my honest opinion of you", "RT @BuzzFeed: How Taylor Swift played the victim and made her entire career\nhttps://t.co/Ob3tcatnLl https://t.co/DnZjJ5OzYh", "I know that's not a political tweet but man I really am gonna miss Cuban food", "RT @malonebarry: This clip is unbearable. https://t.co/F31SaXYuGu", "RT @_hudahassan: you have to understand,\nthat no one puts their children in a boat\nunless the water is safer than the land\n\n-- warsan shire", "RT @womensmarch: We stand with Sally Yates, a true American hero. #ThankYouSally #RESIST https://t.co/fSxUYkZGMD", "@Jaggerlarson I love how it came out!!", "\"it's really astonishing that in a country founded by immigrants, 'immigrant' has somehow become a bad word.\"", "@genopereyraa https://t.co/DRDU91iEEp", "RT @AndrewBloch: Powerful New York Times Magazine front cover https://t.co/CIUwMrTilh", "!!!! this! https://t.co/kXu2SQDUsA", "RT @TWLOHA: Hope is infinite, and so are you.", "RT @RowanBlanchard: https://t.co/12d6WLPHjd https://t.co/MlukFQ9gg5 https://t.co/LjcQRWbC2Q DONATE WHATEVER U CAN", "@lindscolaco I like especially how he put your name (spelled wrong) after the question", "RT @orionnichole: i like to feel your eyes on me when i look away", "RT @sorkinese: Why don't you take your legislative agenda and shove it up your ass.", "RT @coffee_n_mtns: This is so pure https://t.co/hw8AmTUoaR", "RT @KatzOnEarth: First they came for the Latinos, Muslims, women, gays, poor people, intellectuals and scientists and then it was Wednesday.", "@Kaitlyn_Ashley5 man I always feel like this", "RT @ChickfilA: You're one-of-a-kind, just like a Waffle Fry. #WorldComplimentDay", "the national parks tweeting about climate change + other things is the best thing about today", "RT @IFC: Reminder. https://t.co/La9ritrQYx", "RT @BernieSanders: I will do everything I can to stop these pipelines and protect our planet for future generations. https://t.co/W18GzYr0tI", "RT @sassafrasskim: How is it that Trump has signed at minimum 5 executive orders since FRIDAY and people aren't talking about it???", "RT @nicole_soojung: it just doesn't seem right that this is how we're all going to feel now, all the time.", "RT @nickbilton: The NYT calling it exactly as it is: a \"Lie.\" https://t.co/e3cELLsPXn", "RT @90swomen: https://t.co/k9H8xkoMYM", "@melmnzn same with tap 42 and rok brgr", "RT @rgay: Women did something incredible today.  Women, specifically.", "RT @downtomarzz: Women's march Miami, FL @womensmarch https://t.co/kPDE9owUyY", "RT @rizmc: https://t.co/RX2RQPU5Al", "RT @IFC: Protest. https://t.co/e7azzX6lf5", "RT @TWLOHA: \"To define is to limit.\" - Oscar Wilde", "RT @IFC: Women &amp; Women First https://t.co/WaTKSF3UVj", "WELP: https://t.co/M0pXbFJ3J7", "RT @PWRBTTMBAND: be your full self. be radically kind. laugh at ignorance. be fabulous. and love with the force of your heart.", "hobbies include having photo shoots in front of home depot holding an orchid https://t.co/YnO7zvGuTt", "RT @BritandCo: Keep choosing hope. \nKeep choosing change. \nKeep choosing kindness. #WomensMarch #Inauguration https://t.co/jT6sAfmNiG", "RT @JohnnyHye: 40 years ago on January 19, 1977 it snowed in Miami, today its 81 degrees https://t.co/KAiBsmyXcY", "RT @HouseofCards: We make the terror. https://t.co/VpChwGOSMj", "RT @POTUS: I won't stop; I'll be right there with you as a citizen, inspired by your voices of truth and justice, good humor, and love.", "RT @Lin_Manuel: Good morning. What's next? https://t.co/7Ng3W5iOjI", "I'm excited to go home for three reasons: seeing my dog, doing laundry for free, and actually having good wifi", "RT @unsmokabIe: https://t.co/Wg13fYUy2w", "@Jaggerlarson glad i'm not alone", "Rob called me and then proceeded to read Young Thug lyrics out loud instead of talking to me #ok", "RT @JustineBateman: Retweet if you went to a public school. I did. https://t.co/mgxzJ3VxQa", "RT @eliesaaab: Black Mirror Episodes, by Brazilian artist Butcher Billy (2016) https://t.co/X3y6fOgpIg", "RT @Lin_Manuel: Gotta go to work. https://t.co/crQHXfF8J8", "no puedo omg https://t.co/BjqobDO5sI", "@genopereyraa I believe in you", "RT @Luzion: Rest In Peace to my favorite vine of all time https://t.co/Tglw9twm5M", "\"I have decided to stick with love. hate is too great a burden to bear.\" #MLKDAY", "RT @hamilbots: History is happening in Manhattan and we just happen to be in the greatest city in the world", "RT @IsaacFitzgerald: When life's problems keep piling up but you're trying to stay positive. https://t.co/VQZ5K6HLXO", "RT @erkngarcia: if i had a dollar for every brunch pic i see on insta every sunday i'd be able to afford to go to brunch every sunday", "RT @artfulIy: https://t.co/73EGnH2JWE", "RT @indiebreakfast: feels like a great day to waste in bed", "RT @gawdduss: hi my name is junie b jones the b stands for bad and boujee https://t.co/KERpvw6qIR", "RT @IFC: #Portlandia's 8th season will be its last. https://t.co/szPcHgOnZ7", "RT @artfulIy: \"I would rather die of passion than of boredom.\" \n-Vincent Van Gogh https://t.co/7IqSGIizTy", "RT @kumailn: Always Sunny in Philadelphia has been on for like a hundred years and is still one of the funniest shows on tv.", "do you ever just need to cry in a bathroom for a bit to regain composure bc I just did", "RT @Laahh_5: Fitbit dashboard of a college student:\nSunday: 14 hours of sleep, 100 steps\nMonday-Saturday: 4 hours of sleep, 10k steps", "RT @IFC: Take your relationship to the next step. #Portlandia https://t.co/aFhhWUNFQf", "\"feminism isn't about making women stronger. women are already strong. it's about changing how the world perceives that strength.\"", "I would like everyone to know that Rob hung up with me to take a snapchat of a lizard sitting on the hood of his car", "RT @1a: If it is fake, it is not news. https://t.co/1HlXOuO1F1 #1Ashow https://t.co/my1btNraJw", "I just applied for a bunch of @ACUHOI summer internships and I am so so excited to see what happens", "@mishallem seeing the recipes all over pinterest makes everything worse", "I had an apple and peanut butter for dinner", "RT @Lin_Manuel: Happy birthday, Alexander.\nThanks for everything.\nSee how your legacy blooms from your mansions of rest.", "RT @ComedyBangBang: This week's appropriate reaction to...everything. https://t.co/ErudZZs9TL", "RT @besthues: San Francisco, California https://t.co/u1y4ozGG0M", "you know everyone shops at @Target when you walk around campus and see three other people wearing the same shoes as you", "RT @swtextpost: https://t.co/W53wnCNndd", "when you can't decide if your headache is from too much coffee or lack of coffee", "RT @NYTMinusContext: I think I like stressing myself out", "RT @TWLOHA: Better days are ahead. Keep fighting for tomorrow.", "@sassafrasskim these tweets are literally how i felt watching westworld", "@alienlover6669 clean it with wound wash!! or saline spray and don't move it around if you can help it (I kept getting keloids on mine too)", "RT @jordandubz3: that Barack and Michelle love", "RT @DearYouFromWe: idk how you found me but i'm so grateful you did.", "RT @dorrismccomics: oh no https://t.co/tzZlfBoMHL", "RT @halcy: Black Mirror (2016) https://t.co/RSNfaubPBY", "RT @paintmyfeeIs: i hope you read some fine books and kiss someone who thinks you're wonderful https://t.co/Hhik62ZtZS", "RT @BuzzFeed: 24 horrifying but fascinating true crime podcasts you must listen to https://t.co/JlXcp3h2Z2 https://t.co/1HjzRahbM2", "me right now after having cold brew nitro on top of cold brew: https://t.co/bLlrYkXKWE", "watching Black Mirror and being over caffeinated is a TERRIBLE idea bc it makes me even more anxious", "@Kaitlyn_Ashley5 @Jaggerlarson define \"zooted\" and use it in a sentence please", "RT @umsassy: do ur squats \neat ur vegetables \nwear red lipstick \ndont let boys be mean to u", "@aniahopes yes!!! 8-3!", "@_supgoddess PLS YES", "so who's gonna take candids of me at Vicky Cafe this semester? taking applications now", "@victoriateske SAME. it makes me sad my current planner goes until august bc I want to buy a new one LOL", "RT @BuzzFeed: my heart https://t.co/kyxi01xnTn", "@erinmaewalsh https://t.co/HIQ876uPiG", "@mandaxyz you're super hip I don't know what you're talking about", "@ClaireHolt5 omg yes!! what is it?", "@coricobain I was slightly inspired by this tweet", "@_supgoddess https://t.co/vKKIBk9caF", "I use memes on my program flyers to stay ~relevant~ with the youth", "RT @NYTMinusContext: scary stuff, like the news, is not advised", "I love leaving scathing Yelp reviews for bougie-ass places", "RT @bustle: me: *accomplishes one task* https://t.co/SWx8s1M6R2", "RT @ohkayewhatever: #IStandWithPP https://t.co/fCxDTg5YO2", "RT @redgaskell: How bad do you want to go to #Coachella? \n\nhttps://t.co/usNsRcjppk https://t.co/WELaeI2aTd", "RT @OrlandoCitySC: Always a part of our new home. #OrlandoUnited https://t.co/S28OQd8nmG", "RT @tbhjuststop: [sees a dog] [gentle gasp]", "RT @BuzzFeed: 19 products that will enable your bullet journaling habit in 2017 https://t.co/mII5yyPq8v https://t.co/FhY1q8Ue7x", "RT @limitedally: Yeah Coachella is cool and all but have you ever been to Target", "RT @Astronomikal1: Your MCM thinks Barnes &amp; Noble is a library. https://t.co/oh1sHzTLaW", "@Jaggerlarson :/", "RT @NYTMinusContext: saying goodbye to my dreams of being a domestic goddess", "RT @onlywreckage: kiss me the moon is watching", "RT @radnature: San Francisco, California https://t.co/NmNLAK9A3u", "RT @listendarlin: my heart's always yours", "Rob is laughing his ass off at Spongebob but never laughs at my jokes???", "RT @blackgaygemini: It really is a beautiful first day to this year. Trying to hope for the best.", "RT @BuzzFeed: new year, new me https://t.co/5qg9lRMpJ2", "RT @Lin_Manuel: Before #OldManMiranda falls asleep:\nHappy new year.\nI feel so lucky to have you in my life. \nLet's make new things.", "RT @ch000ch: [slowly rises from trashcan while 2 friends are making plans without me]\ni am also free that day.", "RT @lyricaIart: Elvis Presley // Cant Help Falling in Love https://t.co/Cbudc7F0gd", "RT @KimmySchmidt: This #NewYearsEve, give a final \"Later, gator\" to the problems of yesteryear!", "I just want to travel and get a new tattoo and another piercing and drink lots of nice coffee but being a broke college student sucks", "RT @hyped_resonance: does mercury have anything better to do than always going into retrograde", "RT @halsey: I love everything you've ever touched and because of that I love myself", "RT @valerieunion: after all this stress, money, &amp; hardwork I've put into my education? \n\nissa negative. https://t.co/Ov2tlGMZtF", "it's so boring being on duty that I keep napping to make the day shorter", "RT @MiamiHerald: And here it is ... Dave Barry's 2016 Year in Review! https://t.co/p4ljefZgmZ https://t.co/0SLnJBubLS", "RT @stteezzy: last yosemite trip of the year https://t.co/JLgfTKMAmj", "RT @restot50: Egon Schiele https://t.co/fC9qPezhrC", "@Postmates_Help but why does this happen even when an order won't go through?", "RT @IFC: Ready for 2016 to be https://t.co/LE7X0bTZQQ", "my heart rate is so high sometimes that my Fitbit thinks I'm working out when really I'm just watching Netflix", "@TheRobDiDonna I'm cracking up omg", "@meeeeeeems ? https://t.co/PdfcwCcV6u", "RT @IanDeloney: California mountains feel like a dream https://t.co/Lgkcbesc8x", "RT @MyDudes_: https://t.co/BOrnqOjDRU", "Carrie Fisher as Princess Leia taught me that being a a girl and being a badass aren't two separate concepts.", "RT @HamillHimself: no words #Devastated https://t.co/R9Xo7IBKmh", "RT @onlywreckage: when you walk into a bookstore &amp; you take a deep breath. she's like that.", "I hope someone says \"you betcha\" to me at the airport", "@_supgoddess LOL there was a time before hip glasses", "RT @HistoryInPix: Harrison Ford, 1980 https://t.co/U0SUlLU5e7", "oh my gosh???? https://t.co/ejYWnTFtbx", "can my grandma update the pictures of me that she has in the house bc I don't look like that anymore https://t.co/McGDDQFTug", "my mom: we need to sit together in church \nme: for moral support?\nmom: no, I need cover to watch my movie", "@natissss I walked outside this morning and I was way too excited", "RT @Cinemartistry: Elf (2003) \nDirector: Jon Favreau \nCinematographer: Greg Gardiner https://t.co/OSWrfCaHgY", "THERE IS SO MUCH SNOW OUTSIDE I AM IN AWE CAN YOU TELL IM FROM FLORIDA", "RT @artfulIy: https://t.co/G3HyTsN825", "RT @luigiimbro: It's time for the Festivus airing of grievances https://t.co/Cjws45lqFn", "RT @SenSanders: The women of this country have the right to control their own bodies, not politicians. No cuts to Planned Parenthood.", "RT @VieraBRO: This is the least Christmasy Christmas I've ever Christmased.", "RT @BuzzFeed: 19 reasons you should be drinking so much more coffee https://t.co/dfx8VkifRF https://t.co/Y2LfFhAqDq", "RT @onlywreckage: turn love into music. slow dance in the middle of everything. cooking. conversations. the rain.", "RT @onlywreckage: you should never have to apologize for the way you need to be loved", "North Carolina, I'm a fan of you. https://t.co/HfsGA9m72a", "RT @DepressedDarth: When you finally get to kiss your crush https://t.co/Zv5xnNkuBr", "RT @TristanRBoyd: @ritazwiee this choice of emoji confuses me I can't tell if you're glad or #overit with these road trips", "@TristanRBoyd 10/10 over it; I just want my own bed and solid ground", "rob is fired as my photographer that's all https://t.co/nIY2dXIGZg", "RT @Complex: Did you know that 'Scream' was based on a real serial killer in Florida? https://t.co/sYYmycTVjn https://t.co/O1aeggk8D7", "it's officially too cold to drink iced coffee y'all", "@erkngarcia girl i've been at this point and it is terrible let me tell ya", "@margaretpottah dude yes watch Westworld it is SO GOOD and James looks SO GOOD as a cowboy", ".@LittleCityRal thank you for turning a disappointing night into a great one", "RT @DetroitRedWings: .@NHLCanes What are you waiting for, the ice to freeze? https://t.co/0POO2owTPX", "I'm shook https://t.co/vjbA5mBXPz", "RT @ClickHole: Will You Make A Suitable Bride For Oscar Isaac? https://t.co/RIOubazT9d https://t.co/QNRX9ej8OB", "RT @JulianPar__: Work hard now so your daughter doesn't have to sell Herbalife products", "@ritazwiee @HighFiveCoffee @OverEasyCafeAvl", "@Bootybrooke I would reconsider my relationship at that point lmaoooo", "@Bootybrooke this is serial killer material honestly", "traveling with just your boyfriend is awesome but hard bc no one can take cute couple pics of the two of you", "RT @TFLN: (512): I responded like every reasonable adult would. With a gif", "RT @jonnysun: Can Dogs Be Millenials", "@TristanRBoyd look at this bookstore we went to in downtown Asheville https://t.co/UKlcbJkJIr", "Rob is making me listen to bluegrass since we're in South Carolina, pls send help", "why is everyone in new york this weekend", "RT @StirvinoLady: Reposting my #Westworld fanart. I'm SO excited for the finale tonight!! https://t.co/H5tSeE5BXo", "@alienlover6669 dude that math class kicked my ass too", "RT @hohjiro: me at 3 AM after I told myself I was gonna go to sleep early https://t.co/7I3RF2d1Al", "my favorite thing about when grades post is when everyone humble-brags on insta with screenshots of their GPA's", "@_supgoddess https://t.co/DvCU7QQQV2", "I'd like to thank all the coffee, tears, Quizlets, and translation apps for getting me through this semester", "the phrase \"morning coffee\" still applies if you woke up at 2pm", "All up in that #SkimmLife https://t.co/8yQjixm6sn via @theSkimm", "RT @shakirabernal: iconic https://t.co/2oaxAjn4yf", "RT @AJEnglish: \"Save Aleppo. Save humanity.\"\n\nResidents of East Aleppo are giving their final messages to the world. https://t.co/Hzd4VWp0wC", "RT @DanaSchwartzzz: https://t.co/Y7oP3rZcwh", "RT @alyza_enrique: You vs. the guy she told you not to worry about https://t.co/GNnRLtUOJj", "RT @sam_reginald: You (hasn't seen Ratatouille): gross get this rat outta here\n\nMe (smart, has seen Ratatouille): now wait just a minute", "RT @netw3rk: 2016\n\nMedia: white supremacists dress nice now\n\nTeen Vogue: Trump is destroying democracy", "RT @bustle: mood https://t.co/p4QO99y1CV", "RT @punkheist: if wearing things more than once makes people broke then i'm the most broke out of all https://t.co/0V7KWyIwzQ", "I FINALLY FINISHED ALL MY FINALS", "why is it whenever I cook at my boyfriends house I accidentally manage to smoke the kitchen up? :-))", "@natissss you're famous dude", "@Kaitlyn_Ashley5 @TheRobDiDonna @Jaggerlarson noooooooooo", "RT @natissss: People think Disney World is the best place in Florida but in all honesty it's Publix", "Rob and I started #Westworld and oh man how did I miss this one bc I'm loving it", "RT @noahihardlynoah: oopsie daisies. oh-no roses. blew-it tulips. damn-it-all daffodils. tarnation carnations. fukk-it-up buttercups.", "RT @portlandia: If any of us is unable to speak and goes down, what's the signal? https://t.co/mWyq5w7pO0", "RT @PINKFIU: Day after VS Fashion Show feels... https://t.co/TCgDtsYwq9", "RT @tomwaIker: \"Thursday I don't care about you, it's... https://t.co/Y55Z8xcJH0", "RT @ChipotleTweets: Your secret santa wants guac.", "if this isn't me https://t.co/AoWVNGpPoF", "watching the clock run out when I'm left with an ingredient I forgot to include", "I'm watching Chopped instead of writing a paper and I think that's a pretty good analogy for this semester", "RT @CuteEmergency: this. this is where I want to be. https://t.co/qhgNoOskUm", "RT @HistoryInPics: Harrison Ford in a kitchen in the late 70s. https://t.co/F4sbtx9MKC", "I just want everyone to know that my boyfriend got banned from Runescape bc he was using illegal software #nerdalert", "RT @WaltDisneyWorld: To the man who started it all - Happy Birthday, #WaltDisney! https://t.co/AShFBSrtkE", "RT @HalfAtlanta: THANK THE\nWATER PROTECTORS\nAND ORGANIZERS\nWHO HAVE BEEN\nFIGHTING THIS\nBATTLE FOR MONTHS,\nNOT PRESIDENT OBAMA", "RT @BuzzFeedNews: BREAKING: Dakota Access Pipeline Will Not Pass Through Standing Rock Reservation, Army Decides https://t.co/h7GgbhOoEJ", "RT @frvnxcesca: Trader Joe's in the bay lit https://t.co/I82ajYQqLr", "RT @Blackedpoetry: https://t.co/vfakNhQcoO", "the gilmore girls' costume department is very inspired by anthropologie and pinterest and I'm digging it", "RT @unsmokabIe: spotify's \"thanks 2016, it's been weird\" ad campaign is brilliant. https://t.co/HO8bi9KSdg", ".@ComedyBangBang is ending? more like comedy bye bye", "\"america's ghostwriters, the credit's only borrowed\" #HamiltonMixtape", "RT @fiImart: That '70s Show (1998-2006) https://t.co/Gj9JAb1ILU", "between the #HamiltonMixtape and the new Childish Gambino album, I don't know what to listen to first https://t.co/u8OYKNsSZj", "RT @HuffingtonPost: Let's go, #HamiltonMixtape day https://t.co/X6gj4PbHu4", "RT @BuzzFeed: Trying to make plans like https://t.co/YbmfyhSXc3", "RT @dorrismccomics: a warm and cuddly comic https://t.co/KDwEsFmPeB", "@TristanRBoyd interesting", "there was some lady who half heartedly yelled out 'boo' during the trevor noah-tomi lahren interview &amp; I identify with that", "RT @bustle: someone describing me https://t.co/wHwapkdXpe", "RT @brittanycribb_: If you're reading this, even if we barely talk, please Venmo me twenty dollars.", "plans for december: https://t.co/2pIcgTOaqe", "@margaretpottah this made me laugh really hard omg", "RT @margaretpottah: @ritazwiee when you start the next one https://t.co/zAhAJmQSCl", "RT @PDQFreshFood: *December 1st*\n\nPassing grades on my finals wya?\nChristmas break wya?\nSummer wya?\nChicken tenders wya?", "@TheRobDiDonna yeah ok", "@TheRobDiDonna you're trying too hard w/ three different captions to the same pic", "@TheRobDiDonna stop trying to make a meme happen", "@TheRobDiDonna fight me", "when you finish one of your four essays https://t.co/W192z92XyQ", "RT @portlandia: Triggered. https://t.co/IYpX55rAlz", "most of the text conversations between me and @erinmaewalsh consist of duck sightings and the difficulties of liquid lipstick", "@TheRobDiDonna omg https://t.co/AvD38s1zyV", "RT @portlandia: [dreamy chillwave music]\n\n#CalmMeDownIn3Words https://t.co/cLweVH4wqy", "@genopereyraa \"babe what are you doing\" \"it's so i can be twitter famous\"", "@BestBedrooms @genopereyraa dude imagine her laying all that shit out in front of him and asking her boo to take picture of her for twitter", "RT @erinmaewalsh: when you find a spot in the library during finals https://t.co/jebXKZCv8y", "web md is the worst bc I just scared myself into thinking I have appendicitis by googling one symptom", "RT @thinkpiecebot: What Hipsters Get Wrong About Feudalism and Kylo Ren", "@alienlover6669 LOL GROSS NO", "@Jordang563 the one by the main door LOL they cleaned it thank goodness", "@saraabeatricee we have one on campus and it's so hard to not go every day", "someone peed in the stairwell over the weekend and if that doesn't describe a freshman building I don't know what does", "RT @iamkidpresident: Your life is the greatest dance you'll ever dance.", "RT @ssarahibarra: I WANT TO BE AT DISNEYLAND WITH A CHURRO IN MY HAND AND ENJOYING THE CHRISTMAS DECORATIONS EVERYWHERE", "it breaks my heart to hear about the @OhioState shootings and be upset about it, but not at all shocked.", "facebook is killing me right now bc of the gilmore girls spoilers NO ONE TELL ME ANYTHING OK", "RT @FIU_AXO: Finals week is approaching. https://t.co/WXSvFQZB0k", "RT @jwbost: Miami's response to Kaepernick praising Fidel Castro...\nhttps://t.co/n9nUznQBxF", "@hey_bench @MyFavMurder I just started today and I'm in love; crime and murders are a weird thing I love", "@MyFavMurder is my new favorite podcast, that's all", "RT @weakroses: 49. ronald \n- paid a girl to date him\n- i couldve loved u for free. \n- messed up big time https://t.co/sX1pgpQ7LM", "RT @_ThatGuyT: Congrats to Fidel Castro for finally becoming a good communist! https://t.co/485ZrG9CYS", "this dog is living my dream life https://t.co/Metj6IPIlK", "ITS BACK ITS BACK #GilmoreGirlsRevival https://t.co/efC195Sgxp", "RT @HistoryInPics: Marlon Brando in 'A Streetcar Named Desire,' 1951. https://t.co/ioASoSlUWt", "RT @genopereyraa: @ritazwiee lipstick always helps", "@genopereyraa @beautyguruhacks true honestly and i wanna hate myself less by looking pretty", "RT @TheWildSide57: RT if you from the other Florida https://t.co/QYop4muem5", "RT @AVAETC: In all things, be grateful. xo.", "@_supgoddess I'm in awe oh my gosh", "RT @unsmokabIe: https://t.co/Uwks2sFTIS", "RT @waterslide: treating my girl today https://t.co/L9dg29Yxis", "I told Rob I had a bruise on my leg and he proceeded to poke it #ok", "when your boyfriend's mom makes thanksgiving dinner a night early so you can be there https://t.co/nXsMRfUZFI", "RT @LittleSimz: love selflessly", "RT @ComedyBangBang: Careful in the kitchen tomorrow. #cbbtv https://t.co/cTIMrWLVcS", "@lauraaamarin LOL the best use of this gif honestly", "RT @rodimusprime: A Seat At The Thanksgiving Table Charlie Brown. https://t.co/8Je6F8kveX", "and yet I saw a girl wearing uggs today https://t.co/fV6nf3jfPf", "yo @FlaPanthers I drove 4 hours to watch this game and y'all are losing??? this is how you repay me??", "RT @chrisdelia: When someone watermarks their  memes. https://t.co/87uF3jgqPC", "@TheRobDiDonna @erinmaewalsh yeah but the bitmojis look the same regardless", "@erinmaewalsh when you're both lowkey mom's", "RT @erinmaewalsh: true friendship is having bitmojis that look like each other https://t.co/8z6OIwDsaI", "RT @lulztxtit: @ritazwiee https://t.co/but6e7ldZJ", "@lulztxtit honestly us", "RT @lulztxtit: me with @ritazwiee https://t.co/zLI12rytiu", "RT @TWLOHA: \"be easy. take your time. you are coming home. to yourself.\" https://t.co/gEtmdc1Kx4", "@SAKComedyLab making my improv heart so happy tonight https://t.co/EXVC4bFHYI", "RT @portlandia: If found, please return. https://t.co/HrK5leZsxV", "@TheRobDiDonna i can't argue with that", "@TheRobDiDonna bitterness doesn't look good on you", "@TheRobDiDonna you tried this once with the arthur meme, let it die", "I love how considerate some people are", "taking the bus to orlando rn and the guy next to me feels the need to spread out his elbows as much as possible", "RT @Latinegro: Kanye: I can't have an opinion?\n\nMe: Did you Vote?\n\nKanye: No.\n\nMe: https://t.co/F2oERqQbLa", "RT @asolezz: forcing ur friends to listen to ur indie music like https://t.co/U69rTTYQts", "@alevids notting hill, four weddings and a funeral, bridget jones' diary (and the sequel)", "RT @Cats0ntheprowl: Feelings rn https://t.co/N6l8dVnQQC", "RT @natissss: Constant \"wish you were here\" and \"wish I was there\"", "RT @portlandia: Full extension. https://t.co/c0VrIe35XB", "RT @AlphaChiOmegaHQ: #ItsOnUs to be a part of the solution. We can make a difference. #AXO https://t.co/nAmvwXA0D1", "RT @ashleyiidk: IF I WAS A FLOWER GROWING WILD AND FREE ALL I'D WANT IS YOU TO BE MY SWEET HONEYBEE https://t.co/t1IEDmXBU8", "RT @Lin_Manuel: Good morning.\nSurprise. \nThere's a spark in your eyes. \nThere's a home just your size.\nLike, you guys.\n*waves hi's*", "me: sets a timer for a 20 minute nap \nalso me: falls asleep for an hour", "ugh https://t.co/sDOkUrkpQ7", "RT @libbyhoward_: lead a life worth writing a song about", "RT @SenSanders: We are not going to allow women to be insulted and attacked and have their rights taken away from them.", "@genopereyraa can u pls", "RT @lizziemsuarez: me: woah, yellow light i should slow down\nthe miami driver in me: floor it. https://t.co/edLCm6Motn", "can it be friday already?", "I am tired of spilling coffee on my keyboard", "RT @lindseycolaco: the motto https://t.co/1iRNmmzzt5", "RT @LilStumpss: Take a min take a read on this thread https://t.co/mG29cYyzFd", "@emilyrivero @genopereyraa also why does she have two beds", "@genopereyraa https://t.co/8DsBKtNLXw", "@BZwief dad but without the spanish https://t.co/fdtpJqeLcz", "RT @_melinajohnson: when his whole existence is annoying but u love him https://t.co/88vJHO8iGH", "RT @cakefacedcutie: what u do when u n ur bf r arguing and he's making valid points n u run out of things to say https://t.co/uE9qQeKsr3", "@TheRobDiDonna https://t.co/gZGv78C42y", "RT @Lin_Manuel: Good morning. \nTake care of yourselves. \nTake care of each other.", "RT @mariasherm: honestly we have all dated young bernie sanders https://t.co/9R4gwdfzck", "RT @genopereyraa: @ritazwiee that's a 12/10 puppers", "this is my family honestly https://t.co/rPeCd2nPJY", "dogs are the worst to take selfies with https://t.co/cUAOl7yBk4", "@genopereyraa just saying the truth", "RT @bustle: me: tries to be the bigger person\n\nalso me: https://t.co/jzHbjokN2Q", "RT @Lin_Manuel: Good morning!\nRise &amp; shine!\nor\nRise &amp; sulk!\nor\nRise &amp; weep!\nor\nRise &amp; roar!\nbut\nRISE", "@alienlover6669 omg that is SO ANNOYING when guys ask that", "@genopereyraa what is this", "RT @NYTMinusContext: finally finding something close to adulthood", "@margaretpottah my grandma called me during the election season bc she was scared I was turning into a liberal", "RT @MarnieTheDog: Honestly, truly. https://t.co/GUnmk0SugF", "RT @reIatabIe: THESE MAKE ME SO HAPPY https://t.co/4jrH4eRv0k", "RT @MarnieTheDog: Brunch time (that means breakfast and lunch smooshed together) https://t.co/2C5Q9qOVdd", "RT @heyifeellike: sometimes u need a gold star in college https://t.co/L5LCueoCrf", "\"I'm no longer accepting the things I cannot change. I'm changing the things I cannot accept.\" -angela davis", "pro tip: if you're already running late for class, stopping for coffee is totally acceptable", "RT @TWLOHA: \" ... hope has an astonishing resilience and strength.\" - Kathleen Norris", "RT @magsvas: https://t.co/4N1yjnkg3o", "huge huge thank you to Rob for making me feel safe and staying on the phone with me for two hours as we watched results pour in last night", "What do we tell the children? https://t.co/ZtEFrO4ecC # via @HuffPostEdu", "the worst has happened. but now let it settle, and let us move forward + show love and empathy and support to those who need it the most", "RT @Lin_Manuel: Good morning!\nBahahaha I didn't sleep. \nBut the sun is up and the world still spins.\nLet's go. https://t.co/DOFPZqWIcE", "we could have broken the glass ceiling tonight. instead, we let misogyny, homophobia, and racism win.", "RT @itsashlyperez: To all the ladies who have stories to tell and history to make, \n\nkeep going.", "RT @ohkayewhatever: America, you great unfinished symphony", "I cried over the results; I'm saddened and disheartened by our country tonight.", "RT @sullivanamy: Be gentle to the women in your life. The country is sending them some very mixed/tough messages right now.", "all this election is proving is that racism, xenophobia, and misogyny are alive and well in America", "RT @sbstryker: Florida reawakening every four years to cause drama like: https://t.co/DvT5ne3A8O", "@_supgoddess it's the best part of this whole election night special", "RT @lindseyweber: sorry but if you voted third-party I hope you feel really great about yourself right now!!!!!!!!!!!!!!!!", "this man on CNN is way too amused by zooming in and out on the interactive map #ElectionNight", "#Election2016 is stressing me out; women have so so much at stake right now", "RT @margaretpottah: Florida. You are always a mess. I just need you to pull it together for one night. Please.", "RT @sorkinese: Decisions are made by those who show up.", "oh and #ImWithHer https://t.co/A0VriwBZbg", "#ImVotingBecause women fought way too hard for me to not take advantage of my right to vote, especially in a crazy election like this one", "@TheRobDiDonna omg https://t.co/79MfKcgpNl", "RT @ItsJennaMarbles: when your inner \"treat yourself\" voice speaks and you're about to give in https://t.co/6lgZXTpZyS", "today I got a brand new nalgene someone left at the desk a month ago", "perks of being a RA: whatever people leave at the desk goes up for auction in our group chat", "RT @fiImart: scarface (1983) https://t.co/o94H7XsNAD", "@TristanRBoyd LMFAO i'm so confused but also amused at the same time", "going back to reality is not ideal", "RT @TristanRBoyd: @ritazwiee I am Most Pleased in your taste in men", "@TristanRBoyd you and Rob feel the same way", "RT @erinmaewalsh: accurate description of college https://t.co/ZesfdNGAHW", "RT @BuzzFeed: 7 mesmerizing animations to help you take a deep breath https://t.co/3hODQM8Ts4 https://t.co/SzygZ2TVBS", "RT @portlandia: I'm sorry to interrupt, I had that exact same question.", "thank you FIU parking for giving my boyfriend seven citations that we didn't know about until I called to register his vehicle today :-)", "RT @HistoryInPix: Bob Dylan, circa 1963. Photograph by Richard Avedon. https://t.co/juF9ZF6lj0", "RT @benadryI: me after writing one email https://t.co/qaeIsx6uav", "thankful for a panthers win &amp; this cute guy https://t.co/raskuJSCws", "RT @lulztxtit: nothing feels better when a trip finally comes together and now u can sit back and relax and await this magical trip", "RT @small_saraah: \"why is she mad?\"\n\"she's hungry\"", "@annavoig101 @laylabby0x LMAOOOOO IM CRYING YES", "@annavoig101 as a white person, I can promise you I'll never do some crap like this; you'll be happy to get regular pancakes", "@_supgoddess i'm gonna cry", "only good thing about working transfers: eating my weight in free bagels", "RT @TWLOHA: Here's to the unlikely story. Here's to the comeback. Here's to breaking the curse and making history. You're made for this.", "RT @BuzzFeed: The Chicago Cubs, World Series champions again after 108 long years https://t.co/uXGBYvreRg https://t.co/1Hy61bg6v3", "today is a good day bc I get to go to a panthers game with my two favorite fans https://t.co/7EuKGgJmNP", "RT @dorrismccomics: oh no https://t.co/PpGR2q7uIz", "the most fun thing about being an upperclassman? knowing your graduation date will get pushed back bc you can't get the classes you need :-)", "RT @FemaleStruggIes: body type: not terrible but definitely enjoys pasta", "RT @CommonWhiteGirI: I've waited exactly 365 days to post this Merry Christmas. https://t.co/p2MOhi3Mk9", "RT @ChipotleTweets: If marching band is a sport, then a burrito is a burrito.", "RT @girlsasgods: me @ myself: don't read into it \nalso me: https://t.co/HH9485JyKp", "RT @BuzzFeed: it's freakin' bats https://t.co/PzJLLVTSiV", "happy halloween y'all https://t.co/MKxVZOx5t4", "RT @sbellelauren: for halloween i'm going as not going", "RT @myhairisblue: What if u fell in love with someone but they thought David S pumpkins wasn't funny", "actual footage of me going through @HorrorNightsORL https://t.co/D04oVv6edl", "RT @Laz_Fernandez8: A date to knasberry is perfect. You can literally talk about your whole life waiting in line.", "y'all I got the nicest uber driver this morning and I get to see rob so today is gonna be a great day https://t.co/va62VfmQGr", "RT @indiebreakfast: date someone who wants to hear about your day", "RT @2korny4you: i sleep easy now knowing there's a mac and cheese restaurant in san francisco called Mac Daddy", "@Jaggerlarson https://t.co/kESFko9LXt", "RT @MsMeghanMakeup: avocado toast for the soul", "RT @ConnerParis: As a nasty woman, I relate to this #ImWithHer https://t.co/6MdlY9N5mg", "@_julily you can apply online for it! google \"florida absentee ballot\" and it's the first link", "@TheRobDiDonna you tried too hard there", "\"i'm voting for trump just out of curiosity!\" -some idiot in my comparative politics class", "bc I am not throwing away my shot to help this election in the right direction", "struggles of living away from home: realizing that your voting address didn't change and you have to request an absentee ballot real quick", "@AnxiousKami thank you nutritionist!!", "@meeeeeeems he was like \"all you want is bread?\" and i was like you don't understand my love for toasted cuban bread", "RT @mac_and_cheeks: friend: wow, you always give the best advice.\nme: https://t.co/2S7i6zfv2W", "I didn't have coffee this morning and I fully regret that decision", "RT @coffee_n_mtns: At this point my blood type is coffee", "@KayySlayys_ this is called being an adult unfortunately", "RT @bustle: accurate \n\n(via onlytwitterpics) https://t.co/12QTPzCcYn", "RT @GilmoreGirls: Hey, November 25: COPPER BOOM. https://t.co/NBKLUmuwoo", "RT @Refinery29: RT cause you know it's true. https://t.co/WwNErWFkSv", "RT @orionnichole: we'll name our children jackie &amp; wilson, \nraise 'em on rhythm &amp; blues", "@_supgoddess LMAO you right", "@yliiime especially in starbucks", "I have recently realized I am not cut out for this broke college student lifestyle", "RT @KenTremendous: A reminder that polls are not votes. Votes are votes. Everyone has to vote.", "RT @mitskileaks: I am not afraid to love; I fav tweets freely and generously", "I Didn't Shave My Legs But I'm Wearing a Dress: A Memoir", "RT @portlandia: When your team loses. https://t.co/sHEPND13pm", "he didn't have any input for our Halloween costume so his opinion is irrelevant right now", "\"this is my costume: a stick and a hat. I have a whole bunch of hats and I could get a stick outside my house.\" -Rob, discussing our costume", "@TheRobDiDonna babe you're slacking on the grammar", "RT @NYTMinusContext: bed. Sleep, soft smiling", "RT @unsmokabIe: high fidelity (2000) https://t.co/8EHomzbUCg", "RT @BuzzFeed: 12 diplomas you really earn in college https://t.co/eSheUjeHnS https://t.co/j0Cr9ZJdF1", "RT @ritazwiee: caffeine and lipstick make me feel like I have no problems", "hey I love you https://t.co/DIIQ0CiCoC", "RT @portlandia: Retweet if you agree. https://t.co/xGVdZLLgIC", "RT @TeenVogue: RT if you're a #NastyWoman who's headed to the polls to vote for your rights", "RT @MissLiberty: https://t.co/pCN3hmoI5b", "RT @joshgad: SNL at this point is literally considering just re-airing this debate", "RT @dorrismccomics: frizz https://t.co/FGmlgTaMHa", "RT @stephatdisney: So much to do, so little time https://t.co/Jyea14VOV2", "@alevids @TheRobDiDonna absolutely yes please", "really just want to be back in orlando with Rob tbh", "RT @bIessly: i got 99 problems and 97 of them are due by the end of the week", "perks of having a long distance boyfriend: you don't always have to look presentable when you go around campus", "RT @girlposts: STILL ONE OF MY FAVORITE VINES https://t.co/pCTMGsyP0h", "I identity too strongly with this spoon https://t.co/ltPMRlP0HJ", "@small_saraah LOL the secret is out", "@alevids at least it was champagne; your computer can be celebrating something", "RT @jennyslate: If all else fails I will thrive at being everyone's strong aunt", "RT @genopereyraa: Me: constantly wants affection \n\nAlso me: doesn't even have time to sleep", "happiest girl in the world bc I got pizza and my love https://t.co/VwnNqVf534", "RT @TWLOHA: https://t.co/0w3FEfhILE https://t.co/7v4IyURNtz", "@TristanRBoyd LMAO I always feel guilty for sending drinks back", "@TristanRBoyd ew that sounds awful", "I don't know what it is about miami and flaky people, but the only flaky thing in life should be a pastelito", "RT @feminismfranta: 3. i am this dog https://t.co/fsuhANTOLY", "RT @rachelmillman: https://t.co/xCV4esLOcv", "@BarSouthNCelly @TheRobDiDonna is this u", "RT @GirlfriendNotes: me after taking one feminist theory class https://t.co/7QBzD2VCpk", "RT @Schrotime: Wen u tryna explain to ur friend that Who is the name of the 1st baseman https://t.co/EtgBgZZYmh", "@Jaggerlarson @TheRobDiDonna I'm going up tomorrow!", "RT @bustle: mood https://t.co/pe0uVTnEIv", "RT @hipstermermaid: What's better than \"Sweater Weather?\" \"Irish Setter in a Sweater Weather.\" https://t.co/ARBlsYajsg", "...stop the world I want to get off https://t.co/cVSRloWTwE", "@annavoig101 this american life, ted radio hour, radio lab, 2 dope queens, gilmore guys!", "@TristanRBoyd SAME sor juana gets me so hype", "RT @DisneyPixar: \"Someday, I will be a beautiful butterfly, and then everything will be better.\" #WednesdayWisdom https://t.co/lk5OOmKUmu", "does anyone else get really thrown off when there's children on campus?", "@margaretpottah I want to know who used hay in their room and let it catch on fire", "I accidentally sat under an AC vent this morning and I regret  everything https://t.co/pRlrbeGVWC", "RT @thebirthdayboys: Just realized I've been using LinkedIn for dating, Tinder for restaurant reviews, and Grindr for job hunting. Whoops.", "RT @joanneprada: Be positive, be Patient, be petty.", "RT @MattBellassai: very close to hiring someone to make sure there's an iced coffee and a sandwich in my hands and/or mouth at all times", "@genopereyraa honestly i'm about to buy another planner", "RT @coffee_n_mtns: Coffee dates + midnight car rides", "update: I changed into birkenstocks midday", "@TheRobDiDonna all right editor calm down", "me: gets overly excited for fall and wears ankle boots \nalso me: shows up everywhere vaguely sweaty", "RT @Hoetus: me: I'd be a cute girlfriend wtf\nme, in a relationship: https://t.co/0mlWes19YW", "reunited in four days AND I CANT WAIT https://t.co/1dv2KHyslC", "RT @Naimm_17: #WorldMentalHealthDay \nTake care of yourself \nTake care of your friends", "RT @deray: .@chancetherapper in GQ. https://t.co/CYZeeoDV10", "RT @harto: Happy #WorldMentalHealthDay! Our minds are like fingerprints of our lives. Love all your curves and edges.", "RT @haileyoutland: Not REALLY with her just against him", "RT @linzsports: Can Anderson Cooper follow me around to all of my meetings? \n\n\"Please let her talk, she didn't interrupt you.\"", "I asked Rob why he had a Canadian flag on his wall and he responded by singing the Canadian national anthem to me #ok", "RT @Refinery29: When u realize there's still one more #debate to go https://t.co/mNN9vNV6tX", "RT @mkwiles: Can he answer one question without pointing fingers at her", "\"she just went 25 seconds over her time! what are you going to do about that!\" -actual child Donald Trump #Debates2016", "s/out to my silver fox anderson cooper", "these moderators are the best thing to happen to this #debate honestly", "RT @CIothesPorn: If there was a purge I'd rob Sephora and ULTA", "RT @genopereyraa: Finding at least 5 of your sisters at the closest chipotle after chapter #TSM", "skills include: making the boys stare while I chow down on the largest burrito bowl I've ever eaten", "RT @indiebreakfast: wnna pick pumpkins n drink cider wit u n shit", "RT @TejeraAshley: some cafe con leche and a tostada with a croqueta would be so amazing rn", "\"I'd go to Fist City with him\" https://t.co/0uNaq4sPsp", "RT @Lin_Manuel: Good morning.\n*peeks one eye open*\nAfternoon.\nLove you. Make good choices.", "my parents are at my favorite restaurant and i'm stuck in my dorm with a disgusting amount of bread and peanut butter", "RT @orionnichole: you call the shots babe, \ni just wanna be yours.", "RT @hey_volero: I want pastelitos Cuban bread cafe con leche and to lose ten pounds", "@erinmaewalsh @girlposts this is me", "my heart is so full of love rn", "RT @Notoliviasteel: \"THE WORLD IS GOING TO END!\"\n2012: omg please no\n2016: are we doing this or not", "RT @ericsshadow: Would you get your phone if you dropped it in a toilet?\n\n1996: eww that's gross\n\n2016: head first without thinking", "RT @imdaintyaf: Husband: I love you.\nMe: *eating a potato chip really loudly* You should. I'm a goddamn miracle.", "late to the game but @solangeknowles' new album is so beautiful and chill vibe-y and I can't stop listening to it", "RT @chrisdelia: \"What about Chief Keef? He said a lot of bad things about women too? Much worse than I did.\" - Donald Trump", "I got miles to go till I ever get home, but the sound of your laugh and your voice on the phone makes me feel like I am already there", "RT @NYTMinusContext: a choose-your-own-adventure where no matter which path you choose you always die", "RT @ChiBDM: https://t.co/0Kds1zyljH", "RT @Patrick_Cullum: #HurricaneMatthew I want more vines like this https://t.co/Dh9KdD4Rgp", "RT @TFLN: (281): If its not for food we ain't going out.", "@Tarunitar @Deathbymartymar i'm good!! miami barely got any rain or anything", "RT @billyeichner: Sending love to Florida, which will unfortunately not help you whatsoever", "RT @_danieladoll: I'm glad the hurricane didn't come but also mad I wasted my day off in bed", "RT @libbyhoward_: When you're trying to do homework but pandora plays yo shit (Vine by @abdinoorx2) https://t.co/AQ8G69i6bq", "so #HurricaneMatthew didn't actually hit Miami meaning we scammed the university out of two days https://t.co/4RrLepoUhc", "RT @DanDaley: When you're inside and bored so you start eating the hurricane supplies before the storm hits... https://t.co/bUBYE2cTSK", "RT @EddyRmrez: This hurricane must be running on Cuban time", "seeing people do things other than hurricane prep on snapchat is so weird", "RT @ChickfilA: No one's perfect, except Waffle Fries.", "RT @dorrismccomics: trying to join a twitter conversation between people you admire https://t.co/gqzvuseBhJ", "RT @uhohwow: you ready to live this life with me?", "Rob and I have the worst luck as a couple honestly", "RT @rmdrk: always remember you are special and someone will always need you in their life.", "RT @RantingOwl: South Florida wants to survive #HurricaneMatthew. But we'd rather die than eat clam chowder. https://t.co/WtNp6Xa6pZ", "RT @indiebreakfast: the world sucks, let's make our own", "y'all I am about to go through my first hurricane alone and I am not a fan of this concept", "RT @KarenKilgariff: (break up text) sent with lasers", "RT @_patriciaalexis: floridians during every hurricane be like https://t.co/ao5Gxd22Ya", "@TristanRBoyd it does a little loop just to make sure you didn't miss it the first time", "RT @FIU: Hurricane Update: We are closed at 5 p.m. today and all day on Thursday and Friday. https://t.co/Esd4aSxpjS", "@chloe_adams34 isn't in America to experience Luke's Diner and I'm so sad", "RT @Amaranta_Neto: HURRICANE MATTHEW, ARE U HITTING SOUTH FLORIDA YES OR NO?????? https://t.co/kAfznjbviY", "RT @McJesse: MURDER CLOWNS: this a good time?\n\nAMERICA: fuck it. why not.", "@_supgoddess and I are going to Luke's Coffee tomorrow and I cannot wait https://t.co/MuHn0J7tM9", "@_patriciaalexis if you ever need to geek out call me; i have the entire album memorized", "RT @ryeknight: I swear Floridians take nothing serious. We've got a category four hurricane coming for us and no ones even stressing yet.", "RT @Lin_Manuel: Good morning. \nOne step at a time. \nYour pace. \nYour unforgettable stride. https://t.co/vJh8ismTcn", "@TheRobDiDonna you love me https://t.co/xqZFivXjvV", "RT @erinmaewalsh: @ritazwiee like Mother Nature can you not", "can u not I have things to do https://t.co/YiokR864ZH", "RT @FreddyAmazin: Me after I check my bank account and see I still got $10 in it https://t.co/52QGWDMZXh", "RT @TheTumblrPosts: quotes in a bar bathroom https://t.co/reZNtplr41", "RT @mkwiles: I Just Left the Grocery Store and Remembered One Thing I Forgot to Get: a memoir", "RT @TeenVogue: Eleven might just be the most popular Halloween costume of 2016 https://t.co/fj5zbYKAmR", "@coricobain that happened to me and my eyebrows, anastasia changed my life", "@coricobain contouring intimidates me tbh", "RT @nickmastodon: When you're the designated driver #cute https://t.co/S1FPtqj1Km", "I probably post about my boyfriend too much but also I don't really care", "RT @BarackObama: Side-by-side for 24 years. Here's to many more. #HappyAnniversary https://t.co/nh8Xfc7IWU", "RT @coffee_n_mtns: i wanna sit in old cafes and listen to the rain just chatting about nothing with you", "RT @dorrismccomics: me every day https://t.co/QMMEjjKg0R", "@nettyyourqueen omg SHARE rob and I are constantly struggling on date nights", "RT @celestepaquette: everything i aspire to be https://t.co/frkJdGuVXL", "@TheRobDiDonna Mac DeMarco is ruining our relationship", "@TheRobDiDonna NO I DIDNT", "@TheRobDiDonna knows I'm really gullible so HE CONSTANTLY TRIES TO TRICK INTO BELIEVING STUPID THINGS", "RT @Lin_Manuel: Gnight you! \nMake mew nistakes, dream new things, repeat!", "CECILY STRONG AS LIN MANUEL", "if the only good thing coming out of this election is funny SNL skits, then let's keep 'em coming", "@FIU_AXO thank you! I thought it made me look more presidential", "RT @Lin_Manuel: Gmorning you!\nMake new mistakes, learn new things, repeat!", "me this entire past week: https://t.co/hzABdFagIg", "Rob always buys a half gallon of Publix chocolate ice cream when he stays at my apartment and expects me not to eat it while he's gone... ok", "RT @FIUSM: FIU win!!!! The Shula Bowl is back home, Panthers! #FIU", "working in a freshman building during a home football game is a super fun time", "RT @FIUSM: Halftime: FIU-14 , FAU-17", "RT @alienlover6669: person: how many coffees have you had today?\nme: yes", "RT @_patriciaalexis: thick thighs, thin patience", "RT @coffee_n_mtns: My Halloween senses are tingling https://t.co/ggKJy8biq9", "RT @Lin_Manuel: Good morning!\nRecess today. Chase your happy. https://t.co/lyXK1syGYE", "@meeeeeeems my exact thought process before Rob picked me up", "today! has been! the worst!!", "RT @gmlamb: Bon Iver's new album is out and hipsters everywhere are listening to it in their favorite flannel.", "RT @ritazwiee: today summed up in one gif: https://t.co/jZ10MzAJmx", "RT @ritazwiee: hi, my name is Rita, and I'm a pub sub addict", "what a beautiful mess we've gotten ourselves into", "RT @brightlightray: 34. why am i not as talented as this cat https://t.co/SFUnbgnypA", "you don't realize how many things you actually use your laptop for until you can't use it for anything :-)", "RT @ImCardiB: crying over a boy??? while the sun is shining???? Bitch get it together", "RT @gifdsports: Me watching the Miami Dolphins https://t.co/S4TEIv6vY5", "RT @Lin_Manuel: Gnight. \nI'm tired. \nYou tired!\nA dormir, vamos.", "I would like today to be over, thank you very much", "@libbyhoward_ this is such a cool pic", "RT @NYTMinusContext: normal at the time, but weird, even horrifying, in retrospect", "RT @HarperPerennial: Thank you, coffee, for letting me read more than I sleep. #NationalCoffeeDay", "me trying to deal with a non functional computer: https://t.co/EokdhfcXXP", "@TristanRBoyd it was like a little spill of black coffee but my keyboard doesn't work :-)", "RT @TheAVClub: Happy #NationalCoffeeDay. https://t.co/K8jLepqaUc", "@alienlover6669 if only we could all look like zooey deschanel with them", "@alienlover6669 they're cute but so annoying to keep up with", "das my best friend https://t.co/EHyoegqsQr", "RT @Lin_Manuel: Good morning. \nI'm tired. \nYou tired?\nAt your own pace, vamos.", "RT @bocasaints: PISCES\nlikes:\n- helping anyone in need\n- daydreaming \n- alone time to think\n- emotional connections with people", "RT @literallyale: why is this literally me https://t.co/PjPOdSxfjt", "RT @ChipotleTweets: Roses are red\nViolets are blue\nThis burrito bowl is big but not enough for two", "RT @batkaren: \"The key to a well-balanced asset portfolio,\" I explain, stacking my animal crackers by species, \"is diversification.\"", "so for some reason my autocorrect likes to affirm everything I say by adding \"yes\" onto the end of all my texts", "RT @andrewalan_: when your girl gets drunk before you. https://t.co/23zVyRC9Q5", "RT @TheLiturgists: That @lisagungor vocal take on this podcast is a single, untuned take at 3am this morning btw #badass", "I'm not even done listening to this episode yet and it's already one of my all-time favorites https://t.co/dlJTfRBrFQ", "All up in that #SkimmLife https://t.co/8yQjixm6sn via @theSkimm", "RT @Seinfeld2000: debate recap https://t.co/KfnaH6C7pw", "@alevids this is a true fan LOL", "@alevids help Rob is ordering a custom Panthers jersey", "@TheRobDiDonna you whenever I say something dumb", "this is how he looks at me when I start getting hangry and can't decide where to eat (btw I miss you) https://t.co/JOp2cPRxLd", "if you're in the mood to be emotional, listen to Sunday's @ThisAmerLife and cry bc I definitely did that last night (thanks @iraglass)", "@camiweinstock unless you're wearing socks with them, probably not", "this thunder is making me not want to be a productive member of society", "RT @ProBirdRights: if I don't get to be presdident I going live in white house chimnley anyways", "and the fact that trump keeps interrupting clinton makes me so angry #DebateNight", "ok this isn't funny anymore where are the real candidates #debates", "RT @BuzzFeed: \"Release your returns!\" - one candidate\n\n\"Release your emails!\" - the other candidate \n\n\"Release me from this hell!\" - me", "RT @BuzzFeed: #debatenight https://t.co/N2HMwt8MqL", "RT @BernieSanders: What we have to do is focus on the issues, not see tonight as an entertainment show. #debatetonight", "RT @ErinChack: If you liked Man Talking Over Woman you'll *love* Man Talking Over Woman, Presidential Debate Edition", "RT @balkissoon: He sounds pretty shrill. Too aggressive. On the verge of bitchy.", "RT @margaretabrams: Exclusive footage of @LesterHoltNBC at #debatenight https://t.co/SKZMgWimj4", "RT @HouseofCards: There can be no false steps now. #DebateNight", "RT @uhelly: my boyfriend: breathes \nme: falls even more in love", "RT @OfficiaIKanye: 1 (800) DID-I-ASK", "RT @indiebreakfast: laugh again and make me fall in love", "RT @lulztxtit: \"he threatened me to smoke alcohol\"", "@TheRobDiDonna how our first kiss happened accidentally https://t.co/mgoLKdtInI", "RT @Jaggerlarson: @ritazwiee @TheRobDiDonna photo creds and caption creds even though we both know it's Matt T-sun.", "people who think they're saying something revolutionary in my political classes: https://t.co/LbWfsnbIxD", "taking a mwf 9am was not my best idea this semester", "@Brri_zzy i'm crying", "RT @genopereyraa: Us @ritazwiee https://t.co/M63ufMmNrG", "RT @ziwe: Jose Fernandez, the icon https://t.co/0gzKrA72TN", "RT @lizzy_israel: you ever meet someone and you know your souls were meant for each other", "RT @BuzzFeed: I swear https://t.co/q8wl7Kx0sH", "@natissss LMFAO ME", "RT @AshleyPardo8: Wherever you go, bring your own sunshine", "@coricobain I'm gonna try it out!! I'll let you know LOL", "@coricobain https://t.co/oL81aqqTg0 !!! I'm obsessed", "@TheRobDiDonna at least I'm not trying too hard", "@TheRobDiDonna trying too hard to be topical", "researching bullet journals is making my crazy organized self so happy", "RT @FreePeople: Half way through the week #writethisdown https://t.co/M0s0BDPZ6o", "RT @valeriababyx3: I just want cuddles and lots of besitos", "RT @MattBellassai: thinking about becoming heavily involved in the instagram calligraphy community", "RT @BuzzFeed: https://t.co/IuXrkZXM4T", "RT @iconicthott: Me: is scared of lifelong decisions\nMe: has 5 tattoos", "omg I didn't put Chandler Bing but he's up there too OR Elaine from Seinfeld", "@_julily I read it this morning and wow", "\"black man is killed, they tell us all the bad things he used to be. white man rapes, they tell us all the great things he could become.\"", "RT @coffee_n_mtns: mood: https://t.co/sxdB1lEZ9r", "@alevids https://t.co/BUDZ21hqfa", "RT @Silvio13157: Switching my major to Comiendo Mierda", "@small_saraah welp i'm always gonna be a pisces (and my tattoo is gonna show that)", "me after watching Making a Murderer https://t.co/hGqDmqVwwE", "RT @mtwizzz: college week 4: no longer fun. everyone is sick. I am sick. I miss my dog. I'm failing 8 classes even tho I'm only in 5. sos", "RT @RadicaIArt: art museums n chill https://t.co/FJasEFLZtu", "in case you missed the sunset on snapchat tonight: https://t.co/LDk5u3f5Ib", "RT @rebelpiIot: I YELLED https://t.co/6yjxZoC2JV", "@meeeeeeems are you just that cool?", "@genopereyraa accurate", "RT @genopereyraa: @ritazwiee okay but actually take an snippet of her talking about coffee and it's you https://t.co/3CN6CcrGA6", "when you realize you're actually Lorelei Gilmore https://t.co/3brjnGzz8n", "RT @TFLN: (970): He told me I was a good dog mom. I've never been so turned on in my life", "RT @trextin: when all your classmates are from SoCal but you finally meet someone from the Bay Area https://t.co/sm69Gp2LzA", "RT @catbbottlemen: \"Every Arctic monkeys fan at 5:05\" https://t.co/fLFkg0Mq7n", "RT @tarantallegra: Snazzier Things https://t.co/KmP6w4KAHf", "RT @artfeeled: Tilt Shift Van Gogh Paintings https://t.co/5PGrhhNLm1", "RT @TristanRBoyd: @ritazwiee I fall hard for beards that might be a deal breaker for me", "@TristanRBoyd I'm a beard girl but he's got a nice face under the hair so it's gonna be okay", "RT @H_Ta_The: wanna be Nietzsche but i'm prolly Kafka or Camus https://t.co/HBPL0hcYuU", "@lauraaamarin I know it'll come back but I'm gonna miss it", "now I have to get used to an entirely different face", "when your bearded boyfriend shaves his beard without telling you", "RT @IamEnidColeslaw: *backflips out of bushes*\ncan I pet your dog", "mercury needs to hurry up and get out of retrograde", "being a coffee snob is so hard sometimes bc you're so picky about beans and brewing methods", "honestly me https://t.co/QX9t97qGJL", "RT @DocumentaryNow: Dreams are dreamt and then they shatter. Pitter-patter, pitter-patter. #DocumentaryNow! https://t.co/zLPmPoukvP", "RT @bestofmckinnon: HER REACTION https://t.co/lK1DhkLzh9", "THIS IS SO CUTE I CAN'T https://t.co/C3l6Vrn0jM", "making hockey jerseys look cute since ever https://t.co/COkBkbUMFY", "RT @joshuahenry20: If you're stressed, frustrated, and/or exhausted while doing something you LOVE... You're blessed", "@meeeeeeems I relate so strongly", "RT @TWLOHA: Sometimes the future needs to be faced in small increments.\n\nhttps://t.co/mVWMFbOWWf https://t.co/jQZ02KkRdu", "RT @portlandia: Do they give #Emmys for feminism? https://t.co/svGZZx7hqj", "RT @beaufilms: juno (2007) https://t.co/lQ5WYfxZxD", "@TheRobDiDonna https://t.co/Kl7BQ2uqxs", "@_julily hot damn they real petty", "RT @Lin_Manuel: Good morning. \n*looks around*\nYou're here. \nI'm here. \nSomeone's making coffee. \nGood.", "RT @aliahmartinez: \"My boyfriend doesn't let me..\" who are you dating a guy or your father", "I agreed to go to Halloween Horror Nights with Rob and this is going to be me the entire time: https://t.co/aoLoLzJ8Qv", "@meeeeeeems @TheRobDiDonna I always deserve them honestly", "@meeeeeeems LOL @TheRobDiDonna gets annoyed whenever I take pictures of him and judges me whenever I use the word \"aesthetic\"", "@sabeenaliah LOL ITS SO DUMB", "like girl nobody cares about that ugly pandora ring your man got you", "even though I have a boyfriend, the gross shit couples post to twitter about gifts and crap still makes me gag", "RT @LipstickThuggin: The Cinnabon was in there too tho right? https://t.co/UcCattKJFa", "RT @NatGeoTravel: The Hungarian capital is a work of art https://t.co/pYF12yxoLJ", "RT @DearYouFromWe: let's figure this life thing out together.", "@AngieGigiFierce LOL RIGHT there's like six different orlando trips", "RT @coffee_n_mtns: Breakfast dates should be more of a thing https://t.co/e643D6poaK", "RT @malloryfoutch: it's Amy Poehler's bday so show up today as your best self in her honor alright https://t.co/JXO7Zr5TXZ", "three. https://t.co/Ynese4wQoi", "RT @OpenSouIs: The universe in progress at the Wuhan, Science and Technology museum. https://t.co/WTz5YDgAxQ", "RT @indiebreakfast: THE DREAM OF THE 90'S IS ALIVE IN PORTLAND", "RT @joanneprada: If you were messy today, be messy again tomorrow.", "@milanstarr with the coffee mug always and sometimes birkenstocks", "the second is me always  https://t.co/R3KlUqlIHu", "RT @dubstep4dads: cowboy 1: this town aint big enough for the two of us\ncowboy 2: whatever. i want to die anyway\ncowboy 1: whoa r u ok dude", "whenever my mom doesn't pick up when I call her I get offended\nlike I am your flesh and blood \npick up your phone", "RT @BuzzFeed: 19 memes for everyone who loves sleeping, drinking, eating, and repeating https://t.co/MCzSFla2ho https://t.co/u3yxgAObHX", "RT @BoneRude: AHS: My student loan debt. https://t.co/wIlIpfB2QA", "my heart  https://t.co/dJiM66QcCg", "discovered @pennyandsparrow recently and haven't been able to stop listening", "RT @daviddeweil: Accidentally wore an oversized shirt and now I'm the social chair of a sorority", "RT @ms_mela: Do you hear the people sing?\n*What's a mob to a king?*\nSinging the songs of angry men\n*What's a king to a god?* #JayMiz", "RT @bustle: forever mood https://t.co/CMlRMZkiNd", "RT @Lin_Manuel: Gmorning. \nTry &amp; face the world with your best self, even if the world doesn't respond in kind. \nDon't do them, do you.", "RT @quintabrunson: Love me where nothing else exists.", "RT @iamBrILLYant: you keep looking for a place to call home, when home exists within you.", "@laylabby0x yeah they have a tendency to look bad so do your research!!", "today one of my students told me all I consume is waffles and coffee so I'm basically Eleven from Stranger Things", "RT @theyearofelan: 1. Make fun of new Apple product\n2. Buy new Apple product\n3. Can't live without new Apple product\n4. Repeat", "RT @moviepoets: https://t.co/AuXSVF3PhW", "\"travel light, live light, spread the light, be the light\"", "@manymanywords @TheRobDiDonna", "my computer has 27% and I forgot my charger so let's see how class goes", "RT @jonnysun: *turns on twiter night mode*\n*joyce byers voice* we made it hopper.. we're in the upside down", "started doing homework but then started listening to The Last 5 Years and needless to say I stopped doing homework", "RT @coffee_n_mtns: I just want to go on road trips, eat donuts, and drink coffee", "today was going gr8 until i realized i spilled soy sauce on my white shirt", "I made a pourover this morning and I bought shoes so Monday's been pretty good so far", "RT @SlNFULGODDESS: my thighs r thick cos theyre full of love", "despite taylor swift being problematic rn, 1989 is still my go-to jam (considering it's one of the few albums I have on my phone)", "RT @ColourPopCo: #NeverForget https://t.co/lyD99CYdYK", "@victoriateske https://t.co/ARIxki7V8V", "astrology might not be a real scientific thing but I'm definitely a pisces okay", "I just read an astro chart of my sun and moon signs and honestly it explains so much about everything", "RT @berniethoughts: I RAN FOR PRESIDENT\nNOW I RUN FOR EXERCISE\nAND FEAR OF MORTALITY", "RT @jonnysun: ur mcm was unable to comprehend the narative structure of \"the last five years\"", "saying goodbye sucks https://t.co/TQHOTScVrY", "RT @erinmaewalsh: @ritazwiee  https://t.co/bUKTmBzUb2", "@berkingbad yes boo https://t.co/CBYRgp2VyD", "RT @rgay: I guess if you want your relationship to implode, a tiny house is a good choice.", "@meeeeeeems yes https://t.co/v3zCjWi8ou", "tell those you love how you feel, and never let them forget how important they are in your life #WorldSuicidePreventionDay", "I love someone with anxiety and depression, and it's made me realize how important conversations about mental health are #WSPD16", "RT @HoodyII: I love Documentary Now https://t.co/vPVZ46vh4k", "me on duty this weekend  https://t.co/E91fFkxTmp", "RT @unsmokabIe: Kill Bill: Vol. 1 (2003) directed by Quentin Tarantino. https://t.co/QJ7nOTchqF", "RT @BuzzFeed: 11 charts that make way too much sense to picky eaters https://t.co/VdPWOjJfeS https://t.co/XTiAK7SsuR", "ROB IS COMING HOME TODAY + I AM WAY TOO EXCITED", "RT @unsmokabIe: https://t.co/JLELpoclzk", "@victoriateske same girl omg", "@genopereyraa https://t.co/gNwGr6R8VQ", "@_julily 2/3 rule: make two parts of you fleeky and don't bother with the third", "RT @jonnysun: apple better also be releasing new types of pockets bc this isnt gona work for me https://t.co/k2oFtirCRZ", "RT @MacMiller: Listen: https://t.co/JGc342proJ https://t.co/8CniLuaiZ2", "RT @happylilsky: you have been assigned this mountain to show others it can be moved my friend", "my mom excitedly texted me about the zooming feature on instagram; i told her they were taking pity on old people", "@genopereyraa this is perf", "@small_saraah it really does omg", "thank you Liz for catching me in my natural habitat https://t.co/mJuZdvwox3", "RT @Lucykainn_: Me because I have no sense of a filter https://t.co/hJoZPQOxuo", "RT @portlandia: Headphones with wires are now known as antiques.\n\nhttps://t.co/w86DeTgGLf https://t.co/WBN1A416GK", "@lindseycolaco it was a nice avocado", "@TheRobDiDonna am I your tribe", "catch me losing these the minute I put them down https://t.co/naOg7yXwca", "the wifi in my apartment is so terrible I've gone over my data for the month and I have to leave whenever I need to do homework", "RT @JheeneAiko: make your heart the prettiest thing about you", "RT @shutupmikeginn: The iPhone 7 is fully submergible, I can finally waterboard Siri!", "RT @BuzzFeed: \"it's the best iPhone that we have ever created\" - every #AppleEvent", "RT @small_saraah: I'll stay sarcastic, thanks.", "if it could stop raining now that would be a-okay coolio beans", "RT @polaxrize: after he leaves me on read once https://t.co/zwvYMhAsAV", "RT @victoriateske: I just want to fast forward to traveling and decorating an apartment with someone I love dearly.", "RT @TFLN: (519): Look, all I'm saying is that you're going to be a great Vodka Mom.", "RT @TWLOHA: 46 Reasons People Kept Living. #IKeptLiving #WSPD16 \n\nhttps://t.co/aDWdzOQdRr https://t.co/zAYF1VJBl5", "RT @itsashlyperez: the good news is: you can do it \nthe bad news: you have to motivate yourself to get it done", "@TheRobDiDonna yes", "@Jaggerlarson @TheRobDiDonna we ran out of food so we had to stop", "@Jaggerlarson @TheRobDiDonna been there, done that", "@TheRobDiDonna thanks babe https://t.co/0kapIeSnGC", "RT @Jesskidding_: @ritazwiee update: you're overqualified. You're hired.", "update: feel like more crap and online shopping didn't help", "@Jesskidding_ hi where can i apply? i believe i meet all the qualifications (see: my 26k pins on pinterest)", "RT @sidebae: i want that \"daaaaamn they still together??\" type of relationship", "I feel like crap today so I ordered a bunch of lipsticks and hopefully that'll help fix my life", "RT @chooses: all i want is a grilled cheese and some love", "missing you a whole lot right now https://t.co/YI8oxb9b5L", "@small_saraah YES OMG", "RT @HollyMemphis: If no one comes from the future to stop you from doing it than how bad of a decision can it really be?", "RT @MakeupbyMandy24: IF WE DON'T BRUNCH TOGETHER YOU DON'T KNOW ME", "caffeine and lipstick make me feel like I have no problems", "RT @bustle: how how how \n\n(ourbodiesglow//tumblr) https://t.co/3eC6t65Dyk", "RT @bustle: still, though: https://t.co/gAZWCL0SK6", "@ritazwiee look how cute we are https://t.co/wQie4hrr8Q", "RT @NYTMinusContext: Breakfast should begin slowly and quietly around noon", "you can tell my mom and I are related bc we can't get through a pedicure without laughing", "RT @catspirational: he was a skater boy she said see you later boy he wasn't good enough for her https://t.co/gT0IGipdWm", "RT @erinmaewalsh: @ritazwiee what are friends for https://t.co/PO5M9gv6BP", "@erinmaewalsh thank you erin for supporting me https://t.co/wZKjud9XXc", "RT @erinmaewalsh: @ritazwiee it's something @chrissyteigen would do so I support it 110%", "Rob is amazed at me that I ran a Twitter poll about getting bangs or not", "@TheRobDiDonna https://t.co/JtzHLSr2aQ", "@TheRobDiDonna triggered", "@chloe_adams34 polling the masses because honestly I don't know what to do with my life THEY JUST LOOK SO CUTE", "@meeeeeeems you look so good girl omg", "RT @byrdinator: Tomi Lahren literally complains about people for a living like how do I get a job like that", "RT @RudyFrancisco: #poem https://t.co/4xHvwYVOmF", "RT @bustle: mood https://t.co/Pl1kZVcgE1", "RT @WorIdStarComedy: her: on a scale of 1 to 10 how do I look\n\nme: https://t.co/BE0K7xmrmg", "@genopereyraa me @ men always https://t.co/cIi5LRhW05", "@genopereyraa oh my gosh this happened to me", "\"we are walking poetry. the kind that moves. the kind who has feet, the kind with mind, will, and emotion.\"", "RT @lizzyfromonline: https://t.co/0JInr2Qxcd", "I accidentally skipped my first class today and I'm wearing workout clothes w/out intentions of working out so there ya go #thursdays", "RT @inactive: 3am or 3pm i wanna be with u", "RT @FIirtations: https://t.co/14n0d95Snx", "@victoriateske YES", "me finishing stranger things: https://t.co/B8w1rcDwhX", "RT @sebastiancodex: Elle https://t.co/Uxel64lygZ", "some girl is FaceTiming in the study lounge \ncan't you see people are trying to do homework https://t.co/EaZagFnVe0", "RT @bustle: me getting through Wednesday: https://t.co/infrEn1uOw", "only perk of being forced to eat at the dining hall: taking the cereal home", "@small_saraah have you seen Populaire?", "RT @spellboundaf: pisces:\n- super dependable \n- they love but don't get it in return \n- awesome to be around unless they're heated", "if you're having a bad day watch this  https://t.co/v7dVN8FK66", "you are the smell before rain, you are the blood in my veins", "RT @indiebreakfast: she deserves the love she keeps trying to give everyone else", "RT @dissembIe: drake: rihanna is someone i've been in love with since i was 22\n \nrihanna: yeah i know", "RT @BoJackHorseman: waiting in the coffee shop line is the worst but so is making your own coffee. in short, i have no answers.", "\"and you, you scare people because you are whole all by yourself\"", "RT @LowKeyUHTN: Drake: I love you\nRihanna: https://t.co/NijSAdykLe", "the face before a four hour long chapter meeting https://t.co/5s2qo5683c", "@BuzzFeed @lulztxtit", "RT @femalenomads: I SWEAR IF YOU'RE HAVING A BAD DAY PLEASE WATCH THIS I WAS LAUGHING SO HARD I STARTED CRYING https://t.co/iEFjBH6Wx7", "RT @BobsBurgersFOX: Wake up and smell the coffee. #BobsBurgers https://t.co/sgrgOKQ8Kl", "i'm watching @chrisdelia on people in miami and i'm crying", "@TristanRBoyd it does for me tbh, covered in chocolate smudges", "@TristanRBoyd honestly nothing better", "everyone might think I'm being very studious by having my computer open in starbucks but I'm really watching @Stranger_Things", "@annavoig101 where is this?! they look super pro", "RT @portlandia: Patriarchy - we would like to be excluded from this narrative, one we have never asked to be apart of. #WomensEqualityDay", "RT @vcxv0: me making connections to prove everyone i know secretly hates me https://t.co/gJJ1kzyc0G", "@milanstarr I think he's questioning my life choices and his parenting", "RT @HelloPasternak: I can never tell if I want a coffee or if I want to lay down and die", "my dad on my nose piercing: \"what, two holes in your nose aren't enough to breathe through?\"", "@MariVetencourt1 LOL exactly yes", "@MariVetencourt1 scale of one to ten, it was a five tbh", "we laughed in the sun, we laid in the grass and I felt your earth pushing back, it pushed back", "RT @SeinfeldQuotes_: https://t.co/QL8K9845lY", "RT @fyeahCalifornia: \"you are what you eat\"\n\nme: https://t.co/7oLe4UpvCf", "@victoriateske SAME", "@thedailybeast @TheRobDiDonna", "@Jesskidding_ i love pinterest too much", "I realized recently I use a lot of Lucille Bluth reaction gifs and I think that says a lot about me", "RT @AVcopydesk: The track listing from Bon Iver's new album, a.k.a. a copy editor's goddamn nightmare. https://t.co/YGEP6e7ztX", "RT @MattBellassai: i like drinking coffee until my body is running on pure unfiltered anxiety", "RT @ChipotleTweets: Me at 17: I want a burrito.\nMe at 25: I want a burrito with guac.", "I finished class at noon and I've just been watching #StrangerThings since then", "@genopereyraa https://t.co/spVmESgqY7", "RT @IsaacFitzgerald: Me, most of the time. https://t.co/f9Q7rtDq1j", "I'm such a nerd but I'm actually so excited for this semester to start", "\"this is hardcore af\" -Rob https://t.co/gQ76mTauqc", "@margaretpottah actually obsessed", "ITS BID DAY https://t.co/UXgqAEhH1d", "@Tarunitar I love cold brew too", "starting a coffee habit is expensive y'all https://t.co/kdBRhXzYUP", "RT @indiebreakfast: we can be corny, obnoxiously romantic fools together. we'll make everyone hate us", "people are so amazing sometimes  https://t.co/XlMNFfoEFf", "RT @MISTERHIPP: #StrangerThings https://t.co/MIb4eaAq9G", "RT @orionnichole: just wanna be cuddled up next to u", "the cashier at target judged me so hard for buying kombucha and I feel personally attacked", "RT @qc: I love bread. https://t.co/GdIGjKe8Ju", "RT @DearYouFromWe: still trying to be the best me that i can be.", "RT @bustle: MONDAY: https://t.co/Df391PUAwm", "RT @SeinfeldQuotes_: https://t.co/F5qxPywygi", "date a boy who will build you bookshelves", "@valegomez19 LOLOLOL omg it was Castells at Sergio's but still I would die seeing Baldor in public", "when you see one of your old Spanish professors at brunch https://t.co/QhF4AJ3CTX", "RT @Lin_Manuel: Good morning beautiful. \nMake someone happy today.\nI promise you it'll bounce back.", "does red wine and Thai food go together? asking for a friend", "RT @Lin_Manuel: Good morning.\nYou are stunning. \nUse your power wisely.", "my entire family is together for #DCIFinals2016 and I'm stuck at work :-)", "i feel this on a daily basis https://t.co/PNkZ2UzVIA", "@erinmaewalsh @milanstarr this is a show I would watch", "I just made a frozen dinner and I'm procrastinating on making doortags so you could say I'm living the RA life right now", "I'm eating my breakfast literally in my bed bc it's the warmest place in my room", "@jessika1126 i am so happy for your countdown", "RT @bustle: thinking about the weekend like: https://t.co/O14TV0ar2y", "you're cute and I miss you https://t.co/MwgxNUaSN4", "@erinmaewalsh good yes", "RT @BuzzFeed: 20 https://t.co/qR0PwpuWbL", "@girlposts @erinmaewalsh did u see this", "RT @Lin_Manuel: Good morning.\nTake care of yourself. \nWe need you. https://t.co/3LhXd9Ana6", "literally me https://t.co/nfsUQnPHOd", "appreciation tweet for Rob who helped me move into my apartment in the pouring rain yesterday (you rock babe)", "RT @NBCOlympics: .@TeamUSA WINS GOLD IN THE 4x100M FREE RELAY! https://t.co/3A5oNg23p6", "me having to move back to campus two weeks early for RA training: https://t.co/Q26hcsmowa", "RT @GuyInYourMFA: What movies do I like? Well, the FILMS that I like are...", "RT @indiebreakfast: she prefers the smell of musty books over designer perfumes", "@meeeeeeems this is me at my boyfriend", "@alevids my boyfriend said the exact same thing", "my two favorite boys https://t.co/MKEE65g9UH", "@girlposts @erinmaewalsh this makes me genuinely angry", "RT @OfficiaIKanye: surround yourself with people \nwho make you a better person", "RT @TweetLikeAGirI: Body type: not terrible but definitely enjoys pasta", "I just wanna watch #StrangerThings is that too much to ask", "@LAnunez6 @OhWonderMusic but for real though", "RT @LAnunez6: So @ritazwiee and I are not only seeing @OhWonderMusic, but we're meeting them too????? #goals November 3rd I'm ready for you.", "@ClaireHolt5 https://t.co/IhFFTYVGpy", "@TheRobDiDonna blocked", "RT @Things4WhitePpl: Calling all dogs puppies", "@ClaireHolt5 LMAO i'm so down!!", "coffee crawl = extremely successful https://t.co/fV2T7QwBk8", "RT @NYTMinusContext: a love of eating that borders on mania", "@small_saraah hopefully we can make it over!!", "COFFEE CRAWL COMMENCES w/ @TheRobDiDonna", "@milanstarr ah thanks!! they're super hip LOL i'm still trying to get used to them", "RT @ninatreemonkey: Welcome to rhetorical question club. Are you all stoked or what? GOD DAMMIT PHIL PUT YOUR HAND DOWN", "thanks for running across town to watch the sunset with me https://t.co/FfRTRWHMgw", "planning a day trip to Saint Pete with Rob tomorrow and most of our stops are centered around coffee shops", "@LAnunez6 ah!!", "RT @jonnysun: BAE: come over\nME: i cant\nBAE: my parents are home\nME: o dam i love ur parents", "RT @AestheticGoaIs: https://t.co/vh2sojbO2m", "RT @girlposts: when you're watching house hunters and the couple chooses the wrong house https://t.co/LmULPNQDD5", "happy birthday @margaretpottah!! https://t.co/DRWwy1sI4y", "let's talk about how last night my boyfriend took a shot of tequila with my dad", "RT @rachelzarrell: find someone who looks at you the way Bill Clinton looks at balloons https://t.co/OiXX0l3ELL", "RT @FIU_AXO: Today is the last day to sign up for recruitment!! #FIU20 https://t.co/Z3ejSIWjNV", "not super about Hillary Clinton but the gifs of her and Bill at the DNC are the cutest", "RT @deray: when you're lowkey more excited for your friend than they appear to be. https://t.co/70mWgCISlK", "RT @deray: we know each other, we are not friends. https://t.co/zPt9atPqDD", "RT @itsmanuuuu: \"Do you think the universe fights for souls to be together?\"", "@DanielRCarrillo @TheRobDiDonna", "@TheAVClub @sabeenaliah", "freshman are so amazed by the ice cream machine in the dining hall and it cracks me up", "RT @girlposts: Me: I'm really trying to save money\n\nFriends: let's all go out to eat\n\nMe: https://t.co/iCGgP2TQOH", "RT @BoJackHorseman: is it possible to be universally loved yet vastly underappreciated? asking for a friend.", "RT @sophwilkes: My goal in life is to have as many batshit crazy headlines as Father John Misty https://t.co/IaTCgC8bNv", "RT @indiebreakfast: you have great music taste, and by great music taste i mean the same as mine", "RT @hamilton_text: https://t.co/FSzmKa7wjj", "RT @portlandia: #IAmAFeminist \nhttps://t.co/2yC4g8maAn", "RT @Boringstein: my facebook brand vs. my twitter brand https://t.co/VrSjSoUtm6", "it's only 11am and I've eaten all my snacks SOS", "RT @Jesskidding_: All I've done this summer is work work work work work", "RT @ashtrous: 20) if she wears glasses boy your future is bright with her", "moving out means having the strange end-of-the-year smorgasbord from everything in your freezer and pantry", "RT @orionnichole: don't get attached to the moments\n\ngood or bad,\nthey all pass.", "RT @mielmonster: wow this is a crazy season of The Apprentice https://t.co/GQxlCe5Ncm", "@laylabby0x @victoriateske we don't have a choice LOL", "RT @HouseofCards: Let's put on the best show in town. https://t.co/KQ5SWwTZxB", "RT @erinmaewalsh: @ritazwiee CAFFINATED AF", "@erinmaewalsh I went to three", "I HAD TOO MUCH COFFEE AND MY HANDS ARE SHAKING", "all I did today was drink coffee &amp; I'm okay with that https://t.co/5qao4KlVwx", "@meeeeeeems LMFAOOOO too true but not me in this moment", "@laylabby0x LMAO not you babe", "you guys some people are way too petty for this world", "when I accidentally make hella spicy tacos for me and Rob: https://t.co/8NOVOK2d0Y", "RT @TheBlueDevils: We love our crew! #bdworld #dreamon https://t.co/eOtLKeyBkf", "\"can you shut up about Harambe?\" -me on a daily basis to Rob", "RT @FreePeople: #writethisdown https://t.co/BI1wCFU4eV", "please don't judge my amount of pins  https://t.co/NqIAOe9kDt", "this is called \"I can sleep anywhere if left alone long enough\" https://t.co/zl5TqDlJhX", "look into your eyes and the sky's the limit", "RT @alexalosey: the world is a little brighter just because you're in it", "@amgraham13 AH YES I got Anders in crystal!", "me when I sleep TEN HOURS: https://t.co/qTFCsrEO1Q", "I just ordered crystal @WarbyParker's, which will now complete my \"cool librarian\" aesthetic I've been trying to achieve", "RT @BestMovieLine: 500 Days of Summer https://t.co/4xGLAC8DDk", "RT @HarperPerennial: I'm getting angry on behalf of...words.", "RT @HouseofCards: https://t.co/b2I5DQFYY0", "our aesthetic is \"cool mom and dad\" and I'm okay with that https://t.co/yf6R93Nd4J", "RT @BestMovieLine: Dead Poets Society https://t.co/thVW32IJQ4", "RT @indiebreakfast: you miss 100% of the kisses you don't go for", "RT @bustle: this is real (@shekeepsmebalanced) https://t.co/tkMl5NLiOQ", "@TristanRBoyd thank you LMAO", "\"these morning memes are always dank\" -Rob over breakfast this morning", "RT @HouseofCards: https://t.co/uPJzraE8g6", "RT @perfumegenius: I think the only way I will find peace is if I live in the Great British Bake-off tent", "\"I'm a romantic; a sentimental person thinks things will last, a romantic person hopes against hope that they won't.\"", "RT @HouseofCards: Politics is no longer just theater, it's show business.", "RT @NOCONTEXTOFFlCE: https://t.co/A42jFCrtnh", "RT @NYTMinusContext: nice-scary-weird", "RT @arianamaria__: do me good and I'll do you better", "@lauraaamarin ME TOO THO", "RT @rgay: Last night we were reminded that you should find someone that loves you like Kim loves Kanye.", "RT @screwsavannah: my cousin did a photoshoot of her dog all over the city.... oh my god https://t.co/yOT1oSm34r", "I hate drama in real life but my goodness do I love some celebrity drama", "RT @KarlTheFog: Welcome to the summer of your discontent", "RT @RelatableQuote: I'm so happy I found this vine https://t.co/oqUyklb91o", "@TheRobDiDonna two things I'm really good at doing", "RT @artfulIy: Van Gogh street art https://t.co/vdIXnXmriR", "missing my coffee snob goober of a boyfriend a lil bit rn https://t.co/XpCR8Omtbo", "RT @HistoryInPics: Bob Dylan playing guitar and smoking a cigarette, New York, 1961. https://t.co/FjVcp9OM7e", "heaven help the fool who falls in love", "RT @HerCampus: That didn't last very long https://t.co/T4xVyKI7gW", "me when I finally sleep nine hours: https://t.co/LLqpwr1Cw4", "@lauraaamarin SAME", "whoever tells you chips and guacamole isn't a meal isn't the kind of person you need in your life", "RT @LaMadelynn: https://t.co/UxJNZEi5qW", "RT @8BitPorn: https://t.co/8jZj7m1CDR", "so full of love I can barely eat", "RT @seanoconnz: He always sounds like he's running into an ex-girlfriend that is living her best life. https://t.co/h5IWxBw5Lh", "RT @bustle: same (@huffpostwomen) https://t.co/Uhb7Wnv6Sj", "RT @NYTMinusContext: the freedom to be so judgmental is its own reward", "RT @jonnysun: we keep getting new mornings even when we dont deserve them. sometimes thats the only reason we can call them good.", "RT @TristanRBoyd: @ritazwiee nerd", "Rob and I were trying to watch our show tonight and I managed to fall asleep with my glasses on??", "@margaretpottah it's like Washington state and everything weird from X Files taking place there", "RT @RappingArt: Back to Back, Drake https://t.co/L7o7ZvbBvF", "RT @PFTompkins: So glad Netflix has dozens of British TV dramas available because I'm a big fan of all eleven UK actors.", "when one of my students feels sick during orientation: https://t.co/AGhNN784ls", "RT @AndreaRussett: your smile could make flowers grow.", "RT @Brri_zzy: At least my coffee won't get cold in hell", "RT @pixelatedboat: Why Pokemon Go Is Like Game Of Thrones: Please, Slate Told Me If I Wrote This I'd Get My Kids Back", "@AustinScott10 LOL US TOO", "RT @beaufilms: twin peaks (1990-1991) https://t.co/SEZUHMPfuN", "RT @aparnapkin: \"How is your thing an issue if I can't make it about me?\"-The Missing the Point Brigade", "RT @misheardhamilto: pick a place to cry where it's high and dry", "@BuzzFeed @TheRobDiDonna", "RT @RealTomHankz: wednesday afternoon haiku\n\nthe world is just thoughts\nhang your hopes on ideas\nand be nice to you", "RT @jakeandamir: I can't swim. \nLuckily I suck at drowning too.", "\"it is awfully easy to be hard-boiled about everything in the daytime, but at night it is another thing.\"", "actual footage of me coming back to work today: https://t.co/O0udTA3qrY", "@lauraaamarin I love how shady we have to be", "RT @kumailn: Hot take alert: I don't play Pokemon Go but I'm also fine with it. #HotTakeAlert", "on one hand I love DC and I want to stay forever but on the other I kinda miss home so I'm very conflicted about leaving", "RT @lovelylatte_: https://t.co/H1DGF7L1s0", "DC day 3: held a hissing cockroach &amp; watched the sunset from the dock, 10/10 would recommend https://t.co/pBYThqbB4g", "I found a @PhilzCoffee in DC and honestly I've never been so happy", "hanging out with my bff Barack https://t.co/20cIPq2dpk", "10/10 would recommend visiting monuments at 1am with your friends", "RT @mitskileaks: me, just woken up by the alarm, trying to remember how to be a person https://t.co/5VOViBvnZZ", "RT @g0thxjuice: keaton henson's art is nice https://t.co/V90t7d8zoS", "RT @milanstarr: @ritazwiee you make tiva's look so cool", "\"they slipped briskly into an intimacy from which they never recovered.\"", "RT @jeremycabo: 1. https://t.co/u1grY2za8Q", "RT @Lin_Manuel: Good morning. \nEyes up. \nHearts up. \nMinds sharp. \nCompassion on full blast. \n(Sips coffee)\nOkay let's go.", "RT @tessie_the_mess: wake me up when it's all just not awful anymore.", "me: I'm going to go to bed early and be ready for tomorrow!\nalso me: goes to sleep at 2am", "millennial romance: starting a Netflix series together", "RT @andnowtothemoon: illo: @willvarnerart https://t.co/Y3Si4aQM0K", "RT @ArtFeeIings: craving you https://t.co/vnrWtBMF5s", "RT @_supgoddess: THE HAMILTON SOUNDTRACK IS ON IN FRESH. THIS IS NOT A DRILL @ritazwiee", "@TristanRBoyd a necessary qualification", "\"history, despite its wrenching pain, cannot be unlived, but if faced with courage, need not be lived again.\" -maya angelou", "RT @MattBellassai: i'm at publix for the first time which seems like the only redeemable thing about florida", "RT @misheardhamilto: some men that that i'm intense or i'm in pain", "me when parents talk crap about FIU in front of me: https://t.co/78FyEvVqfE", "@alevids why is this me every morning", "RT @_supgoddess: @ritazwiee or around the ballrooms  https://t.co/sR8YXVgDVu", "RT @MattBellassai: WHO INVENTED FLORIDA WHY IS IT LIKE MY BODY IS SOAKING WET WITH PURE FIRE", "RT @ladybroseph: *drives motorized scooter into meeting I'm late for, around the conference table, and out the door*", "RT @shenanigreat: \"Am I up in a Wendys? Because this bitch is frosty\" is my favourite comeback.", "RT @RyanFischer34: If Rihanna hurts Drake we might receive the best album of all time", "I'm with Rob and literally all he's doing is looking at memes", "@small_saraah this is my dad", "and you are the reason I'm smiling when there's nothing to smile about", "RT @natissss: Looking at old messages and realized every time I try to flirt back, I end up talking about tacos", "RT @cam__pj: hella\nyou feel me\ntryna\nswoop\ngiggin\ngood looks\nfasho \non moms\ncoo\nslaps\ntweakin\ndummy\n#growingupinthebay", "RT @melmnzn: I'm a stay in the car to listen to the rest of the song type of person", "@TheRobDiDonna  https://t.co/iaCxJeR8gP", "this is our personality pic tbh https://t.co/iRU2vBYU7u", "nothing makes me happier than brunch with my favorite humans", "@Jesskidding_ YES THEY'RE MY FAVORITE", "RT @TheBlueDevils: This. This is what it's all about. We LOVE our BD Family and all it represents. #bdworld https://t.co/GSa2lqlKQn", "RT @Lanna_Ko: Relationship goals is someone who understands and responds to your humor like Luke does Lorelai", "RT @CommonWhiteGirI: Being friends with me is like: https://t.co/daX3ftETPU", "\"the opposite of love is not hate, it's indifference.\" #ElieWiesel", "@LAnunez6 there's still a chance for me", "RT @reaIgal: i would never fight with you at cheesecake", "@lindseycolaco KILLIN IT", "RT @IFC: Get a girl who can do both. #cbbtv https://t.co/c38Y0jziIJ", "@AriFernandez07 we're winning the game rn", "RT @artoftheserpent: Vincent Van Gogh, starry night (details) https://t.co/zoYY1MzAHs", "currently eating cookie butter ice cream while standing at the kitchen counter, hbu?", "RT @stephatdisney: Ok literally everyone and their mother is at the Demi Lovato/Nick Jonas concert", "RT @wendyasteiner: If the love don't feel like those potato chips that are folded in half and look like little baby tacos, I don't want it.", "RT @indiebreakfast: *rob lowe voice*\nit is *literally* the most beautiful day", "@ everybody: someone bring me a burrito", "RT @lindseycolaco: gonna create a tv show where boys have to read the shitty messages they send girls to their mothers", "RT @fiImart: Moonrise Kingdom (2012) https://t.co/1zVUB3xyf8", "I thought I got paid tomorrow and I don't after all so I'm very disappointed rn", "RT @dopeblvnts: https://t.co/Sk5EgBmV3d", "update: fell asleep under a table today", "RT @bustle: when it's still not Friday: https://t.co/UU9LDUbGCN", "RT @Lin_Manuel: Good morning \nmy goodness \nlook at you\nperfect\n&amp; this is just the beginning \ni can't wait", "RT @NYTMinusContext: I have never been the victim of a famous kidnapping or any kidnapping at all", "I'm so sad I don't live in New York &amp; I can't see @ohhelloshow on Broadway", "RT @SFBART: We challenge @metrolosangeles to a transit poetry slam. Haikus only.\n\nYour move, LA.", "@coricobain safe travels!! take lots of pics!!", "RT @BuzzFeedBooks: 18 Incredible New Books You Need To Read This Summer https://t.co/LVmYAlybDn https://t.co/Hf5oyxVJwq", "sunburns + orientation days: https://t.co/AgoINnTfPA", "RT @BuzzFeed: Literally just 36 really funny tweets https://t.co/3HkTMLgxmT https://t.co/TuCxvKLVju", "RT @Refinery29: #GetMyAttentionIn4Words \"I just ordered food\"", "@berkingbad I have some comparable stories oh god", "modern romance: confessing to deleting tinder to each other", "my Fitbit died and I left my charger in Naples so basically all and any physical activity is pointless", "RT @bustle: me: https://t.co/njFftILbAD", "RT @itsmanuuuu: Best things happen unexpectedly", "RT @TheAVClub: Nick Kroll and John Mulaney are putting too much tuna on Broadway https://t.co/JqHgq3MjZQ https://t.co/YAa4FUfODv", "@TheRobDiDonna whoa!!", "when you spend 15 hours with someone and don't get bored of them: https://t.co/G2V9YsHqCw", "me: oh I won't get a sunburn this summer \nalso me: goes to the beach and forgets to reapply sunscreen, gets worst sunburn of life", "@valegomez19 GOALS", "just came for my fans https://t.co/zkan2364zI", "the dad thumb: rarely seen in twenty something females, but occasionally makes an appearance https://t.co/D6QxR88Yfb", "RT @dog_rates: This is Maddie. She gets some wicked air time. Hardcore barkour. 11/10 nimble af https://t.co/bROYbceZ1u", "unfortunately me https://t.co/B4GhE2BOph", "RT @bustle: some people are Carries, some people are Samanthas, and some people are Elaines: https://t.co/PMEikPHlNu", "RT @Lin_Manuel: The world changes. \nThe ground shifts.\nWe still make plans.\nWe still find gifts. \nGmorning.", "@alevids this is my most favorite picture of you", "RT @CNVega19: Post-orientation naps are literally the best.", "please explain to me why Closing Time by Semisonic has been stuck in my head for the past two days", "RT @IFC: \"Their dog is a chicken.\" \n\nWatch the entire 50th season of #DocumentaryNow! this Sunday at 10A. https://t.co/JqIur5Py2A", "me @ all the mosquitoes attacking me whenever I go outside: https://t.co/2lnUejjTZl", "RT @NYTMinusContext: fact-lover, dog-lover", "RT @OWCalifornia: When I'm out of state I: https://t.co/MIAk06jOez", "RT @berniethoughts: THE PERIODIC TABLE OF ELEMENTS IS AN ELITIST CLUB THAT RARELY ADMITS ANYONE NEW TO THEIR CIRCLE", "@bustle @erinmaewalsh", "@literallyale honestly me", "RT @shutupmikeginn: Things were going well with my date, until she noticed my Roomba was a Frisbee glued to a bunch of rats", "RT @berniethoughts: WHICH CAME FIRST THE PASTA OR THE BREAD", "RT @meanpIastic: \"You take so damn long to answer\"\n\"Where were you\" \n\"Are you ignoring me\" \n\nMe: https://t.co/HwLhrh60qY", "RT @jonnysun: falling in love is like having spent your entire life reading a thesaurus and someone hands you a dictionary", "@milanstarr that's one way of putting it", "RT @warriors: What a time, #DubNation. #StrengthInNumbers https://t.co/LTaVFimdHh", "RT @jjngsputa: 54. TE ASMO https://t.co/ikNCEWlpol", "RT @TheBlueDevils: Presenting the new 2016 Blue Devils look! #bdworld https://t.co/D1gPXFXSPn", "RT @RudyFrancisco: Nobody's ever come back from 3-1. I respect it #NBAFinals", "RT @BuzzFeed: 28 adorably awkward puppies https://t.co/counKTpC8U https://t.co/AeKfLGAyd4", "RT @BuzzFeed: give us an 8th game @NBA", "when your mom sends you pics of @BZwief in his A Corps uniform and you cry a lil bit #BDWorld", "RT @Jeanluiz56: Pollo tropical https://t.co/cU6QyO6hyH", "RT @Cuddle: \"come over\"\n\"hang out with me\" https://t.co/Agx0WfW1qg", "RT @rmdrk: #BeautifulandDamned is out everywhere - ONLY through my site do they come signed. (link on my bio) https://t.co/JUh8wtRjQ8", "this is the first year I'm not at @TheBlueDevils family day and it's making me very sad #BDWorld (three thousand miles away)", "RT @Lin_Manuel: Good morning. \nIf we're picking teams,\nI call dibs on you. \nThanks for being around.", "@natissss um yeah but now you get to see me", "RT @IFC: Make some good decisions this weekend. #FridayFeeling #DocumentaryNow! https://t.co/luXcBb24iV", "I shouldn't look at the @alexandani website when I have no money, bc now I just want all the bracelets https://t.co/NKAqqRLLDX", "RT @HerCampus: Yeah pretty chill https://t.co/5f6FW2bd7M", "RT @brandonmcg: Come for the queen scolding William, stay for the George facepalm. https://t.co/etvmofiU5m", "necessary qualifications for a boyfriend: https://t.co/eFcKWJDnfo", "@lauraaamarin YASSSSSD", "RT @NYTMinusContext: becoming a competent, socially mature adult", "@alienlover6669 YES LOVE", "@dia_garciaa SUPER COMFORTABLE", "RT @milanstarr: @ritazwiee funky shoes for the win", "I just need everyone to pls appreciate my Tevas bc no one in Miami does (ignore my linty leggings) https://t.co/0SyhR86TJV", "RT @TFLN: (512): He gave me an extra phone charger for the other side of the bed the other night. Is that love?", "RT @TheBovsWho: Summer 2016 https://t.co/dabJdSl79E", "@valegomez19 YES OMFG I CANT WAIT", "RT @onthatjetlife: When y'all both petty af https://t.co/OeQyyt5En3", "sooooo I just bought tickets to go to DC next month?! https://t.co/Ly5wg6a4MO", "@TristanRBoyd the accuracy", "RT @TristanRBoyd: @ritazwiee no man is worth Santa Rita at 3:15 on a Friday let alone that", "RT @stevesilberman: Photo of the Day, via @maggiekb1. https://t.co/RHYU8JLPqI", "RT @portlandia: #StateOfWomen https://t.co/hDp9ckXGbv", "uhhhh still no  https://t.co/3aNp7sQzsP", "RT @SincerelyTumblr: Sext: https://t.co/46MRrlD1pk", "RT @ItsJennaMarbles: \"where do you see yourself in 10 years?\" \nme: https://t.co/Val0K7hnHa", "RT @RappingArt: Sweatpants, Childish Gambino https://t.co/uNCxOlb2VO", "@BuzzFeed @margaretpottah", "@ari_kari12 HIIIIII", "RT @sadqueer4life: american horror story: literally everything", "espresso count for today: three &amp; counting", "@itsmanuuuu thank goodness you're not a PA lmfao", "and love is love is love is love is love is love is love is love cannot be killed or swept aside", "RT @HamiltonMusical: Hamilton: An American Musical has won 11 @TheTonyAwards including Best Musical. #Ham4Tonys https://t.co/92t4UrBzlN", "RT @TimFederle: Theater kids, walk tall.", "forcing my coworkers to watch #TonyAwards https://t.co/eOlcirg75J", "RT @RealLucasNeff: Tired of \"thoughts and prayers\"\n\nReady for \"action and change\"\n\n#Orlando #Pride2016 #gunviolence #GunControl #gunsense", "RT @ChipotleTweets: Your girl loves us more.", "I'm really vain and I love this picture https://t.co/PJrP84TYvC", "RT @girlposts: me everytime I see a dog https://t.co/v0mkqIx4X8", "@milanstarr the guy looking dead at the camera at the end is me", "RT @bustle: THIN MINTS https://t.co/PEjjI74ADa", "RT @ChipotleTweets: Anxiety: Thinking about your next burrito while eating the current one.", "@lindseycolaco this is life advice", "RT @laylabby0x: I'm literally all my friends mom... Like can y'all get it together please lol.", "RT @portlandia: Thursday means there is still another day left until this week is over. https://t.co/4uYF9p3fvD", "RT @MattBellassai: As usual, Nora Ephron said it best. https://t.co/IsMm8h0u8w", "\"the right person's still gonna think the sun shines out of your ass, that's the person worth sticking with.\"", "RT @FRlENDSreaction: who wouldn't want to look like 90s jennifer aniston https://t.co/DMicZdhDJr", "RT @starwars: It's #NationalBestFriendsDay, who would you choose to pal around the galaxy with? https://t.co/dWbh6YqmbC", "ATTN MY LITTLE RAY OF SUNSHINE IS IN ENGLAND KICKING SOME ASS (@LAnunez6 I'm ur embarrassing mom)", "RT @bustle: me: *harshly judges contestants on MasterChef*\n\nalso me: *ate a jar of peanut butter for dinner*", "RT @bbysamus: Yeah but does it really have to be this woman https://t.co/IdtCtJ7ctt", "RT @iamBrILLYant: you haven't \ntraveled and \nseen beauty\nuntil you \nexplore her\n           mind.", "making a quesadilla while top chef jr. is on; needless to say I feel pretty intimidated rn", "me after orientations like: https://t.co/ZBN6vRwMS1", "@lindseycolaco @margaretpottah @totalsratmove truly life changing", "RT @Lin_Manuel: The sun is gone but you remain, undimmed and glorious. \nGnight.", "RT @TraderJoes17: Top two quotes of college: \n1. The uber is here \n2. I'll venmo you", "RT @HerCampus: Giving away free front row tix https://t.co/vcUF2MAUZI", "RT @laylabby0x: @ritazwiee same! I just want to cry damnit!", "RT @thinkpiecebot: Are Emoji Why Millennials Won't Work Their Way Through College?", "RT @totalsratmove: Bid. https://t.co/WTKSXfXJk9", "RT @whichyouare: quote with which one you are (submission) https://t.co/l8MRfgoxd9", "@knicole__xo yeah it was gross", "RT @brookemiccio: sweet potato fries are so important", "I want a Sunday kind of love", "RT @BuzzFeed: 26 Ron Swanson jokes that just never get old https://t.co/ZlWHqNf0gS https://t.co/KuQW1uObnB", "RT @sextsbot: I'm going to disrespect your aesthetic", "@tinatbh @erinmaewalsh", "Discomfort with a bit of Pink Regret https://t.co/xZAbcmOmcb", "RT @shondarhimes: The world will never be the same... https://t.co/zhCpVGgk6B", "took a sex in the city personality quiz &amp; got Miranda; feeling very confused with the world right now bc I'm DEFINITELY a Charlotte", "@margaretpottah CROSSES FINGERS &amp; TOES", "@margaretpottah LMAO STOP you're cooler than me!! ok glad we settled that https://t.co/BHzLeNpeUi", "@margaretpottah I feel like we're the same person but hella far away to solidify our potential friendship (thnx @lindseycolaco)", "RT @margaretpottah: my job: https://t.co/ntmIYHCHDA", "@margaretpottah OMG YES", "@margaretpottah WAIT FOR REAL", "RT @bustle: ahhhhh.... https://t.co/enawNABR6s", "RT @orionnichole: don't get too close, i'll turn u into poetry", "@LAnunez6 crying forever", "RT @TFLN: (402): I can't find my keys and there's a hotdog in my purse.", "my life this summer: gesturing wildly at my group with a coffee-stained clipboard #OrientationSZN https://t.co/4UFJb58K9W", "YOOOOOOO https://t.co/kqyavmwL36", "@natissss TOO TRU", "RT @NightValeRadio: A falling knife has no handle. That's why you dropped it.", "RT @FreePeople: #writethisdown https://t.co/NVVoCL8zKB", "orientation &amp; RA trains you to be ready to go on a distinct lack of sleep  https://t.co/kimfGP4XDO", "RT @HouseofCards: Always. https://t.co/JR8qWWiCdC", "@sassafrasskim literally me", "we have our dreams because without them, we could not bear the truth", "look at this aesthetic JUST LOOK AT IT https://t.co/jST1suYG5k", "me as a Spanish teacher tbh  https://t.co/kJQEhYdtxt", "@victoriateske blue!!", "I went to bed at 11pm last night and I was genuinely shocked", "took a nap in the middle of the piano lounge today, that's how you know it's #OrientationSZN https://t.co/5lV0rThs7w", "RT @FIU: Seeing all these #FIU20 tweets is making our hearts smile. https://t.co/LdmEBYrsZj", "I stopped looking for the light when I realized that I'm the sun", "my reaction when people block me on social media: https://t.co/2yaKBNSxsh", "if you forget to wear your Fitbit, does any of your physical activity actually matter?\nanswer: no", "Joey Purp - Girls Ft Chance The Rapper https://t.co/PnbmxHuKky \n(so weirdly good??)", "RT @bustle: TUESDAY (@tinatbh) https://t.co/YizVyEhgDb", "RT @dulcetry: TO ALL MY HATERS: fair enough.", "RT @bustle: me: fearlessly navigating my way to my best life possible\n\nalso me: had to turn that \"omelette\" into scrambled eggs", "RT @axtang: *drake voice, to a puppy*\nyou're a good boy and you know it", "@annavoig101 watch broadchurch! it's on Netflix, two seasons, and one of the most amazing British crime shows I've ever seen", "RT @libbyhoward_: https://t.co/K9ZPBX1F18", "RT @bustle: why why why (via @honorcurves) https://t.co/N5M65SSNYm", "it's at this point in my tv watching that I reconsider watching Parks &amp; Recreation from the beginning all over again", "#GoalDay2016: let's see if I can make it to 10,000 steps amidst all this damn rain", "RT @nickjonas: Just completed my one man show version of Les Miz in the shower.", "RT @sharinish: I feel like my hydroflask is an extension of my personality", "concept: she is water. powerful enough to drown you, soft enough to cleanse you, deep enough to save you.", "RT @portlandia: Favorite genres are Queer Horror, Softball 1980-1989, and Political Cartoons: Lady Artists. Yours? https://t.co/n0rQkskveR", "RT @OWCalifornia: You know you're from California when the Mexican food in any other state leaves you totally disappointed.", "@camiweinstock bless ur soul", "@lauraaamarin I've been choosing food lately LOL", "orientation training marathon: when you have to decide between eating or sleeping https://t.co/qzwtIiMmQ7", "@literallyale so down", "RT @evepeyser: Also known as going on a first date with a millennial man https://t.co/oAGHsBsg0x", "RT @NYTMinusContext: an appealingly unpredictable wackiness", "RT @alyvi101: Can't live without cafe con leche", "RT @berniethoughts: IF DOGS KNEW THE DELICIOUS MEALS WE EAT WHEN WE ARE GONE", "RT @OllieMcKendrick: i stared into the unknowable darkness of the abyss and asked it if it wanted to go for brunch sometime", "@LAnunez6 since when do you watch sports", "RT @campaignsenpapi: How Cubans pronounce areas in miami https://t.co/8mZUIDlfqA", "@ my roommates I'm sorry for watching friends for the past two hours", "RT @Lin_Manuel: Gmorning. \nLook at you!\nDamn, you alright!\nPssh. They ain't ready for you!", "RT @Dory: my 4 moods https://t.co/KqsJuxCgMX", "RT @coffee_n_mtns: I want to take good photos.\nDrink lots of coffee.\nAnd travel the world.", "RT @bustle: my life summed up: https://t.co/q04HriKBZr", "hi, my name is Rita, and I'm a pub sub addict", "RT @itsmanuuuu: If someone takes me to a coffee shop &amp; bookstore as a first date, I might marry them on the spot", "@ClaireHolt5 me as hell", "@berkingbad I'm magoo's biggest fan tbh", "hello everyone I am finally starting game of thrones you're welcome", "RT @orionnichole: you make me feel how jazz sounds", "can we please appreciate @LAnunez6 clapping on \"booty like this\" (psa don't leave us in traffic together) https://t.co/QUe0GK1qSF", "love arrives exactly when love is supposed to, and love leaves exactly when love must.", "RT @sosadtoday: can someone teach me how to do that black eyeliner cat eye thing and how to be at peace", "whenever my phone rings unexpectedly I can't pick it up\nI can't have a conversation that I'm not prepared to have", "@alevids YES GIRL OMG", "RT @notlawstjw: I like to think that my pettiness is one of my most charismatic qualities", "@literallyale literally me in wynwood yesterday", "Amy Sedaris never fails to make me laugh tbh", "RT @aparnapkin: A good mom is like a hipster, she was into you before you were cool", "@BobsBurgersFOX Kind of a Big Dill Burger (served with a pickle on the side)", "RT @NYTMinusContext: It is really good to feel loved", "RT @FIU_AXO: Big's are moms too. https://t.co/x3xpubxFoZ", "@lauraaamarin you have two children (@valegomez19 @BriannaFerraro8) so you basically are", "me when all my friends are wifed: https://t.co/5j7y9AtnMz", "I want to go to the #KentuckyDerby one year simply to wear a big hat and drink mint juleps", "also I met a dog today in wynwood\nso all in all today today was the greatest day ever", "RT @TFLN: (813): Made him watch 4 hours of HGTV then told him I was too tired for sex.\n\n(727): Savage", "@lindseycolaco LMFAO THAT IS FUNNY", "so my parents came to visit and checkouts still aren't done... so they're currently watching Netflix in my room", "@lindseycolaco yeah that too", "@lindseycolaco @itsmanuuuu I'm gonna come visit tbh", "RT @RAGirlfriend: Checkout is going to be the death of me #RAproblems", "you know you're getting ready to move when you finally throw out the rolls of butcher paper under your bed #RAproblems", "@_mariaroman CALIFORNIA YES", "RT @BuzzFeed: aesthetic https://t.co/VGyOIjc1CE", "RT @literallyale: i said better late than never, just don't make me wait forever", "RT @jonnysun: every flower that grows in a city is beautiful for the simple fact that it is protesting", "this is a self parody\n(thank you @BuzzFeed) https://t.co/1Y5gZJ2UN2", "@knicole__xo same girl", "@valegomez19 thank you, thank you https://t.co/MAmjfmtzjb", "@valegomez19 @BriannaFerraro8 FAVES", "tbh I've turned into such a rebellious twenty year old and I kind of like it", "RT @taylortrudon: Love In A Time Of Netflix https://t.co/e5k6FI2J6U https://t.co/1vesSohlC7", "RT @TweetLikeAGirI: the only running man challenge i need https://t.co/9XOztSQlSs", "@valegomez19 can i come", "@stephatdisney SO CUTE", "happy star wars day!! #MayThe4thBeWithYou\nhere is a han solo &amp; leia gif bc they're my favorite https://t.co/N4ONQdtIQ8", "RT @RepubGrlProbs: me https://t.co/gCic8ixveP", "RT @BoJackHorseman: just think, one day all of this will be gone and none of it matters. goodnight.", "RT @BuzzFeed: me at 2pm: i'm so tired i need to sleep\n\nalso me at 2am: https://t.co/xCXxz8od3m", "RT @mikimoshpit: @ritazwiee Story of my life. An endless void of endless fictional worlds.", "RT @dispends: yea you cute but what are your aspirations", "RT @Lin_Manuel: Good morning. \nYou are perfectly cast in your life. I can't imagine anyone but you in the role. Go play.", "going onto amazon is a blackhole for me because I just want to read all the books", "RT @History_Pics: A less \"scruffy looking\" Harrison Ford, 1981 https://t.co/Qd9y6ezeHY", "RT @bustle: Monday got me like: https://t.co/tEijPrv8fm", "relating far too strongly to Daria these days", "me currently  https://t.co/ytBITSFvxQ", "this song is relevant for an entire month, unlike the other famous may song https://t.co/ZExqPRpbHw", "RT @McKinleyKitts: if I'm trying my hardest to white wash a Mexican holiday, should I call it \"cinco de drinko\" or \"drinko de mayo\"?", "ok everyone needs to watch Comet on Netflix bc I need to discuss it with people", "RT @CommonWhiteGirI: Man who just listened to Views approaches woman who just listened to Lemonade https://t.co/SK6c577xn2", "@bustle @jennifercaved", "@victoriateske THIS DRIVES ME CRAZY", "RT @BuzzFeed: 7 cheap and unexpected date ideas you need to try immediately https://t.co/lt3rFkOrVH https://t.co/1mOv0spS7b", "RT @ParksPics: Leslie Knope feminist queen https://t.co/WwK4Rz05sA", "me currently at work: https://t.co/gZWx8JWrCK", "@natissss LMFAO DEAD", "RT @femaIeboss: your mcm listens to Future but doesn't have one.", "RT @mackenziebourg: i was made for lovin you", "RT @ry_sny: Views from the P https://t.co/u4WA2XyI6x", "@pitchfork @diplo @arzE @literallyale", "RT @qc: \"Happiness looks beautiful on you.\"", "RT @karis_naomi: When your boyfriend doesn't reply to your messages first thing in the morning https://t.co/G2GAtoCsku", "RT @madeline_haller: Is Mercury in retrograde or am I just sleep deprived?", "RT @girlideas: https://t.co/1eV3EslcjR", "@stephatdisney aw you know I'm here for you no matter what!!", "truly obsessed with this song (a few weeks late) https://t.co/lSYlBX0jfo", "there are no words for how much I hate penny boards", "RT @BuzzFeed: Here's a GIF of Jeff Goldblum just because https://t.co/miFu5iurlx", "RT @natissss: I still have no idea who Future is. I feel like a 42 year old suburban mom.", "@victoriateske your tweets are literally my favorite", "RT @jaypugz: me watching anything involving the Hamilton cast https://t.co/ajEsH23J3D", "RT @coffee_n_mtns: 12 things to do to find happiness again https://t.co/L10Loc2gDL", "@yliiime @lulztxtit @JustJared okayyyyy we get it you don't want chisme", "@jennifercaved @TheFunnyTeens us on the daily", "RT @FIU: We're so happy to hear this! We strive to make our students proud to be #FIUPanthers! #ReachHigher https://t.co/u78uApm6At", "RT @sosadtoday: my peer group is a burrito and a dog", "RT @laurenxhooper: sometimes I forget how young I am. I have time. there's enough time.", "the fact I once set an alarm for 4:45am makes me cry a little bit", "why are so many emo bands on my discover weekly?? what was I going through last week?", "RT @OdysseyRejects: Why Getting a College Degree is Overrated, as Told by the Guy Who Peaked in High School", "RT @ChipotleTweets: If tacos grew on trees, we'd all be tree huggers.", "RT @tbhjuststop: \"How's life?\" https://t.co/OiCK9VCIE9", "RT @rgay: Hot sauce in my bag swag https://t.co/NOEowJkvno", "RT @bustle: pls stop (via @MyThrpstSays) https://t.co/koq1cJmEjH", "RT @natissss: Graduating with a bachelors in procrastination and double minor in quizlit and easybib", "RT @melmnzn: https://t.co/dM4fUWugGf", "RT @beautfilm: 500 Days of Summer (2009) https://t.co/rg6dtUPTRX", "WHEN UR BEST FRIENDS FACETIME YOU FROM A PARTY @yliiime @lulztxtit", "RT @BuzzFeed: BEYONCE time https://t.co/WyqTKF921d", "RT @brokeymcpoverty: *casually texts 'why do you deny heaven' to all my exes*", "RT @Refinery29: A moment of silence for all my feels. #LEMONADE", "RT @lulztxtit: do you ever look at someone and just think man I want to treat you like no one else has", "RT @yliiime: https://t.co/TSjPIzmxID", "RT @mackenziebourg: i just want ur extra time and ur...kiss", "RT @BuzzFeed: https://t.co/JnbEBZxX0Y", "RT @KardashianReact: The whole point of dating is to get the 2 for $20 deal at Chili's", "\"she's gonna say she's peachy. and by her voice I'm gonna know she's not peachy.\" \nvalentina dispensing some wisdom", "RT @bustle: career goals: https://t.co/kCE8jd4p1i", "Thing to Know: Zombieing...the word for that time your ex from college liked your Insta. #SkimmLife", "just saw a girl crying at the gym; me too girl, me too", "RT @PulitzerPrize: The 2016 Pulitzer Prize for Drama goes to... @Lin_Manuel #Pulitzer100 https://t.co/78ORIi2aOa", "RT @HouseofCards: I was looking forward to watching you go down in flames.", "@yliiime @lulztxtit sexual", "RT @hoezodiacs: the signs as @CINEMAPALETTES \n\npisces: Breakfast at Tiffany's (1961) Dir. Blake Edwards https://t.co/uv6OdTqnce", "LMAOOO https://t.co/bpxXsrBFDH", "RT @rac__hael: Are you boys not tired of this dog lifestyle? https://t.co/7SUoS1RJyY", "me: is determined to work out tomorrow morning\nalso me: eats ben &amp; jerry's from the carton", "@yliiime gross (but cute)", "https://t.co/aoDjioIFwn", "RT @BuzzFeed: A huge alligator ate another alligator because Florida https://t.co/jL3UpR5Icv https://t.co/ekiCxjG0fk", "I truly believe that in a past life, I was a Jewish grandma", "I just watched someone roller blade through the library??", "@lulztxtit this is really cute but sexual also", "do these students realize how lucky they are  https://t.co/VXGE4B8jlu", "@Jesskidding_ putting in a pre order", "psa: I HATE the word \"finesse\"", "@CaptainAmerica I stand with #TeamCap. #TweetMe https://t.co/LFpBgMvKt3", "WHY IS THIS FUNNY TO ME https://t.co/FmO3kYAUN4", "RT @SexTaIk: \"what kind of relationship do you strive for?\" https://t.co/msbrSygvc1", "RT @Jesskidding_: @ritazwiee YASSSS RITA SLAAAAY", "this is called \"I didn't work today and I bought an expensive face mask at Sephora\" https://t.co/brH1ltz7bC", "RT @astroIogyposts: the signs and their beautiful features https://t.co/1aBXNezhjH", "RT @deepsouI: Livin la vida broka.", "I'm watching Best in Show and these are truly my people", "RT @HouseofCards: It's only a wound. It's not fatal. https://t.co/QvD7AWnbwN", "RT @bustle: waiting for my paycheck like: https://t.co/asQ9VabYt8", "RT @NYTMinusContext: just have fun and be free and be in the world and unafraid", "RT @swtextpost: https://t.co/6vzs8lZcAA", "RT @bustle: mood: https://t.co/bvpmtNGEyX", "RT @bustle: when your heart wants to have a fun weekend but your bank account doesn't: https://t.co/6OUp5CUR6x", "RT @yliiime: @ritazwiee should say twerk queen ngl", "@yliiime LMFAO DEAD", "my whole life https://t.co/b3xeYpKI2o", "RT @lulztxtit: you have sadness living in places sadness shouldn't live", "RT @bustle: me: proud and strong AF woman\n\nalso me: completely dependent on coffee", "RT @coffee_n_mtns: And you https://t.co/erdpnpVLed", "RT @hectoreses: https://t.co/APHIYKSpka", "RT @ghostkrogh: me (applying for food stamps): are these like, scratch and eat", "RT @cityt0city: I enjoy my own company way too much", "RT @erinmaewalsh: @ritazwiee and I really like ducks.... https://t.co/c7ivZnl0Fj", "@MarthaCamposs Martha I love your shade", "RT @netflix: You WOULD get the sashimi, @BoJackHorseman https://t.co/NEPsg7jLts", "RT @NYTMinusContext: somewhat menacing, somewhat Pottery Barn", "@Jesskidding_ LMAO I LOVE YOU TOO", "everything I've eaten today has been given to me or free and this is the life I truly enjoy living", "RT @berniethoughts: I BET THE FIRST BOTTLED WATER COMPANY FELT INSANE WHEN THEY REALIZED THEY COULD SELL WATER", "RT @KyloR3n: dear diary\nmy mom missed my band concert\nshe said she was busy leading a galactic resistance but I had a clarinet solo", "RT @coffee_n_mtns: Coffee is always a good idea", "@alevids ME AS HELL", "\"if you work really hard, and you're kind, amazing things will happen.\" -@ConanOBrien", "RT @bustle: proof that beauty come in all shapes and sizes: https://t.co/lbSJvDP2vH", "RT @bustle: me: *i never have anything fun to do*\n\nalso me: *cancels plans*", "RT @HouseofCards: I wish we could turn back time, but here we are.", "duty weekend + a paycheck = online shopping for days", "RT @bustle: goals: https://t.co/Zl7srLQR1z", "RT @BuzzFeed: when someone tries to tell you something on April Fools' Day https://t.co/I1Kv4cVAX2", "I hate when people ask me how I am; the answer is always busy and/or tired, it never changes", "RT @silvisbal: I just wanna dance", "RT @_sakanoue: https://t.co/UF2s4HOSxz", "RT @BuzzFeed: Reminder  https://t.co/vPmlh6KeOj", "RT @KyloR3n: ugh these aren't delusions of grandeur, dad\nmy grandeur is real", "RT @ohkayewhatever: men https://t.co/LUR7rtCIIa", "RT @HouseofCards: https://t.co/NLomugLJiu", "RT @bustle: it's really a total gamble (@Gaby_Moss) https://t.co/iGCMQk81wE", "RT @portlandia: Unattended children will be given a free espresso and a puppy.", "RT @coffee_n_mtns: https://t.co/u8XtjwKTyX", "RT @itsmanuuuu: Being a college student with a job and a social life is just being exhausted &amp; sleep deprived throughout the entire week", "@caroline_hagan @HamiltonMusical @camiweinstock", "RT @royal_bri: As a sorority woman, this is so accurate. LMAO. #yougetashirt  https://t.co/w0zx8QfPdY", "@literallyale they are so stupid but i love them so much", "gertrude https://t.co/GJoR0014QH", "RT @NYTMinusContext: fairly confident but sometimes unmotivated", "pick a star in the sky, we could both say goodbye all night", "RT @gabydunn: Just a Claire Underwood looking for her Tom Yates.", "RT @ChipotleTweets: Find someone who holds you like you hold a burrito.", "RT @officialbskip: when she makes no sense at all but you still love her https://t.co/bmZUtMd1Di", "RT @bustle: ??? https://t.co/oSmsiXkrSc"]}