{"SFPort": ["@bridgeology @TidelineSF @ryan_levi Hi Mike. We will look into this. Thanks!", "@SFGEnterprises has launched the re-designed California Spirit, a 100-ft luxury vessel made for on-the-water events. https://t.co/WaU8SrU5Xi", "RT @SFGovTV: We have a full house today at the @SFPort commission meeting!!! https://t.co/SnFmbyJrkC", "RT @SFGovTV: Streaming LIVE at 3PM - Port Commission on https://t.co/btMuESu1Dm @SFPort  https://t.co/EERIm1H85h https://t.co/fa0XtF9gfH", "Examine the effects of climate change &amp; sea level rise in this documentary series put together by @SFPublicLibrary - https://t.co/OHADtYYAoO", "Check out this nifty waterfront 360 Time-Lapse video! Sent to us by @TobyCreations - YouTube | https://t.co/VOhUt4MqMg", "Check out this beautiful drone footage of a local fishing boat (Bass Tub Sport) heading out to sea - YouTube | https://t.co/x4m88kJepW", "A fresh catch of 24 salmon brought in by the sports fishermen and women at Bass Tub! #FreshCatch https://t.co/Rpe2RsFvrX", "The Bay Area Maritime Trail is packed with ships, ferries &amp; museums which preserve the region's seagoing history | https://t.co/KEhRuyTdxA", "FYI: @Caltrain will operate on a Sunday schedule for the 4th of July and provide extra capacity post-fireworks show https://t.co/fqyeJqFghy", "Enjoy your 4th of July! Photo by Dave Rauenbuehler. https://t.co/VYMpreXWVi", "Need an alternative fireworks viewing option? -- 2017 4th of July Dockside Fireworks Viewing on SS Jeremiah O'Brien https://t.co/SJJ9AWYJJR", "We'd like to thank our followers for helping us grow our online community and for keeping track of our historic waterfront! #SocialMediaDay", "It's Summertime on the Waterfront! -- Check out the 6th edition of our interactive digital magazine: https://t.co/ySTvwSp6AZ #SFPort", "Another bike share option has popped up in the Bayview and Mission neighborhoods| Hoodline https://t.co/7H9QGyMzIf", "Looking for 4th of July activities? Check out our list of holiday celebrations taking place along the waterfront! https://t.co/pjz5peaCgJ", "It happens! -- 3 tales of gigantic aircraft carriers getting stuck in SF Bay muck - San Francisco Chronicle | https://t.co/xorU37y12w", "Join @SFGiants and @SFOpera for a FREE Live Simulcast of Don Giovanni this Friday at 7:30pm at AT&amp;T Park! https://t.co/xetpooh6UN", "Every last Friday of the month, #PIER39 hosts an outdoor movie night. Catch the next screening on June 30th - https://t.co/uI3gfImEQH", "A few safety tips for those of you celebrating #SFpride this weekend: https://t.co/tgSQjF5g6v", "For the artists who craft the parade floats at Parade Guys at Pier 54, #SFPride is the most busy time of year -- https://t.co/TgcJSEViGi", "Hooray! A reprieve! -- Most of Bay Area to cool off after triple-digit heat wave - SFGate | https://t.co/qXIiRS8Yoe", "Congrats to the new cities! We're using @Living_Cities support to develop a financing plan to fortify the #SFSeawall https://t.co/lvTNEOAkso", "Water ferries, of course! -- In the days before BART, how did people get across the bay? - SFGate | https://t.co/On2F4Gv8A6", "RT @bookpassage: Celebrating the #SummerSolstice like https://t.co/nXxgBng8Gg https://t.co/CvO4YE2zxx", "Save The Date! Join the EcoCenter for a fun and FREE day of science, arts, music, and food, celebrating the Bay - https://t.co/3Fadsesfp0", "Bay Area Heat Advisory Upgraded To Excessive Heat Warning - SFGate https://t.co/sVTnLYaDZl", "Happy First Day of Summer! https://t.co/KEupjlMATK", "Get your groove on at this Friday's @PIER39    Summer of Love Dance Party - https://t.co/OX6fTdVDua", "RT @SFPortHR: The Port is hiring a senior industrial hygienist to handle chemical, physical, and biological agents - https://t.co/oiGGsx6ZzQ", "FYI https://t.co/x1NdXCbt5S", "Enjoy extended summer hours at the @exploratorium, including After Dark Thursdays and Family Fridays -- https://t.co/u6Bx6iyW9j", "RT @sfbike: It's summertime, and the Embarcadero is hopping with these new improvements. https://t.co/YHtKSwPyHd https://t.co/DIW21nOVSt", "Heading to the #SFwaterfront? You can take the ferry, Bart or the Embarcadero E or F lines.  https://t.co/K7EuUHxX9Q", "RT @SFGovTV: Port Commission LIVE streamed on https://t.co/btMuESu1Dm at 3pm @SFPort https://t.co/3BX1Nwg1sI https://t.co/OYt2TwfiJl", "How the Bay Area Is Restoring Nature's Delicate Balance | Shared via @NatGeo  https://t.co/UJB3Mdq0Qq #SeaLevelRise #SFwaterfront #SFSeawall", "RT @sfgov: We got this like Dray's got Klay #DubNation https://t.co/MYcNVqe9vR", "55 years ago, Alcatraz guards realized three inmates escaped their cells. They've never been found. -  https://t.co/7ok4nXL3WT", "Two of these will affect the #SFwaterfront: 7 billion-dollar megaprojects that will transform San Francisco by 2035 https://t.co/XejL3YQn7D", "Get ready for the next Big One. Attend the #EarthquakeSafetyFair on 6/15 4 wkshps, exhibit booths, &amp; raffle prizes! https://t.co/ErElUPay8k", "They lie beneath the street, just like the #SFSeawall: New Map Reveals Ships Buried Below San Francisco | https://t.co/ngpn1OFnGG", "Celebrate #WorldEnvironmentDay2017 tomorrow and join the live stream conversation about people and nature on Earth https://t.co/GcvCvEi09j", "Make ur home #earthquake &amp; #fire safe. Join @sfdbi &amp; city partners at Free 6/15 #EarthquakeSafetyFair. Register: https://t.co/ErElUPay8k.", "Maritime fan? Indulge in the maritime history of the Pacific Coast at the SF Maritime National Historical Park | https://t.co/fgjQHMvIZg", "The largest craft-beer festival in America is coming to #Pier48 this Saturday - SF Weekly - https://t.co/3BO7aP7qJg #SummerFest #BeerCamp", "Kicking off this week: Design teams will compete for the best solution to sea-level rise - https://t.co/BEibknmWqF #ClimateChange", "FYI: Man on middle anchorage of Bay Bridge; 2 WB lanes closed | https://t.co/i0r7ubO6vL https://t.co/XN8rd3opC4", "@ATTPark @SFOpera @SFGiants Thank you for the RT!", "In celebration of @PIER39 turning 39, participating pier restaurants will be offering free desserts on June 2nd - https://t.co/MvFgFYS21v", "https://t.co/yRLhcTpHXd", "25 Ways To Celebrate The (Unofficial) Start Of Summer In San Francisco | Hoodline https://t.co/TeDrt22hMH", "But they'll be back! -- With Summer Ahead, Most Sea Lions Expected To Leave Pier 39 | Hoodline https://t.co/YbqB8Lz6H2", "Seeking a commuting alternative? https://t.co/hdcr0UkNdk", "The Port would like to welcome Mr. Rod Iwashita as our new Chief Harbor Engineer! https://t.co/hAlAqzr4BQ", "San Francisco opens newest homeless navigation center in Dogpatch w/ neighborhood support | https://t.co/4w5Ss4qaHQ https://t.co/h2WjDOT6TQ", "Congrats to the @RecParkSF Greenagers program! - Teen wildlife and nature program wins $20K grant from Disney-ABC  https://t.co/fwMhcysn8H", "Head's up BART riders! Track rebuilding work Memorial Day weekend: 5/27-29 between Lake Merritt &amp; Fruitvale. https://t.co/fEDr9qzEcM", "RT @theoellingtonSF: Proud to support Kimberly Brandon's reappointment to the @SFPort commission. https://t.co/evvy9xCKuf", "NOW Hunters Point is hosting an Outdoor Movie Night this Saturday, featuring the movie Get Out! -- https://t.co/6S3TmNpany", "RT @SFGovTV: Port Commission LIVE streamed on https://t.co/btMuESu1Dm at 3pm   @SFPort   https://t.co/3BX1Nwg1sI https://t.co/BHTPWwWJvO", "U.S. Ports Need $66 Billion for Infrastructure --  https://t.co/CZjy5x8ic3 #TimetoBuild #InfrastructureWeek", "Developments at Mission Rock, Pier 70 &amp; Crane Cove will add more than 20 acres of open space &amp; up to 4,500 homes #ItsTimetoBuild @SFGiants", "Did you see them? -- Whales were swimming near the Golden Gate Bridge Wednesday morning - SFGate https://t.co/FVlEYylLdB", "More than 50 new developments and capital projects are currently underway and in Port management #TimetoBuild #InfrastructureWeek", "RT @SFMaritimeNPS: This is a very exciting day -the promenade project is now complete!! https://t.co/BJJmHy6RcQ", "The @SFBayFerry Mission Bay Ferry Project will provide a capacity for 10,000 riders #TimetoBuild @mayoredlee @SFOEWD @GoldenGateFerry", "During May, permit fees for awning replacements and pedestrian level lightning are waived for Small Business Month. https://t.co/dBDSxDjffT", "We're on Instagram! Share your SF waterfront shots using #sfport or #portofsanfrancisco for a feature: https://t.co/gXz6TkNcoT", "Head's up BART riders! Track rebuilding work May 13-14 between Lake Merritt &amp; Fruitvale. https://t.co/juQzl558Vx", "Highlights from yesterday's event --SF Ferry terminal expansion project breaks ground: https://t.co/cglMEimmFb", "View the video from today's Downtown SF Ferry Terminal Groundbreaking Ceremony: https://t.co/yO4SyfvlAJ @SFBayFerry #TimetoBuild", "The Port will be live-streaming today's Downtown SF Ferry Terminal Groundbreaking Ceremony on Facebook at 10am: https://t.co/F8unCNTtUK", "Blue Collar Green Water Photography Exhibition Opens - San Francisco, CA Patch https://t.co/JSXavbxBWe", "FYI: The next Fisherman's Wharf Waterfront Advisory Cmte mtg will be held May 16th, 9:00AM at @ScomasSF. This mtg is open to the public.", "The EcoCenter at Heron's Head Park offers several K-12 education programs. View the programs for 2016-17 school yr: https://t.co/TqYDGyU1Mc", "RT @SFGovTV: Port Commission LIVE streamed on https://t.co/btMuESu1Dm at 3:15pm  @SFPort  https://t.co/o6KaxfVy9l", "RT @sfoewd: Today 11a-6p: Shop &amp; support 40+ vendors at #CityHallPopUp for @sfmade Week. Free event #shopdine49 https://t.co/Tj1Xle474E", "May 8-13 is Digital Inclusion Week! Expand your tech skills with these FREE activities hosted by @SFPublicLibrary - https://t.co/HYvsiuePwe", "#PIER39 is holding a series of beer and wine pours as part of their 39-week long anniversary celebration: https://t.co/12NCOUXRQD", "May is Small Business Month. Improve your curb appeal &amp; save on permit fees with an awning for your small business! https://t.co/n0b7HqVd7C", "Help show that #SFBikes at this year's Bike to Work Day taking place Thursday, May 11th #BikeTogether https://t.co/3ZUple8xgS", "RT @zip2media: Enjoying @HotelCouncilSF Women in Leadership Forum with @reneedunnmartin of @SFPort https://t.co/FELFif5VJT", "RT @GGAudubon: Our recent #BioBlitz at #Pier94 was fun for both kids and adults!  https://t.co/gvsBhEd7ZA https://t.co/p9BOfJSzHA", "The future of growth: Public comment sought on regional Plan Bay Area 2040 document l https://t.co/KIymOmPdnG", "The Port and Blue Collar Green Water would like to invite you to attend this FREE 1-hr photo workshop at Pier 1 - https://t.co/oEqqfKhz0y", "Rising Seas Are Claiming California's Famed Coast Faster Than Scientists Imagined | https://t.co/wLm979HqVQ #SFSeawall #ClimateChange", "A photo exhibit at our Pier 1 offices will present the experience of the Bay taken by @BGFleet blue-collar workers - https://t.co/NzYq2j8MEG", "@SF311 @shitinthecity Thank you.", "FYI: We anticipate that #MayDay2017 marches combined with a cruise ship at Pier 27 will create heavy traffic and delays on The Embarcadero.", "The Port has issued an RFP for planning, engineering &amp; environmental services for the Seawall Resiliency Project - https://t.co/60oxnsGQde", "We're pleased to welcome local Louisiana eatery Queen's Louisiana Po'boy Cafe to the Embarcadero this summer! | https://t.co/zxzdpLL1IK", "Congratulations to @FogHarbor for making top 5 most popular restaurant in San Francisco - Business Insider | https://t.co/NsjJH2P76W #PIER39", "Ocean might swallow California sooner than you think - Yet another reason why we're fortifying the #SFSeawall | https://t.co/9Mx0N7vDiX", "This week is the last week to apply for the Greenagers Program for the 2017-2018 Season |@recparksf - https://t.co/sE5aAAdyd5", "@shitinthecity @SF311 Noted. Thanks", "No injuries were reported -- Threatening Art Project, Fire Breaks Out At Bayview Gateway | Hoodline https://t.co/B8yPU0yNoz", "RT @mayoredlee: Mayor Lee reaction to preliminary injunction on #sanctuarycity funding https://t.co/234bWqCOxH", "@shitinthecity @SF311 Noted. Thank you.", "Why You Should Explore San Francisco's Buzzing Waterfront | WhereTraveler https://t.co/0YvGijX4M0", "RT @mayoredlee: At our emergency ops center, working with city departments to deliver services. #poweroutage https://t.co/nPMvvvhe1u", "RT @KQEDnews: Here is the official list of neighborhoods affected by the #poweroutage in San Francisco. https://t.co/aWapzZOFPh", "RT @SFBART: *beep beep!*\n\nWe are back open at Montgomery station! Normal service has resumed through DTSF. Thank you for your patience.", "Certain portions of PIER 39 have been impacted by the power outage, but some are still open for business! https://t.co/Loa3CB7px3", "FYI: Power outage hits downtown S.F., Union Square - San Francisco Business Times https://t.co/dQ1OcLaljI", "Happy Anniversary! We are happy to have you here on the waterfront! https://t.co/3aiFBcXHrd", "Join Heron's Head Park to celebrate #EarthDay2017 and the 7th anniversary of the EcoCenter this weekend -- https://t.co/MTw0XKPO2U", "The resurrection after 1906: Rare, private photos of SF clawing back after quake | SFGate - https://t.co/gO2axXLHj6", "Po-Boys, anyone? Queen's Louisiana Po-Boy Cafe will be opening on the waterfront this summer! | Cruise News https://t.co/t5f1dilx7U", "Celebrate scientific knowledge and discovery at the March For Science event at Justin Herman Plaza - https://t.co/b4cuXhhoYQ @SFEnvironment", "FYI: Sausalito ferry service cancelled due to emergency repairs | https://t.co/i0r7ubwvEd https://t.co/1iSlVXvNTU", "Get your goat on at this year's #Goatchella which returns to San Francisco this Saturday -- https://t.co/rh3GhSc2CD #CUESA #FerryBuilding", "Check out these two proposed waterfront developments that are aggressively planning for rising sea levels. https://t.co/kpMyJZrwyB", "Excited to see @DevotoOrchards featured in @SFPort this month. Tasty cider and delish apples! https://t.co/RvExxZg7vE", "Meet the Beatboxing Street Performer Who Invented His Own Bagpipes --https://t.co/AEXJ4tg6RV", "Heading to an #SFGiants game? Trying to avoid driving or BART-ing? Take a ferry instead! - https://t.co/4xlcs7qg55", "Supportive housing proposed for homeless residents on Mission Bay lot  - The San Francisco Examiner: https://t.co/zRBKbbxttf", "Did you see the @sowsf feature about the @Ferry_Building Farmer's Market? See the juicy details here: https://t.co/IFilUZOZMy", "Stay in the know about what's going on along the San Francisco waterfront by joining the Port's official email list: https://t.co/KvGtwKAQfd", "Come enjoy #SundayStreets in the Bayview &amp; Dogpatch neighborhoods on Sunday. FREE activities and family fun awaits! https://t.co/SKclK4CYI1", "Leaking Barge Capsizes in San Francisco Bay, Cleanup Underway | Hoodline https://t.co/8GBah6WuGk", "RT @kurtisalexander: Just in: Gov. Jerry Brown declares official end to California drought. #Finally", "Did you see the @RanchoGordo feature about the @SFFerryBuilding Farmer's Market? We spill the beans here: https://t.co/ajLzCX8X7F", "BART Riders: Rebuilding work to impact Warm Springs, Dublin, OAK Airport lines some weekends April - July: https://t.co/sL4dWYq9Yo", "RT @annacolibri: One of our favorite markets! https://t.co/kojxAyYuCO", "RT @sfpublicworks: Everyone's celebrating #Walk2Work Day - making our streets &amp; sidewalks safer for all https://t.co/oJhROnzsBU", "Today's Walk to Work Day! Get your FREE \"I Walk SF\" goodies &amp; snacks at the event hub at Embarcadero &amp; Folsom St: https://t.co/GfOx6csgsb", "The warm weather was nice while it lasted ---- Heavy Rains, Intense Wind Returning To SF This Week | Hoodline https://t.co/LyLMVIuEVF", "Coming Soon: New Restaurants at the Port - https://t.co/OZPuvRmN4r #DigitalMagazine", "Explore how the rise of container shipping has transformed the Bay Area economy and shaped cities around the world. https://t.co/A1SElHpzB1", "Join Heron's Head Park to celebrate #EarthDay2017 and the 7th anniversary of the EcoCenter on April 22nd! |https://t.co/MTw0XKPO2U", "Today is #SourdoughBreadDay! Since San Francisco sourdough is the best in the nation, why not celebrate by making a stop at @boudinbakery?", "This month, @MayorEdLee recognized women leaders in the #SF who are dedicated to moving our City forward. #LEEdership #WomensHistoryMonth", "Did you know: The #Pier27 cruise terminal has a roof drain that collects rain to flush toilets &amp; water landscape! https://t.co/7pHmqsxpOK", "Immigrant art show starts as chain letter - San Francisco Chronicle https://t.co/6IAeLYFDNt", "RT @SFBusinessTimes: Sale of waterfront gem breaks price records\nhttps://t.co/MlaRYcCYmg\n#SFBTrealdeals winner", "Celebrate all things goat at the Ferry Building on April 15th| BARTable https://t.co/vGMBePAJ9c", "RT @SFGovTV: Port Commission LIVE streamed on https://t.co/btMuESu1Dm at 2pm  @SFPort  https://t.co/ZH03F2cjh9", "Welcome, Mr. Martin! -- Michael Martin to Lead Port of San Francico's Real Estate - https://t.co/oiZM4JyREz", "Hi, @QueensPoboys! Check out your feature in @SFPort! Serving up some southern hospitality here: https://t.co/jdat2gB8S3 - Please RT!", "See author William Geroux talk about his book, Mathews Men: Seven Brothers and the War Against Hitler's U-Boats - https://t.co/5As4xDmUNj", "We love that Crane Cove Park will have a waterfront walk, dog run &amp; gardens! @Pier70sf check it out and please RT! https://t.co/MemWR9zywV", "@JaneKim @JBinSFO @sfmta_muni May be referring to the Horizon Spirit ship lay berthed at Pier 30/32. She's scheduled to depart in April", "And 400 passengers! https://t.co/Hjfa8XZks7", "Did you see the @CUESA feature? See why a visit to the location at @SFFerryBuilding should be on your grocery list! https://t.co/roSKd7qBWA", "Hydrus ferry unveiled at Pier 9 in San Francisco | https://t.co/i0r7ubwvEd https://t.co/TmvoN1NnjR", "The Port has named a new Deputy Director of Real Estate and Development| Port of San Francisco News - https://t.co/krB4mOoapJ", "Oldies but goodies! -- San Francisco aerial photos through the decades: How much has the city changed? - SFGate https://t.co/XoYksW51nE", "Celebrate Arbor Day this weekend at a family-fun event packed with hands-on urban environmental education! | https://t.co/uoTY2tCWii", "Tug boats are tiny but agile and strong, and can nudge and pull giant megaships in any direction needed! https://t.co/M1ImdsPG7O", "Beautiful! https://t.co/pJFAECBIns", "Bayview-Hunters Point Leads the Charge Against a Rising Tide of Pollution - SF Weekly | https://t.co/QKV0nJknSW", "Sign up to exhibit at the Fisherman's Wharf Hospitality Trade Show taking place April 20th -- https://t.co/CfmaixJke5", "What a ship! Celebrity Unveils Edge-Class Ships - Cruise Industry News | Cruise News https://t.co/nLdOdcAFUG", "Happy #PiDay! Did you Know: The first Pi Day celebration took place at the @exploratorium &amp; featured a circular parade &amp; lots of fruit pies!", "We're expecting beautiful waterfront weather all week long! https://t.co/Y4gjh71Pdz", "Join Heron's Head Park to celebrate #EarthDay2017 and the 7th anniversary of the EcoCenter on April 22nd! |https://t.co/MTw0XKPO2U", "New, exciting waterfront developments are in the works. One of these is Crane Cove Park: https://t.co/zUw1XyRgZD #DigiMag #SFPort", "The Port is advertising an RFP for PR, communications &amp; media relations related to the Seawall Resiliency Project | https://t.co/myKLIBEmmA", "@_The_Atlas Thank you!", "A major earthquake on the waterfront could be devastating. It's time to update the #SFSeawall infrastructure| https://t.co/smI46LTum9", "Karl makes his triumphant return! https://t.co/P9hcnTc6k9", "The Port invites proposals (RFQ) for as-needed PR, communications, media services, &amp; related professional services | https://t.co/017ZrtOjkg", "Happy #internationalwomensday We are glad to have one of only eight women Port directors in the United States leading our agency!", "FYI: Tomorrow is a \"Day Without a Woman\" and protests are expected to begin at Justin Herman Plaza at noon.  Expect traffic impacts.", "RT @AquariumOTheBay: We've been nominated by @USATODAY @10Best as a contender for best #aquarium. Vote for us here: https://t.co/ka6vCM9RJS", "Join the fun at Warm Water Cove at this year's @sfpublicworks Arbor Day Eco Fair taking place Sat, Mar 18th | https://t.co/4aSSXnslUt", "Interesting stuff! -- Data Visualization Reveals the Frantic Life of San Francisco's Ship-Packed Bay | WIRED https://t.co/geXHbIaXGm", "Golden Gate ferry service begins Tiburon-San Francisco route | https://t.co/i0r7ubwvEd https://t.co/vAT0WnsLoy", "@Fishermanswharf businesses have launched an initiative to focus on environmentally friendly business practices -   https://t.co/xi0KHNxF1p", "More commute options! -- Berkeley-San Francisco ferry service begins: https://t.co/P14hmb6ZQM", "@pinocchiometer The Horizon would simply take over if one of Pasha's ships were to break down. Most of the containers are empty.", "RT @SFGovTV: Port Commission LIVE streamed on https://t.co/btMuESu1Dm at 3pm @SFPort  https://t.co/vsqWtJVqn5", "@SFsomaGirl Pasha is a worldwide shipping company. They have a facility at Pier 80. Reserve just means alternate.", "The Port is hiring a Deputy Director, Chief Harbor Engineer. Recruitment closes March 3rd -- https://t.co/F38SL650qY", "RT @SFMaritimeNPS: Notice: Some Hyde Street Pier historic vessels will be closed for maintenance until 1PM.", "Sick of all the rain? Sunny skies are ahead! https://t.co/7ISKWgi0wA", "FYI https://t.co/PyzI8mloJh", "RT @femaregion9: Be prepared! Download the FEMA mobile app for shelter information, weather alerts, &amp; safety tips. #FEMA #CalOES", "Did you know: PIER39 hosts an outdoor movie night every last Fri of the month? https://t.co/0XjlPoATrd", "Have you spotted a bottlenose in the Bay?? -- Warmer waters have more bottlenose dolphins turning up in SF Bay: https://t.co/3WRWFMWU3V", "FYI --- Coast Guard to issue debris warning for San Francisco Bay | https://t.co/i0r7ubwvEd https://t.co/EviSJBYQ95", "In case you're wondering why the Bay has turned murky -- San Francisco Bay turns brown after nonstop storms: https://t.co/jui8QJxRj5", "RT @SFGovTV: Port Commission LIVE streamed on https://t.co/btMuESu1Dm at 3pm @SFPort  https://t.co/uMPbAvxnxS", "This is exciting! --- Red and White Fleet orders Li-Ion hybrid vessel at AAM. Shared via Marine Log - https://t.co/1USaxq6cu6", "FYI: Terry Francois Blvd between 3rd St and South St will be closed beginning tomorrow at 8am for Giants Fan Fest and New Years Parade.", "Sip wine, peruse the marketplace &amp; watch dancers do the tango at the Food from the Heart event at @SFFerryBuilding https://t.co/ClG5bypfY8", "Update: Northbound Embarcadero is now open.", "Go back in time and spend the night aboard the historic World War II submarine USS Pampanito (SS-383) -- https://t.co/1a9nKOVWZT", "FYI https://t.co/iaKnT4yDV0", "Get autographs from Giants players, snap a pic with World Series Trophies and walk the field at Saturday's Fan Fest! https://t.co/uY3nXL53io", "The Greenagers Program, which offers teens a chance to improve green spaces, is accepting applicants for 2017-2018 - https://t.co/XNb1GfiDit", "FYI https://t.co/BDjWrR1wGE", "Tickets go on sale today for the Int'l Ocean Film Festival. Don't miss these inspiring ocean-related films! https://t.co/EK3ba6JJgW", "SF SPCA holding adoption pop-up at Embarcadero Center through February - SFGate https://t.co/KiHBWFrkN3", "On Oct 12, 1985, the #USSEnterprise led the @FleetWeekSF parade of 14 ships -- USS Enterprise to be Decommissioned - https://t.co/mFyNNeEIMv", "RT @SandhyaABC7: High clouds providing a \"milky sky\" tonight.  Count on a colorful #sunset at 5:32pm! https://t.co/fjQPj2C8ce", "Tideline, The Chariot Of Ferries, Launches Commuter Service Between SF, Berkeley, and Richmond: SFist https://t.co/ayA2d0tqNP", "She's ready to tackle historic pier restoration and social justice! Learn more about the Port's new director -- https://t.co/NnUZQGMqIJ", "FYI: The Critical Mass bicycle ride will begin at Justin Herman Plaza today at 6pm. Expect traffic impacts | SFMTA https://t.co/NHGfSf6Jxz", "Thank you! And we are happy to support! https://t.co/avkfwm7vlE", "Looking forward to restoring and preserving the historic piers! -- Happier landings ahead for Alcatraz ferry - https://t.co/sX8rGhzUgW", "Herring Season is now open! This first catch was unloaded by Two by Sea at #Pier45. Photo by Kenny Belov. https://t.co/xCp8vfsxaG", "Because ship views never get old! Photo by Jean Marc Sorhondo. #SFport #cruiseship https://t.co/rMDb5XKcF8", "Join #SPUR, the Port and Arcadis for a discussion on what can be done to adapt Mission Creek to #SeaLevelRise - https://t.co/L1tFCBB8aP", "National Park Service Releases Final Environmental Impact Statement for Alcatraz Ferry Embarkation - https://t.co/8oszHTcOmI", "This year's San Francisco Beer Week festivities kick off with the opening gala on Feb 10th at #Pier48 - https://t.co/oj3zudT5zR", "For 39th Anniversary, Pier 39 Holds 39 Weeks Of Celebratory Events: SFist https://t.co/aqgVbC0Hmh", "Spotted: Rainbow Brings Moment Of Zen To Waterfront | Hoodline https://t.co/0sRcDednz2", "RT @sfmta_muni: UPDATE: IB/OB #FMarket riders should use #subwaysvc to and from the Embarcadero.", "FYI: A demonstration is planned to take place tomorrow morning at Justin Herman Plaza. Expect crowds &amp; potential traffic/transit impacts.", "Got #KingTides pics? Upload them here! https://t.co/GEnqd8XPbC", "Check out this lecture series on how #ClimateChange and #SeaLevelRise are expected to impact the California Coast - https://t.co/2yybjZb97A", "RT @PortholeCruise: Wish more #cruise #ships called on @SFPort! #SanFrancisco #travel #california https://t.co/snAkLc579t", "RT @kristallakis: Whoa. Glad @sfport is fortifying our seawall. https://t.co/QWwH7tzXKg #climatechange", "Happening on Monday: Transit agencies offering free rides to King Day event in SF - SFGate https://t.co/lOkDvsdnfI", "Check out this insider guide to exploring the science and human percentiption inside the Exploratorium at #Pier15 - https://t.co/x4eep1oYzq", "@joen7xxx Duly noted. Thanks!", "Cities around the Bay are making plans for a wetter future.  In SF, the 1st step is to fortify the #SFSeawall: https://t.co/6r7XBZ11pc", "Pier 39 is turning 39 and celebrating with a series of Friday-fun-to-do activities. Stop by any Fri from Jan to Oct https://t.co/qkR3VRFKjw", "Some slo motion video shots of #KingTides creeping through the Embarcadero roadway! https://t.co/xsAe7YNOLH", "FYI: The northbound east lane of the Embarcadero is now closed due to #KingTides flooding. #SFwaterfront #SFembarcadero", "RT @civicjobsf: Paid internship at @SFPort for engineers and designers! https://t.co/OufOV7K5FR", "The #SFSeawall was built 100 years ago and needs major improvements to withstand flood risk from #SeaLevelRise: https://t.co/6r7XBZ11pc", "#KingTides offer a glimpse of what our daily tides may look like in the future as a result of #SeaLevelRise: https://t.co/NwcLfFGzfM", "@DogpatchStFest Of course!", "FYI: The Embarcadero northbound east lane between Mission and Howard streets is closed to traffic due to flooding and King Tides.", "Help @CA_king_tides collect images to visualize how #SeaLevelRise will impact our lives in the future: https://t.co/WpeEty3GkI #KingTides", "Fight poverty and empower underserved communities through street soccer! Games happening daily at @TheYardSF   - https://t.co/niSaCqKilL", "RT @SFGovTV: Port Commission LIVE streamed on https://t.co/btMuESu1Dm at 2pm  https://t.co/rcMF98H4vk \n@SFPort", "RT @SF_emergency: Right lane of Northbound Embarcadero is closed between Howard &amp; Mission due to flooding. #SF #CAStorm #CAFlood @SFPort", "Good news! -- West Coast crabbers reach deal to end strike - SFGate https://t.co/3nEtDcQI4q", "King Tides are returning to the waterfront this week! https://t.co/atGyapdFIo", "RT @SF_emergency: UPDATE: All lanes of the Embarcadero open since 11am.", "Butterfly to close after 15 years on the Embarcadero - Inside Scoop SF https://t.co/QKHWz6mpuh", "Celebrate diversity in technology at Innovation &amp; Equity 17: 50 Most Important African-Americans in Technology. https://t.co/bCc6nCaiDP", "RT @SFBayDavid: Warmer #SFBay waters lead to increased bottlenose dolphin sightings.\nhttps://t.co/DK4jUajTSt https://t.co/gdgJpoZsjj", "The Port would like to wish you a wonderful and prosperous New Year! #NewYears2017 #HappyNewYear https://t.co/bf3AxmQWJa", "Heading To SF Embarcadero For New Year's Eve Fireworks? Get Transit Details Here -- https://t.co/brMxLckr71", "FYI -- New Year's Weekend: Free NYE Muni service and Fare Changes | SFMTA https://t.co/aoV6anQikb", "Draft EIR for Pier 70 development concerns noise, transit impacts - The San Francisco Examiner https://t.co/jRL7dNQXSm", "@Desi33 @SFFerryBuilding Hello. We don't expect that project to be completed for several years.", "Ever ridden a ferry? It's actually a very pleasant experience! -- SF Bay ferries riding tidal wave of popularity: https://t.co/0FjWaPUFA8", "RT @SFist: Bay Area temperatures expected to drop to the 20s for New Year's Eve: https://t.co/XhBfH6pks5 https://t.co/3jNznHpthj", "The NYE Fireworks Show returns to the #SFwaterfront on Dec 31st. Check out these tips to enjoying the show - https://t.co/bgakIA9A1p", "Floating pier considered as site for key Embarcadero fire station - San Francisco Chronicle - https://t.co/yZVRbW1HPK", "Guess who made the list? The Waterfront Fireworks show came in at No.8 -- Best New Years Eve Celebration in the U.S. https://t.co/Vi3QMSY0an", "The Port would like to wish you a very Merry Christmas! #Christmas2016 https://t.co/ZGUL6D2y7I", "Check out how you can be a part of the conversation for land use and design policies on the #SFwaterfront: https://t.co/uKRZzPlPB3", "Beginning in January, @PIER39 will celebrate 39 years on the Waterfront! -- https://t.co/hRhyBBlrnS", "RT @SFFerryBuilding: FYI: The building will be closed on Sunday December 25 in observance of the Christmas holiday.", "The Port was featured in the Pacific Maritime December Regional Report thanks to the revival of Pier 80! https://t.co/6iRV0mOoqn", "RT @511SFBay: Update: SF Bay Ferry 5:30 pm Ferry Bldg. Departure to Vallejo Will Have Regular Service.https://t.co/ITRwoLsl4h", "Help the City's homeless this month by donating a new or gently-used jacket for the Project Homeless Connect Drive - https://t.co/NUBQfP7VI4", "RT @erby: @alevin You should check out @SFPort's eco-industrial strategy for SF's southern waterfront: https://t.co/vAoEnWV9ZW", "Climate change is happening now -- discover how extreme weather and rising seas can impact your health - https://t.co/y2bUP0MAyf @SF_DPH", "RT @SFTIDA: Reminder: call @SF311 to report downed tree limbs, clogged storm drains on-island and 911 to report downed power lines.", "FYI: We are expecting a strong storm and more #kingtides tomorrow. Strong possibility of flooding in the City. #PlanAhead", "Still haven't picked up your holiday tree? Before you opt for artificial or farmed, consider which is \"greenest\" - https://t.co/imMiM2U1Zs", "The Port has issued an Invitation for Bids for roof repair at Pier 23 - https://t.co/xPuwvkgT65", "The Project Manager II position for the #MissionBay Ferry Landing Project is still open - https://t.co/sXxIgO4Okb #AnchorYourCareer", "RT @sffdpio: COASTAL FLOOD STATEMENT https://t.co/5Wn3Y2wG0M", "#KingTides happening now on our waterfront! Now is the time to protect our coastal communities: https://t.co/pjEcuQNiXN #SFSeawall", "Heavy rain with King Tides has created a major flood risk. Explore health vulnerability to flooding - https://t.co/IdWlhfqmZf @SF_DPH", "RT @sfgov: #mondaymotivation https://t.co/Owzq6ta8E1", "Share your #KingTides photos to the @CA_king_tides Flickr Group Pool to help with future planning and awareness - https://t.co/TEBAKK2iNG", "@AdamNMayer @YouTube Thank you for sharing!", "This holiday season, give the gift of participation by getting involved in the future of your #SFwaterfront - https://t.co/19vgVNFCsa", "The Port is seeking an electrical engineering intern to provide assistance to our utilities section - https://t.co/cnW4A7FytS #SFPort", "We will be experiencing #KingTides next week on Dec 13-14. Stay dry and plan accordingly. @SFFerryBuilding  @SF_Embarcadero @exploratorium", "FYI: King Tides return next week. Expect extra high water &amp; an increased chance of flooding along the #SF waterfront https://t.co/CUXjoQGTQ3", "Doing some holiday shopping? Check out Ferry Building Gifts Under $10 - Ferry Building Marketplace https://t.co/MVYwBpOlHK", "RT @DailySanFran: Bay Area Events Mark 75th Anniversary Of Pearl Harbor Attack https://t.co/wXr556z0Fk https://t.co/7VxoN15ZjE", "RT @JaneGabs: Day 6: \"Portly\" Santa.  #santacember @ The Port of San Francisco https://t.co/edLORu9NPT", "@heqian So sorry. Thank you for sharing.", "Five things to know about the 2016 Dungeness crab season - San Francisco Chronicle https://t.co/8Q7lp7lKu5", "RT @SFFerryBuilding: @SFPort Thank you! And thanks for all the support over the years! We literally could not do it without you:)", "Blue &amp; Gold Fleet boss reflects on 40 years in boat biz - San Francisco Chronicle https://t.co/8amtkKcajT", "More good news! -- More of Northern California coast opens to commercial crab fishing - San Francisco Chronicle https://t.co/sObdqx8OtT", "RT @Work4SF: The Port of San Francisco is hiring an IT Operations Support Admin.  Apply today! #jobs #careers \nhttps://t.co/L1JjKPfxqc", "The Port is seeking a highly qualified, dynamic professional for the position of Deputy Director of Real Estate - https://t.co/ynsZqW2GNS", "Find out how an abandoned pier development became a beautiful, thriving ecosystem - https://t.co/OXn68vCyDx #WetlandsRestoration", "Go Do This Thing: Check Out The Most Dazzling Art Works Of The Festival Of Light: SFist https://t.co/C3SrlA5KtS", "RT @BayNatives: Rainbow over the port of San Francisco, outside our side gate. Rain means planting season. https://t.co/J2CFbXXGP7", "Congratulations to @playerssf at PIER 39 -- 50 Best Sports Bars in America's Best Sports Towns: https://t.co/hl6Trxrb5l", "The Port is seeking bids to furnish and install new lighting fixtures and new rate tenant metering at Pier 19 - https://t.co/ezgnFsTl7A", "They especially enjoy Sue Bierman park! -- Where Did the Wild Parrots of San Francisco Come From? Via KQED News: https://t.co/lg7NDrY3sW", "RT @CamCamPhotos: @SFPort Hello San Francisco, thought you would like this one. https://t.co/vx5R1bVZtS", "The Port would like to wish you a wonderful Thanksgiving holiday! #TurkeyDay https://t.co/LxW0Kquzk4", "The Port is seeking a Deputy Director of Finance &amp;  Administration (CFO) to oversee admin and business functions -- https://t.co/4PcPxSPQzz", "The Port is hiring a Project Manager to oversee the new Mission Bay Ferry Landing Project -- https://t.co/o7jg8FbidJ #AnchorYourCareer", "SF Port, wildlife advocates take aim at alleviating suffering of pelicans - Story | KTVU https://t.co/u629PuDHJr", "Dreaming of a Green Christmas: Instead of cutting down a conifer this holiday season, adopt a SF street tree! https://t.co/ZzbY8g7rJ3", "Where To Eat Some Delicious Dungeness Crab As Crab Season Officially Kicks Off: SFist https://t.co/goUNFQWjeq", "@stirlingspencer Noted. Thank you!", "@stirlingspencer @stirlingspencer Hello. Can you please send location details? Thanks!", "RT @AaronPeskin: Thank YOU @SFPort for leading on environmental reforms &amp; listening to residents' ideas. https://t.co/kzn3scugcQ", "RT @JuanCarlosABC7: They are here! Crab fishermen unload first catch of the season at SF's Fisherman's Wharf. https://t.co/q2gXfx03fk", "RT @SFFerryRiders: Golden Gate Bus &amp; Ferry services for 2016 Thanksgiving weekend  https://t.co/6jIH4avGiH #NorthBayTransit", "@TidelineSF is now offering water taxi service from Richmond to SF. Will run M-F between Marina Bay and Pier 1.5 https://t.co/3kKeTOUYh2", "Commercial crab season begins at midnight! https://t.co/RliRAg9EUV", "Did you make it to Sunday Streets on the Embarcadero? -- Until Next Year, Sunday Streets. https://t.co/gMJw3AtlWB #Embarcadero1113", "Protests happening on the Embarcadero. Traffic is heavily impacted.", "The Port is hiring a Maritime Market Specialist to research and analyzes maritime industry data - https://t.co/3xVQTSLyXF #AnchorYourCareer", "Come out to the Sunday Streets neighborhood celebration happening on the Embarcadero this weekend - https://t.co/XbXnIlDCyE", "Kick-off the Holiday Season at the 4th Annual SF Etsy Indie Holiday Emporium happening Nov 26-27 at Pier 70  - https://t.co/7yDSaUTIWZ", "Adopt a drain, give it a name and help our sewer system by clearing it before it rains! #adoptadrain #drainhero - https://t.co/Z6nfAX1Gxk", "Did you know: There are between 30 to 60 ships buried under San Francisco? Next question: Why? -- https://t.co/OhAaDaxO4y", "Happening this Thursday: Pier 70 update to make a splash at Planning Commission meeting  - San Francisco Examiner -- https://t.co/ifr8MbZbBk", "Celebrate and enjoy everything from green energy systems to organic food at the Green Festival Expo at Pier 35 -- https://t.co/Fu9CSsg5Tr", "RT @SF72org: Tmw is #TsunamiDay2016. Learn more about #CA tsunamis, and how you can prepare: https://t.co/skEfjiBz0F https://t.co/b8b2b9J9dJ", "RT @sffdpio: The newest SFFD fireboat was recently featured in the @SFPort\ndigital newsletter. Meet the St. Francis https://t.co/Vj2J8XPUKh", "Let The Holidays Begin! The Embarcadero Center Ice Rink is open for the holiday season. Opens every day at 10am -  https://t.co/sItcgknSZP", "The Embarcadero literally translates to \"place to embark\" in Spanish -- \"En route to Embarcadero\" https://t.co/Fm1WZFLuoq", "This is exciting! https://t.co/lmOEzkEzbM", "RT @Work4SF: The Port of San Francisco is hiring an Administrative Analyst. Apply today! #Work4SF #jobs #careers\n\nhttps://t.co/ZgkoVldxNZ", "Sea level rise has left the Embarcadero vulnerable to flooding. Explore the worldwide impact in #BeforeTheFlood - https://t.co/6QDzAy2nHu", "Curious about the planned developments for Pier 70? Join Forest City for an update and community tour -- https://t.co/gybSYjIYIi", "Explore the topic of climate change and sea level rise in the @NatGeo documentary #BeforetheFlood on Oct 30th - https://t.co/fcQob8mJIB", "Join in on Art Night SF's Grand Finale and Halloween celebration tomorrow for a memorable night under the stars - https://t.co/2LCXRLccrh", "Listen to Port staff and others share strategies for resiliency of historic resources at a forum hosted by @CPF_SF https://t.co/99hBJhBlZN", "The Port has an opening for a Maritime Market Specialist with an emphasis on research and metrics: https://t.co/5dqB8NjfFJ", "State officials optimistic for crab season, Coast Guard to begin safety inspections | https://t.co/4w5Ss4qaHQ https://t.co/EZuHr74jgQ", "The October 2016 edition of the Port digital interactive magazine is now live! https://t.co/0jxFYxeXuP https://t.co/DnRih86I9E", "The Port has a job opening for a Principal Administrative Analyst to work with the Seawall Project Team - https://t.co/2zqeKiuJwQ", "10 restaurants in Saturday's #WharfFest Chowder Competition @TheWharfSF. Buy $12 tickets now with code CHOWDER16 at https://t.co/wZXF78DSG8", "These guys jumped into action right away! -- \"Mayor Lee honors rescuers who saved lives when boat capsized\" - https://t.co/ldNfvmMJyW", "#GreatShakeOut happening now!", "#WharfFest street fair is back this Saturday @TheWharfSF! Buy chowder tickets for $12 with code CHOWDER16 at https://t.co/wZXF78DSG8", "@shitinthecity Hello. Please report encampments to @SF311 to have the matter referred to the proper channels.", "SF welcomes new fireboat to fleet on anniversary of Loma Prieta - SFGate https://t.co/XVcjl2eZh3", "Today marks 27th anniversary of Loma Prieta earthquake | https://t.co/i0r7ubwvEd https://t.co/tbHSOmL6hw", "The Port is hiring a Piledriver Supervisor to direct, inspect and supervise the work of the pile worker crew - https://t.co/nHvM9S1Neh", "RT @KarlTheFog: It's the perfect morning to crawl back into bed and sleep until tomorrow", "On 10/22, Wharf Fest returns to the iconic waterfront neighborhoood for the 4th year in a row. Chowder, anyone? - https://t.co/oh6TMsP7qw", "The Port is thrilled to announce Elaine Forbes as our new Executive Director! Learn more about her on our webpage: https://t.co/nVaebclB0g", "Experience the rhythms of shipboard songs aboard the Balclutha during the 28th Annual Sea Music Concert Series - https://t.co/EEm1L8msbO", "RT @SFGiants: Ready for Game 4? We are. \n\n#BeliEVEN | #NLDS | #SFGiants https://t.co/Kuxk8KHvZB", "RT @SFGovTV: Port Commission LIVE on https://t.co/btMuESu1Dm at 3:15pm @SFPort   https://t.co/i7DFBfND14", "Nieuw Amsterdam Makes Maiden Call Ceremony in San Francisco - Cruise Industry News | Cruise News https://t.co/cu1iXpm20i", "RT @EllaSogomonian: Anyone coming out to the viewing party tonight? #cubsvsgiants https://t.co/x7z6XdN4gO", "The 1950 Blue Angels flew over S.F., into history - San Francisco Chronicle https://t.co/uEuujbKom9", "Wow! https://t.co/eMKH9tYSwP", "RT @SFFerryRiders: SF Bay Ferry will operate special expanded schedules over Fleet Week weekend, October 8 and 9. https://t.co/9GP98VdagH.", "@SavingPlaces has put the Embarcadero on a list of America's top 11 most endangered historic places  - https://t.co/a8yy5klCpf", "Tour the Freedom Trail during #FleetWeekSF and learn the history behind prominent 19th century black sea captains - https://t.co/1LEys6bnXf", "The Port has new job opening for 2 Development Project Coordinators to manage real estate projects for the Port - https://t.co/i94jDMsut3", "RT @SFCityCIO: #FleetWeekSF is here! #USSSanDiego #WeAreFleetWeek https://t.co/xHiHqcHByj", "Headed to #FleetWeekSF next week? Check out this guideline to prohibited items, scheduling and ship tour conduct - https://t.co/4kjr06ol8S", "FYI -- Traffic Alert: Street Closures For Bridge To Bridge Race, Dreamforce Collide This Weekend | Hoodline https://t.co/r1vQnENSUu", "Parking along the Embarcadero? @SpotHero offers parking discounts for many different locations near the port! -- https://t.co/iI08M7Afjp", "Check out scenes from this weekend's SF Fire Department 150th Anniversary Grand Parade at Fisherman's Wharf -  https://t.co/IyE5Kl7y4C", "@planetcinerama Are you in need of street parking? When is the event?", "Weather Alert: Heat Advisory Issued For Sunday, Monday | Hoodline https://t.co/jO37M2s1lV", "Celebrate 150 years of firefighting at the SFFD Parade and Historical Exhibition this weekend at @TheWharfSF - https://t.co/ZsAw8zKC2p", "RT @FleetWeekSF: Getting closer! #WeAreFleetWeek https://t.co/kgy16wfpNm", "Join swissnes SF to celebrate the grand opening of Switzerland's new interdisciplinary hub at Pier 17 - https://t.co/nMdjc4aa5u", "In honor of #FleetWeekSF, why not Buy a Burger for a Sailor? All proceeds support Fleet Week's annual programs - https://t.co/lhrFzUcTFQ", "Beautiful! https://t.co/89dJ7p6la1", "How interesting! -- A Brief History Of How San Francisco Ended Up With Electric Trolly Buses: SFist https://t.co/wrKckaUtzW", "Pier 94 and several other sites still need volunteers to assist with tomorrow's California Coastal Cleanup Day  - https://t.co/BXrOWmX2R9", "@CruiseCritic has named San Francisco the Best U.S. &amp; Canada Cruise Destination out of 5 top contenders! - https://t.co/DEE9RMORq2 #Hooray", "The 2016 San Francisco Fleet Week ship lineup is in! #WeAreFleetWeek #FleetWeekSF #SFwaterfront #FleetWeekCountdown https://t.co/AKNdKD8sfF", "The Port is hiring a Special Events Coordinator to handle the scheduling of special events on Port property - https://t.co/Poyt9MOykL", "Congratulations to   @TheWharfSF for being honored with a 2016\nExperts' Choice Award from TripExpert! --  https://t.co/rs9yi4zzZs", "Get your tickets for this year's Fleet Week Air Show on the Marina Green. #FleetWeekSF #WeAreFleetWeek #BlueAngels https://t.co/Wh5rwqwJph", "Get involved in the Port's process to update the long-term plan for San Francisco's waterfront -- https://t.co/tZhGKi6PuU #WLUP", "Go behind-the-scenes during this docent led tour of the WWII submarine USS Pampanito at Pier 45 - https://t.co/rn0c43FLWb", "Volunteer opportunities exist for individuals intersted in donating their time for this year's #FleetWeekSF -- https://t.co/lcC9n78gb5", "Join the SF Maritime Park Association for a panel discussion exploring the history of the Aquatic Park Bathhouse - https://t.co/p1wo4wQQxO", "This Dogpatch site will become a 250-space surface parking lot to help accomodate Warriors' Arena parking -- https://t.co/ufxrqLB1tP", "RT @HotelVitale: We can't wait for sunny September days in San Francisco. https://t.co/UAM6cE7ZW2", "Hear what developers, City Officials and the Port Director have to say about the future of waterfront redevelopment! https://t.co/rU6H0Tc0hb", "Celebrate #CoastalCleanupDay w/ Aquarium of the Bay at Aquatic Park on 9/17 -- https://t.co/EeTjpRksJy", "Join the celebration to remember local community leader June Osterberg at Barbary Coast Restaurant on Sept 6th -- https://t.co/FZM5P6xicy", "RT @NatlParkService: They belong to you. Join us in celebrating them! #NPS100 #FindYourPark\nhttps://t.co/wNTTQ8gPmT", "RT @SF_Embarcadero: @FleetWeekSF See what a great host I am! https://t.co/yja6GqknVK", "@FleetWeekSF @SF_Embarcadero We try :) Thank you for the introduction!", "Port of San Francisco Welcomes Pasha Automotive Services to Pier 80 -- MV Jean Anne Makes Inaugural Ship Call: https://t.co/OsQX4hVMs7", "And thank you! https://t.co/M0pyeI95b6", "RT @david_landis: Car shipments soon to come through (client) Port of San Francisco @SFPort via @ByTomLee: https://t.co/VTeGMxtmtA", "Update: Designs for Contentious Affordable Development Have Been Drawn https://t.co/TRnhxi1OgW", "@esatmitdotedu No, not on our end. We have since discovered that it is an issue that must be handled by SF DPW.", "Discover the rich history of the San Francisco waterfront on this Historic Waterfront Walking Tour: https://t.co/oGn9pybbht", "Navy ship ceremony salutes Milk - San Francisco Chronicle, 2016-08-17 https://t.co/HJ9BzzYqEd", "RT @CBSSF: #BREAKING #SFPD finds a bag of bones at Pier 14 this morning. Medical Examiner will determine whether or not they are human.", "RT @sfexaminer: .@SFPort may locate hydrogen fueling station at Pier 54 https://t.co/HF06pUYNt2 https://t.co/nLqT6TO7uV", "The Port has an opening for a Public Service Aide (intern) who will help manage the Street Performer Program - https://t.co/NOi3VGuEpW", "RT @HotelVitale: Fridays are full of possibility. https://t.co/8bf6qS4DjY", "#BART weekend closure coming this weekend -- August 13th and 14th! https://t.co/waPuhehQV5", "The Port is seeking qualified teams to design the new Mission Bay Ferry Landing. Pre-submittal mtg on 8/15 at 2pm: https://t.co/RChj44jjIf", "The party will include a mezcal tasting arena, art and live music -- \"Lucha libre taco party to take over Pier 70:\" https://t.co/uYoddgoNic", "Take a tour of some of the most incredible shipwrecks ever discovered by watching this nifty film program: https://t.co/So6FQXwBJD #PIER39", "RT @SFGovTV: Port Commission LIVE streamed on https://t.co/btMuESu1Dm at 3:15pm @SFPort  https://t.co/pmNl0buQyv", "#FleetWeekSF returns to the waterfront on October 2nd. Set your calendars! --  https://t.co/HBOVCZ3mV2 #WeAreFleetWeek", "The Port has an opening for a Regulatory Specialist who to implement our Storm Water Management Program: https://t.co/UmXYPi5F58 #PortJobs", "SFFD to take ownership of new fireboat after delays - The San Francisco Examiner https://t.co/gzr6hOaOlD", "Join the SF Maritime Nat'l Historical Park for a full day of music, demonstrations, and fun along the SF waterfront: https://t.co/M7ag1gtNoh", "RT @HoodlineSF: RIP: June Osterberg, North Beach Reporter &amp; Community Fixture https://t.co/rdOiw96RT4 https://t.co/IUzoxZBZEh", "Pop-Up Aquarium to open shop on SF Embarcadero this week - SFGate https://t.co/XyS83HzcAM", "Who doesn't secretely love Fisherman's Wharf on #PIER39? -- The secret shames of San Franciscans - SFGate https://t.co/6AvHAmW3ps", "FYI: Weekend Traffic &amp; Transit Delays: SF Marathon, BART Closures, More | Hoodline https://t.co/p1TjZ4ojp3", "Pier 70 Putt Putt, A Pop-Up Mini Golf Course, Swings In To Dogpatch: SFist https://t.co/oDMaN27mA3", "The historic waterfront was full of Pokemon last night -- Crowds for PokeNight swelled to nearly 5000 people! https://t.co/9mcCWsFsXm", "@esatmitdotedu Thank you for pointing that out. We will notify our maintenance staff.", "1hr @SFBART delays between Millbrae/SF this weekend. Expect bus transfer. Consider alternative transit. Info: https://t.co/uwHX1QjxIG", "The Port is hiring a Regulatory Specialist to implement our Storm Water Management Program -- https://t.co/DlbSpeIzqY #AnchorYourCareer", "Join the SF Maritime National Park Association for their next Floating Film, \"All is Lost\" on July 28th! https://t.co/lEolakZwED", "We especially love the Bayview Rise mural! -- Lights in the sky: Inside San Francisco's illuminated art scene. https://t.co/Xpt4NFszpn", "Thanks to the great work of the Golden Gate Audubon Society! -- Lost plant returns to life at Pier 94: https://t.co/IQi85j29ns", "The 2016 series of #ArtNightSF kicks off this Friday, 5-9 p.m. in UN Plaza. There will be fun for all ages! https://t.co/E032YyCdZU", "Happening this weekend! -- San Francisco Symphony - Summer: Free Concert at the Waterfront -- https://t.co/tNnumhWb5Q #Pier27 #SFSymphony", "@bluedonkey That's interesting. Can you provide any additional details?", "Did you know: #Pier70 is now open for Putt Putt! The 60,000 sq. ft course has 18 indoor holes, a cafe and a bar - https://t.co/92Jye4XqEh", "Warriors win judgment in fight over SF Mission Bay arena - SFGate https://t.co/aJ7RyT8C4d", "The Port is excited to partner with Pasha Automotive to bring car shipping services and jobs to #Pier80. https://t.co/fY8ZyOHdcP", "The Port has new job openings available for July. Anchor your career by becoming a civil servant with the Port! https://t.co/rBzUYp4vRe", "Check out what the Port is doing to limit the effects of climate change and implement sustainable practices: https://t.co/piIw8OXaoH", "The FREE SF Symphony Concert returns to #Pier27 in ten days! #countdown #SFSymphony #SFwaterfront https://t.co/yvnMBWPY6p", "Tonight,  enjoy sea-faring cinema on the deck of an authentic 1886 Balclutha ship at Hyde St Pier! https://t.co/L59CZbbQ5N #FloatingFilms", "RT @pinkzebrasf: It's nice out, come down to ferry plaza and take a hit on some noodles @Namu @CUESA #ramencarbonara 10-2 today!", "Happy birthday to San Francisco's Ferry Building - SFGate https://t.co/cvcUCyOmN5", "This applies to any pokemon spotted along the waterfront! RT @SFPD \"#SFPD #PokemonGO Safety Tips:https://t.co/3K5RoDe30Z\"", "Join the Port in finding ways to improve the seawall as a FUSE Corps Fellow. The application period closes soon. https://t.co/Wui3nONnkl", "FYI https://t.co/WWKtBuQSbt", "RT @SFGovTV: Port Commission LIVE streamed on https://t.co/btMuESu1Dm at 2pm @SFPort  https://t.co/LtxECC4XkV", "Prepare for cuteness overload! - Strider Cup World Championship Races to Descend on San Francisco's Pier 35: https://t.co/61X3v9FGlh", "RT @erby: Highlights from the southern waterfront tour with @SFPort this morning. https://t.co/PrY0HvVttI", "FYI: Protests are planned in Justin Herman Plaza starting at 6pm today.", "Get to know your City &amp; County commissions! - City and County has More than 60 Commissions via The Potrero View: https://t.co/O1CByMHhke", "Happy #FourthofJuly2016 https://t.co/2qxNrw9eiV", "Yes, that's a possibility. But there are lots of other activities taking place there too! @Islarivas_ @KarlTheFog", "Looking for a place to watch the fireworks? The #PIER39 4th of July celebration is one of the best in the City! - https://t.co/QVRl9e0aFj", "Job announcement: The Port is hiring a Fusion Welder to repair and maintain various Port property structures - https://t.co/34VhPwW0TJ", "The latest edition of our digital newsletter is live! Learn about the car shipper that is bringing jobs to Pier 80: https://t.co/A2HkFlZyxA", "Happy Wanderer: S.F. Fisherman's Wharf is the perfect staycation - San Jose Mercury News https://t.co/9vCHvWR83E", "Port Engineer Steven Reel discussing the northern seawall with @sfchronicle videographer @erinbrethauer https://t.co/2zxw16gyNK", "The SF Symphony is returning to the waterfront for another free concert on July 24th: https://t.co/U5MNlOkyjf", "We can't wait! https://t.co/p6YnTDCSHi", "Experience the shark-themed activities scheduled at the Aquarium of the Bay for #SharkWeek - https://t.co/qsok81fCZc #HumansWelcome", "The Port is hiring an Executive Director with exceptional leadership skills and a background in finance/real estate: https://t.co/yWJWRcne9t", "The City's Seawall requires significant improvements to survive the next major earthquake. See why: https://t.co/fjp7WYhhxN", "Catch some pre-Olympic action at the AVP Pro Beach Volleyball Tour happening at Pier 30/32 this weekend: https://t.co/4ElOcb0CFT", "RT @ksofis: A quality project on the @SFPort that will create good #jobs &amp; help highlight #locallymade goods. https://t.co/ZvfO8KJyBE", "The Green Festival Expo is coming to #Pier35 Nov 11-13th. Discover how to live a more sustainable lifestyle! https://t.co/O6q9q89q22", "RT @flygrl67: Scene while on a #run early this morning... #travel #SF #bay #bridge @ Port of San Francisco https://t.co/hsE9mG4UfC", "Check out the best locations for watching this year's Pier 39 Fourth of July Fireworks Show! https://t.co/QcGt2AqKXM", "FYI: Ferry fares to rise July 1 - https://t.co/wO6EsHE2Eh", "Have a question or just want to voice your concerns? Check out tomorrow's Coffee With A Cop hosted by @SFPDCentral https://t.co/K90zNjMFTG", "Job Announcement: The Port is hiring Pile Workers to maintain and repair the Port's piles, piers and docks - https://t.co/93XEDppTXL", "RT @sfexaminer: OPINION: Pier 29 project to benefit #SF waterfront https://t.co/AYiiPKBC9u via @SFPort https://t.co/jCrZPESvTr", "Happy #FirstDayOfSummer  :) https://t.co/oItsbXPLZQ", "Biking The Gritty Beauty Of The Bay Trail Through Dogpatch | Hoodline https://t.co/vuG0Yi1YcL", "Great shot! Nice bird. #RT @selimozturk: Bitmeyen #sanfrancisco fotograflari vol.14557546... @ Port of San Francisco https://t.co/Oml4ubaL82", "RT @SFGovTV: Port Commission LIVE streamed on https://t.co/btMuESu1Dm at 2pm @SFPort  https://t.co/I00v9HMrSs", "Go Do This Thing: Sierra Nevada Beer Festival At Pier 35 This Weekend: SFist https://t.co/SYRSl0sYIH", "@GreenFestival Hi there. We'll be sure to share the event details to our followers!", "Catch a live stream of the Warriors Game tonight at #Pier70 ! -- https://t.co/siuxZd9AYI", "Happening this weekend: 62nd Annual North Beach Festival, Amazing Acro-Cats, More | Hoodline https://t.co/nTZ9i65X0L", "I spy Engine 35 at Pier 22 1/2 on the Embarcadero! #Engine35 https://t.co/4V8hXUJrkj", "RT @Work4SF: The Port of San Francisco is hiring Project Managers. Apply today.  #careers #jobs\nhttps://t.co/sYODzRgK6h", "@CUESA Of course. You know we love you guys! :)", "CUESA Summer Celebration Sows Seeds For Food Education June 12th | Hoodline https://t.co/Y882BdjN3t #CUESA #FerryBuilding #SFPort", "Exhilarating Bay views tend to have that effect! https://t.co/0OSuyS1Iav", "RT @SF_emergency: THE PREVIOUS MESSAGE WAS IN ERROR National Tsunami Warning Center has CANCELLED.", "After 2 Months Of Repairs, Forbes Island Sets Sail Back To The Wharf | Hoodline https://t.co/huqOQkUQQ8", "RT @HotelVitale: Spend your summer vacation exploring the San Francisco waterfront. https://t.co/2oDawjGth8", "Because there's nothing more awesome than getting high-fives from a stranger! -- Watch \"High Five Camera\" on @Vimeo https://t.co/5mTNxor2PV", "The Port would like to wish you a Happy Memorial Day! #MemorialDay2016 #LandoftheFree #RememberOurTroops https://t.co/c5DqRjtyCj", "Today marks 79 years since the opening of the Golden Gate Bridge! https://t.co/8pijVoiwmL", "Thumbs up to Port staffer @TaiTrangSF for keeping our City streets green! -- https://t.co/Ipwq2rpVhc #QuesadaGarden #Bayview", "We concur! RT @BramWeerts: The Port of San Francisco... Heaven in the USA. What an amazing place.", "A little dose of City history -- Pier 39 opens to scathing review, bathing suit-clad Feinstein: https://t.co/VHVX3zdH9c", "Port and City staff met with @Living_Cities reps today to discuss ways to improve the City's protective sea wall. https://t.co/mn3mUThwtL", "Have you checked out the latest issue of our digital newsletter? -- \"Water Taxis Take to the Bay!\" https://t.co/am9Oqsyf4W", "This wind-powered kinetic sculpture coming to the #Exploratorium is sure to be an eye-catcher! https://t.co/dKaoZNi4yj #Pier15", "FYI: A labor rally is scheduled to take place at Justin Herman Plaza today at 4pm. Expect some crowds and possible traffic impacts.", "RT @BOMASF: #BOMA #SF members were honored to meet with the leaders of @SFPort https://t.co/swSe3v6CWG https://t.co/TKBNC3WQec", "#SFSBW2016: Events, networking, free business workshops &amp; access to city resources to grow your business! https://t.co/hRMAnTAFci May 21-28", "RT @LWCplanning: Beautiful Japanese Coast Guard ship 'Kojima' is docked at the @SFPort this weekend. https://t.co/oHifv23HU7", "Join us on 5/18 for a public meeting for a proposed Homeless Navigation Center in the Central Waterfront area - https://t.co/b6VQ6wL2Dz", "Pasha Signs for New Car Terminal in San Francisco - This deal will revitalize #Pier80 and create new jobs: https://t.co/f6t07wRame", "FYI -- Art on Muni Returns: Seeking Bay Area Artists to Brighten Commutes | SFMTA https://t.co/6SqVKHH6Ql", "The Port of San Francisco has received the Best-Kept-Secret Port Award from Porthole Cruise Magazine! - https://t.co/DZ3ajdYOdV", "RT @Work4SF: The Port of San Francisco is hiring a Capital Manager. #jobs #Work4SF\nhttps://t.co/SbDi3KkZ9r", "Get your tickets for the 11th Annual Uncorked Wine Festival happening this weekend at #GhirardelliSquare | https://t.co/8IxP0PjCZA", "Enjoy crunching numbers? The Port is hiring a Principal Administrative Analyst, Capital Manager. Deadline extended - https://t.co/afAh2UR94i", "The next Waterfront Plan Working Group Public Meeting takes place 5/11 and will focus on Port real estate - https://t.co/Wr1UaYHBSV #WLUP", "Join the SF Maritime National Park for the Women in Maritime Trades Panel Discussion taking Place 5/14 - https://t.co/VRzFlxGMCw #SFmaritime", "SFMTA Wants To Know: Does SF's Parking Permit Plan Still Work? | Hoodline https://t.co/7fsoD3o7op", "RT @RENEWSSF: Team Picked to Development Contentious Affordable Waterfront Site: Identified by the Port - https://t.co/SXbWUHxbcF", "Take a tour and have a glass of wine aboard the WWII submarine #USSPampanito at Pier 45 this summer! - https://t.co/EGLVB6RKZn #sfmaritime", "Looking for fun weekend activities? Check out this list of some of the best things to do in the Bay Area in May: https://t.co/Xci6R9SE1Y", "Pasha to import cars through San Francisco | News | American Shipper https://t.co/euzwiZJSJ7 #Pier80 #SFPort", "RT @sfexaminer: .@SFPort zeros in on potential Pier 29 tenant https://t.co/GSbhYeYH7c via @nashellytweets https://t.co/GvQ3l13plM", "FYI https://t.co/qNdQgRVRmt", "RT @sfgov: \"Dearly beloved, we are gathered here today to get through this thing called life\"...#RIPPrince https://t.co/22t56HtBuk", "This is much needed! -- E-Line Runs Daily Starting Tomorrow, Relieving Busy Waterfront Routes | Hoodline https://t.co/hWyGBDODr0", "The beautifully-designed #Exploratorium at Pier 15 has received a 2016 Green Projects Award from AIA National: https://t.co/yOt1u0MAsq", "RT @SFEnvironment: The @SFPort's #ZeroWaste Event policy keeps plastics out of the Bay. #EarthDay #GreenSF https://t.co/e0XFCbF4En", "Join us at India Basin Shoreline Park on 4/23 as we celebrate #EarthDay w/ a coastal cleanup and fun activities: https://t.co/lQaEmOnQVe", "Learn about the Port's goals and vision for vibrancy and sustainability in our 2016-2021 Port Strategic Plan: https://t.co/SMeHQi7bDe", "RT @SFGiants: TONIGHT: Grienke vs. Bumgarner\n7:15pm | @ATTParkSF\nhttps://t.co/ZLfiLmmMkN\n#SFGiants", "The Shipyard Museum has set up an exhibit of the Great Earthquake at Pier 1. Stop by to get a dose of City history. https://t.co/1IPYMCdzhP", "RT @RevClown: @SFPort throws some love to the always awesome Heron's Head Park. https://t.co/u2PLTkZvny", "The 2nd edition of our digital newsletter is live! In this issue: Learn about the Port's Best Kept Secret: https://t.co/BM4lCkg0xu", "The Port is hiring a Principal Administrative Analyst, Capital Manager. The close date has been extended to May 2nd: https://t.co/LU1CySqSM1", "*Update* the Port's Steven Reel is being interviewed instead of Ms. Forbes. @kqedforum", "Tune in to @KQEDForum this morning at 9:30 am to hear Interim Port Director Elaine Forbes discuss the recent seismic earthquake study.", "Discover how San Francisco plans to address its most pressing challenges in the City's Resilience Strategy: https://t.co/tfjGtUN3TD", "Thank you!  https://t.co/AznorfLVCW", "Today marks 110 years since the 1906 Earthquake and Fire. Check out this photo archive shared by the SFPUC | https://t.co/ZRUdHrvQbZ", "FYI https://t.co/9w71GApXp9", "Big news for commuters! -- $4 million grant to expand San Francisco Bay ferry service - SFGate https://t.co/VARZ8KI1Gr", "RT @HoodlineSF: Teatro ZinZanni Supporters Urge Port To Bring Back The Show\nhttps://t.co/oj2T57I8P7 by @gerikoeppel https://t.co/e5r1IAZWjy", "Happening this weekend! Baby Goats, Goat Cheese &amp; More At Ferry Building Goat Festival | Hoodline https://t.co/kTnKuehvSC #Goatchella", "RT @SFGovTV: Port Commission LIVEstreamed on https://t.co/btMuESu1Dm at 2pm  @SFPort  https://t.co/0CqVqJzdjI", "RT @HoodlineSF: .@SFPort Says Seawall Fix Will Cost Up To $5 Billion: https://t.co/D44zKuNiKd by @gerikoeppel https://t.co/irB83yxNij", "Meet the osprey that has decided to call #Pier80 her new home. https://t.co/VMhBGxQ3Nh", "RT @KarlTheFog: Last night you were sweaty and slept above your sheets &amp; tonight you're curling up near a heater. Welcome to San Francisco.", "Help out your community by voting for 1 of 3 City Parks to recieve a $20,000 grant for revitalization -- https://t.co/aLLmXv6RCV #EarthMonth", "Take a climb aboard the Rueben Lasker this weekend for a FREE Ocean Research Ship Tour: https://t.co/eAFBa0yA3m #Pier15 #Exploratorium", "RT @SFGiants: Looks like a nice day to #BeatLA.\n#SFGOpeningDay\n#SFGiants https://t.co/bct4x2i329", "RT @DolphinClubSF: Come learn about the state of our seawall at @SFPort Waterfront Plan Working Group meeting 4/23: https://t.co/cbNdM7TCVk", "Walk to Work Day returns to the City tomorrow celebrating the most healthy, sustainable form of transportation! https://t.co/WD4HOfcV9g", "Calling all maritime fans! Join the Maritime Museum this weekend for an afternoon of shipwrecks and treasures -- https://t.co/BiBWpNldPT", "RT @Work4SF: The Port of San Francisco is hiring a Capital Manager. #jobs #careers\nhttps://t.co/SbDi3KkZ9r", "They're back! #SFGiants #WeAreGiant  https://t.co/sHizc6k0jX", "@jashsf Hi there. Are you speaking in regard to development opportunities?", "A celebratory meal was held at #Pier45 today to celebrate the opening of the crab season. And what a feast it was! https://t.co/xYpyWOmxSy", "@CoastGuardRadio @sfdistrict3 Very interesting! Thank you for the clarification.", "RT @FogHarbor: Fishermen unloading our Local Dungeness Crab. Come eat! #dungenesscrab #sanfrancisco #fogharbor https://t.co/2XXWooayxX", "#Goatchella, now self-aware viral goat festival, to return to Ferry Building in April - SFGate https://t.co/BiionR8L9V", "Crab season is officially open! -- Dungeness crab sells for $2.90 a pound | https://t.co/4w5Ss4qaHQ https://t.co/j7a9pht3a2", "On 4/7, the City will celebrate Giants Opening Day! Get info on how to navigate to and from all home games: https://t.co/RYuw8pdyXV #SFMTA", "It's National Tsunami Preparedness Week! Discover how prepare for tsunamis and what to do to stay safe: https://t.co/PJBKx3Sj7c #tsunamizone", "We sure did! https://t.co/5IlLxYyeCc", "240 years ago today, Spanish explorers reached San Francisco and founded the modern city - SFGate https://t.co/71Jbo5gBX4", "We saw it too! RT @sfdistrict3: Interesting aircraft that just glided over Alcatraz. Relatively quiet for it's size. https://t.co/QtgkiDPWS9", "Crab season faces further delays from sea conditions, pricing - SFGate https://t.co/JezYqjOxHf", "RT @FogHarbor: PIER 39 lowering the flag to half-mast. #brussels https://t.co/717P9c7BGr", "RT @SFGovTV: Port Commission LIVE streamed on https://t.co/btMuESu1Dm at 2pm @SFPort https://t.co/NWrO0ZhLVK", "We're looking forward to participating! -- Port And City Selected For Program To Help Find Seawall Solutions: https://t.co/471GgGQp8t", "Happy St.Patrick's Day Port friends!  https://t.co/9owd8aq2WS", "The Port is hiring a Marina Assistant to provide security to marina facilities and perform routine maintenance: https://t.co/rQzPWchmTw", "Volunteer to provide habitat restoration at Pier 94 with the Golden Gate Audubon Society. Next event is April 2nd: https://t.co/b09zcw5kcL", "The next Waterfront Plan Update public mtg takes place 3/23 and will focus on Port resiliency and sea level rise: https://t.co/IMJJSnXSUX", "Update: These are the flash flood warnings and flood watches currently in place for the Bay Area. #ElNino... https://t.co/4pmDJOOUxq", "RT @vclixmedia: My life is my message\n-Gandhi #SF #portofsanfrancisco #bayarea @ Port of San Francisco https://t.co/TwJiETUlRH", "The 13th San Francisco International Ocean Film Festival, featuring ocean-themed independent films, launches today! https://t.co/huFiOSdi3k", "RT @SFBusinessTimes: Super Bowl 50 raked in over $8 million in #hotel taxes for S.F. https://t.co/ppFshN1IF8 #SB50 https://t.co/kPWXMHneNC", "Heavy rains are expected over the next few days which could lead to flooding. Be prepared: https://t.co/hGzOitgED0 #FloodSafety #ElNino", "RT @TheaSelby: Congratulations, Port Commissioner Kounalakis, for joining the other 4 commissioners @SFPort https://t.co/98CRI77Xf0", "RT @SFGovTV: Port Commission LIVE streamed on https://t.co/btMuESu1Dm at 2pm https://t.co/4kRmTJvdxQ  @SFPort", "SF Rec &amp; Park Greenagers Program is Accepting Applications | San Francisco Recreation and Park https://t.co/UDjdaPj8cv #SFport", "Top 10 Things To Do In San Francisco - WOW TRAVEL https://t.co/j24XnEg4nZ", "The Port is pleased to welcome Ambassador Eleni Kounalakis to the Port Commission! https://t.co/iKeifkCPca", "RT @SF72org: During the storm call 3-1-1 for city services &amp; assistance. Call 9-1-1 for life threatening emergencies.", "Two tall ships with rich histories are paying an extended visit to the Bay Area -- https://t.co/Xm6hVra4Iz #LadyWashington #JackLondonSquare", "RT @HoodlineSF: New Bike Box, Sharrows, Signage Installed At Embarcadero &amp; Townsend https://t.co/7GNTXSWapv https://t.co/Wy1vEAcMMf", "Celebrate our veterans with a 4-hour cruise aboard the SS Jeremiah O'Brien on 5/21 --  https://t.co/n7kFmWV2gc #SFwaterfront #Pier45", "Green tech! RT @DannySkarka: San Francisco rain harvesting. @ Pier 27 Port of San Francisco Cruise Ship Terminal https://t.co/lFcR36eGSe", "We're a fun bunch! #FarwellMonique #PortStaff #SFPort #YoullBeMissed @gmimonique https://t.co/apP1wNj0DI", "Help the Port and the City find a way to #finance repair of the protective Seawall. Today is the last day to vote! https://t.co/SdnxzS2jiY", "Port Asks Public For Online Votes To Help With Seawall Funding Quandary | Hoodline https://t.co/MzpdPem8TJ", "RT @Work4SF: The Port of San Francisco is hiring Environmental Planners.\nhttps://t.co/qUgpnoA3q7", "The megaship Benjamin Franklin returns to the Bay Area early tomorrow morning: https://t.co/cjICZN9pR7", "Vote to save the #SanFrancisco seawall! Votes help us plan how to finance improvements for our future! https://t.co/UoZokMQphU @sfgov", "RT @CREwatch: JOB: Deputy Director Real Estate (Port of San Francisco ) San Francisco, CA https://t.co/wK1cIVNeTT", "The Port is hiring hire two environmental planners to staff the Maritime Division and the Engineering Division: https://t.co/tho0i8f0E3", "Catch them in action! Missy Elliott, Justin Bieber Flash Mobs To Perform On Embarcadero This Sunday | Hoodline https://t.co/e1bVj5bp0N", "Port News--Mayor Appoints Elaine Forbes as Interim Port Director: https://t.co/TGNVVNkYM5", "A Seawall for all; Help San Francisco protect the waterfront for the future of all residents. #CityAccelerator https://t.co/UoZokMQphU", "Great shot of the new Port banners! RT @ankurattitude: Port of San Francisco @ Port of San Francisco https://t.co/ToI359ZRpy", "It's Random Acts of Kindness Day! Here are some small ways to brighten someone's day. - SFGate https://t.co/MghhiYy42A #Feb17", "The Port is proud to support the @RecParkSF \"Greenagers\" program which fosters environmental education in youth: https://t.co/5Oq3R4SAVR", "RT @SravanthiSinha: #nofilter @ Pier 27 Port of San Francisco Cruise Ship Terminal https://t.co/atfcifnX4k", "Port News : Pier 70 LLC Signs Tea Collection to lease at historic Building 104: https://t.co/TTudYkSXFo", "RT @abc7newsBayArea: #BREAKING: Dungeness crab season is finally open for Bay Area waters. \nhttps://t.co/k5QWfWiEgP", "Port News :  Mayor Announces Emergency Assistance to Crab Boats and Receivers due to lack of Dungeness Crab Season: https://t.co/kXrAVwbklQ", "RT @SFGovTV: Port Commission LIVEstreamed on https://t.co/btMuESu1Dm at 3pm @SFPort https://t.co/VWCAbeaDos", "This Sat marks the return of the Giants FanFest at AT&amp;T Park. All gates open at 10am. https://t.co/DKPsP59FBJ #FanFest2016 #SFwaterfront", "The Port is seeking a proven leader with a commitment to public service for the Deputy Director of Real Estate role: https://t.co/PCi1o6yXnC", "The Port was recognized for waterfront vigilance! RT @JohnMercer67: #SB50 #logistics and security concerns @SFPort https://t.co/a6b3fjTSrx", "The Port is requesting proposals (RFP) for a lease to improve the Pier 29 Bulkhead Bldg on the NE waterfront: https://t.co/6LtHHXGAcz", "#FerryBuilding #ClockTower :) RT @ESPNRadio980: Port of San Francisco with Super Bowl 50 flavor https://t.co/oGXSatHUFK", "Public Meeting Notice: Waterfront Plan Working Group Meeting, Feb. 10th at 6 p.m -- https://t.co/FvKG6Ov5m7", "Come to #SuperBowlCity tonight and see Matt Nathanson on The City Stage presented by Levi's. https://t.co/zBBaXhdJrt #SB50 #SFwaterfront", "Happening Now: ESPN live at Fisherman's Wharf! #SB50 #FishermansWharf #PIER39 #SFwaterfront #SFport https://t.co/CV83T2EL29", "Check out this amazing gallery of some of the most famous shipwrecks of San Francisco Bay - SFGate https://t.co/7USthBYJQs", "RT @AGST9X: Port of San Francisco #sf @ Ferry Plaza Farmers Market https://t.co/hrJSKjfWCd", "Super Bowl schedule 2016: Dates and times for the full week of events - https://t.co/TdtNciwu5I https://t.co/Gc1Pxy6UXH", "RT @superbowl50: .@Broncos fans have arrived in #SuperBowlCity https://t.co/Xj5NcTOiU7", "Super Bowl City opens today! #sb50  https://t.co/jEadrcWmKR", "Super Bowl 50: Paratransit and Accessibility Details | SFMTA https://t.co/U2HNHdYcs0", "The port is seeking to 4 graduate internship roles in the Planning &amp; Development Division - https://t.co/oDT16m53Qu #internship #WLUP", "The @AnimalPlanet #PuppyBowl is coming to San Francisco. Watch in person from 2/4-2/7 in the Ferry Building! https://t.co/qUWxMFuHbs #SB50", "Reminder: You can sign up to receive traffic and safety alerts related to Super Bowl 50 by texting \"SB50\" to 888-777. #SB50 #SFDEM", "This Weekend: Super Bowl City and the Year of the Monkey | SFMTA https://t.co/SLpv4ScEv6", "Waterfront Plan Update Public Meeting, SAVE THE DATE: February 10th -- https://t.co/LyQwriDiqI #WLUP #YourSFport", "The \"50\" is here! Photo credit: Ms. Jenny #FishermansWharf #SB50 #SFport https://t.co/yvBHMJdMxK", "Super Bowl traffic and transit resources | https://t.co/i0r7ubwvEd https://t.co/FlPnh7wqSW #abcnow #SB50", "Follow the story behind #TheBayLights with the documentary Impossible Light | KQED Truly CA - YouTube https://t.co/7gYtgteD11 #Jan30", ":) RT @PlanetaPic: Port of San Francisco #photo #picture https://t.co/nQ5VFMGR0b", "Super Bowl 50 by taxi! Taxis will be allowed on streets closed to private auto and bike traffic from 1/23-2/12: https://t.co/l7dSOupZ44", "FYI: There will be special expanded ferry service for Super Bowl festivities beginning 1/30 - https://t.co/YggSf7zW3o #SB50 #FerryBuilding", "Our Super Bowl City resource page has been updated with detailed info RE: transit impacts, security and logistics: https://t.co/ZQbmN8emJx", "@TheSFShipyard Thank you for the #FF :)", "The Port of San Francisco mourns the passing of Ms. Sylvia McLaughlin: https://t.co/KDezr8KlSc #SaveTheBay", "Video: Sneak peak of Super Bowl 50 setup in San Francisco | https://t.co/4w5Ss4qaHQ https://t.co/GQojXo1B5m", "She's a beauty!  https://t.co/FxkYWW5FJq", "Super Bowl 50: F-Market Reroute &amp; Terminal Change | SFMTA https://t.co/I52WcBMm81 #SB50 #Embarcadero", "Here's a full list of all the events at Super Bowl City in San Francisco - SFGate https://t.co/l6b6zeHUW7", "Meet the new Port Commission officers elected for the 2016 term: https://t.co/YwWFWu30tH", "FYI: The Ferry Plaza Farmer's Market will stay open during Super Bowl Week | CUESA https://t.co/5NC6NZNBaR #SB50 #CUESA #FarmersMarket", "Regular BART commuter? This Super Bowl week playbook for BART customers has great info on expected impacts - https://t.co/PT793jXPQq #SB50", "The Super Bowl City live musical performance list is now available. See the full lineup - https://t.co/G6Ip4sAIjC #SB50", "SF celebrates 26 years of sea lions making a splash at Pier 39 - The San Francisco Examiner : https://t.co/GbltkAbGrf", "The Port is proud to sponsor the 13th Annual San Francisco International Ocean Film Festival -- https://t.co/pp0EAqgvs0", "25,000 Bay Bridge LED Lights to Shine Again, Just in Time for Super Bowl 50 -- #SB50 #SuperBowlCity https://t.co/IjH11PCm7o", "RT @Work4SF: The Port of San Francisco is hiring a 9393 Maritime Marketing Manager. #careers #jobs\n\nhttps://t.co/hklR46QYVu", "Going to the Metallica Night Before Concert on Feb 2? Take the ferry to AT&amp;T Park | San Francisco Bay Ferry: https://t.co/5yzWpikHsL", "#SFRestaurantWeek returns on Jan 20th. Book a table at one of the 15 participating waterfront restaurants! https://t.co/715x2bdP87", "RT @KarlTheFog: Say goodbye to sunshine https://t.co/3XpajGixND", "Attend the 1st community mtg for the SF-Oak Bay Bridge West Span Bicycle, Pedestrian and Maintenance Path Project: https://t.co/HlOjh9QWBm", "RT @SFGovTV: Port Commission LIVE on https://t.co/btMuESu1Dm at 3:15pm @SFPort", "Super Bowl 50: Street Closures Coming to Downtown &amp; SoMa | SFMTA https://t.co/lAACkQNOlX", "Check out the history behind the #PIER39 sea lions! -- San Francisco legends: California sea lions at Pier 39. https://t.co/9iT975jkSP", "Our website now has a page dedicated to Super Bowl City. Stay in-the-know about #SB50 events along the waterfront: https://t.co/Qs71MWaHkS", "Meeting Notice: The Port is holding a public meeting to discuss the waterfront plan update process on Jan 13th -- https://t.co/o1lLvXcFcc", "Alicia Keys to Headline Free Concert on Super Bowl Eve at the San Francisco waterfront: https://t.co/D7dKe70xIe", "Help clean, green and beautify San Francisco during the Mayor's Day of Service on Jan 9th: https://t.co/sj6i65t1kD #SFserves", "Join the Port and @spur_urbanist as we tour the commercial seafood industry at Pier 45:  #SPUR https://t.co/lCc3RQGrIr", "Discover our rich history with this post highlighting historical facts about the Port of San Francisco: https://t.co/FgIb4EuDqP", "Time-lapse video of the megaship Benjamin Franklin making a final turn before departing the Bay. https://t.co/MyC64idS4w via @YouTube", "RT @RinconHill: Gorgeous photo of Cupid's Span at Rincon Park after dark! Thanks @sfport for sharing it!! https://t.co/6tDb1H2bvu", "Explore the chemistry of mixed drinks at the Exploratorium's 6th annual Science of Cocktails event: https://t.co/NhYGHubTzq #Pier15", "Get the latest info on the lead-up to Super Bowl 50, plus events and schedules, with the Road to 50 App - #SB50 https://t.co/vgyvMQEXi2", "Get up to 10 free sandbags from SF Public Works to prepare for El Nino weather this week: https://t.co/W2NXQ6zVZc", "See what the Port's Director of Homeland Security has to say about security measures being put in place for #SB50: https://t.co/XxtuklHrsm", "The Port would like to wish you a glorious and fulfilling New Year! #2016 #HappyNewYear https://t.co/deXnS41jF6", "Headed to the NYE fireworks show tonight? Take muni for free! https://t.co/PVTpDMgDd0", "RT @SFMaritimeNPS: Massive container ship and #Balclutha. https://t.co/pT9rvBBmlE #FindYourPark #maritime https://t.co/BfRonjYX5J", "Biggest ship ever to sail into S.F. Bay arrives Thursday - San Francisco Chronicle https://t.co/VNtgVy8WhM", "Don't forget about the FREE New Year's Eve waterfront fireworks show: https://t.co/WOYdFukBkb", "RT @PIER39: Did you know? You can size yourself up next to a real #sealion skeleton at the Sea Lion Center. https://t.co/dMRLK3aVdJ", "The Port is requesting proposals (RFP) for a lease to improve and operate space at the Pier 29 Bulkhead Building: https://t.co/9mTQhAmiMQ", "Coming up: Public Meeting at the #SFPort To Reveal Super Bowl 50's Event Details - https://t.co/0AyMEc5UOA #SB50", "Santa is approved for take off! -- Secretary Foxx and FAA clear Santa and his sleigh | Department of Transportation https://t.co/xhaqWTEdr1", "#SFPort  https://t.co/U9Tcuz2qWc", "Here's a brief clip of last Friday's colorful Light Saber \"Battle\" which took place at Sue Bierman Park: https://t.co/kfJV478bGW", "RT @SFist: For the 16th year in a row, you can ride #Muni for free on New Year's Eve: https://t.co/0KqzOO4Mn4 https://t.co/tNorRVSCJ1", "PIER 39 is looking oh so festive! Have you stopped by the tree yet?  https://t.co/MF7MPoj4gf", "Need a resolution? Shop&amp;Dine in the 49 by supporting businesses within the 49 sq miles of San Francisco: https://t.co/oJQKsPr3CZ #shopdine49", "Plan ahead for the latest transit impacts expected for the areas around the City's Super Bowl 50 festivities: https://t.co/cneyXek0dB #SB50", "A shot from 1975 of the Hyde Street Pier with the Island Princess ship in the background. #TBT #ThrowbackThursday https://t.co/iZLixcR5ih", "Happening this Friday -- Force to Awaken in Massive Lightsaber \"Battle\" on the Embarcadero: https://t.co/PF8BbxAADm", "Head to the Embarcadero to catch the action! -- Bay Lights Fans Can Watch Artist Reprogram Display Before Unveiling: https://t.co/1GPPA4sw6f", "Autodesk at #Pier9 wants artists &amp; engineers to use their fabrication workshop to make cutting-edge projects: https://t.co/lkTnaJljbn", "Awesome video alert! Port Of San Francisco at night by drone -https://t.co/fYl57yyHQV via @YouTube", "Ferry captain brings the Eureka into slip at the Ferry Bldg circa 1940. Credit: SF Maritime Nat'l Historic Park #TBT https://t.co/tbjzOdqvmH", "RT @SFFerryBuilding: How San Francisco's Ferry Building Became a Can't Miss Attraction https://t.co/wAwhYd6opF", "The Port commission meeting is being held today at the Pier 27 Cruise Terminal! https://t.co/WHsh2rDk9v", "RT @SFGovTV: Port Commission LIVE streamed today at 3:15pm on https://t.co/btMuESu1Dm @sfport https://t.co/2NAzbQYGcz", "So lovely! RT @apurkiss: The Port of San Francisco https://t.co/2eZsG4c0k2 https://t.co/zYJ8atDN33", "The PBS Network show Craft in America will feature incredible parade float artists located at the Port's Pier 54 - https://t.co/u4eDHRhkOh", "Footage from this evening's #PPIE commemoration where the ferry bldg lights were turned off #countdown https://t.co/AHnWQN9EVQ", "Teatro ZinZanni Prepares For Waterfront Second Act | Hoodline https://t.co/fEFqIMhw1m", "Celebration Marking Ferry Building Lights Set for December 4 | Shared via Bay Crossings: https://t.co/p5NpQXUmrj", "The Urban Air Market returns to #Pier70 on 12/13 for a holiday show that will feature 170 sustainable design brands: https://t.co/JMsQJLPXcf", "Happening Jan. 15-18, 2016 -- The 3rd Annual Progressive Insurance San Francisco Boat Show at Pier 48: https://t.co/XXG73X2p1F", "How to scale a clock tower 101 #FerryBuilding #ClockTower #Maintenance #SFPort https://t.co/t9oDd04pS7", "Crazy #KingTides at the #SFPort. Don't get too close!  https://t.co/EAtVxWdvD2", "King Tides today at Pier 14! #kingtides #sfport #embarcadero https://t.co/mMSy7BFNur", "RT @GmiMonique: Touring Kvichak Marine in Seattle who is building 2 new ferries for WETA @BayAreaCouncil @SFPort https://t.co/luC5qIizrd", "FYI https://t.co/ngl1imEled", "RT @TheWharfSF: All you need to know about this weekend's #Pier39 #treelighting! We hope to see you there! https://t.co/WAovRA3vvG", "RT @1YCEU: @SFPDBayview handing out Turkeys on Potrero Hill with the Bayview YMCA @SFPDCares @SFPD #potrerohillsfc https://t.co/lHUFpvMZXC", "Mark Your Calendars For Pre-Thanksgiving Farmers Markets at the Ferry Plaza and the Yard at Mission Rock - https://t.co/oO4AioVQVV", "Port of San Francisco, BAE Systems forge new 20-year ship repair lease | Longshore &amp; Shipping News https://t.co/YU5NrBD5OC", "To honor #WorldToiletDay, we'd like to share that there are public restrooms at Pier1 &amp; the Ferry Bldg. More info: https://t.co/LTTLvJ2Iwl", "Port Commission Pres @lrkatz traveled to Shanghai to attend the 16th Sister Ports Conference Oct 27-29 @GmiMonique https://t.co/Jrd8tyfQb8", "Thanksgiving at the Ferry Plaza Farmers Market taking place on Wednesday 11/25 - https://t.co/iDP1PmIJYi", "Join us as we remember Closing Day of the 1915 Panama Pacific Expo by turning off the \"1915\" on the Ferry Bldg: https://t.co/LuHTzPSFiS", "Mark Your Calendar For Holiday Lighting Ceremonies | Hoodline https://t.co/gIG59lHgyo #PIER39 #Embarcadero #FishermansWharf #SFPort", "San Francisco Port Commission seeks Parking Lot Operators, submittals due Dec. 17 -- https://t.co/4JCmsrPKYm #RFP #SFPort", "RT @LauraDudnick: .@SFPort Commission paves way for use of parking lots for @Warriors arena https://t.co/6Oilr8Escv", "RT @HoodlineSF: Port To Seek Proposals For Empty Space At Pier 29: https://t.co/kFUATPvCUS by @gerikoeppel https://t.co/YpBoEw38qd", "RT @SFGovTV: Port Commission LIVEstreamed on https://t.co/btMuESu1Dm at 2pm @sfport", "San Francisco is the 1st Port of Call for the nation's newest research ship, the Neil Armstrong -- https://t.co/eCe2xo0AU9 #WHOI", "Ever wonder where those barnacle benches came from? Those were created by our tenant @SDISF https://t.co/hlufQS4HCp https://t.co/gSmqse6Ljj", "RT @SF72org: Exercise caution on the roads today! We are seeing some of the much anticipated rain for the season. https://t.co/b595u6J3dD", "The Waterfront Land Use Plan Working Group is creating a new vision for the waterfront. What do they have in mind? - https://t.co/o73fshaebz", "Due to construction on the Central Subway, E-Embarcadero streetcar service will be canceled for the next 2 weekends: https://t.co/gB77monG3p", "The Golden Gate Ferryboat preparing to carry commuters across the Bay in 1977. Photo credit: SF Public Library #TBT https://t.co/EHQtbQWaVe", "Off The Grid returns to Justin Herman Plaza this Saturday! Burn off the food calories on the winter ice rink nearby: https://t.co/NAiZehgfuQ", "Is that a Port pylon in the distance? ;-) https://t.co/VULzPqH6nK", "@carolyngalvante Hello. There's no permit process for Rincon as it's an open, public space. For the others, please contact @RecParkSF", "The Port's Waterfront Boat Tour was a success! Nearly 150 came out on Sun to learn about the historic waterfront. https://t.co/Skcoc8lxKz", "RT @BermelloAjamil: Pier 27 Cruise Terminal in San Francisco wins AIA merit award! https://t.co/yOWwKllzXM @SFPort @AIAMIAMI", "Miss out on our digital newsletter launch? No worries. Sign up for all future newsletter distributions: https://t.co/h8TfIBT7Vf", "With stops at the Ferry Building and a few waterfront restaurants, of course! -- 36 Hours in San Francisco: https://t.co/irSjkSv5nm", "The Port is pleased to announce that our new digital newsletter is live! In this edition: What is a Seawall? https://t.co/Lh4lK6duiF", "7 Cool Things to Do in San Francisco's Embarcadero | TravelPulse https://t.co/Nb5BWC4a2L", "Bay Area NBA fans, on 10/27 TNT will be holding a day of NBA related-events at Pier 43 to launch the 15'-16' season: https://t.co/bFSp4I5WDX", "In one week, we'll be launching the 1st edition of our digital newsletter. Join our email list to stay in the know: https://t.co/QFfWyvFBc2", "On 10/25, Engine 35 at Pier 22 1/2 will celebrate the centennial of the Panama Pacific Int'l Expo with tours: https://t.co/4S0LJliuPD", "Curious about events taking place on the waterfront? Our calendar has a listing of events happening at the Port: https://t.co/DaAqsmBnAy", "Family-friendly Halloween fun, Open Studios, History Night and more happening at the Pier 70 venue this month! -- https://t.co/eY1z4p4a6C", "Today in History: 87 years ago today, the N-Judah line first ran from the Ferry Building To Ocean Beach -- https://t.co/cRmWSQHKju", "Check out some of the ideas for future Port development discussed at yesterday's Waterfront Vision Workshop: https://t.co/S6bQXJXvew #WLUP", "Wharf Fest returns to the Fisherman's Wharf this Saturday, Oct 24th. Get your tickets online -- https://t.co/OJsPWyMJ4l", "Explore the hidden beauty of the Bayview district in this video shot by drone: \"Aerial Ode to the Bayview\" - SFGate https://t.co/rhoIyrdRhc", "You're invited! Happening today: Port of San Francisco Vision Workshop http://t.co/4On7UR6mpf #SFport #YourSFPort #WLUP", "#FF @SFWeekly @picache @PUBLICBikes @walidmrealtor @SFFerryBuilding @eatersf @PocoDolceSF @SFPort @GMillsSF @debragurriere @goathillpizza", "@TheSFShipyard Thank you for the Follow Friday #FF", "Port News : Statement on Sinbad's Eviction -- http://t.co/78UAloW36m", "Train being delivered to help handle waterfront traffic, 1943. Photo credit SF Public Library #ThrowbackThursday http://t.co/wjjZaSPyFh", "In case you missed it: Scenes from Fleet Week 2015 -- http://t.co/nHHcH63k2l #FleetWeekSF", "Great #SelfieWithASailor shot! #FleetWeekSF  https://t.co/L7AOM0Hl63", "Avoid the #FleetWeekSF traffic by taking BART and exiting on Embarcadero.  https://t.co/VC2mWZjCac", "RT @GmiMonique: Participating in Senior Leadership Seminar as part of #SFFleetWeek @SFPort http://t.co/Vzx0j0ZV7p", "Here's some detailed information about which ships will be open for tours this week: VISITING SHIPS - http://t.co/mw456bBwQS", "A #NoDroneZone is in effect during #FleetWeekSF. Violators could face a $10K fine - SFGate http://t.co/S9QAKE29XQ", "Blue Angels scheduled to practice above San Francisco today | http://t.co/i0r7ubO6vL http://t.co/usyKFxZ3lD", "RT @Break_Bulk: Amazing bowling party last night hosted by #MetroPorts and @SFport #bbam2015 http://t.co/nyJ8o5sRWl", "REMINDER: Police Community Meeting for Fisherman's Wharf - TOMORROW October 7 at Castagnola's 12PM -- http://t.co/eBX9h5zFXo", "In honor of #FleetWeekSF, we want to see your #SelfieWithASailor pics! Tag #SFPort or @SFPort with your selfies!", "RT @JodiTraversaro: Thank you .@SF_emergency @SFPort #FleetWeekSF #selfiewithasailor #weloveSneed http://t.co/v75suwOw8o", "We kicked off 35th Annual #FleetWeekSF with a presentation from the Mayor and several military reps at Pier 50: http://t.co/V6uero6DIg", "RT @femaregion9: Get important #preparedness tips and info wherever you are! Text PREPARE to 43362 (4FEMA).", "Congratulations to Port Director @gmimonique for her #CEDAW Community Building Award! http://t.co/SX4erviJTM", "The Blue Angels are back! San Francisco Fleet Week Has Arrived | Hoodline http://t.co/6j2SVdcRNG #FleetWeekSF", "Help support the #FleetWeekSF non-profit organization by supporting The Buy a Burger for a Sailor GoFundMe: http://t.co/IClRRRjjkI", "Just FYI: Watch For Street Closures This Sunday On Embarcadero And At Wharf | Hoodline https://t.co/WjkED19DcW", "On 9/30, the Port held a reception for members of the Land Use Plan Working Group &amp; Advisory Team. Pics are live --&gt; https://t.co/wSICtcDVZy", "Port Director @gmimonique had the pleasure of hosting participants of the IDA Annual Conference &amp; Tradeshow #IDASF http://t.co/jUBKEZNWce", "RT @FleetWeekSF: #FleetWeekSF banners are up along the @SFPort! Everything kicks off Monday! http://t.co/kZxpTRTHqD", "We're proud to announce that the new James R. Herman Cruise Terminal at Pier 27 has garnered several awards: http://t.co/BKQNTSPf1Q", "Discover the artwork along the San Francisco waterfront: http://t.co/q3VG3NW5is #SFPort", "Interested in a career in public service? The #SFPort has new job openings: http://t.co/L9aXjYQqEi", "Happening this weekend at the @SFFerryBuilding, 2nd floor -- the 4th annual SF International Tea Festival: http://t.co/XOsHsUAluE", "Join the EcoCenter for #BaySplash on 10/10 - a fun and free day of science, art, music and food celebrating the Bay: http://t.co/EE6M5Phjqc", "Happening now: The Port's Be the Match donor registry drive at Pier 1. #journietorecovery http://t.co/78ow8mlGmq", "The full Fleet Week schedule is now available. Purchase tickets to the air show or sign up to volunteer: http://t.co/bxWIDlCGUP #FleetWeekSF", "RT @SFGovTV: Port Commission LIVE-streamed on http://t.co/btMuESu1Dm at 3pm @sfport http://t.co/15DavMTwoB", "A couple more pictures from Friday's Bayview Gateway opening. Thank you to all who came out to support the event! http://t.co/AElVm2Hol7", "RT @sfvas: Bayview Gateway Ribbon Cutting! @MaliaCohen @Scott_Wiener @SFPort @sfpublicworks @SFPD http://t.co/mHHhr0dTfz", "Our @BeTheMatch Drive takes place in two days! If you'll be in the area, stop by Pier 1 on 9/23 to save a life: http://t.co/2pWGbmf89U", "Today, the Port is celebrating the opening of the new Bayview Gateway open space at Cargo Way and Third St: http://t.co/VMPAfWL5LY", "Save a life by joining us on 9/23/15 for a @BeTheMatch Drive at the #SFPort: http://t.co/2pWGbmf89U", "The #SFPort would like to wish BCDC a happy 50th anniversary! http://t.co/F4iVrHIBjM", "Say hello to the \"Dreamboat\"! http://t.co/Ue8JfGN4q0", "RT @superbowl50: #Kickoff2015 \"Love Me Like You Do\" @elliegoulding http://t.co/7ll5vRrn2W", "Look at that Sea of Red! RT @superbowl50: Justin Herman Plaza is the place to be this afternoon! #Kickoff2015 http://t.co/OSqhU11uV0", "Slice of History: Tour the USS Pampanito with Wine at Pier 45: http://t.co/n39lnAZhxc", "RT @superbowl50: #SB50 @49ers fans! Come see @RickyWatters (12:30-2PM) @CharlesHaley94 @Gmacbulldawg62 (5-6:30PM) for autographs at Pier 35!", "Tides of Change ~ The Story of the James R. Herman Memorial on Vimeo http://t.co/ofzZN6Th6G #Pier27 #ILWU", "RT @SFGovTV: Port Commission LIVE streamed on http://t.co/btMuESu1Dm at 3pm @sfport http://t.co/K5p7kDr8Wo", "This great video is a short documentary about the environmental sustainability internship program at the EcoCenter: http://t.co/qbcNZDVoBb", "RT @nbcbayarea: WEATHER ALERT: Heat advisory, Spare the Air alert issued today. http://t.co/gjNrLRZ4E9 http://t.co/lsJWHu26Qr", "Come see ELLIE GOULDING and TRAIN perform live at Justin Herman Plaza on 9/10 as part of the 2015 NFL Kickoff. http://t.co/WLyC9dx7ej #SB50", "Reminder:  https://t.co/aS8ysjSuCq", "Fleet Week returns to the Port Oct 5th! Check out the calendar of events and purchase air show tickets: http://t.co/zQM89Xzleb #Fleetweeksf", "RT @PIER39: 11 Gorgeous Fog-Swept Photos of #SanFrancisco http://t.co/ghHVAVBW5U", "@tsuyoikuma You are correct. Thank you for pointing that out. We will get that taken care of as soon as possible!", "Join @aquariumothebay on Sept 19th for California Coastal Cleanup Day -- the state's largest volunteer event: http://t.co/tKDMslKJqI", "Looking for some family-friendly fun for Labor Day? The @exploratorium will be open for business! http://t.co/i2Hhj2esI2", "The Saturday-in-the-Park McLaren free concert series is back w/ new talent to showcase! The next performance is 8/29: http://t.co/MA31CAcfxA", "A brief history and description of the Port's Mission Rock area: http://t.co/z0pXUNX8xB", "Join the EcoCenter at Heron's Head Park on 8/22 for an interpretive walk along the SF waterfront: http://t.co/mppC6hBBfd #sciencesaturday", "RT @CREW_SF: Congrats on San Diego Port's new (1st female) CEO! http://t.co/dl9qLM9fSr @CREW_SD @SFPort http://t.co/66wcvOUdaS", "The #SFPort participated in the California Senate Committee on Ports and Goods Movement hearing: http://t.co/4fV3rJ4Zwb", "Two Matson Line passenger ships docked at Pier 35 in 1957-- #ThrowbackThursday #sfpubliclibrary #blackandwhite http://t.co/3NmgfxgYaI", "The Super Bowl 50 Host Committee is accepting applications for volunteers to serve in a variety of roles: http://t.co/AxIxTsJMQi #SB50", "The 2015 NFL Kick-off Concert is coming to Justin Herman Plaza on Sept 10th. Oh, and it's free! #SuperBowl50 http://t.co/nup8KxEWxo", "#PeopleAtThePort RT @may32019366: Gate B Port Of San Francisco #OTWOLArrival http://t.co/U4OocO0Ngx", "San Francisco Street Food Festival is back with a new home at Pier 70 - AXS http://t.co/qYk8DJCMMC", "Join us 8/12 as we review ways to address travel demands thru SoMa, Mission Bay &amp; Central Waterfront neighborhoods. http://t.co/cLs35OdW5E", "The Ferry Plaza Wine Merchant @FPWM is a great place to explore (and taste) hand-picked wines from around the world. #WineWednesday #WineBar", "Movie buff? Martime fan? Join us at the Port for @SFMaritimeNPS's upcoming Floating Films series at Hyde Street Pier: http://t.co/hL023lc3gh", "Embarcadero Sunset by Lumos.photoSF #happymonday https://t.co/ohteciWYXS", "Interested in working in government? The port has several new job opportunities open on our job board: http://t.co/nwbqtXzxyE", "Today marks the launch of the E-Line which runs from Caltrain Station to Fisherman's Wharf! 1st rides start 8/1. http://t.co/ebxHySnT8o", "Due to the BART closure, @tidelinesf is offering $15 round trip from Berkeley Marina to Pier 1.5. Use code swyft812 - http://t.co/B4YBrxmT9D", "On 7/31 at 10:45am, SFMTA will announce the launch of the E-Embarcadero weekend line on the Embarcadero Track (Between Mission &amp; Howard).", "Commute across the Bay? @tidelinesf is asking people to fill out a survey so it can develop more commuter routes: http://t.co/PndrgoH539", "@Salesforce helps bring nature back to the Pier 94 habitat restoration site: http://t.co/Qa6Z5ZKVuV Shared via Golden Gate Audubon Society", "RT @PIER39: Mondays... #sealions #sf http://t.co/iD9X1OSCs9", "The Port has new job openings in numerous divisions. Learn more on our job opportunities page --&gt; http://t.co/wihMG7PcJ4 #AnchorYourCareer", "Experience amazing views of the SF waterfront w/ professional guides at the Heron's Head Park Trail Walk on 7/26. http://t.co/qg3Wyfkcaj", "Yesterday,we hosted a community workshop for design guidelines for an upcoming developer RFP at Seawall Lot 322-1 http://t.co/0KB9XbgLo1", "BART is holding an online townhall meeting on July 28th to answer questions about the planned transbay shutdown: http://t.co/QdiP9iwVzn", "Join @SFPDCentral for their Nat'l Night Out event on Tues, Aug 4th at 680 Filbert St. Festivities begin at 5pm! http://t.co/i4XL7fiP6u", "RT @Work4SF: The Port of San Francisco is Hiring a Grants and Budget Analyst.\n\nhttp://t.co/dgiTS6DYAq http://t.co/TX5tGK3FlJ", "RT @Work4SF: The Port of San Francisco is Hiring an Assistant Deputy Director of Development.\nhttp://t.co/jChXCpZeuC http://t.co/QsnfzlA3W0", "Art Exhibit On Free Speech Coming To Harry Bridges Plaza | Hoodline http://t.co/St6faYfFOF", "RT @SFGovTV: Port Commission LIVEstreamed on http://t.co/btMuESu1Dm at 3:15pm @sfport\nhttp://t.co/IWjPtz2yJ0", "Nearly 5,500 came out to attend the @SFSymphony waterside concert at Pier 27! http://t.co/wsGGI4yW03", "The #SFPort will be at #SundayStreetsSF in the Tenderloin this Sunday from 11am-4pm. Stop by our booth! http://t.co/IAgtWP5vZh", "Reminder: The @SFSymphony is holding a FREE waterside concert at Pier 27 this Sun featuring guitarist Bryce Dessner. http://t.co/mLho1zEkiV", "An affordable housing development at Pier 29 was one of the topics discussed at Wednesday's NEWAG Meeting at Pier 1. http://t.co/snKIHyTGBJ", "The Embarcadero was recognized by Metro Jacksonville as one of the country's most successful urban waterfronts: http://t.co/pcimCRjOEy", "In honor of 100 years of history, San Francisco City Hall is holding centennial tours every 3rd Sun beginning 7/19: http://t.co/CuGpwtbUFQ", "Want to receive updates on the Waterfront Plan Update process? Join our mailing list to stay current: http://t.co/aq47AZ8bmS #YourSFPort", "Still unsure what to do this weekend? We have a list of #4thofJuly events taking place along the waterfront: http://t.co/5d7e6wsLPN", "A little #throwbackthursday for you: Ferry Building circa 1913 #tbt #sfport http://t.co/wbHBB5yvaL", "Stay, play and dine - Check out the wonders of the historic San Francisco waterfront -- http://t.co/Oy0NFkl225", "Join us at the #SFPort for a free San Francisco Symphony Concert at the Pier 27 Cruise Terminal Plaza on July 12th: http://t.co/iKU045xpzl", "Celebrate the 4th of July at @TheWharfSF and enjoy a spectacular fireworks show over the SF Bay! http://t.co/NBzAtUhUnJ #4thAtTheWharf", "Alioto's Waterside Cafe, located at @TheWharfSF, is now serving delicious (and reasonably priced) breakfast items! http://t.co/L93CPNVkR8", "Bird enthusiast? Heron's Head Park at the #SFPort offers scenic views and is an amazing birding hotspot! --  http://t.co/ZPE2ZBVuS6", "RT @HoodlineSF: .@SFPort Seeks Volunteers For Waterfront Land Use Plan Groups: http://t.co/V35jgPdGKq by @gerikoeppel http://t.co/GaY8P678ct", "The SF Port marched in the San Francisco Pride parade this past weekend! #sfpride #lovewins #sfpride2015 https://t.co/JDxjW1S2iF", "RT @SFAC: #BayviewRise named best public artwork in USA http://t.co/dWukcJUqw9 .@MaliaCohen .@SFPort .@TomDeCaigny http://t.co/YlSPUdw01T", "The #SFPort Softball Team had a blast at the Mae Louise Mays 26th Annual SFFYF Softball Tourney this past weekend! http://t.co/xB4JmU1vZP", "The Barbary Coast Neighborhood Association's annual meeting is Sunday, 6/28 at II Fornaio, and open to the public --  http://t.co/xgGJTFWoru", "We're so flattered! RT @lifeboatcoffee: Skipper enjoying all-new Port of San Francisco - C'est Manufique! http://t.co/6KQyBfHyRX", "@achille A portion of Rincon Park is closed due to an event for the US Conference of Mayors. The northern portion still open to the public.", "Do you like the SOMA art at Pier 14? Or kayaking in the Bay? Provide your input and suggestions for Port land use: http://t.co/AOHAAMwv3O", "On 6/17, the BBC Greenland uploaded a remarkable 760,000-pound reel of electrical cable onto a barge at Pier 80: http://t.co/icb8LHZjrr", "Congratulations Warriors! Confetti &amp; fans line the streets of Oakland for the #WarriorsParade! http://t.co/mwnqL9wX8l http://t.co/t3DhoTMEnH", "Discover the history behind the Land Use Plan in this report chronicling the changes along the Port from 1997-2014: http://t.co/jwwwmdfeok", "Rep Nancy Pelosi spoke on the House floor regarding the passing of San Francisco civil rights leader, LeRoy King: http://t.co/0ikR0twtUh", "Port news alert: Mission Rock Initiative Receives Unanimous Support from the Members of SF Board of Supervisors: http://t.co/6VtjeLFCjR", "Mayor Lee stopped by Harry Bridges Plaza today to view the SFMTA showcase of the new Siemens light rail vehicle. http://t.co/kN8LooU29L", "RT @david_landis: Bravo to @SFPort (clieint) for creating new #SF waterfront open space: http://t.co/KJMdnEGDpr via @SFExaminer", "Julie Christensen met w/ community reps &amp; Port staff to announce $1.7mil for Jefferson St. Renovation at @TheWharfSF http://t.co/9wxFopKKbz", "Ever wonder what it's like to complete a maze in total darkness? Find out at the @exploratorium's, Tactile Dome: http://t.co/xL9n7YmhBu", "Happening Now! --&gt; Embarcadero Center Hosting Health &amp; Wellness Fair from 11am-2Pm http://t.co/jovk4LLpuF", "Save the date (July 1, 2015) for the ADA Month Kick-Off Celebration taking place at San Francisco City Hall! http://t.co/NAt5GEGfx4", "Enjoy beautiful waterfront views on the new 'Barnacle Benches' at Piers 9 -15. Don't forget to take a selfie! -- http://t.co/6zFou7aUNk", "And we need it! RT @sanfranmag: It can't be. No, it is. It's...it's...it's...raining!!! http://t.co/uXbNXHRoKd", "Want information on events, waterfront planning &amp; upcoming meetings? Join the Port mailing list to stay in-the-know: http://t.co/whsp8YvuG0", "This year, @SFCity_Hall turns 100! Join the centennial celebration on 6/19 at Civic Center Plaza from 6pm-11pm. http://t.co/3j3Ymr6Yhp", "Cruise enthusiasts, check out this @CruiseIndustry infographic to learn the past, present &amp; future of the industry. http://t.co/3XUwjusCcG", "Do you enjoy biking, running or boating along the waterfront? Become a part of the waterfront development process: http://t.co/OW1MaYO0oc", "Fleet Week returns to the #SFPort on October 6th. Join us as we give thanks to the men &amp; women who serve our country! http://t.co/HCHpjkmWsX", "RT @TrippyFood: Historic ships at #HydeStreetPier in #SanFrancisco @SFPort #travel https://t.co/yImL5fDUKm", "Port Executive Director Monique Moyer kicks off today's simulated earthquake emergency exercise. http://t.co/TOyzkSKpMb", "What was once a one-time Ferry Plaza Harvest Market has lasted 20 years! -- SF's Ferry Plaza Farmers Market Turns 20: http://t.co/RIao4nBiZZ", "Port of San Francisco to Hold Full-Scale Earthquake Emergency Exercise\nSimulating a Regional Disaster on Thurs, 6/4: http://t.co/ma0mHsDXWC", "RT @Oobie_Nubie: We are ready to be saved by @TheRock #SFPORT #SFDEM @SF72org #sanandreasmovie #SF http://t.co/FHiH5iLsdh", "Tideline Marine Group is rebranding their cross-bay water taxi service as Tideline Water Taxi. See the Bay-in-a-Day! http://t.co/VJnaO4sUXo", "Happy 78th Anniversary! RT @saveSFbay: #GoldenGateBridge, gatekeeper of our Bay waters for 78 years and counting! http://t.co/2a12X1SKsi", "There's still time! RT @SFist: Red's Java House turns 60 today, so until 3 p.m., they're reverting to 1955 prices http://t.co/gMeAraSHf8", "10 of the Most Stunning Ports of Call in the World: http://t.co/96H8WkgaYe", "Happening now! Port of San San Francisco Commission meeting! http://t.co/hR1r7d6DB9", "RT @SFGovTV: Port Commission LIVEstreamed on http://t.co/btMuESu1Dm at 3:15pm http://t.co/bHtcOejPfW @sfport", "Take a look at the artwork proposals for the Bayview Gateway Public Art Project and submit your public comments: http://t.co/Q7cvM4AtSU", "RT @SFGiantsFans: #SFGIANTS WIN!", "Q6: We find that none of the waterfront amenities are overrated at all. We cannot say the same for Lombard Street ;-) #TravelSkills", "Q4: Who needs a hotel when you can stay in a Dreamboat...on the waterfront!? http://t.co/Rz5PAF50QW #TravelSkills #CelebrityCruiseShip", "A2: Experience sea-side views of the San Francisco waterfront on a ferry or water taxi! http://t.co/1yooRHp8wh #TravelSkills", "Construction Has Begun On New Ferry Building Kiosks | Hoodline http://t.co/I98USZamh7", "RT @PIER39: PIER 39 and our neighbors are currently experiencing a power outage. Please check back for updates.", "Historic listing of the merchant ships arriving at the Port of San Francisco from 1846-1890s! #USHistory #sfport http://t.co/QIC9dRncPC", "Join SFSOUL for a shuttle tour honoring the achievements of Capt. William Alexander Leidesdorff on Monday, 5/18. http://t.co/AyeeJehTNe", "RT @SFCity_Hall: That's right, YOUR San Francisco City Hall was just certified LEED Platinum! http://t.co/z1y5fsDac4", "RT @CUESA: Hey, bike-to-workers! Stop by the @SFFerryBuilding + farmers market to fuel up: http://t.co/hImsurSgS9 #biketoworkday2015 @sfbike", "RT @CREW_SF: Thx to all @CREW_SF sponsors &amp; @SFPort for today's special panel! http://t.co/7cYxZcYzMt", "The Port of San Francisco is now on Instagram! You can follow our updates under the username \"SF_Port\" -- http://t.co/bxGn9tYfCn #SFPort", "More Ships Coming In: May Is The Major Month For Cruises | Hoodline http://t.co/kJcgGUwxsb", "Port News : Pier 80 Receives Cargo for PG&amp;E's Substation Upgrade Project http://t.co/VFMgqwgwWI", "This is beautiful! RT @PiFiZone: RT TravelsPhoto \"Port of San Francisco by heyengel via 500px #travel #photography http://t.co/CYk3YBbPVc\"", "Teatro ZinZanni makes plans to return to the SF waterfront at Seawall Lots 3243 &amp; 324 with a new hotel development: http://t.co/XMopXGOBIH", "RT @SFGiantsFans: #SayHEY! Happy Birthday Willie Mays! #SFGiants", "Giants add affordable housing, shorten heights in building plan for Mission Rock - SFGate http://t.co/f9XrnZAlYI", "Port Executive Director Monique Moyer exchanges gifts with Capt. Shigetoshi Kai of the Japanese ship, Kaiwo Maru. http://t.co/AQnLIbVdBx", "Today, the Mayor's Office announced major investments to the @sfmta_muni budget to improve performance &amp; reliability: http://t.co/o8HjpaMJEi", "RT @SFFerryBuilding: May the Fourth be with you!", "The Pier 1 audio &amp; visual exhibition of The Great Earthquake of '06 is being extended until 5/8! It's a must-see! http://t.co/KgGgp4sobZ", "These are excellent! RT@DevelopingTank: Old Bascule Drawbridges of San Francisco http://t.co/rDMrNv6Vkb @SFPort", "RT @KarlTheFog: HEAT WARNING: temps will reach high 70s in SF today, residents are encouraged to wear the only \"summer outfit\" they own", "For @sfgiantsfans headed to the game, consider a roundtrip loop on a @tidelinesf water taxi: http://t.co/3pQEHlpg32 #NoTraffic #Oceanviews", "Up close shots of the Golden Princess receiving repair at Pier 70. She completes her 14-day dry docking tomorrow! http://t.co/yJR6LBo76Q", "What a sight! RT @gerikoeppel: Double cruise ships at piers 35 &amp;amp; 27 today! @SFPort http://t.co/VWXYaU1tlN", "Port planner Dan Hodapp explains the improvements being made to accommodate the crazy traffic near Pier 27: http://t.co/K3sKqhJvXT", "City &amp; County of San Francisco and the Port of SF File Lawsuit Against Sinbad's Restaurant at Pier 2: http://t.co/WznYbf5Hg8", "RT @SFGiants: The #SFGiants score off a single by @BBelt in the bottom of the 6th The score is now 2-1. #BeatLA", "Where will the Super Bowl 50 fan village be located next year? Right along the Port of San Francisco! #SuperBowlCity http://t.co/WWSgxe4Trd", "RT @AreYouEVReady: New Charging Stations Let Electric Cars Run On Sunshine #drivingonsunshine #sfenvironment #sfport http://t.co/EbFnov9g0b", "Happy #Earthday! Contribute to the Port's environmental stewardship by joining a Waterfront Advisory Committee. http://t.co/Wtxhd7v17B", "Beautiful shot of the docked Golden Princess cruise ship with a backdrop of post-Giants game fireworks! http://t.co/fyM0V64pcF", "The Wonders of the Historic San Francisco Waterfront - Jetset Extra http://t.co/1gokXe6Way", "The Bethlehem Shipyard Museum has an exhibit on the 1906 Earthquake in the lobby of the SF Port building thru 4/24: http://t.co/VP9BPUvm40", "Join us for the Waterfront Transportation Assessment Community Meeting on 5/13 to determine ways to improve transit. http://t.co/dfX5qEIlz3", "@andrewjfaulkner Thank you for bringing this to our attention. This info will be sent to our plumbing and maintenance staff.", "The SF Waterfront offers some of the best views in the City! - 10 Best Waterside Restaurant Reviews: http://t.co/2iYAp2lKNC", "We're not disagreeing with that! RT @sheenaniganz: @ATTSeagull @SFPort @SFFerryBuilding i thought seagulls just went whereever they wanted?", "Headed to the Goat Festival at @SFFerryBuilding tomorrow? Cover your basics w/ this #Goatchella Survival Guide: http://t.co/SqgWfEdSh7", "RT @SeatradeInsider: .@SFPort &amp; BAE Systems forge new 20-year ship repair lease; yard is competitive in #cruise biz http://t.co/iHrKP8kyzA", "There's only so much you can say in 140 characters, so like our page on Facebook too: http://t.co/lNJ5fSJkdM #SFPort", "The SF Waterfront Land Use Plan is ready to be updated! Got something to say? Submit your feedback and ideas: http://t.co/gQSn76tbMz", "@berkeleyCERT We weren't provided a link, but if we get one, we'll tweet. You can find a few more details on our FB: http://t.co/up6KeqewnJ", "History buff? An audio &amp; visual exhibition of The Great SF Earthquake of 1906 is happening 4/18 at @sfferrybuilding, 2nd floor from 10-2.", "Over the last 18 years, the waterfront has undergone many improvements. Use this interactive tool to see what's next: http://t.co/T6LJwb4cJp", "Play bocce ball? The Ferry Bocce League has 56 teams that play weeknights directly across from the Ferry Building: http://t.co/wZTy0SQR5x", "RT @NY4P: Dan Hodapp of @SFPort led a fascinating tour of 3 miles of #waterfront SF this morning. #greatergreener http://t.co/eEChPtgIvm", "What beautiful imagery! \"'High Water Line' provides a unique perspective on San Francisco\" - SFGate http://t.co/3n8O8mHTAC", "RT @exploratorium: All along the waterfront... #ExploPier15 Instagram Contest: http://t.co/zLIHgEmb5t http://t.co/hlmbfUxDAR", "Yes, they're really awesome! \"Secretly Awesome: The Bay's Tideline Water Taxi\" | Hoodline http://t.co/8lD54MZlXV", "Looking for a fun way to spend time with your family? Join the EcoCenter for Science Saturdays at Heron's Head Park! http://t.co/kXNrP2Mhvj", "RT @SafeStreetsSF: Today is Walk to Work Day! Remember, there's people walking everyday. http://t.co/WUxmClx5vV", "For your viewing pleasure: Video of the James Herman Memorial Opening (Pier 27) - YouTube http://t.co/pIadhL0AlH", "The SFPort staff provided @SenatorCarper (3rd from right) w/ a tour of the waterfront thanks to Tideline water taxi. http://t.co/4C4fQ97QfH", "Our very own Dave Rauenbuehler chronicles the #SFPort with stunning photographs. Learn more about his work: http://t.co/tV92Rjt8Tc", "Beautiful! We love #SFPort pics! RT @kyletait: Top of the morning. @ Port of San Francisco http://t.co/KtAyvI9ILQ", "Miss today's Ferry Plaza Farmer's Market? You can also catch the market on Thursdays &amp; Saturdays, rain or shine! http://t.co/5bze9IyXIg", "Recreational salmon fishing season has begun and fishermen located along the SF waterfront are jumping in!| Hoodline http://t.co/1O0HfFNP0S", "Take a look at the incredible work that went into creating the #BayviewRising Mural (Pier 92). What amazing artists! http://t.co/e6TBgd7N5z", "Wow! Amazing! RT @VeryOldPics: Hundreds of boats sit abandoned in the port of San Francisco after gold rush, 1850 http://t.co/bYvagjuvQB", "Dear fans of the waterfront--&gt; More Public Space Now Open On #Pier29 | Hoodline http://t.co/XR47MKwWRJ", "RT @PIER39: @PrincessCruises Welcome to San Francisco! Stop by the Welcome Center for a free Fun Pack w/ discounts &amp; coupons #CrownPrincess", "Planning on travelling around the Bay this Easter Weekend? Avoid Bay Area traffic by taking a water taxi! http://t.co/qPJTInZlls", "No room at the inn: S.F. hotel shortage pushes Dreamforce attendees onto a cruise ship - San Francisco Business Times http://t.co/WMYAVwiHPx", "The #SFPort will have an information booth at the next #SundayStreets event on 4/12. Stop by and say hi! http://t.co/aTOLAtMOjP", "Check out SFMTA's transit impacts for this Easter Weekend (Apr 2-5, 2015). Some impacts affect the Embarcadero. http://t.co/ViF956XJL7", "@PrincessCruises hosted a plaque exchange ceremony on board Ruby Princess at the Port of SF -- http://t.co/2k6Z15n0by #maidencall #Pier27", "National Park Service looks for long-term home for Alcatraz ferry | http://t.co/i0r7ubwvEd http://t.co/v9Lr3BRdfd", "Yes! Did you miss us? ;-) RT @TheWharfSF: @SFPort Hey! We know you :)", "RT @SFBusinessTimes: S.F.'s cruise ship comes in with gleaming new Pier 27 terminal http://t.co/9ckyV8VnFI @SFPort http://t.co/vzyCChiiM9", "Kojima Japanese coast guard ship in San Francisco  Monique and Captain Mitsuya http://t.co/CX1SvaYuDF", "Looking to lease a #retail space along the #sf waterfront? http://t.co/c0MvU93QSM", "Another Call for #Artists: Market Street Project #sf http://t.co/MClRAJXofg #artmarketsanfrancisco", "Dear Artists, apply for the #art #rfp for Moscone Expansion Project in #sf http://t.co/JSIQ66h5IO", "Expect early morning traffic delays Sunday on the #embarcardero http://t.co/GvxU3AlGsj http://t.co/73xJ6e5uFT", "Hey #marketing #media #PR consultants apply to this: http://t.co/3kc4eWgeoK", "Deadline for #art proposals today at 5 pm http://t.co/QSjuMtySLz", "Sunday Streets San Francisco  is in the Bayview/Dogpatch this weekend! http://t.co/V2Xin6gc0x", "Learn about Sustainable Seafood with the Fisherman's Wharf CBD. Sign up today! http://t.co/TvOtQjlB1m", "Looking to #lease #retail space along the #SF waterfront? http://t.co/UEUFf4fNm6", "RT @CBSSF: Remains of deadly 1888 SF Bay shipwreck located http://t.co/65fU7T3Cbn", "There's an amazing historical ship wreck under the Golden Gate Bridge! http://t.co/6utJfwptPZ", "Hey artists, apply to this! BAYVIEW GATEWAY PUBLIC ART PROPOSALS http://t.co/jtMkPkfEon", "Want to take a tour of an awesome Coast Guard vessel? Check out Coast Guard Appreciation day PIER 39 http://t.co/p0COBHwYny", "Pick Your Port http://t.co/H2NiFz1iBA", "@mlroach @KezarSoze Regarding the #Maritol? We are still working with getting them compliant with local and state law.", "@jashsf @SF311 Were there any changes on this? I would recommend calling 311 or using their app if nothing has happened.", "@KezarSoze @mlroach @ptraughber SF voters passed Prop H (1990) restricting housing/hotels along the waterfront. http://t.co/BnvcXETjfa", "@jashsf @SF311  Thanks for mentioning it! 311 will report to us if it's in our jurisdiction.", "RT @SFGovTV: Port Commission LIVE streamed today at 3pm on http://t.co/1YC85NwqxD  @sfport", "Attention Ferry Commuters!... http://t.co/xRVPvsM38h", "@thundt We're sorry you had a bad experience. Send us a direct message to let us know what happened.", "Curious where to eat along the waterfront? http://t.co/NpJio2k13u And lots more http://t.co/dFGHPkJjYv\nFarmer's... http://t.co/OCRSWzu0Ml", "Pretty amazing! Good work Xavier and the Make-A-Wish foundation. http://t.co/sc4JrHMP0r", "#balboa #bart is back open still delays  in #sf", "RT @SF_emergency: Avoid the are of 4th Street and China Basin due to a fire.", "Awesome #film festival this year @AquariumOTheBay #sf", "Also,@SFMTA_SFpark, might be able to help with taxis in bike lanes. Ideas? @apthornley @zabethsue @ku1313 @kainotkyle  @printtemps", "We are serious about bike safety and will look into what we can do. @apthornley @SFPD", "Tourism and Hospitality Job Fair March 22nd! http://t.co/ZGSQlEB2Fk http://t.co/dmXSMqwtAg", "#Greenagers application now open. Deadline March 28th 5pm! @SFUnified http://t.co/Ug7o6vx2rm #students #green #jobs #sf #internship", "This just in. Fresh swordfish caught 1000 miles offshore between here and Hawaii. http://t.co/30i0n06Yjq", "Check it out! http://t.co/V7M3cwAqN0 #Bayviewrise", "Great #bayviewrise event at Pier 92! Photos compliments of Dave Rauenbuehler http://t.co/IyscssQUbW", "I posted a new photo to Facebook http://t.co/CshD6TSA74", "I posted a new photo to Facebook http://t.co/topEIOC9L5", "We're very saddened by Bush Man's passing. We really appreciate all the characters that make SF's waterfront unique! #RIPBushman", "Have you seen this?http://t.co/ri3jP87cSx @sfmuralarts #bayviewrise #bayview #sf http://t.co/yjqxZKWTLk", "It'll be rainy, but we hope you still come check out the lighting tonight! 5:30 pm at Cargo Way and Third Street,... http://t.co/KLCl3hnjyX", "Awesome! @SFGate http://t.co/HT5EJeqKNG #Bayviewrise #Bayview #SF #Art http://t.co/ri3jP87cSx #haddaddrugan", "Spread the word about our newest public artwork #Bayviewrise http://t.co/ri3jP87cSx @deyoungmuseum @calacademy @Jewseum @strangerslog", "Have you seen our #Bayviewrise interactive #art? http://t.co/JnhPiieQgz http://t.co/ri3jP87cSx @SFist @SFMOMA @SPUR_Urbanist @SFWeekly", "On Feb. 26th at 5:30 pm join us for an amazing lighting ceremony for our newest illuminated mural #Bayviewrise... http://t.co/mQ8RdU05DD", "@StreetArtSF This project is almost done! We will be having an opening on Feb 26th to light it up! #SFPort http://t.co/bgWTRMdKZL", "Need a break? Come watch the carefree sea lions at Pier 39 and check out their new Sea Lion Center.... http://t.co/h5LaSwc5K1", "@RecParkSF Send our congrats and thanks to the Greenagers Class of 2014! What a great group!", "Check out the brand new SF Bay Railroad baby goats here at the Port.", "I posted a new photo to Facebook http://t.co/jmSJ3Qpbkd", "I posted a new photo to Facebook http://t.co/gygXsBzrna", "I posted a new photo to Facebook http://t.co/vCx9dBhJmQ", "@kleankanteen We have a plastic bottle ban for all City offices. @sfbos will be considering it late Jan/early Feb. http://t.co/7doNfns1o1", "Be part of the Port's 150th Anniversary with the Cruise Terminal Legacy Program http://t.co/foiB5aPRhU http://t.co/wpu40Gfo7s", "#Holiday Prep has officially started! http://t.co/ZJMCDhEAj8", "Check out @mayoredlee &amp;  Lou Seal's Video for the @SF311 App http://t.co/rY7GYs1MBZ This app is awesome!", "Prepping for an Emergency: Divers Inspect Piers Following a Simulated Catastrophic Earthquake http://t.co/MrnBol4092", "RT @SFAC: Deadline extended for the Bayview Gateway Public Art Project  http://t.co/WuXxL2V9Dj", "RT @SFMOCI: Share your tech skills with seniors! Volunteering opportunities to help bridge the #DigitalDivide http://t.co/dWW6Av0Bmn @sfciti", "We have a new bid opportunity #rfp http://t.co/YAwHgkBtkv", "Bugs the bulldog is out with us  today, come on by http://t.co/M5MUwS79qQ", "#WharfFest is this Sat/Sun 11-6pm come check it out @mayoredlee @DavidChiu #SanFrancisco #Events http://t.co/bY49b0LZcT", "RT @portofsandiego: CAPA Recognizes #LGBT Group in Ceremony at Port of #SanDiego http://t.co/bSCyTS07NP #diversity #ports", "Street closures on the Embarcadero this Sunday @sfmta_muni @511SFBay @streetsblogsf @sfgov http://t.co/VaSTLU5YR8 http://t.co/CoW8LKL8Zf", "Join @mayoredlee @maliacohen @sfdpw tomorrow morning 9-12 to clean and green #sf district 10! http://t.co/dl3ugmYew1 http://t.co/s6PlpKrtco", "I posted 20 photos on Facebook in the album \"America's Cup\" http://t.co/EPN8w4IQkK", "@OracleTeamUSA What a crowd! What a team! Congrats.", "Happy 35th Birthday @Pier39! Looking forward to the music, fireworks, and all the great deals. http://t.co/PxSdOt8tDc", "A-mazing and so very proud! @oracleteamusa @americascup #ThisistheAmericasCup", "Volunteers! Next Sat. come cleanup our coasts http://t.co/U2wRpZGAzT @cleanupday #Coastalcleanupday http://t.co/IptMJUhL5E", "Partial traffic lane closure this weekend on the Embarcadero. http://t.co/ILTVGmckqb", "Labor Day Plans? Join @ILWU for Labor Fest in SF at the #longshoremen's hall #free http://t.co/T99yW1kZjB @FreeFunSF @SEIU", "Next Monday is Labor Day! Join us for a 150th Anniversary event with the #ILWU http://t.co/rfiBal3GbH #sfport150 http://t.co/7vtzgE6ebW", "Very cool article! http://t.co/C9Q1mgd3rr #UrbanAirMarket", "Free Golden Gate Larkspur Ferry Ride? Let's go! http://t.co/fNL6j5QgB8 http://t.co/q3S21D4gjB", "Support our sailors! Join us Saturday for a fun event! http://t.co/tM8IkK3Zyx http://t.co/gyOw2qTBEd", "Hurray! Bay Area Association of Disabled Sailors  (BAADS) will take part in the AC OPEN! #BAADS @americascup #ACopen http://t.co/iCbfzmBKCO", "One of our favorite photos of the waterfront... http://t.co/JuHAnbMsYB", "We are selling some Port items! Check us out on Pinterest too. http://t.co/YmdxO8u7wb", "I posted 4 photos on Facebook in the album \"\" http://t.co/w9t7c6nrTr", "Looking good everyone! Thanks for celebrating the Brannan St. Wharf with us. @OtisRedding III @SupeJaneKim @DavidChiu http://t.co/x6GVwBblLw", "Excellent #brannanstreetwharf ribbon cutting today http://t.co/r0xr2R8N3C", "Please avoid the #SOMA Jewelry Mart now due to police activity", "Wonderful work at Pier 94! @ggaudubon http://t.co/ettKS1VMAO", "Great job training for 9th and 10th graders http://t.co/UVBxTm5a1t http://t.co/Cv4yf1ZYUq http://t.co/gf0GooNEAs", "Want to work at the Port? We have a Survey Associate Position open. http://t.co/7fmvx9c7wV #surveyors", "Jefferson Street Ribbon Cutting http://t.co/HjNkmWs5It", "Prepping the new Brannan Street Wharf http://t.co/VCGZP9RATu", "Our Excecutive Director won the Silver Cable Car Award! http://t.co/qsTOCH3csQ http://t.co/yYcKucQLOu", "Join the @sfdpw, @sfplanning, and @TheWharfSF for a special Jefferson Street Ribbon Cutting at 12 pm tomorrow.... http://t.co/MlToFkzjSo", "SF has a ton of art on the waterfront. This app will help you learn about it! http://t.co/pOGjpyZtx8", "Our labor made us what we are today! More fun events to come. Congrats @ILWU http://t.co/7gUx1joo48 #sfport150 http://t.co/o5QXZiOMWA", "Love historical images? Check out this amazing free event tonight. http://t.co/81VZegPeZC http://t.co/4BXRVPR3Pv", "We have some good resources about that on our website http://t.co/Ts5xfjfQd8 @exploratorium @noahfrito @iangogame @NOAAResearch", "Port Commission meeting starting in 15 minutes. Remember you can always watch online thanks to @SFGovTV  http://t.co/zDMRBIKlXd", "@americascup Everyone at the Port of San Francisco is deeply saddened by yesterday's events. We send our condolences.", "I posted 5 photos on Facebook in the album \"(wo)Manpower Boats\" http://t.co/2l9jDmMDAr", "Check out all the amazing people who make the Port what it is today! http://t.co/kcQRjrWMPj", "Thanks Blue and Gold for making such a great 150th Anniversary! @BGFleet http://t.co/xBmaqEmQ9M", "Thanks everyone for stopping by the Maritime Day events! If you took photos send them to us.", "@ronvinson Help us spread the word about the Port's 150th. Maritime Day is this Sunday! http://t.co/mj73XFUSpG #SFPort150", "Tons of discounts on Drinks and Food on Maritime Day! Download a list at http://t.co/aUCmns4eiq http://t.co/udE6AfkxgM", "Hurray! http://t.co/hDbREssRah", "http://t.co/IlRuibXZo3", "Today is the  Port of SF's official birthday! Meet us down at PIER 39 for our bday kickoff 11am #sfport150", "@Sfgov @mayoredlee @Pier39 @SFEnvironment @RecParkSF help us spread the word about our 150th #sfport150 http://t.co/foeCbjOIwK", "So excited for our new neighbors -your building is amazing! @exploratorium", "Special Port 150th Walking Tours on Apr. 28th! #sfport150 @SFCityGuides http://t.co/6RGy3zYNTq http://t.co/dTss26ycf7", "Check out our Maritime Day event list http://t.co/aUCmns4eiq #sfport150  Lots of free and family friendly events! http://t.co/x1Qi7nDjF6", "We've been busy getting ready for the Port's 150th #sfport150 \nThese interepretive pylons tell our story http://t.co/vcTz8Y0vLq", "@mizmay @DnomadB We are about to put the matching banners up this week. Keep an eye on the Embarcadero #sfport150", "@sfbike Can't wait for the Port 150th Anniversary History Ride\non #sfmaritimeday on Apr. 28th for the #sfport150 http://t.co/x70bx2oNiY", "#sfport150 We are counting down to our 150th birthday! Come celebrate #sfmaritimeday on April 28th! http://t.co/TVe9tXgays", "Awesome! http://t.co/sOfSJfxEu0", "Check those meters before you park! Meter rates and hours change. http://t.co/3P4cwYoMfd", "Vote for #SF in the @EHCityChallenge here: http://t.co/sIYWRJ6fym \n @SFEnvironment Thanks for leading the way! #greensf", "RT @SFParksAlliance: Great updates from @sfport http://t.co/C2pG31d8Gm aliging w/ #BlueGreenway. Check out Pier 70, Seawall Lot 337, NE  ...", "Beautiful Day for a Pier 27 Ribbon Cutting! http://t.co/T9e3KrdPek", "I posted 10 photos on Facebook in the album \"Pier 27 James R. Herman Cruise Terminal Ribbon Cutting\" http://t.co/eeuGBbxnFk", "Something Free! Next Wednesday at the SF Law Library is a great lunchtime speaker on the basics of trademark law http://t.co/9uP5I4DlTi", "The Port is very excited about Anchor Steam's new location! http://t.co/wXIV4kLJ", "This is a great tool for you entrepreneurs out there. http://t.co/Dxi9D6iv", "I posted 9 photos on Facebook in the album \"\" http://t.co/6jyhXITo", "The Port is very excited for the new Retro Flap Sign at the Ferry Building! http://t.co/wFdL6y9b", "http://t.co/SIvie4LO", "Twitter / alroker: With SF Mayor Ed Lee at the ... http://t.co/UrdDom0f", "It's a little ways out but... http://t.co/lvXI04kN", "Check us out. http://t.co/8ualbaPE", "We are super excited for the start of Dine About Town next Tuesday! http://t.co/k7FeqdYG", "http://t.co/iYc11CWd", "I posted 2 photos on Facebook in the album \"\" http://t.co/rtTs0PRz", "Today's Pier 43 Promenade ribbon cutting was a success! http://t.co/oPPvVhbr", "Join Mayor Ed Lee and the San Francisco Port Commission next Monday for a ribbon cutting at Pier 43! http://t.co/14iQbep6", "Pier 70 Sunrise http://t.co/FySROPVm", "Decking the halls! http://t.co/3PSxQAqB", "What could be better than eating for a good cause on the waterfront? http://t.co/qvoCIzgB", "Heron's Head Park Grand Opening http://t.co/hJfh28rD", "Rain or shine - we love our bike lanes! http://t.co/JRQXQ6Tg", "Expect delays around Stuart and Mission including Justin Herman Plaza and surrounding area. S.F.P.D. is removing a suspicious package.", "Our Super Bowl bid starts with you. Show your support and help bring Super Bowl 50 to the Bay! #SFSuperbowl", "Are you ready for this weekend? We are! http://t.co/9WYHfUBC", "Nice evening for a cruise... http://t.co/RzRIaNjh", "Water taxi time http://t.co/VaqyXpcp", "Come out and volunteer to clean up your coast this Saturday with us! http://t.co/DDRtlneo", "We are very excited about our new commissioner. Welcome William E. Adams to the Port Commission! http://t.co/QiYtNZmB", "We are so excited for the Sunday Streets Chinatown Ping Pong Tournament this Sunday! 11-4 p.m. http://t.co/vlqver88", "Let's get digital!\nhttp://t.co/tRm7x72o", "I posted a new photo to Facebook http://t.co/VAWzyjuS", "Pier 94's super cool kite photos! http://t.co/35lZ2jVT", "http://t.co/KDl19Ww1", "The Port of San Francisco extends its deepest condolences to the people of Japan and those who were affected by the earthquake and tsunami.", "The Port of San Francisco is a proud sponsor of the International Pow Wow 2011 http://fb.me/UuisY3Jr", "Pier 70 is due for a face lift! http://fb.me/zJptg4vL", "We've been selected to host the next America's Cup!! Happy New Year San Francisco! http://fb.me/EDeNa6vM", "Happy Holidays! And don't forget to come watch the fireworks this New Year's Eve on the waterfront at the stroke... http://fb.me/MK9y03GG", "Happy Holidays everyone! http://bit.ly/faufMO", "We are looking for a Property Manager! Please clink the link to apply! http://fb.me/Qw6qeBbO", "Congrats to @portofsandiego on the installation of their new #shorepower system!", "Calling all artists! The Port is working to improve its waterfront parks, and we are teaming up with the SF Arts... http://fb.me/Ise5AyRh", "Fisherman's Wharf wants to attract locals as well as tourists with revitalization plans:... http://fb.me/KUlsoOlv", "New jobs open at the Port! We are looking for two Principal Administrative Analysts. To apply, click the links... http://fb.me/N3OlpqVO", "Get into the holiday spirit with your favorite Disney friends this Sunday from 12-6 at Pier 39 for the Tree... http://fb.me/LIVlTbbz", "Come out to Justin Herman Plaza this Sunday and join 'Walk Tall for Life'! Check in starts at 8 am, and the walk... http://fb.me/JD56MiEi", "THEY DID IT!!!!", "What an amazing game! Way to go Giants!", "Tonight's meeting of the Southern Waterfront Advisory Committee has been rescheduled to Tuesday, Nov. 16th. [Go Giants!]", "One more time in case anyone missed it, here are the rules for boats in McCovey Cove! http://bit.ly/9hpEdO", "Planning on watching the game from McCovey Cove tomorrow in a kayak/canoe/raft? Read these safety guidelines first! http://on.fb.me/bjAjBo", "Port Commission meeting today at 3:15! Watch it online, or check out our archives:... http://fb.me/CCNtGowS", "The construction for the new Exploratorium at Piers 15 and 17 is underway! http://bit.ly/buuZH4", "ShakeOut! When the sirens go off at 10:21 today, that's your cue to join the quake drill and practice dropping, covering and holding on!", "SF open Studios this weekend, 11am - 6pm, at the Noonan Building #304, Pier 70. For info on the artists to be... http://fb.me/vtuE47Cw", "Water taxis coming soon! http://fb.me/x1Rsv6eu", "We are also looking for a great IS Intern! Come join the team at the Port of San Francisco! http://fb.me/wZ6K0GZT", "The Port is hiring! We are looking for a Senior IS Business Analyst. Apply through the link below! http://fb.me/vhLSRuJV", "Port Commission meeting today at 3:15! Watch it online, or check out our archives: http://fb.me/wNYIk131", "Hear that sound, San Francisco? Welcome to Fleet Week 2010! http://fb.me/IXRTFqYv", "Yesterday's unveiling of the SF Port's new shoreside power was a success! http://fb.me/IdMvqlU4", "Get ready for the largest Fleet Week celebration in over 20 years! It all starts tomorrow, when the Blue Angels... http://fb.me/wvlAdjql", "Michael Nerney checks in with an update on Mayor Gavin Newsom's inauguration of shoreside power today at Pier 27! http://on.fb.me/cyXYl9", "RT @PrincessCruises: Island Princess helped debut shore power in San Francisco today. Our ships now \"plug in\" @ 4 ports to reduce emissi ...", "We can't wait to see what these developers come up with for the Pier 70 site! http://fb.me/KSmtmVUc", "AB 1199 passes, with another 'coincidental' message for Assemblyman Ammiano: \"you are welcome\" http://fb.me/HcSTGbre", "This 1920's three dimensional map of California is looking for a home! The only problem? It is \"as long as two... http://fb.me/uQv1ue7u", "A few good walk recommendations for a sunny day on the San Francisco shoreline! http://fb.me/JBTJa2u3", "The SF Chronicle provides a great America's Cup timeline. Check it out below [and keep those fingers crossed!] http://fb.me/KyET9YI1", "Water taxis potentially available by the end of the year! Flag one down for a quick trip to Marin, the East Bay or... http://fb.me/JzXFJf8u", "More Crystal Cruise stops planned for SF in 2011: http://fb.me/E8ZzzFgb", "Looking for a bright side in today's chilly weather? San Francisco's windy clime could work in our favor! http://fb.me/Dmh9XdJx", "If San Francisco wins its bid to host the next America's Cup, expect to see some exciting changes happening around... http://fb.me/HanCNGZ6", "Salmon Month kicks off today! Check out the festivities at the Aquarium of the Bay: http://fb.me/wGS3Q5mW", "We've got big plans for Pier 70! http://fb.me/B1nS2VKQ", "I posted 9 photos on Facebook in the album \"Pier 70 Redevelopment\" http://fb.me/ET2mwy4y", "This Sept. 11-12, join the SF Brewers Guild for their annual Brews on the Bay, on the SS. Jeremiah O'Brian at Pier 45! http://fb.me/EmM4ccRY", "Former Mayor Willie Brown ruminates on the potential effects of the America's Cup http://fb.me/HJtNIXGD", "Raise a toast to ferryboats! This August is the 40th anniversary of the first run of the Golden Gate Bridge... http://fb.me/Dr05EiaQ", "The Exploratorium plans for a 'net zero energy' building at Pier 15 in 2012! http://fb.me/Gc2tZVEh", "We are looking for developers to transform Pier 70! http://fb.me/GZGgcKGc"]}