{"TreanorSarah": ["Hi @KenSmithramos I am making a doc for @bbcworldservice on US/Mex trade. What is the best office contact for you? sarah.treanor@bbc.co.uk", "RT @zsk: 100 hours a month in overtime - what an awful pressure. Interesting story from @EdwinLane &amp; @TreanorSarah https://t.co/GlwHUcN2A1", "RT @janewakefield: @NoelSharkey Thanks Noel. And @TreanorSarah played a huge part in making it great!", "RT @wayne5540: Um... https://t.co/D0Jx40r5RL", "RT @Lucy_Worsley: Horrible day at work. Truly terrible. https://t.co/wdbTzij8XL", "RT @JenGlantz: The dance I do when someone cancels a meeting or a phone conference. https://t.co/e1wQINEkjQ", "Hi @ Miky_e would love to talk to you for @ bbcworldservice about streaming in Japan. My email is Sarah.treanor@bbc.co.uk many thanks", "RT @Brexitannia2017: The full enormity of Brexit was beginning to sink in with Edith . . . https://t.co/YnoL384Lki", "RT @Manglewood: Top 20 Things NO WOMAN Should Wear after 30 https://t.co/HMewYZ8a6c", "RT @Jatusmaximus: @zsk @TreanorSarah @cwnhitch very generous, thanks Zoe. We love working with you too!", "hi @JamesSurowiecki would love to interview you for @bbcworldservice on corporate boycotts. I'm on sarah.treanor@bbc.co.uk - many thanks", "RT @JoeMillerJr: My @bbcworldservice programme on corporate America vs Trump. Feat @kgittleson and hummus.  https://t.co/PUWppkYxye", "Hi @NickHanauer would love to interview you for @bbcworldservice  I'm on sarah.treanor@bbc.co.uk many thanks", "Hi @LaszloBock2718 would love to talk to you for @bbcworldservice I'm on sarah.treanor@bbc.co.uk if you're interested in chatting Trump", "Hi @jlmorone Would love to interview you for @bbcworldservice  - what's the best email? thanks very much", "@zsk @Pitt_Rivers wonderful time in such a special place", "RT @haveigotnews: Star Wars prequel to feature leather-clad heroine battling evil empire. https://t.co/hBljR4zxkU", "RT @TheEconomist: Our quote of the day is from English writer Samuel Johnson https://t.co/uU1qKLg7xC", "RT @JamesBlunt: If you thought 2016 was bad - I'm releasing an album in 2017.", "@amyegallo hi! it's sarah.treanor@bbc.co.uk - apologies if there was a typo!", "@zsk but I needed to talk!! Sorry! Actually just realised I'm in quiet coach too ;)", "Bravery. https://t.co/mB2S0Gk7TH", "RT @jonronson: Lovely, then ominous https://t.co/i9Ug4uOrGB", "RT @guardian: Vicenza: dark heart of Italy's banking crisis where locals have lost millions https://t.co/QkToMgNapL", "RT @LeadsomsTips: The naughty step isn't always an effective method of tackling poor behaviour #MumsKnowBest https://t.co/jjW2JgCuGB", "RT @InterestingLit: Roald Dahl was buried with chocolate, red wine, HB pencils, a power saw, and his snooker cues.", "RT @FitzMuseum_UK: #bringyourdogtoworkday Our Director, Tim Knox, with 18 year old Sponge - part of the Fitz family! https://t.co/FpQ95ZXvqo", "RT @BBCWorldatOne: \"No regrets\" for the woman behind a high heels rebellion. https://t.co/ifTR8EZPcp https://t.co/s9oQHdZg2H", "Thanks - so glad you enjoyed it! @bbcbaxter", "RT @bbclaurak: Corbyn also mentioned importance of free press in his speech ...just sayin", "Hi @bobbie_thoman would love to talk to you about student loans/Niagara for the BBC @bbcworldservice  I'm sarah.treanor@bbc.co.uk - thanks!", "@ACMayorDonGuard would like to get in touch for a BBC World Service interview. Who is the best contact? I'm sarah.treanor@bbc.co.uk? Thanks", "RT @FT: Here's how to set up an offshore company. Yes, we actually did it.\nhttps://t.co/ut5XG8REAC #PanamaPapers https://t.co/dhDiag7QIj", "Hi @thejasonmander - would like to talk to you for BBC world service could you email me your contacts? sarah.treanor@bbc.co.uk  thanks", "RT @ManuelaBBC: We heard it straight from the horse's mouth... https://t.co/YyFSICer40", "RT @NPGLondon: \"Take everything you like seriously, except yourselves\" Rudyard Kipling was born #onthisday in 1865 https://t.co/QE0IKVbNs5", "RT @camillalong: Favourite party dress code so far this season https://t.co/Jcfg23vDxd", "RT @ManuelaBBC: Business Daily on @bbcworldservice Live from the @Kilkenomics Festival w/@yanisvaroufakis @davidmcw https://t.co/lVxHt8PC9o", "RT @V_and_A: Don't forget to check your bonfire for prickly visitors tonight! #BonfireNight https://t.co/hbPFQdxAR5 https://t.co/OT7tY2R3l9", "RT @digitalspyfilm: Is this the worst movie extra in history? (You had one job) #Bond https://t.co/ixTeuPNvaW", "RT @Telegraph: More people have died by taking selfies this year than by shark attacks http://t.co/wghtFDLOvB http://t.co/8fwCxQX8m2", "BBC News - Bug-killing book pages clean murky drinking water http://t.co/laetzotOvr", "RT @louistheroux: \"I'm looking for Walter Palmer.\" http://t.co/g9dmF8lljM", "RT @Telegraph: \"Hunting is a coward's pastime,\" writes Sir Roger Moore http://t.co/xTnidRdwAy #CecilTheLion http://t.co/e3IMT37OUq", "@chefsalisbury @manuelabbc do get in touch! Sarah.treanor@bbc.co.uk", "RT @BBCWorld: How the size of the Greek debt compares with the money wiped off Chinese shares: http://t.co/jNrXoGXetV http://t.co/MozVMUKv2K", "thank you @zsk for being the best bitcoin-adventurer! http://t.co/yCUncgw46T xx", "so am i! It was a great subject and trip :) https://t.co/novs0GVw0j", "Proud of my \"impressionist\" eclairs - a brilliant course @ThymeAtSouthrop what a beautiful place- will return! http://t.co/o2IMYlXd3I", "Isle of Man in spring! Blustery! http://t.co/s872KRsuqr", "The fort of refuge! http://t.co/z7KZZjQheF", "RT @BBCTwo: We're hiring!\nApplication details to follow. http://t.co/aLKUVWoUjt", "Hello, I'm hoping to get in touch about a chat to the BBC World Service in Paris Weds or Thurs for Business Daily and @BBCr4today .Thanks!", "Woman orders cheese and biscuits at hotel - and gets this instead | via @Telegraph http://t.co/TWxUNmRmkk", "RT @BBCBusiness: \"My friends were eaten by crocodiles\" - The story of a Malawian elephant poacher on Business Daily: http://t.co/64F2DE6hyL", "RT @katywatson: My contribution to @bbcworldservice #BizDaily on energy subsidies across the world  http://t.co/GZN58o3S0f", "RT @BBCBusiness: Motor City for sale: Why is the post-bankruptcy #Detroit selling off land for $100 a piece? http://t.co/Hjce2z99wA", "RT @kgittleson: BBC World Service - Business Daily: A new beginning for Detroit  https://t.co/in2ZS40Avk", "There is nothing heroic about watching Isis's high-definition murder porn http://t.co/dC2pHOXA45", "But I love yellow roses, and lillies! BBC News - The perils of 'taboo' gifts http://t.co/9wEtVQXS3x", "Great read! \"Hilary Mantel on the TV Wolf Hall\" http://t.co/CoH7977Ta2", "RT @ManuelaBBC: @GCGodfrey @BBC @justbriohny programme will be available shortly as a podcast here: http://t.co/prcIoCcm9e #QE #ECB", "RT @GrizeldaG: It's the super-rich!\n@spectator http://t.co/nMc4v1toGH", "RT @BBCNewsUS: This dog regularly catches the bus to the park on its own http://t.co/0jOPPPLXeX http://t.co/S2sH2pLH0R", "RT @AnOtherMagazine: Venice, frozen. #AnOtherLoves ice http://t.co/e249fJDtK3", "@ManuelaBBC 100% non psychopathic ! Never in doubt! :)", "RT @Jatusmaximus: Are you a psychopath? Find out here http://t.co/IK2l3waOwV #bbcbusinessdaily", "Business Daily tomorrow with @ManuelaBBC will be a brilliant listen, as she asks: Am I a psychopath?! http://t.co/1f4AAjefCS", "RT @LDN: Paris last night #CharlieHebdo http://t.co/A0dFfVeXgO http://t.co/U9KRpunDiW", "RT @BBCWorld: France marks minute of silence for victims of #CharlieHebdo http://t.co/YkwO7nZxcb http://t.co/HK1sqKai84", "RT @Tommydessine: #CharlieHebdo http://t.co/GNh2ZAEArf", "Fascinating - beautifully shot too- BBC visits China's Xinjiang province - home of the Uighurs http://t.co/lHNnhPKy1s", "Fantastically interesting doc on CS Lewis from AN Wilson - on iplayer  http://t.co/PK89JEkkiF", "Why everyone really hates New Year's Eve - via @Telegraph http://t.co/z4tjAyv7hu", "@davelee I love visiting ny but it's not perfect and the constant \"we're the best\" stuff gets a bit dull after an hour!", "BBC News - How the fairytale of New York can become a nightmare http://t.co/TlswhN26gM", "Silicon Valley and whether we are still human... Biz Daily today  http://t.co/luWAYpPtYA", "BBC News - Christmas menus: Cuisine and calories through the ages http://t.co/wvAc1JSe3E", "BBC News - The twilight world of China's wild west http://t.co/aGyFzUAjy4", "India's yoga minster aims to reclaim practice from West - via @Telegraph http://t.co/IPA1k4eWHA", "RT @BBCBusiness: LISTEN: BizDaily: Bermuda's tax triangle http://t.co/k3rbwdVq15", "BBC News - Arthur the dog's tale of dogged determination http://t.co/96OXa5hAar", "RT @BBCBusiness: LISTEN: BizDaily: India's Ponzi rp-off http://t.co/bEvMiUwXBY", "BBC News - Smartphone use in restaurants prompts Craigslist rant http://t.co/39gnPdQyHf", "Lovely clip! \"BBC News - Humpback whales shock fishermen in Norway\" http://t.co/Ipf9RAqzha", "RT @BBCr4today: LISTEN: Shift work impairs cognitive performance. http://t.co/nS8se3VAS3", "RT @rebeccamarston: OMG! http://t.co/IiBsZAQfPI", "RT @guardian: Are you \"not happy\" or \"too happy\"? Take the Oxford Happiness Questionnaire http://t.co/wyARsFA0pk", "Benedict Cumberbatch on Sherlock's sexual prowess | via @Telegraph http://t.co/FuYDrXYEOK", "Lies damned lies and.... http://t.co/gReTNBOw7u", "Interesting tale! BBC News - Government to 'retire' some of its WW1 debt http://t.co/hBwII8nMmK", "Inflation or Deflation? explained the country music way http://t.co/AIM1WV0u1q via @YouTube", "The 10 greatest changes of the past 1,000 years http://t.co/R1CCDTwuCZ via @guardian", "RT @BBCBusiness: LISTEN: BizDaily: Iraq: The Economic Cost of Isis http://t.co/LgSlPZSwUf", "Woman receives rape threats after recording 10 hours of harassment in New York http://t.co/UpaN9qtGAq via @guardian", "Confessions of a white Oxbridge male - http://t.co/WYhOO6sWHI http://t.co/it8ETFir54 via @FT", "RT @Telegraph: Hogwarts for Muggles: Hotel offers #HarryPotter themed rooms in London http://t.co/CDtHhlW2ml http://t.co/uvsgcnjU52", "Very interesting read: BBC News - What's the appeal of a caliphate? http://t.co/f9CA32cv4K", "'Like a ghost train...better because the ghosts might actually beat you up' Night tube to be more terrifying than bus http://t.co/TxcJ5bsais", "RT @MaikenScott: This dog looks like Putin. Seriously. http://t.co/fn2CrPuPCW", "There are worse places I suppose.. \"US tourist locked inside London bookshop\" http://t.co/cZgcWtH2FS via @guardian", "RT @WhichNews: If average annual UK salaries had risen at the same rate as #energy prices (2003/13) they would be... http://t.co/uX9EiMn4pp", "Apple and Facebook just got darker: freezing female employees' eggs is anything but kind | via @Telegraph http://t.co/wLRBBGsaIa", "@kgittleson @bbcworldservice Kim! all your hard work! Biz Daily was delighted to have you on - and again soon please! x", "RT @FT: Free to read: Satya Nadella's bad karma over remarks on women's pay http://t.co/YDuoUZY042 http://t.co/ZtBzHl2wok", "Preview: When John met Johnny, 09/10/2014, Today - BBC Radio 4 http://t.co/xkhHZNn75v", "RT @maxkeiser: FTSE sell signal? http://t.co/JFWQSuLXAk", "Karl barbie. Amazing. http://t.co/DOL1RZfw7O", "RT @kgittleson: \"The gap between the haves and the have-nots globally is now at the same level as in the 1820s, the OECD said Thursday\"", "@lindyloumccann https://t.co/WCH04tjSMr it's the BEST \"mood music\" x", "RT @BBCBusiness: LISTEN: BizDaily: India: Toilets before Temples? http://t.co/O4qTLI5QZN", "RT @VanityFair: \"Boys Should Get Pregnant, Too\" @KarlLagerfeld stages a feminist rally at Chanel http://t.co/FvhXleNdKL", "RT @cntraveller: This beautiful, natural, Cornish lagoon is our #PoolOfTheDay http://t.co/yeUQOzfTl8 http://t.co/MkBqifMqxV", "BBC News - Ai Weiwei exhibit takes over Blenheim Palace http://t.co/wzi20GZF5z", "RT @cntraveller: #NorthernLights season has begun! They've been sighted in #FinnishLapland http://t.co/tnyVQQwJDW http://t.co/CDPe5tb13B", "RT @BBCBusiness: LISTEN: BizDaily: The World According to Peter Thiel http://t.co/OHTkjPo05o", "@FionaGraham Next week would be great. Weds or thurs ideal x", "@FionaGraham I got not a god. I swear predictive text gets worse!", "@FionaGraham It's not like a god my weeks muddled or anything and kind of forgot I was coming here.... (I did) drinks soon! Xx", "@ecmitson I know! Adds something to the day ;)", "Tomorrow's wedding is in the Venice church fearured in Indiana jones and the last crusade :)", "@Theothebald Well only when the helicopter is being serviced :)", "@Mantejd Thank you! Also got a lovely bag for 20 euros :) xx", "Venice speedboat selfie! Only way to arrive :) http://t.co/WPbXboSMwn", "Nowhere quite like it... http://t.co/EHORjcg5Ya", "Interesting listen if Alibaba is a bit of a mystery! Jack Ma, Profile - BBC Radio 4 http://t.co/QrejojynqF", "RT @VanityFair: Why is Benedict Cumberbatch posing as Colin Firth's lake-drenched Mr. Darcy? http://t.co/1F0KcFtLH9 http://t.co/jf6q7NjF9j", "reminded of Wes Anderson films listening to this https://t.co/9cTvKCfTKQ", "@spectator very good piece  @mollylguinness", "If I were king for a day, I would ban open-plan offices | Jeremy Paxman http://t.co/c8GSayinLJ", "http://t.co/c4jwKWSIxP", "RT @BBCWorldBiz: AUDIO: Avoiding business and office jargon http://t.co/7VFQxRsuyj", "@lindyloumccann All dinner should include edible flowers :)", "Wow - great pics! BBC News - Would you live in a house clinging to a cliff? http://t.co/9r3eLk55rb", "How to be Parisian? Move to Paris http://t.co/RMny9RYxA1 via @guardian", "I will do what the work screen tells me to! http://t.co/UCR5UmhSt9", "RT @katywatson: BBC News - The perils of being called Isis http://t.co/C72IOpp3I5", "I totally agree! BBC News - Ban puppy and kitten sales in pet shops - http://t.co/Vpdx8KWCCH", "Kasabian rehearsing at work! A live music treat for 10 mins http://t.co/hLkqE3T2OE", "RT @TheEconomist: In 1988, we ranked America as the best place to be born. Not any more http://t.co/70fewFaqLY http://t.co/NGywBt9FbK", "Gorgeous Oxford http://t.co/WkABsWC9PC", "Silly but fun for those of us who grew up with BBC's P&amp;P! Could Mr Darcy afford a stately home today?| via @Telegraph http://t.co/WVcXtHMjWV", "Surprised and very touched by the lovely comments from friends and colleagues on my feature. http://t.co/jMIcnQpJgk THANKS x", "A very interesting read http://t.co/0UAIksIw1B", "The \"clear morning\"...! http://t.co/VWFbATiLUW", "The outdoors... A geologist's dream! http://t.co/ZWR7Am71lv", "@katywatson Thanks Katy! :) it was a v beautiful place", "@MichaelDMillar Beautiful picture! Thanks for the praise :)", "@RamzanK Thanks for that :)", "James Foley and fellow freelancers: exploited by pared-back media outlets http://t.co/21jF9gfpSO", "@shanaz17 Hmmm let me think. Yes.", "http://t.co/8FT4PfUXg8", "V&amp;a party! Amazing venue! http://t.co/1BNucpqSDp", "BBC News - Ebola patients Kent Brantly and Nancy Writebol discharged http://t.co/vUHcKC7Qic", "Been mixing Norway prog (next Tuesday WS 8.30 GMT 1400 for the long version!) this is now stuck in brain https://t.co/86XAemUB7n", "There is nothing to be gained from looking at watching and sharing pictures of cruelty.", "@dominic_laurie @Reuters A distinct lack of respect here.", "RT @dominic_laurie: @Reuters please take that picture down -- that is horrible", "RT @JonahFisher: @Reuters Really poor editorial judgement here. Take the photo down.", "RT @JuliaHB1: @Reuters shame on you. Take down that photo.", "@FionaGraham Thanks! too kind... Sadly can't make D drinks - will be here for office toast though", "@FionaGraham hope it wasn't me :(", "RT @Telegraph: Video: 'It's not worth your life' - James Foley's warning to future journalists http://t.co/Cedp5IqHBu http://t.co/AHHBuewAL5", "RT @BBCBusiness: LISTEN: BizDaily: Eurozone crisis: a PIIGS health-check http://t.co/l1eckbyNsN", "RT @Telegraph: Journalist James Foley in Aleppo, Syria, in July 2012 http://t.co/RWWKdpWKez (Photo: Nicole Tung/AP) http://t.co/GuiKeICTg7", "So much heartbreaking news around today.", "RT @_Kate_Allen: London: less attractive to live in than Detroit http://t.co/HzIm2NShSs", "BBC News - A Point of view: Are we all suffering from consumption? http://t.co/GhJo3f2maj", "BBC News - EU sanctions prompt Russia to turn to Swiss cheese makers http://t.co/Z9aPy8D575", "RT @VFritzNews: Hats off to the youngest ever self made billionaire. She's made it in blood:  http://t.co/Qw5X1Cw4Tq", "Owen Jones: Bigger than Jesus | @MrSteerpike http://t.co/JHQ58QQnl8 via @spectator", "sad comment of the day (from me) \"I've just seen an office with wooden desks and WINDOWS\"! The envy....", "RT @guardian: Chechen leader 'has 1,000 wedding guests questioned after losing phone' http://t.co/yBI5ijJPYf", "RT @TweetVishala: Could I look any happier? @Bizrobertson @egoncossou1    #whoneedsfridaynights http://t.co/ICHgI3CpQC", "Interesting \"the very first task of a true statesman is to rectify the names\" Why do some country names have 'the'? http://t.co/zcsFZDAdfx", "Not a surprise to those of us from S Oxfordshire - The 62 areas where houses are less affordable than London http://t.co/gMcfL2SSJm", "RT @bbcworldservice: US public debt now stands at $17.5 trillion http://t.co/j8yx0BSjMX http://t.co/UPEuk3GVMZ", "On business daily- \"@bbcworldservice: US public debt now stands at $17.5 trillion http://t.co/CDBmjE9EZV http://t.co/vaei575vZc\"", "CEOs earning 143 times more than their company averages, new pay study reveals http://t.co/v4juvZQ71T", "@katywatson @KateMcGough Yes thanks Katy for doing all that extra for BD! :)", "BBC News - What does America have for breakfast? http://t.co/z3wrEUV4J2", "RT @BBCBusiness: LISTEN: BizDaily: Panama Canal - 100 Years On http://t.co/XRjp8JqkmC", "RT @BBCWorld: A hazardous gap remains in the world's longest road http://t.co/feP3iqMEtX #bbcgofigure http://t.co/3tv39443C4", "RT @guardian: A-level maths overtakes English as most popular subject http://t.co/Tyuz2k8mPY via @guardian", "Too sad!! BBC News - India lion cub leads guard to its mother's corpse http://t.co/0UKsaU57Az", "BBC News - John McAfee in surprise rant over Google and privacy http://t.co/e2vejK2jD7", "RT @BBCWorld: Why do so many people make statements sound like questions? http://t.co/Sk5p2s7GKY via @BBCNewsMagazine http://t.co/f7cjwmyIVF", "RT @BBCBusiness: LISTEN: BizDaily: Sweden's reindeer herders challenge new mine http://t.co/8jVlCOuCq4", "BBC News - Humaima Malik: Will a Pakistani-Indian kiss be censored? http://t.co/v84JufqSIY", "Cleaner New York waters see surge in whale and shark numbers http://t.co/C2DrqSrOLn via @guardian", "BBC News - A Point of View: Why not caring about anything is only for the young http://t.co/7dpSQUVt2a", "In-flight meals take off as airlines give more thought to food http://t.co/p9P4nCBL5j via @guardian", "I think i did know this - yes! \"did you know that at 35,000 feet you get drunk three times faster?\" http://t.co/GAAA08rojv", "BBC News - Who, What, Why: Who are the Yazidis? http://t.co/fG1eAMAbWS", "A very interesting read. 'A Friend Flees the Horror of ISIS' http://t.co/Ju2jzxdmAh via @newyorker", "I agree! \"Branded blue cheese and halloumi are 'saltier than seawater'\" http://t.co/iAHWVv6MwK", "How niceness became the eighth deadly sin for women http://t.co/hWjofwiwPT via @spectator", "BBC News - Helmand's Golden Age http://t.co/jX6vFLTtxD", "Filthy rich, Business Daily - BBC World Service http://t.co/rdKqa5Bi2W", "Why Not a Three-Day Week? http://t.co/40nKhq76yV via @newyorker", "RT @guardian: London outstrips Tokyo and New York as millionaire capital of the world  http://t.co/cUEIUucGzK", "BBC News - Living in the shadow of Ebola http://t.co/jo0qRIvucC", "King Tutankhamun: Finding the pharaoh | The Economist http://t.co/iOepmfPaGk", "BBC News - India: 'Web rehab' helps wean children off devices http://t.co/Rq8bitYVEZ", "RT @BBCNews: How do people get away with slacking off at work? http://t.co/37Hy40Z9Q6", "School reports on writers deliver very bad reviews http://t.co/2R0lKIlckL via @guardian", "RT @WSydneyRobinson: Gosh we need a John Reith badly http://t.co/Z1XPN4wD1D", "RT @EdConwaySky: UK house prices are overvalued by 10-30%, according to the International Monetary Fund http://t.co/HnGKQrxmmn", "RT @TheEconomist: Rather than pushing out jobs, London increasingly sucks them in http://t.co/BSIazwBhXN http://t.co/Y3Wt1VR8aw", "RT @BBCBusiness: LISTEN: BizDaily: British Business Courting Calcutta 25 July 14 http://t.co/xOOdtpjeYL", "Ca't wait to visit the Ashmoelan for - Tutankhamun: How 'Tut-mania' gripped the world http://t.co/YLQrH2u11Y", "RT @BBCWorld: \"Best compliment a restaurant can get\" - the rise of solo dining http://t.co/MfBleHxzFw http://t.co/V60jRL44kl", "Want a fun job? You just have to pick the right parents http://t.co/HMEbWGMOA6 via @spectator", "RT @NBCNews: Meriam Ibrahim, the mom sent to death row for being Christian, has escaped Sudan http://t.co/Ezlv67ze7L http://t.co/T59hoP0kzi", "Shipping Through the Arctic, Business Daily - BBC World Service http://t.co/rJZiEeDuLf", "RT @PeacheyK: Young adults, the squeeze on owning property, and how 40% of their income goes on rent  #housing http://t.co/UANZfSNE7J", "Amazing story of a terrifying disease \"BBC News - The virus detective who discovered Ebola in 1976\" http://t.co/ucqRDCM7DC", "@KirstyGood1 @AdamParsons1 @stephbreakfast uhoh...", "Well I must be quite moral then! \"BBC News - Early risers 'less moral at night'\" http://t.co/nR1QUppT3B", "BBC News - BBC News to cut a further 415 jobs http://t.co/0ee3uY5S6C", "RT @BBCBusiness: LISTEN: BizDaily: Refugee Economy http://t.co/giHTKjITLu", "RT @guardian: BBC News to cut 415 posts as it restructures for digital http://t.co/PQimVBZCLl @mediaguardian", "don't mean to be rude but yuk BBC News - Pushing frontiers of deep sea exploration http://t.co/nYTgFcfg2d", "\"fait maison.\" interesting idee! BBC News - The new sign on French menus http://t.co/UdYxS9Xe3O", "RT @Independent: Executive pay has now reached 162 times the average wage http://t.co/ib88i2JmGd http://t.co/hgJA3JAVhf", "RT @BBCBreaking: Church of England votes to allow women to become bishops for first time in its history http://t.co/FJoVVBA0QJ", "Oh dear... \"Teen Tatler tells girls to flirt with older men\" | via @Telegraph http://t.co/RcDmMWZ41E", "RT @guardian: Church of England General Synod set to approve women bishops http://t.co/uUk7wzyoqv", "Amazing book by @WSydneyRobinson http://t.co/FbIXqMkkJF Truly great read", "Former First Sea Lord complains to BBC after they call HMS Queen Elizabeth a 'boat' | via @Telegraph http://t.co/prOoSFLIEd", "Hard hat selfie at an oil and  gas base near Bergen! http://t.co/WCQLqXUnXt", "Wifi at 15,000 feet on the way to Norway :) http://t.co/rMFq99I3Vb", "How much is this salad at stockholm airport?! 14 pounds!!!! Good grief! http://t.co/9XpbNghd3N", "@johnycassidy haha. This is my fave story of the day - bar NONE!", "\"Sleep Deprivation Affects Face Appearance\" sadly i already know this!! http://t.co/N9QtERBxND via @HealthyLiving", "BBC News - Why Icelanders are wary of elves living beneath the rocks http://t.co/RhMan2Rm2o", "Beautiful spot http://t.co/GUbu5eyefG", "\"'O frabjous day! Callooh! Callay!' He chortled in his joy.\" http://t.co/mUqp7MTW0a", "RT @fleetstreetfox: Mail Online's reached the point of self-parody now: http://t.co/yG5zhKGeQs", "Some amazing insights about Lord Reith first BBC DG among others in Last Victorians: http://t.co/psT6rLMh8B via @amazon", "RT @BBCWorld: $2bn is spent each year on acquiring second passports http://t.co/Rwn2TLfiqk #bbcgofigure http://t.co/iXhKs4Ehu8", "RT @johnycassidy: BBC News - Braille e-books: Why can't you buy a budget e-reader? http://t.co/vSnCGrvFhR", "BBC News - The slow death of purposeless walking http://t.co/HyKKKH5UWd", "Honest work can't put a roof over people's heads: true Tories should be appalled via @Telegraph http://t.co/Zpq5niCuEz", "\"we associate higher notes, flutes and tinkling piano, with sweetness - deeper, more resonant tones evoke bitterness\" http://t.co/fCioa57Ypx", "@Hotters_says sounds great - at work on fri?", "@Hotters_says sure is! I pre-ordered :) let's go for coffee/lunch soon", "The Last Victorians: A Daring Reassessment of Four Twentieth Century Eccentr... http://t.co/3A9mBkbfzK via @AmazonUK", "Spain's wine surplus overflows across globe following year of unusual weather http://t.co/SGLh2nVqr3 via @guardian", "RT @Hotters_says: Jogging in a Perspex cube accompanied by a Mexican band. How very #W1A http://t.co/haNtCR8xvb", "BBC News - Saudi Arabia: 'Destitute' woman leaves secret fortune http://t.co/4j2wGbvUxc", "BBC News - Do 85 rich people have same wealth as half the world? http://t.co/EZPYTgTZea", "What did Harvard Business School learn by studying people who wear sweatpants in public? http://t.co/m8L5USiS2Y", "8 well-intentioned comments that young people are sick of hearing http://t.co/HOrBQ6fNi9 via @guardian", "RT @BajanJoJo: What a huge lost to the BBC's Business Team but great for @BBCHughPym congratulations on your new role as BBC Health Editor", "Replaced by robots! Robot writes LA Times earthquake breaking news article http://t.co/jXFVeod93W", "Too cute! Chartwell kitten Jock VI upholds Winston Churchill's wish http://t.co/rBJs0TGlFp", "I wish! Can you learn how to be a 'morning person'? - via @Telegraph http://t.co/s2L95bxDuQ", "The private life of Charles Darwin http://t.co/UmE5fdxwDZ", "Nothing beats Fawlty Towers \"Gourmet Night\" The restaurants that thrive on insulting their diners http://t.co/JxKCLjIGAz", "RT @guardian: Spring is here! A sunny gallery from across the UK, via @GuardianWitness http://t.co/b8pW4rRntR http://t.co/3NsV9pOuer", "RT @sorrelmw: Why you should always keep #ChampagneCampaign in fridge http://t.co/41ZC8aStoJ", "RT @DaveLeeBBC: .@TreanorSarah looks in-depth at Satya Nadella http://t.co/2nxgRkpyWk", "@RamzanK this tweet has just gone live ;)", "Police: So LONELY! Seems apt for the Friday late shift...http://t.co/TrDo7LRKjB", "@MRQRoland Hi! Very long time! Hope alls well? Off fbook for a bit yep", "Well I'm cold - but not THIS cold! Yakutsk in Russia, the coldest city on earth - in pictures | via @Telegraph http://t.co/ZBHwobaWg0", "RT @BAHeraldcom: Editorial: Honey, I shrunk the peso\nhttp://t.co/0BGoZfcB2K", "\"Rats have a really bad press and this doesn't help...\" I am NOT convinced... http://t.co/4N7HY29z4p", "RT @BBCNewsnight: Full interview: Jeremy Paxman grills Mark Carney on interest rates \nhttp://t.co/kPdoJxYFWk", "@seanfarrington Haha Im glad to hear you're keeping up your glam ways! (Was my invite lost in the post?!)", "Newsnight answering some of my Davos questions tonight!", "Depressing reading. BBC News - Night work 'throws body into chaos' http://t.co/WXtVmzuvaH", "RT @sallymavin: One of the best Twitter exchanges I've ever seen between Sainsbury's and a customer https://t.co/eP3ib2k0fb", "So so silly... Holy Panettone! Miniature world food art - in pictures http://t.co/cfH8MpAyK9", "RT @Mantejd: Top technology reporter @minnie_r.  Watch out @ruskin147 ! http://t.co/1ldRAjwURJ", "Always nice to work to Chopin... http://t.co/R5p3VWotBF", "RT @VFritzNews: Its banker bonus season. Matt at @Telegraph rises to the occasion http://t.co/Fl6peboDNG", "RT @BBCWorld: Going up in the world - why Norway is becoming an \"architectural superpower\"\nhttp://t.co/u2hjp9t6AT http://t.co/dRlt9PNHwx", "Chocolate Windsor Castle, plastic angel and gnome among official gifts to Royal family | via @Telegraph http://t.co/2WC0fDqVU0", "RT @GettyMuseum: Wonderful image of Singer Sargent in his studio with Madame X via @Mako13Margo http://t.co/quZQzfW7lT", "Automatic whisky - Whisky &amp; soda vending machine from 1960. http://t.co/rM7M1IvQ2H via @AnOtherMagazine", "coup de blues! BBC News - Francois Hollande's 'escapades' - a glossary http://t.co/pLSy3E3klN", "Fruit juice should not be part of your five a day, says government adviser http://t.co/gu0PUFM6fG", "We are so so lucky to have access to so many art treasures in such beautiful spaces - and for free! Tate Britain is always a joy.", "How subtle! BBC News - Altered Images: The case of the Russian minister's missing jet http://t.co/GMlE0Edcba", "What kind of cake is sent in a wooden box with a red wax seal on it - from Vienna? Russian oligarch cake. That's what kind.", "Eyelids drooping, shoulders dropping..  yet still 4.5 hours of work left... the curse of a quiet news night!", "Haha why did we never produce stories like this? @KaitlinFunaro Hope you're v well x", "Mayor of frozen over Hell wishes Humphrys a \"hell of a good day\" on R4 @BBCr4today Twee and fun. https://t.co/fUKfXPy8zr", "nightmare!! BBC Radio 4: the wrong kind of breaking news: http://t.co/DUQonJ0AOf", "BBC News - Why do British prime ministers never wear wedding rings? http://t.co/C0AXAfAtZU", "Silly story for today - Cocaine sent by traffickers to Aldi supermarket 'by mistake' http://t.co/JpRGdv17OE", "It's like a really big cab which just slightly misses my destination", "Slightly odd feeling being the sole passenger on a bus for the entire journey!", "Wow! Never seen this pub at night before! http://t.co/bGXU8m0TWH", "Another Friday - another late shift :(", "RT @Hotters_says: Love the Tudors but never knew Elizabeth I was a big bloke in drag. #NationalPortraitGallery. http://t.co/q3GlPs6Zy1", "\"You're gonna need a bigger budget\" - my fave picture caption of 2013 @EdwinLane http://t.co/t8gRCkmbPH", "\" Drowned by decorum\" -  bit grizzly! 10 truly bizarre Victorian deaths http://t.co/fhRYUHaEAg", "@alexvlf Thanks that's v kind!", "RT @kgittleson: The first Christmas card (in 1843) cost a day's wages &amp; was a total flop + more from @TreanorSarah http://t.co/y7KUffGcw3", "Nice to put together a festive feature http://t.co/q9Ang7jspK", "RT @BBCBusiness: Shoppers shun ugly veg, says Tesco http://t.co/39rbhxnmak", "RT to WIN The 12 Pairs of Christmas - a year's supply of Whistles shoes! #whistlesadvent http://t.co/VljfCxgx4U", "RT @WSydneyRobinson: #coulson and #brooks - not the 1st journos tried at Old Bailey. WT Stead in 1885 http://t.co/JOKlaLoK0r .", "Cute yes, slightly mean... perhaps. http://t.co/j3eZxshIR9", "@lucyburton the traffic is just so tough to predict on the m40 at that time :( but for shift work it's a great way to get here! x", "@lucyburton great service if you're not going peak time! nightmare if you are... x", "How will a postal strike impact the world?! \nhttp://t.co/a6eid0Ds4r", "The airbrush strikes again! http://t.co/N4FOQONzRi", "The woman who turned around Burberry leaves for Apple \nhttp://t.co/zFNzoCgiG3", "RT @Pippatips: Recover from tiredness by resting", "Chinese tourists briefly detained in France after trying to settle their hotel bill with 3,700 one-euro coins. http://t.co/QySsT0SCjJ", "Craving a good sleep. http://t.co/v1kJp8lRNm", "http://t.co/majH5FdJcR", "Bride and groom having their wedding photos outside the office at 11pm! http://t.co/0gu5OC5sLH", "A lovely Henri Cartier-Bresson picture http://t.co/3u6W03VDTn", "FOUR day weekend coming up week after next!", "RT @cumiskey: Who says chivalry is dead. Not in Walthamstow.  #e17eyeopener http://t.co/Xe0HlVZV3i", "just bought: 'Muckraker: The Scandalous Life and Times of W.T. Stead: Britain's First Investigative... via @AmazonUK http://t.co/8TexyCSuH7", "@dominic_laurie @VFritzNews non! it's my Paris good-value hotel tip DL x", "Hope you enjoy it as much as I have @VFritzNews ! xx", "RT @MichaelDMillar: Can traditional skills and techniques survive the technological onslaught?  http://t.co/GoHDG6TvJU (by me for the BBC)", "&amp; Other Stories http://t.co/e2NeCBUufA I like this picture!", "BBC News - Mark Carney profile: The 'film star' central banker http://t.co/astDiOPY8m", "Missing Paris... Hope to see those Marais rooftops soon. http://t.co/nf9FpeTmPn", "@AdamParsons1 @Mantejd It's rare that at 5ft 10 I feel like a midget! A brave choice to be snapped by a supermodel!", "The girls at dinner @Mantejd http://t.co/lseBzWoPps", "RT @Pippatips: #PippaTip: commuting can be a useful way of travelling between home and work, and even back home again", "RT @Pippatips: #PippaTip: avoid becoming locked out by not forgetting your keys", "We just worked it out... Been up for 31 hours so far... About another 14 until home. Luckily am totally relaxed and holiday-calm Xx", "Cold feet in empty lounge! Grrrr to those hogging the recliners and snoring. http://t.co/j7QkhznNWi", "Beach club at sandy bay lembongan... Great food and view! (And power cut) xx http://t.co/FYtGCftMuq", "http://t.co/PoYVaFCzpj", "Dream beach huts worth the trip xx", "Can still catch up on my French homework! http://t.co/OCbhpiAtbb", "Great ridgeway walk to modern art museum x", "http://t.co/VuHpH7v3W2", "Great walks through the rice fields", "Palace water Lilly ponds... And failing to get into a temple http://t.co/fCVJ3rwrxU", "Pool not bad either :)", "http://t.co/v1nc7St0Bn", "Ubud: jungly, beautiful, great food, costumed dancers, temples and palaces... Tomorrow for walks and yoga x", "@shanaz17 is the little dot by the sea... Incidentally.", "http://t.co/YVWoWGZ5Tl", "@Mantejd tomorrow will send a beach picture! And we are meeting Yip for coffee! X", "Beautifully sultry in Bali by the pool relaxing away jet lag http://t.co/kwIYfivGk3", "@Mantejd going here for dinner (first night in seminyak) http://t.co/Tbi9tJ0Re9 thanks for the tip x", "Thank you very much @Mantejd! And thank you for the tips. Will tweet some pictures! Xxx", "@davelee Tamarind also very nice - Chelsea area. Grape and Grain in Alphabet City small but good wine beer and pizza", "@RamzanK @davelee brunch at pastis! Chelsea food market, back room and PDT for drinks, pomme frites - to soak it up. Jealous!", "The Daily Cartoon : The New Yorker http://t.co/lX1biOwyEd via @NewYorker", "@stephbreakfast @seanfarrington Nice one Sean! Looking very engaging! x", "RT @Pippatips: #PippaTip: celebrate the traditional British Friday by visiting the pub with friends or colleagues &amp; drinking some al ...", "RT @Pippatips: #PippaTip: if you want to write to someone but don't want to wait for it to be delivered via post simply send an e-mail u ...", "@FionaGraham soho house has ypur phone! Just called it!", "@kprescott @fionagraham And after this glass of champagne I'll be leaving here. It's wall to wall models!!", "@fionagraham @lcurwen @mantejd He showed us pictures of a cat in a bidet. I can say no more! The maid sends a pic each hour!", "RT @Mantejd: BBC girls @treanorsarah and @elcurwen with the Chanel supremo! Proper Friday boss for @r4today ! http://t.co/cCqMSp05", "RT @Mantejd: At work with the @treanorsarah and @lcurwen and the man from Chanel! http://t.co/NVNJeI33", "RT @shanaz17: Why Andy Murray was scrabbling around for his watch after winning the US Open. His earnings are now set to soar http://t.c ...", "RT @AdamShawBiz: Radio 4 is brilliant. The single biggest contributor to our cultural life. Some things just need to be said every now a ...", "RT @KimKierkegaard: Not sure why my hair looks light in some pics &amp; dark in others--an absurd confusion, for a self differs infinite ...", "@johnycassidy @stephbreakfast Yes! I concur! You'll be fab as always steph x", "@dominic_laurie True but the point that it took so little for lives to change is important. Next week will be a different kind of shocking", "@dominic_laurie Yes! Agree. Googling all kinds of Bangladesh facts. Amazed life expectancy is 69!", "RT @KimKierkegaard: God grant me peace from my foolish earthly desires, my wild longings, the anxious hungers of my heart. I'm craving f ...", "RT @charrlls: @TreanorSarah @MarvinHarvey hi!Tonight #bbcradio4 investigates how #Olympics security went wrong. Hears from police &amp;  ...", "RT @KimKierkegaard: Just got the best spray tan!!!! There is an indescribable joy which glows through us unaccountably.", "RT @nytimes: Decibel by decibel, a sonic tour of New York City http://t.co/Fw1VqjA3", "@treanorsarah @lisagoldapple errr great not grey. Though it may be that too...", "@lisagoldapple Will send a list! Such a grey city x", "@lisagoldapple also stayed here with 2 days notice a while ago.. http://t.co/g3DAJG0x", "@lisagoldapple just got back from this B&amp;B in the Marais. Cute, good spot. http://t.co/aHUglW82", "It's going to be tough to return from paris!", "@njb In France!", "@hayoub Ha! That's well hardcore. Impressive even for the nightshift worker. Hope you get some rest!", "@hayoub Sounds amazing! Looking forward to the travel tales x", "Woops typo @hayou. Bonne nuit!", "Glad to hear all's well @hayoub! Enjoy the advantures (is enjoy  the right word?!)", "This is funny. http://t.co/La7C7Jjf", "RT @WSJ: More than a third of divorce filings last year contained the word \"Facebook.\" http://t.co/LCshU6rx Via @SmartMoney", "I just read a stack of 10 year old Vogues. Thank GOD flared jeans, sparkly tops and streaky hair are in the past.", "being told I look \"like I've had some sleep\" is the best it's going to get tonight.", "@martin_greig @shanaz17 Hope you got your train! Speak soon", "RT @katywatson: Nice once: Channel4 News - Our pledge to put more women experts on your screen http://t.co/rMu4YYSm", "Just done an interesting interview on whether very wealthy people make better parents...", "Maybe someone a lot more intelligent than me could invent a mental dimmer switch", "RT @GettyMuseum: Do not yawn or gnaw at anything! Museum etiquette from Catherine the Great\nhttp://t.co/jTaugzKZ", "Three hours after the show ended and two and a half after my nightshift I'm In W3 on the Oxford Tube in the biggest jam since roads began", "Head under duvet pretending to myself I'm asleep pre nightshift....maybe I can bring said duvet to work?", "RT @minnie_r: BBC1 now. The lovely @AdamShawBiz talking about 'How to survive the Meltdown'. One of the loveliest people to work with.", "What on earth are you talking about @minnie_r? Speak English lady Rice! Xx", "RT @SallyG27: So that's 2 1/2hrs of my life that I can't have back. #wutheringheights", "The nigtshift \"sillies\" have taken hold. Oh YES.", "RT @AdamShawBiz: Sign of times. On journalist desk: PC, Paper, Pencil .... riot helmet. (Corrected) http://t.co/Za9l8wb", "RT @hayoub: What to wear for nightshift #2? Def not wearing green for fear of another unwitting St Patrick's day homage (@TreanorSarah)  ...", "RT @AdamShawBiz: Just grabbed chair of Goldman Sachs A.M. for interview about where investors can hide if US can't agree on debt deal. A ...", "@Hotters_says It's because they reek of bad taste. C'est horrible...", "Good show @Hotters_says old bean! Can I be your agent?!", "RT @AdamShawBiz: Odd News:Met professional hard man Ross Kemp last night and he says he is a big fan of business slots on the Today prog ..."]}