{"weaselzippers": ["Report: White House May Give DHS Authority to Deport Illegal Aliens Faster https://t.co/qHNwDSH216", "Hilarious: Gutfeld Roasts CNN With Their Logo On His Head https://t.co/oEQX2BDTIy", "House Backs Massive Increase In Defense Spending https://t.co/nTf7DLbJe1", "Is Ted Cruz there? https://t.co/rh9nou5IU8", "Timeline Shows Multiple Obama Admin Interventions Which Allowed Russian Lawyer To Be In U.S. https://t.co/HKBeBKNjfw", "BREAKING: Judge To Allow U.S. Doctor To Examine Charlie Gard https://t.co/wVqI6WJYdR", "Perez Paid 2 Rivals After They Dropped Out of DNC Chair Race And Endorsed Him https://t.co/ZdXXJgJoRB", "Trump Admin Continues Obama-Era Tradition Of Giving Millions To Soros-Linked Groups https://t.co/yCna5wkMGP", "RT @thatbillokeefe: Well he did cum between them. https://t.co/f0E4FpkERg", "Secret Service Investigating Maine Democrat Who Threatened Trump https://t.co/kx6iBBB9iX", "Nixon was never impeached. You need to go to read a book.\n\nhttps://t.co/mddUn5a7sf https://t.co/d7G9v3TKj6", "Can I eat the dolphins and whales too? https://t.co/30hZTbFI8I", "RT @thatbillokeefe: Your wife had a choice. She chose to defraud a school into bankruptcy. How bout dah? https://t.co/3cRw8SZjub", "RT @HayesBrown: we go now live to ted cruz attempting to save the senate health care bill https://t.co/PwcIzUhout", "Broke US Postal Service Paid To Cover Employees Campaigning For Hillary Clinton https://t.co/fv9ODsjeen", "Maybe you should have won the election. https://t.co/y0W9YH62Er", "BREAKING: Grassley, Feinstein Calling For Trump, Jr To Testify Before Senate Judiciary Committee https://t.co/7wYe5Kx4IB", "Overnight Open Thread: Cow Appreciation Day! https://t.co/KHqFCPUEoI", "Journalist Melts Down After Trump Jr. Scoops Him https://t.co/P67aBT3qns", "Good for you suing people. You have to eat somehow https://t.co/7I8hDX7dpP", "You're a very poor scientist. https://t.co/T2wsnx7u3B", "FBI Document Dump Reveals Secrets Of Clinton Probe https://t.co/JmIOgkVWmR", "BREAKING: Senate To Stay In Session For First Two Weeks Of August https://t.co/Wh8KuF6ZU5", "Mika Brzezinski Lands Mega 3-Book Deal https://t.co/yqtkfojcyn", "Lena Dunham Sells Dress She Cried in When Clinton Lost Election https://t.co/4yvcAqDePB", "Explosion Damages U.S. Air Force Recruiting Office In Bixby, Oklahoma https://t.co/RglqL8cnx6", "BREAKING: Man Arrested For Allegedly Planning Terror Attack At Ariana Grande Concert in Colombia https://t.co/l4tHnOXT4d", "U.S. Coalition Confirms Iraqi Security Forces Liberate Mosul From ISIS https://t.co/UDZXwDz11g", "Sen. Chuck Schumer Courageously Begins The War On Snortable Chocolate https://t.co/nk2i1f6DVJ", "RT @thatbillokeefe: OK Google\n\nStop domestic violence.\n\nhttps://t.co/szW8jnbfa8", "US Veteran Blinded By Terrorist Omar Khadr  Says Justin Trudeau Giving Him $10 Million Is Treasonous https://t.co/uERcN38qNA", "Hillary Clinton Considers Her Role In Midterms, Might Hit The Campaign Trail In 2018 https://t.co/881gFxqu3U", "Oregon Poised To Decriminalize Meth, Cocaine And Heroin https://t.co/kJfONXwk0q", "Trump: No Change To Russia Sanctions Until Progress in Ukraine, Syria https://t.co/x9Twr9DgZT", "President Trump Wears An American Flag Pin Instead Of A G20 Logo Like Other World Leaders https://t.co/f79Aj9p7JX", "Notice Any Problem With This NY Times Tweet? https://t.co/jgVtE3UzbE", "FBI Arrests Man For Allegedly Threatening GOP Sen. Joni Ernst https://t.co/Z42bFFyv9n", "Will New Gender-Neutral Licenses Fly With TSA? https://t.co/NUU1Lwq9nR", "Liberals And MSM Attack Ivanka Trump For Sitting At Table For A Moment For Her Father At G20 https://t.co/Z88Psr7qg5", "Armed Man Arrested Trying to Meet Ivanka at Trump Tower https://t.co/ueq6BwE34r", "Trump, Putin Shake Hands At G20 Summit https://t.co/FcWmkMdGjc", "CNN Slides To #13 In Cable Rankings https://t.co/D1nNa9w3kH", "Someone Sent Rachel Maddow Fake NSA Documents Alleging Trump-Russia Collusion https://t.co/MOv2k6q2Da", "BREAKING: Fox Suspends Business News Host Charles Payne Amid Sexual Harassment Allegations https://t.co/6lMdi0gb3M", "More Very Fake News From CNN: Network Analyst Claims Trump Never Made Article 5 Commitment To NATO https://t.co/beN24pkHQL", "The New York Times Mistook A Parody Twitter Account For The North Korean Regime https://t.co/Tx0xT3c4qE", "Trump Admin Authorizes Strikes on Iranian-Backed Forces https://t.co/ObHA7vbEou", "60 Shot, 8 Dead, In Chicago Over July 4th Weekend https://t.co/dJuODbC54J", "Chris Cuomo Tries To Justify CNN Threat To Dox Random Dude For Making Trump Wrestling GIF https://t.co/XzckUKpS3h", "Poll: Majority Of Voters Back Trump Travel Ban https://t.co/TmhtycBNiM", "Bill Gates: Europe Will Be Overwhelmed Unless It Stems Flow of Migrants https://t.co/Nh0mrOKxgJ", "Hollywood Liberal: NRA Might Be A Terrorist Organization https://t.co/P7IQSt1UWs", "#HappyIndependenceDay https://t.co/n8iIPTRQmi", "The International Trumpism Cartoon And Caricature Contest Was Held On Monday In Iran https://t.co/QnzW88N0bk", "Philly Police Jump In After All Hell Breaks Loose Between Antifa Thugs And Trump Supporters https://t.co/zYojB4YZzx", "FBI Vehicle Containing Several Firearms Stolen Near West Side Chicago https://t.co/7VsoGadEwv", "FBI Vehicle Containing Several Firearms Stolen Near West Side Chicago https://t.co/PTKqbeYUUQ", "Pope, Trump Offering To Help Charlie Gard https://t.co/C4I6QlLgg2", "Toronto Star Has Meltdown Over Record Setting Sniper Shot https://t.co/4bUVZHhbDY", "China Suspends Fuel Sales To North Korean Regime https://t.co/2aPZpZkGg9", "Obama Playing Behind-The-Scenes Role In Rebuilding Democratic Party https://t.co/41ZPRh2dAS", "Sanders Suggests Republicans to Blame for FBI Investigation Into His Wife https://t.co/lBh2WdTr3A", "California Minister Still Supports Trump Even While Awaiting His Deportation https://t.co/h2shuwdpFL", "Obama In Indonesia Takes Swipe At President Trump On Paris Climate Accord https://t.co/T0Rr7st0ka", "Ex-Petersburg City Attorney Made Phony Call To Himself Claiming Racial Threats https://t.co/ZhqOquWjYa", "Little Rock Nightclub Shooting: US Marshals Arrest Rapper, Second Suspect In Alabama https://t.co/kA0SCcqGbq", "Keith Ellison Breaks Into Song To Celebrate Minneapolis Passing $15 Minimum Wage https://t.co/So8PognXDX", "Iran To Finally Pay For Role In September 11 Attacks https://t.co/VmuljqTxPX", "Man Who Identifies As A Woman Pleads Guilty To Rape Of Teenage Girl https://t.co/ES7rnRIUlf", "Cory Booker Likens Planned Parenthood Activists To Brave Men That Stormed Beaches Of Normandy https://t.co/MEHxFnOulc", "Univision Reporter Defends Massive ID Theft Tied To Illegal Aliens https://t.co/ymdBQ39qlP", "Federal Judge Blocks California Ban On High-Capacity Magazines https://t.co/6kMceDz3gE", "Colorado Baker Describes Harassment After He Refused To Bake Cake For Gay Wedding https://t.co/ZfVVyKivHj", "Susan Rice Will Reportedly Testify Behind Closed Doors About Unmasking https://t.co/W9Hdz1pArn", "BBC Article Claims The Holocaust Is A Sensitive Subject For Muslims Because Jews Settled On Their Land https://t.co/CugmO8xBZN", "BREAKING: Greta Van Sustern Gets Fired From MSNBC https://t.co/98E2Yduc0n", "I know.\n\nhttps://t.co/jm9cx0VRWr https://t.co/SUpFrEYFRd", "Schiff Blocks Witnesses From Testifying In Russia Probe https://t.co/awViwxR8jJ", "CAIR Launches New App To Make It Easier For People To Report A Hate Crime https://t.co/QU8jNx7sU5", "RT @thatbillokeefe: Guess he doesn't know they're on vacation.... https://t.co/dADvNlEuVO", "RT @emzanotti: Impeach Trump\nImpeach Pence\nEmergency election\nClinton versus Bobcat\nPresident Bobcat https://t.co/kWxnVxUm4n", "Chart: How Much Time Has Media Spent On Trying To Connect Trump To Russia? https://t.co/zhdir90c2w", "Trump Effect? NATO Allies Increase Defense Spending By 4.3 Percent https://t.co/xt1OoFr5me", "Yazidi Sex Slave Forced To Eat Her Son After ISIS Butchered Him https://t.co/0OOyEDERPU", "Student Who Worked For Dem Organization Jailed For Trying To Register Dead People As Democrats https://t.co/AItxafFyxb", "Democratic Rep: Citing Uncomfortable Data Is White Privilege https://t.co/pwyOYsnX0Q", "RT @thatbillokeefe: In the Muslim world, every holiday is the Puerto Rican Day parade. https://t.co/MMTeMIioih", "Washington Post Writer Accuses Bruno Mars Of Appropriating Black Culture.. https://t.co/mRRAPT12NJ", "Two House Democrats And A Staffer Under Review By House Ethics Committee https://t.co/kl9iY0Le9Y", "House GOP Urges Ruth Bader Ginsburg To Recuse Herself From Travel Ban Cases https://t.co/pXu2BFlCEN", "White House Warns Assad Regime Is Preparing Another Chemical Weapons Attack https://t.co/yrWMWmZx7u", "Did The FBI Retaliate Against Michael Flynn By Launching Russia Probe? https://t.co/6c3oPR2vtx", "IRS Report: Illegal Aliens Using Stolen Social Security Numbers Of 1.4 Million Americans To Pay Taxes https://t.co/dnaD52lnxT", "Irony Alert: Trump Is Not Under An FBI Investigation, But Bernie Sanders Is https://t.co/tuV9kwMz2B", "Liberal Activists Accidentally Fly Banner Attacking Nevada Republican Over West Virginia https://t.co/HCxTdwEGAH", "Shaun King Slams Christians Over Immigration Ban, Calls For Ban On White Men https://t.co/CiR7HZg3GD", "We warned you .... https://t.co/4987WAukUe", "BREAKING: : Supreme Court Reinstates Key Parts Of Trump Travel Ban https://t.co/9wVfLWeC97", "Trump And His Generals; Op-ed by Victor Davis Hanson https://t.co/NHCZicygit", "Border Patrol Agents Save Illegal Immigrant Left To Die In The Desert https://t.co/TPsFhi9eSH", "Sketchy Firm Behind Trump Dossier Is Stalling Investigators https://t.co/NxOMEdGULU", "South Carolina Political Blogger Heading To Court Under Pressure To Reveal Anonymous Sources https://t.co/aJdiP8fsxd", "Snowflake Has Melt Down After Prof Suggests Reading Cato Paper https://t.co/1OvGCnXonI", "Clarksville, Tennessee Residents Thwart Westboro Church Protest At Military Funeral For Sergeant Dillon Baldridge https://t.co/JlSz5IaIim", "Hoax? Woman Suspected In Fire At Mosque https://t.co/21vVWxJLvc", "RT @Namru: Retweet to protect your timeline. https://t.co/KlH3gTyZ1l", "Bernie Sanders And His Wife Jane Sanders Are Subject Of FBI Investigation (Just Like Hillary Clinton) https://t.co/BM95QJp0m1", "Military Chiefs Want 6-Month Hold On Transgender Enlistments https://t.co/BK1XoQT78P", "Black Exodus Accelerates In Cook County, Illinois https://t.co/UHACa4dZbw", "Suicide Bomber Blows Himself Up As Saudis Foil Mecca Plot https://t.co/5Ee5yCtNM3", "2 SCOTUS Picks For Trump?\n\nhttps://t.co/2CwNphMj7g", "Grassley, Feinstein Want Answers From Loretta Lynch https://t.co/ESUGaVJ2T6", "Should hand out pamphlets called \"Don't be a drug addict\" instead. https://t.co/X97UxaibJ6", ".@SenSanders Still won't pay his interns a living wage though. https://t.co/s4kLJzYbhH", "Report: 1.4 Million Illegal Aliens Working Under Stolen Social Security Numbers https://t.co/DQ4grI2X5Y", "Report: House Intel Panel Will Interview John Podesta Next Week https://t.co/1WCfrreYAp", "Saudi Soccer Team Refused To Stand For Moment Of Silence For London Terror Victims\n\nhttps://t.co/iFPY3iomiO", "A Democratic Blind Spot on Culture https://t.co/FP5sZYuZVJ", "Ohio Man Charged With Threatening GOP Congressman And HIs Family https://t.co/fJNsLTl4mL", "House Judiciary Democrats Demand GOP Leadership Start New Russia-Trump Probe https://t.co/tKCrPZXSvV", "Feds: More Than A Quarter Of Illegal Immigrant Minors In Our Care Are Gang Members https://t.co/cN1D9Dam1M", "He was looking for directions, while shouting in Arabic and waving a knife. It happens a lot. https://t.co/aBcdDQOT0G", "Show yourself out. https://t.co/hn3mlcRiv2", "BREAKING: Man Shouted Allahu Akbar Then Stabbed Michigan Cop In Throat ... https://t.co/Oh4FYq75d3", "Sanders Continues to Not Pay His Interns a Living Wage https://t.co/aW54wOZKcT", ".@FreeBeacon Barred From Covering Jon Ossoff Campaign Event https://t.co/Afxu1QAWr3", "Shut up and go away. https://t.co/jt4QIJvafW", "American Student Tortured To Death By North Korea Dies.... \n\nhttps://t.co/BxfxrI6RVp", "ICE Detains Illegal Alien Who Beat 17 Year Old Muslim Girl To Death.... https://t.co/ZtNzK63xr7", "I hate every moment in the universe that brought us to this point. https://t.co/QQB4I6TuEJ", "Flashback: Horrid Liberal Takes On Otto Warmbier Last Year https://t.co/EK0UpFxC3n", "American Citizen Murdered By North Korea Over A Poster...\n\nhttps://t.co/o5vl5VxC37", "Former Hilary Social Media Manager Uses Otto Warmbier Death As Political Tool https://t.co/AjH7kcjDZA", "This story did not age well. https://t.co/vuJJq9A19g", "Supreme Court Axes Law Banning Disparaging Trademarks https://t.co/pvjjRbkRvg", "3M Ukrainians died because Communist leader Stalin thought they ought not to exist. https://t.co/N06DJjCuoe", "Russia Threatens To Retaliate Against US Planes For Downing Of Syrian Jet https://t.co/mlwPQvXK4f", "Report Corroborates Sekulow: No Investigation Of Trump https://t.co/vO9lDoH3HM", "Anne Frank would be ashamed of you. https://t.co/G9fInNCvwo", "Kaepernick Compares Police Officers To Slave Hunters After Castile Verdict https://t.co/IFSZBRGM4l", "Debbie Wasserman Schultz Primary Foe Says His Computer Was Attacked https://t.co/eqJuFgqbIT", "Judicial Watch Sues Justice Department Over Comey Memo https://t.co/ZXhkyhd31T", "Protesters Interrupt Violent Julius Caesar Trump Play https://t.co/Zn5fh30RmS", "RT @CuffyMeh: Which bills did the black lesbian support? Because she also got shot by the progressive. https://t.co/XGLujyY9cB", "BREAKING: Cosby Case Over, Jury Deadlocked, Ends In Mistrial https://t.co/P8rnQ4UHOS", "BREAKING: Minnesota Officer Acquitted In Shooting Of Philando Castile https://t.co/OzI4V2jlSu", "San Francisco Man Shows Up To Spanish Church Service Wearing Fake ICE Jacket; Scares Congregation https://t.co/bAikTteae1", "RT @JayCostTWS: @gabrielmalor  https://t.co/iURCTqEMQ3", "If it's so great, go live there then. https://t.co/N06DJjCuoe", "CA Dem Official Curses Out Conservative Gay Volunteers https://t.co/dJ1Gq45R6a", "Trump Admin Rescinds DAPA Amnesty Program https://t.co/pZP7vQ4Mag", "Deputy AG Rod Rosenstein Issues Statement Warning Against Believing Anonymous Leaks https://t.co/2rZ8StaK3E", "RT @meganamram: old twitter vs. new twitter https://t.co/TXax40thr5", "Canada Passes Radical Law Forcing Gender Theory Acceptance https://t.co/FVOAk7QqZQ", "CNN Posts Fake News Story About Fake Climate Change Myth https://t.co/03hrIjN6uc", "Seattle Gun Tax Failure? Firearm Sales Plummet, Violence Spikes After Law Passes https://t.co/f5347zXyRC", "From the guy whose editors just apologized for accusing a U.S. governor of inciting a mass shooting spree. https://t.co/SE6PzVE6QU", "Congressional Baseball Teams to Wear LSU Gear to Honor Scalise https://t.co/V8BhM189Z0", "ICE Arrests Nearly 200 Iraqis With Criminal Convictions In Deportation Sweep https://t.co/VQMurE0pBt", "RT @martian_munk: Jesus died for our spins. https://t.co/GWN7TEzzz3", "BREAKING: Video Captures Shooting At GOP Baseball Practice https://t.co/azediAjbnC", "Lobbyist Matt Mika In Critical Condition After GOP Shooting https://t.co/kQyAV0DsLo", "Audio Of GOP Shooting At Baseball Field https://t.co/9tNvbhV5HW", "Marxist Wisconsin Professor Rakes In $170,000 Per Year Teaching About The Inequality And Oppression Of Capitalism https://t.co/ybpgJYCfHX", "Shooter Tweeted Negatively About Steve Scalise In Past https://t.co/FD0WuGO1s1", "You don't even know what his name is you dimwit. https://t.co/VHEedIuhzK", "Shooter was a volunteer for Sanders presidential campaign... \n\nhttps://t.co/gGG7vGxYYe", "Bernie Sanders Condemns Shooting By Former Campaign Worker For Him https://t.co/gGG7vGxYYe", "EU Opens Legal Case Against Warsaw, Budapest And Prague Over Refusal To Take In Asylum Seekers https://t.co/y13xHqO7Sv", "Pic: House Democrats Pray For House GOP After Shooting At Baseball Practice https://t.co/AqJVapOGAO", "More Than 100 Colleges Offer Social Justice Academic Programs https://t.co/83qH6VYjfy", "Gunman asked if Republicans or Democrats were practicing on the field https://t.co/xJyIDrNSIe", "Rand Paul: \"If Steve Scalise security detail not there, would have been a massacre\" https://t.co/xJyIDrNSIe", "Congressman Steve Scalise wounded in shooting at GOP Congressional baseball game https://t.co/xJyIDrNSIe", "You seem nice. https://t.co/1Mw03s5Rpa", "BREAKING: Gunman Shoots Up Congressional Baseball Practice: Asked If GOP, Then Started Shooting.... https://t.co/tVqlk3fu7o", "DNC Hackers Targeted Conservative Heritage Foundation Before Election https://t.co/DtgJptT8ls", "Heartache: Oprah will never run for public office https://t.co/wVlVNmZolq https://t.co/OonTmbnDGM", "Hard hitting journalism. https://t.co/hYGAJbrqKS", "Venezuelan Anti-Communist Regime Protesters Set Fire To Supreme Court Building As Crisis Deepens https://t.co/HZpqXAjR7G", "You need to calm down. Maybe have a glass of water? https://t.co/T1wEFyvLzB", "Mattis Shocked By Lack Of Military Readiness Of U.S. https://t.co/1XUhgAe0IT", "BREAKING: Tillerson Announces North Korea Releasing American Student Otto Warmbier https://t.co/mqp6ODGYYa", "Off-Duty Border Patrol Agent Kidnapped And Brutally Assaulted In New Mexico https://t.co/Qoy0B8EF2B", "Hilary Clinton And 7 Top Aides Still Have State Dept. Security Clearances https://t.co/LVyuZ9gmvu", "Teacher Suspended Over Censoring Trump References On Student Clothing, Slogan In Yearbook https://t.co/t5s6nnGxxy", "Trump Expected To Announce Cuba Policy Rollbacks Next Friday https://t.co/LiacPqI3jd", "North Korea Responds To Trump, Threatens To Nuke New York City https://t.co/e4L7a0uLFR", "Another Constitutional Law Professor Knocks Down The Obstruction Of Justice Claim https://t.co/q0UoI0vtWX", "Texas Sheriff Actively Promoting Visas For Illegal Immigrants https://t.co/ckfbgGwRQU", "RT @thatbillokeefe: Kurt Eichenwald's favorite romance novel. https://t.co/VTKg6V3uok", "Linda Sarsour: Stop Obsession Over Treatment Of Gay People In Islamic Countries https://t.co/iGvqNNAZGi", "Jersey City Mayor Wants Cops Fired After They Saved A Burning Man https://t.co/hYySl8xVUH", "Newsweek Reporter @kurteichenbald Posts Photo Showing Creepy Tentacle Porn Tab In His Browser https://t.co/FOy7PJLEtu", "Pelosi Investigating Why Trump Visited Saudi Arabia On First Foreign Trip https://t.co/cYbarOdHUN", "Japanese Emperor To Abdicate, First For A Monarch In 200 Years https://t.co/eeIR94sP8o", "BREAKING: Large White Pick Up Truck Runs Into People, Police In Adams Morgan, D.C. https://t.co/Gf0o3OaRJ1", "RT @LauraWalkerKC: Oh lawd https://t.co/BhdXQF5yiX", "RT @thatbillokeefe: Tweets that did not age well. https://t.co/GwgrLyzv2a", "McCain Blames His Bizarre Comey Question On Late-Night Baseball https://t.co/Ptvw9tyTf2", "Feds Drop Bombshell: Up To 100 Girls May Have Had Their Genitals Cut In Michigan https://t.co/bWMpg9tEoy", "10/10. Would read again. https://t.co/67GRGsruLM", "Cal Poly Frat Apologizes For Group Photo After Being Accused Of Cultural Appropriation https://t.co/J7uCJfeRKk", "Czech Republic Now Refusing Migrants In Fresh Blow To EU Quota Scheme https://t.co/RMod1gLbCX", "Guess Who Just Called Out Linda Sarsour in Magnificent Evisceration? https://t.co/EgL8YRUV9C", "News of Clinton Using Prison Labor as First Lady of Arkansas Causes Social Media to Erupt https://t.co/mzym5rIDtX", "Hating crime (terrorism) is not a hate crime. https://t.co/zP7OUPtKjs", "First Amendment Nonprofit Threatens to Sue Trump for Blocking People on Twitter https://t.co/MdKVUNci9B", "Piers Morgan To London Mayor: What Is A Bigger Priority Than Following Terrorists? https://t.co/THQWzEK80L", "Hillary Takes A Slap At Trump, Gives Support To London Mayor https://t.co/M9jVDon4oD", "London Bridge Terrorist Worked At Westminster Tube Station And Had Access To Tunnels Under Parliament https://t.co/FieGD7OA26", "London A Reminder That Deadly Political Correctness Perpetuates Terrorism https://t.co/yrN95ZRhD1", "Two Of London Attackers Named By Police https://t.co/rjX22Yrgd3", "Iran Developing Advanced Nuclear Capabilities, Reducing Time To Weapon https://t.co/S9XSmVu9Bh", "London Attacker: Known To Police, Tried To Radicalize Children With Candy, Featured In Jihadi Documentary https://t.co/MZ4bG8BfUQ", "Bernie Sanders Made $1 Million In 2016 Selling Socialism To College Kids https://t.co/shVYVeuv7M", "Eyewitnesses Say Community Police Fled From Scene Of Terror Stabbings At Borough Market https://t.co/4lDQkWDGlN", "The Enemy Within: UK Monitoring 23,000 Suspects Including 400 Who Fought For ISIS In Syria https://t.co/tPeDlji7Jg", "RT @thatbillokeefe: You know what's better than pint glasses? Guns. https://t.co/EV0g5lDJqi", "Video of suspect in London attack being arrested https://t.co/63rTtPUA2i", "Three terror incidents in London tonight https://t.co/63rTtPUA2i", "BREAKING: 2 ongoing  terror incidents in London tonight https://t.co/63rTtPUA2i", "UPDATE: reports of a second terror incident at Borough Market in London https://t.co/63rTtPUA2i", "Ex-Spy Says NSA Did Mass Surveillance During Utah Olympics https://t.co/ms3nKh8O0d", "Social Justice Warriors New Favorite Target Is American History https://t.co/fT0E9t2Rco", "Ted Cruz Busts Elon Musk For Flying Private Jet While Lecturing Trump On Global Warming https://t.co/83IUx9Qgq4", "DNC Lawsuit Lawyers Receive Unsolicited Contact From Debbie Wasserman Schultz https://t.co/K4EEqpwufu", "RT @thatbillokeefe: \"Kathy never imagined it would be interpreted as a threat of violence.\" https://t.co/ZKVNWBXnca", "/popcorn https://t.co/g02BY3mKsx", "What career. https://t.co/a1MVdYwpz1", "Hillary Clinton Dings American Election System, Suggests Selection By Elites Is Better https://t.co/VmvU3Zjt1R", "Kellyanne Conway: Washington Bureaucracy Holding Up Potential Trump Administration Hires https://t.co/lA6NkTtf6t", "UPDATE: Sen Al Franken reverses course, cancels book event with @kathygriffin after saying he wouldn't ...\n\nhttps://t.co/66WohMqIWO", "If you don't like it, you can live in one of those other countries on the list? https://t.co/fFdpDtFBT9", "You should switch to decaf coffee. https://t.co/04Ltj2B8Nn", "Bitter Hillary Clinton Is Now Blaming Inept DNC For Election Loss https://t.co/BcclESLVIC", "Prominent Anti-Trump Group has Received More than $20 Million in Government Grants https://t.co/c0517LneaM", "Susan Rice, John Brennan, Samantha Power Targets Of Subpoenas By House Intel Committee https://t.co/MKK0d16Uff", "5,500 Non-Citizens Discovered On Virginia Voter Rolls https://t.co/ukTX0Lznbl", "Barron Trump Was Watching TV, Saw Kathy Griffin Photo, Thought Was Real, Screamed For His Mom https://t.co/JhmwcES6vY", "CNN Commentator Dismisses Upset Over Griffin Pic: Just Speaks To Trump Need To See Themselves As Victims https://t.co/TyqS6Er22Z", "RT @mikeryan: https://t.co/fVjbQaTZCc", "Cory Booker Breaks Ranks With Dems on Kushner, Liberals Turn on Him https://t.co/khC3TdA2yk", "BREAKING: Armed Suspect In Orlando Airport With Gun https://t.co/b7aqPHCLYy", "Attorney To File Lawsuit In Seth Rich Murder Mystery https://t.co/Ne8mXJkPDX", "UPDATE: Kathy Griffin Tweets Video Of Her Holding Decapitated Head Of President Trump....\n\nhttps://t.co/vYDLLAO8e3 https://t.co/CNAoSTXT2B", "Kathy Griffin Beheads President In \"Photo Shoot\" \n\nhttps://t.co/vYDLLAO8e3 https://t.co/EjyoDv9hb0", "Savannah Guthrie Gushes All Over Chelsea Clinton: Do You Have Plans To Run For Office? https://t.co/5CNq3Ak3km", "White House Communications Director Mike Dubke Resigns https://t.co/j9UCZ4cysr", "Portland Killer Is An Anti-Circumcision, Bernie Sanders Supporter https://t.co/OXNXPESup5", "Ivy League Illegal Immigrants Demand Free Health Care, Required Sensitivity Training For Faculty https://t.co/qPQ8Y6nNFi", "Biden Blasts Dems For Ignoring Working-Class https://t.co/Im11KgYXrR", "MSNBC Analyst Shocks Host By Insisting Jared Kushner Is A Russian Agent https://t.co/iiKsQGt929", "Report: Democrats Attack, Threaten TX GOP Lawmaker After He Calls ICE On Illegal Aliens https://t.co/AmDuaJqRGa", "Paris Mayor Condemns Black Feminist Festival, Says It Bars Whites https://t.co/NScUYFXJg9", "Paris Mayor Condemns Black Feminist Festival, Says It Bars Whites https://t.co/3SEocKE9hp", "900,000 Motorcyclists Ride Through DC To Honor POWs On Memorial Day Weekend https://t.co/P3nG9d3jsW", "RT @dcexaminer: Why you shouldn't confuse Memorial Day and Veterans Day https://t.co/dT4ZfOckrp https://t.co/H02WtxksWP", "Rahm Emanuel Gets Uncomfortable Over Questions About Clinton Running for President Again https://t.co/AhRYnBLN67", "Just A Thought On Memorial Day Greetings https://t.co/of0wlvYWJL", "Trump Recognizes Those Who Gave All On Memorial Day, Will Be At Arlington https://t.co/AgrdEzvwmL", "BREAKING: What Are The Red Strobe Lights At The White House? https://t.co/abwCoO4EHn", "Cross In Tomb Of French National Hero General de Gaulle Vandalized https://t.co/ryjKeSKfLz", "BREAKING: Man Arrested, Believed To Be Responsible For 8 Dead, Including Lincoln Deputy https://t.co/39RhQMxYrk", "Reality Challenged Hillary Clinton: My Detractors Fear Me https://t.co/a0JbJPSUad", "UK: Welcome Mat For Jihadists https://t.co/fLMfSw2tPM", "Detective Seriously Injured In Attack Slams De Blasio For Honoring Terrorist https://t.co/kg5FOdY7sU", "Intelligence Leaks Intended To Hurt Trump Spill Over To Compromise US Allies https://t.co/UaqsXbcpyR", "Dearborn Muslim Man Eats Pepperoni Pizza, Sues Little Caesars Over Wrong Labeling https://t.co/kDA6RvS8td", "ICE Agents Eat Breakfast, Compliment Chef, Then Arrest 3 Workers At Michigan Restaurant https://t.co/T544mGFJ9z", "Trump Puts America First At The G7: Stands His Ground On Climate Change, Trade, And Refugees https://t.co/aJ3fhaGwRu", "RT @MarkDice: Why did Hillary Clinton dress up as Monica Lewinsky for the #Wellesley2017 commencement speech? https://t.co/DeRAhBubS9", "Did Tides Foundation Sway Canadian Election? MP Wants Investigation https://t.co/L7dlOI3AWM", "I identify as Darth Vader. https://t.co/xkJeBxVXtR", "Berkeley Police Arrest Local Professor For Allegedly Beating Trump Supporters With Bike Lock https://t.co/x81L8KAg5a", "Media Matters Targets Hannity Advertisers https://t.co/Qifpu2MgaD", "Concealed Carry Up 215%, Murder Rate Down 14% https://t.co/vfNLoA1YE5", "Miracle! Hours After Melania Visits Sick Little Boy In Vatican Hospital He Gets Life Changing News https://t.co/2ZxS1vuJNN", "Professor Wants To Ban White Men From Teaching https://t.co/iyaZVzwNwG", "House IT Aides Fear Suspects in Hill Breach Are Blackmailing Democratic Members With Their Own Data https://t.co/YorU6sxPjn", "Texas Sheriff Defends Controversial Facebook Post Over Manchester Bombing https://t.co/lWOW4uP2KS", "Report: VA Hospital Served Patients Food With Cockroaches on Trays https://t.co/QMoT4ze4nO", "Explosions At Brit Tourist Spot In Jakarta, Believed To Be Suicide Bomber https://t.co/cpuGrLQBpq", "Game Of Thrones Author George Martin Compares Trump To King Joffrey (Who Is Assassinated) https://t.co/U8yrzclGha", "Obama Intel Agency Secretly Conducted Illegal Searches On Americans For Years https://t.co/Hwjucn4Zjk", "British Singer Morrissey: Britain Too Scared To Blame Islam For Manchester Attack https://t.co/3u9eCS78fA", "Police: Manchester Bomber Was Part of a Network https://t.co/1bjQ3v8ecy", "Moonbat Summit: How To Be A Reducetarian For Reducing Societal Meat Consumption https://t.co/r79DSgrPW3", "It can be both... https://t.co/fYO7dlvjJh", "RT @GentlemanRascal: Hah! I would play this version of Dark Rit for sure. https://t.co/cmgtiMk65n", "2017 Has Seen A Terror Attack Attempted In Europe Every Nine Days https://t.co/bWNQ9Ha8GH https://t.co/nqKaN0kWR1", "MSNBC Beats CNN, Fox News in Weekly Primetime Ratings for the First Time https://t.co/hzckBTcjOf", "Trump Meets With Mahmoud Abbas, Says Believes Can Ultimately Get To Deal https://t.co/qMA8NCwgcj", "NYC Mayor De Blasio To March In Parade Honoring Terrorist https://t.co/DllkOmKeoa", "House IT Aides Fear Suspects In Hill Breach Are Blackmailing Members With Their Own Data https://t.co/Zvf66M15mL", "RT @exjon: This &lt;random tragedy&gt; proves that my preconceived notions on &lt;random issue&gt; were right all along!", "To minimize notifications. Delete your account. https://t.co/WPR4WbD0RS", "BREAKING: Nail bombing outside of Ariana Grande Concert in U.K. -- many injuries no word on fatalities https://t.co/dOGEw2R2y1", "As many as 30 may be injured in what appears to be a nail bomb attack in Manchester England https://t.co/dOGEw2R2y1", "RT @thatbillokeefe: BREAKING: A bomb has exploded outside of Manchester Arena in U.K. https://t.co/8VWFeDILEv", "Staggering Number Of Visa Overstays Now Biggest Problem In Illegal Immigration https://t.co/RdeJ2GicNG", "Trump Flight From Saudi To Israel Thought To Be First Direct Flight Ever https://t.co/yjTreWWtL6", "New Hampshire Employers Worry About Impact Of Immigration Crackdown https://t.co/F6z0aCwHQ1", "Caption This Amazing Pic Of Trump In Saudi Arabia https://t.co/JVBPYSyXYc", "Obamas Talk Global Warming In Jet-Setting With $15k Per Night Tuscan Villa, With 6 Fighter Jets, 13 Car Motorcade https://t.co/cuZB1iNLow", "As D.C. Attacks Obamacare, California Takes Steps Toward Single-Payer https://t.co/WG6ibLguSo", "Charlotte Area Church Accused Of Posting Offensive Signs https://t.co/tEcPwJSoJH", "Michigan Voters To Trump: We Have Your Back https://t.co/wClxoX9mPK", "Charlotte Area Church Accused Of Posting Offensive Signs https://t.co/AFJCfmLItf", "Man Who Tried To Break Into Cockpit On Flight, Unruly And Arrested Before Flight, Still Allowed On Plane https://t.co/C9YxqsvOfi", "Unemployment Claims At Lowest Level In 28 Years https://t.co/UPJL78vyZg", "Off-Duty Illinois Deputy Dispatches 17-Year-Old Robbery Suspect With The Taxpayer Relief Shot https://t.co/TN5B2KYoY7", "Audio Analysis Shows Erdogan Told His Security Goons To Attack Protesters In D.C. https://t.co/93viDX1KW7", "83 Charged In FBI Gang Investigation Of North Carolina United Blood Nation https://t.co/58cZm35zkd", "American.\nHero. https://t.co/rH94H00jxZ", ".@RussianEmbassy Rossiya preuspevayet v ekonomike :(( https://t.co/TL956QS8Ce", "Senate Democrats Reject Lieberman For FBI Director https://t.co/azi9Akc28q", "BREAKING: Sweden Drops Rape Probe Against WikiLeaks Founder Julian Assange https://t.co/2ZFmsMpQ2D", "Joe Lieberman Emerges As Front-Runner For FBI Director https://t.co/F679wgIwVK", "Hello.\n\nGo away.\n\nThanks!\n\n=) https://t.co/Apoi2QdnFa", "RT @_the_blessedone: Surprise motherfucker https://t.co/LEPDW4cerR", "Wealthy Socialist Bernie Sanders Again Fails To File Senate Ethics Financial Disclosures On Time https://t.co/Y1LjFgxhpK", "Entire Police Department Escorts Daughter Of Fallen Officer To Prom https://t.co/MUs0opCXn5", "Wealthy Socialist Bernie Sanders Again Fails To File Senate Ethics Financial Disclosures On Time https://t.co/h0B6ki7xQT", "When American women and elderly are choked, kicked in the head and beaten by Turkish agents. Immunity should go bye\n\nhttps://t.co/J1ekB2HhG8", "RT @thatbillokeefe: RIP Roger Ailes he will be missed by all women.", "Diplomatic Immunity Could Hinder Pursuit of Turkish Officials Involved in Attack on Protesters https://t.co/ST6RJCI1iu", "De Blasio Press Office Spreads False Rumor, Tweets Immigration Officials Going After 4th Grader https://t.co/PkXf5CT9ho", "Holocaust Survivors Send Letter to Cuomo to Stop Linda Sarsour From Speaking at Public University https://t.co/rrsWl5AeWC", "Jimmy Fallon Refuses To Become Ultra Liberal Douche Like Every Other Late-Night Show ... https://t.co/18dUnIs4gY", "Democrats Trying To Force A Vote On A Bill For Independent Russia Probe https://t.co/eWGapcJFIU", "Obama Ordered The U.S. Intelligence Community To Share Sensitive Intel With Cuba https://t.co/KKim0eyiQD", "Russia Expert Says Effort To Attack Trump Is Causing National Security Threat https://t.co/IlUOCcHK48", "Before Lois Lerner Targeted The Tea Party, She Helped The Clinton Foundation https://t.co/bve0FPd2Pc", "BREAKING: Senator Thom Tillis Collapses During Race And Is Taken To Hospital...", "Russia Expert Says Effort To Attack Trump Is Causing National Security Threat https://t.co/IlUOCcHK48", "California Budget Proposal Includes Millions For Illegal Immigrant Legal Defense https://t.co/tHydpVFgVL", "California Budget Proposal Includes Millions For Illegal Immigrant Legal Defense https://t.co/z01j1rQv0e", "White House Denies Explosive Report That Trump Leaked Classified Info To Russians During Visit https://t.co/A5rVW4O8LI", "Bill Cosby Says Sex Allegations Could Be Racist https://t.co/EGgnad6ehw", "Researchers See Possible North Korea Link To Global Cyber Attack https://t.co/MCYqo09mZH", "UN Agency Helps North Korea With Patent Application For Banned Nerve Gas Chemical https://t.co/4i9ZTe1NZz", "State Department Says Assad Using Crematorium To Dispose Of Murder Victims https://t.co/eo6DXZBJAg", "Facebook Allegedly Bans Ex-Muslim Pages In Australia https://t.co/67MwTd6k2N", "Illegal Alien In Florida Calls 911 Asking To Be Deported https://t.co/SpRzn3j8Gb", "Trump: White House Will Be Lit With Blue Tonight For National Peace Officer Memorial Day https://t.co/HvUYKpPBQW", "Leftists Protest Targets FCC Chairman At His Home https://t.co/rMr1RkuzUi", "Miss USA -- \"Healthcare is a privilege not a right\" https://t.co/j8L5fyIf24", "Trump Ordered Emergency Meetings To Deal With Massive Global Ransomware Attack https://t.co/CRlulCgEKo", "U.S. Lawmakers Ask Trump To Turn Over Any Comey Tapes https://t.co/aVXP2CSoVz", "Islanders Goalie Is Sorry For Liking Instagram Post That Compared Hillary To Hitler https://t.co/nMpso7ldax", "Trump Calls For Stronger Sanctions On North Korea After They Fire Missile https://t.co/q6uTXqH8o6", "Overnight Open Thread: Hero Police Dog Shot, Took Bullet Meant For Officer https://t.co/v0J0ta2As4", "Comey Says He Is Willing To Testify, But Only In Public https://t.co/0qOk0l5MvQ", "Hackers Exploit Stolen U.S. Spy Agency Tool to Launch Global Cyberattack https://t.co/0gxfggKvKf", "Moonbat At Vox Voxplains Radical Islam As No Threat To Americans Or The West https://t.co/TEP4QfBl8Y", "Dems Angry About Trump Possibly Taping Comey Forget Obama Taped People https://t.co/BkKD0Qq97P", "DeVos Praises BCU Aggrieved Moonbats Who Shunned Her At Commencement https://t.co/x3OzfeGwcJ", "Mexican National Living In GA Has Dreamer Status Revoked For Lying To Police https://t.co/dk8yFqMf4R", "Getting Dangerous: Man Gets Physical With GOP Congressman At Town Hall https://t.co/bZyLhXvCY8", "Nebraska Democratic Party Chair Blames DNC Head Perez for Losing Omaha Mayoral Race https://t.co/2fwNW7HEdO", "Minnesota Is Facing A Measles Crisis, Guess Why? https://t.co/0NpOaYooEj", "Illegal Alien In Connecticut Granted 2-Year Stay Of Deportation After Missing Hearing In 1998 https://t.co/ICewBD4y69 v", "Report: Comey Plotted To Avoid Charges Against Hillary Before The FBI Interviewed Her https://t.co/2Zl3wpLSLb", "BREAKING: Comey Declines Request To Testify Before Senate Committee https://t.co/z1iNAH7DDc", "Massive Ransomware Attack Worldwide -- Emergency Rooms Across Britain In Chaos -- Russian Interior Ministry Hit ...\n\nhttps://t.co/u9Ffe6qopo", "RT @AdamParkhomenko: Breaking news out of New York: https://t.co/W7KkDzjeHd", "Judicial Watch: Obama Admin Leaked Secret Information To Sen. Ben Cardin To Undermine Trump https://t.co/UYjmd0hdO5", "Trump Lawyers: Trump Has No Russian Debt And No Income Coming From Russia https://t.co/aFYf50Yj7B", "Russian Fighter Jet Comes Within 20 Feet Of US Navy Aircraft, Official Says https://t.co/hvqMkNJrXf", "Media Freaking Out That Trump Gets 2 Scoops Of Ice Cream. Really. https://t.co/nb64vrPwcx", "Russian Charged With Breaching U.S. Firms Says FBI Attempted To Coerce Confession Over Clinton Hack https://t.co/j77PmxK6xT", "Olbermann Calls On Foreign Intelligence Services to Overthrow the U.S. Government. Really. https://t.co/E5CBH5yVuU", "VIDEO: Illegal Alien MS-13 Gang Member, Deported 4x, Charged With Raping 2 Year Old Girl https://t.co/hLYPUmFnnl", "Is this just fantasy? https://t.co/ZHsMkN9luF", "NGO: Cuba Doubled Political Prisoners In One Year https://t.co/Fcvf76WuRn", "Senate Judiciary Chair Hints That Comey Revealed Trump Not Under Investigation https://t.co/nrecbl9Iy1", "Aetna To Completely Pull Out of Obamacare Exchanges By 2018 https://t.co/fctJklgI6W", "Illegal Alien Deported 15 Times Arrested In Crash That Hurt Boy https://t.co/AXBHCdK0QV", "Trump Admin Still Considering Moving U.S Embassy in Israel to Jerusalem https://t.co/NaKCvLewoy", "BREAKING: Senate Intel Committee Subpoena For Documents From Michael Flynn https://t.co/ZudATJGaXZ", "Colin Kaepernick May Quit Football, Do Social Justice Work Full Time https://t.co/KwtxOnQh6z", "Nancy Pelosi Praises Nancy Pelosi....\n\n https://t.co/q2LRQpBnAE", "NYC Bomber Claims Cops Shot Him Too Many Times, Wants Reduced Sentence Because Of His Pain And Suffering https://t.co/8gbYhuSujW", "Rep. Tom Garrett (R-VA), His Family, Even His Dog, Targeted With Death Threats https://t.co/3mCb8T547w", "Young Man Plays Venezuelan National Anthem On Violin In Midst Of Street Protests And Tear Gas Bombs https://t.co/Z8VCWIq8Gw", "Senate Dems Threaten To Block Committee Hearings Over Comey Firing https://t.co/UNOqFi18aW", "Obama Scolds Americans For Eating Meat, Says Causes Global Warming, But WH Chef Says He Ate A Lot Of Steak https://t.co/2bigtyJU7y", "Kamala Harris -The Next Obama? https://t.co/s7bUIjAASS", "Obama Uses Private Jet, 14 Car Convoy To Get To European Climate Change Speech https://t.co/7xLNViy54O", "Colin Kaepernick May Quit Football, Do Social Justice Work Full Time https://t.co/5WkQddPUqJ", "RT @SarahFoxes: Quick while we don't have a FBI Director, copy all the VHS tapes you have! No one can stop you! https://t.co/zxUvnPWMtW", "RT @exjon: Democracy Dies in 72-point Bold Type https://t.co/0HuKeZYFjI", "RT @thatbillokeefe: @ChelseaClinton What's so funny about a Democrat committing genocide? https://t.co/AVUICcRjy6", "You're right. He waited till J Edgar died to ransack his office looking for anything he had on Nixon. https://t.co/MFkIwhasrC", "BREAKING: FBI Director James Comey Fired By Trump https://t.co/vs8zjZ0dF9", "Bye murderer. https://t.co/SGjU6HFIMa", "Lefty Loser Keith Olbermann Blames Donald Trump For Failing To Get Job At CNN https://t.co/X52vqDDsAP", "FL NAACP Calls On University Officials To Resign Over Betsy Devos Invite https://t.co/voac4yr62M", "Keep it up ghouls. https://t.co/2WfhAKClER", "Disgusting. You should be ashamed of yourselves. https://t.co/qi5rjmwkNq", "California May End Ban On Communists In Government Jobs https://t.co/ZBwtjtiOG4", "Yates Testimony Fails To Produce Any Bombshells Despite Hype https://t.co/8RXQpuRXN8", "RIP @Bob_Owens.", "She really should put a restraining order out on you now. https://t.co/OawvveGe98", "United Airlines Flies Woman To San Francisco Instead Of France https://t.co/ORyCTfEIkl", "Dem Sen. Joe Manchin: No Evidence Of Collusion Between Trump Campaign And Russia https://t.co/FInIK39qtt", "Classy: Bill Maher Mimics Sexual Gesture Involving Ivanka and Donald Trump https://t.co/IcEvTnTrSd", "Sally Yates To Testify Today: Will They Mention This 2016 Report About Her Democratic Bias? https://t.co/T4DTnsPEHS", "Trump To Announce Slate Of Conservative Federal Court Nominees https://t.co/9mMHaiL8gn", "Pressure Builds On FBI To Explain Garland, Texas Terrorist Attack https://t.co/jsZNbBW4m4", "Mexican Engineers Flood Tesla Hiring Event In California https://t.co/Tegfu0AOWS", "Hungry, Hungry, Jihad.... https://t.co/FcHOzsC0b1", "BREAKING: Leader Of ISIS In Afghanistan Abdul Hasib Killed In Joint US/Afghan Strike https://t.co/AJATa3vCtK", "Haley Condemns Venezuela Crackdowns, Abuses https://t.co/8gOYtDxqn8", "ICE Has 27 Different Databases For Visa Overstays, But Catch Only 0.4% https://t.co/PYdbtAYMu5", "Chicago Police: La Raza Gang Members Ambushed Officers With AR-Style Rifle https://t.co/uzNH9aP4u6", "Liberals Claim To Love Science, But What They Truly Love Is Power https://t.co/LrEaVjykfv", "North Korea Detains Another American https://t.co/2D78bHnQW9", "Reality Challenged Snowflake Spends $35,000  To Become A Real-Life Elf https://t.co/rv0riDEepM", "Black Newspaper Columnist Who Defended NRA Quits After Suspension https://t.co/MUiF6K6qz0", "US, Saudi Arabia Negotiating Major Arms Deal https://t.co/b1tFtRVeBe", "Obamacare Repeal Is Imperfect, Does Eliminate The Tax Burden On Everyday Folks And Businesses https://t.co/S4c8WawxJd", "ISIS Tells Jihadists To Attack U.S. Gun Store Owners As Way To Acquire Firearms https://t.co/JkHuYaxNpT", "George Soros Battles $10B Lawsuit, For Meddling In The Affairs Of Another Country https://t.co/OyohGprZXP", "Bond Set At $25K For Man Arrested For Facebook Post Threatening Law Enforcement https://t.co/su4nLEzyOH", "RT @thatbillokeefe: This is what a baby born into the Socialist utopia of Venezuela looks like. Starving. https://t.co/dHzfky8zs4", "George Soros Battles $10B Lawsuit, For Meddling In The Affairs Of Another Country https://t.co/OyohGprZXP", "Feminist: Men Should Scream And Pee On Trump Tower To Scare Him .... https://t.co/DOqijBWoCv", "Not From The Onion: Florida University To Award Trayvon Martin A Posthumous Honorary Degree https://t.co/1u9GnC0sbQ", "Unemployment Drops To Lowest Level In A Decade https://t.co/dk5JVC3KQy", "North Korea Says CIA Plotted To Kill Kim Jong Un https://t.co/n03q34mhed", "NYT Correspondent Falsely Reports House Members Voted to Exempt Themselves From GOP Health Care Bill https://t.co/Y8dL3j7W7z", ".@emilyyoshida What if you already scream when you pee? Is that OK? #AskingForAFriend https://t.co/KnMN5N7aNn", "Pics or it didn't happen. https://t.co/lnkjtDroFU", "RT @slatermaus: No amount of pot smoking will make you as unhealthy as Chris Christie. https://t.co/yvL1uk05qV", "RT @GentlemanRascal: https://t.co/utVmOuZlvN", "Dianne Feinstein Urges Susan Rice To Testify, Skewers Her Excuse https://t.co/h0edzT4dEE", "Dianne Feinstein Says She Has Not Seen Evidence Of Trump-Russia Collusion https://t.co/tvR7x9tfAZ", "RT @RubinReport: #MayThe4thBewithYou https://t.co/JlL45iJmGY", "North Korea Now Threatening China...\n\nhttps://t.co/wXHHyOn2Mz", "95 Year-Old Prince Phillip, Duke Of Edinburgh To Retire From Public Life...\n\n https://t.co/83wmsI6onX #BuckinghamPalace", "BREAKING: Entire Royal Staff From Across Country Called To Emergency Meeting At Buckingham Palace https://t.co/zV2ppkBJyR", "Hippy Beatdown: Truck Vs May Day Protesters https://t.co/cpBrXpmE89", "Comey: Abedin Sent Classified Info To Anthony Weiner https://t.co/bzGjDWi6lG", "Hippy Beatdown: Truck Vs May Day Protesters https://t.co/rfw1PEwB2U", "DOJ: Cost Of Non-Citizens In Federal Prisons Exceeds $1.2 Billion https://t.co/p4FZvaL450", "Conservatives Fume Over Complete Concession To Democrats On Budget Deal https://t.co/2arN9gjtJW", "New Huma Abedin Emails Reveal 29 Previously Undisclosed Clinton Emails With Classified Information https://t.co/MSbPCFA5Q8", "FBI Was Investigating Black Nationalist Leader Who Shot Dallas Paramedic, Cops https://t.co/jIrDKoztYe", "This woman is all of us when we see Madonna...\n\n https://t.co/sp3UIHaOrs https://t.co/PTBw6mPcS0", "Stephen Colbert Calls Trump A Very Offensive Homophobic Slur https://t.co/JEGZmAa2OL", "Antifa Gets Arrested After Setting American Flag On Fire https://t.co/XtRvyUcuWB", "Female FBI Linguist Secretly Married ISIS Terrorist She Was Supposed To Investigate https://t.co/t1us4B9fya", "Photo of man who stabbed students at UT Austin https://t.co/mltyqaisPw https://t.co/ht0JH7wkTT", "HUD Watchdog Kept 14 Fraud Reports Hidden From Public https://t.co/gWUAlMXJrI", "NYT: Communism Once Gave Ordinary Americans A Sense Of Their Humanity https://t.co/WCWsVheg6R", "Warren Hits Obama Over Economic Record in New Interview https://t.co/4HzJUqo7wd", "Blocked. https://t.co/QmFqsrbTtB", "Pelosi faces the Bern https://t.co/KGTyhyHQAV", "EPA Removes Climate Change Pages From Website https://t.co/9eg6C45k9M", "Democrats Say They Now Know Exactly Why Clinton Lost: Lack Of Voter Turnout https://t.co/v9HyX9diSj", "Jet Setters Al Gore And Richard Branson Fly In For #ClimateMarch https://t.co/4rswC0UUk1", "RT @AlexMLeo: In which the @BostonGlobe treats violent racist groups like they're 90210 characters https://t.co/wtxFXXi3ks", "Two Illegal Aliens Arrested For Prostituting Underage Girls https://t.co/fN2Ko89Khq", "What do I win? @evepeyser https://t.co/zk7HMsEmLm", "The Decline Of Comedy Central: Their New Left-Wing TV Shows All Suck https://t.co/f4Sf39yKfR", "Who needs oil, I ride the bus.\n\nhttps://t.co/NDEdZf3Qso https://t.co/fHpwdpLMLv", "College Speaker Whines About Prison But Fails To Mention That She Tortured And Killed A Man https://t.co/vk5DAWByhT", "Former Democrat Congresswoman Corrine Brown Ripped Off Own Charity To Fund Lavish Lifestyle https://t.co/ufeNs4rECW", "RT @scottlincicome: WHICH MEANS WE'D HAVE A GIANT TRADE DEFICIT MY GOD I CAN'T TAKE IT ANYMORE https://t.co/8ISzZsuGja", "Documents Tie Berkeley Riot Organizers To Pro-Pedophilia Group, NAMBLA https://t.co/YXMf6N6uth", "BREAKING: North Korea Ballistic Missile Test Fails: Report https://t.co/1Rh2NGyVXY", "Delete your account (again) https://t.co/m8bNPyvJTX", "RT @Spacebunnyday: https://t.co/DqLpq81LDP", "RT @Mr_DrinksOnMe: Weird combination of signs. https://t.co/dDNwU64oht", "BREAKING: Dept Of Defense Inspector General Launching Investigation Into Michael Flynn https://t.co/xI9Ef2QyKN", "Bill Nye Sexualizes Ice Cream, With Bonus Swipe At Christians https://t.co/3jCpJVqfYq", "Chicagoland -- 1,000 people shot in city in just 4 months https://t.co/INqKWSpk8G", "Cruel and unusual. https://t.co/08C7xyuYXe", "Turkish Jets Bomb US-backed Forces In Iraq, Syria, US Officials Say https://t.co/94AJYwTBaY", "Michael Bloomberg Chides DeBlasio Over Sanctuary Cities \"The Law Is The Law\" \n\nhttps://t.co/rtgOB2chZE", "North Korea Holds Huge Live-Fire Drills As U.S. Sub Pulls Into South Korea https://t.co/bwZQvr3EHl", "Obama Will Earn $400K For One Of His First Paid Speeches: Report https://t.co/KCrQutpezV", "Obama Admin Mishandled Thousands of Citizenship Applications Before 2016 Election https://t.co/dzEwMbwNTc", "Bomb Attack Hits Secretive U.S. Base In Eastern Afghanistan https://t.co/cSGrWE5uzA", "Entire U.S. Senate To Go To White House For North Korea Briefing https://t.co/eZFGagF33f", "Biden Used False Data to Smear Marine Corps Over Armored Vehicle Request from Iraq https://t.co/8fS9W5r5kH", "Despite Reports, Fmr Fox Guest Now Claims She Was Never Sexually Harassed by Sean Hannity https://t.co/bhSe9g0CQb", "Nope. They are. https://t.co/tVpgeLcLEO", "Five Killed, 26 Wounded In Chicago Shootings Over The Weekend https://t.co/os85fsUyUh", "Five Killed, 26 Wounded In Chicago Shootings Over The Weekend https://t.co/3q8vpENJWt", "Go away. https://t.co/OpKDkXbTHx", "North Korea Threatens To Sink USS Carl Vinson https://t.co/86ZaMKJh59", "Trump Replaces Surgeon General With Black Female Rear Admiral Nurse, Liberals Slam Her Credentials https://t.co/hBaEVjHN6f", "Police: Muslim Indiana State University Professor Fabricated Anti-Muslim Attack https://t.co/ojza6O035V", "Yup. We remind people every year!\n\nhttps://t.co/jcgJ8hN061 https://t.co/xDIw8NtwYO", "RT @thatbillokeefe: Where's Ira Einhorn the founder? Oh right, in jail for murdering his girlfriend. https://t.co/23er34MR9o", "Sanders Asks How Many Yachts Billionaires Need, Twitter Asks How Many Houses He Needs https://t.co/pYhljdhanJ", "Never could beat that game.... https://t.co/8f5CJwfznG", "RT @GeorgeHWBush: Big morale boost from a high level delegation. No father has ever been more blessed, or prouder. https://t.co/ekX4VyG2aO", "Anti-White Fresno Killer Laughed About Murders During Police Interview https://t.co/kfZdqEZgff", "Huffington Post Blogger Declares Trump Supporters Deserve to Die https://t.co/rCQirVJtwW", "University Students Want Free Tuition For Blacks As Reparations For Slavery https://t.co/pWWmiQ6n5W", "ISIS Claims Responsibility For The Attack On Police In Paris https://t.co/pYCYdg8KzI", "Illegal Aliens And Possible Terrorists Have Used Immigration Loophole To Enter U.S. https://t.co/0mGV9jhBPb", "Fight Like A Girl: A Tale Of Two Pictures https://t.co/s3H8Q6QQTX https://t.co/Is2GNtGapR", "I lol'd. https://t.co/RcI568VIim", "Report: Trump Saves More Than $60 Billion More By Eliminating Obama Admin Rules https://t.co/vSGGzRvsR6", "Make me. https://t.co/dlEMGskgJa", "Hillary Camp Scrambling To Find Out Who Leaked Embarrassing Info https://t.co/7peym9B39M", "So write a book. https://t.co/bZDut0V7r0", "It can be both!! https://t.co/5bEgDA4Gxa", "RT @Kronykal: Socialism. Doesn't. Work. \n\nhttps://t.co/8YBrbvfylx", "RT @thatbillokeefe: \"Fight Like A Girl\".\n\nVenezuela vs America. https://t.co/imOFt4xtMQ", "Hi Eric,\n\nhttps://t.co/iKSzARPyGz\n\nYou're welcome!!\n\ncc: @AndreaNRuth https://t.co/NxskUfNL45", "y'all find Wisconsin yet? cc: @Wisco https://t.co/5bVnPqaoVf", "Venezuelan Government Seizes GM Factory ... https://t.co/GAKaTuhJtW", "RT @girlposts: to everyone smoking the devils lettuce today https://t.co/omWdSXqU2O", "GO\nAWAY\nWE\nHATE\nYOU https://t.co/9oGAUXqKxs", "RT @thatbillokeefe: Holy shit those are some yellow teeth. https://t.co/xFglb7hOWb", "Report: CIA, FBI Hunting For Insider Who Gave Docs To WikiLeaks https://t.co/kuupSg4tt0", "DNC Chair Pushes Chaffetz Russian Conspiracy Theory https://t.co/AY3dAHLKa3", "No thanks. https://t.co/efHRtYhXpD", "Killing Bill O'Reilly's career. https://t.co/MEoNTWTzJF", "North Korea Shows Video During Birthday Celebration Of Them Blowing Up The United States https://t.co/T8z0XqXqHy", "ISIS Attacks Iraqi Unit Backed By US And Australian Advisers With Mustard Gas https://t.co/jbU6n53Ou8", "Muslim Shooter In Fresno Killed 3 White People; Hated White People, Trump, Bannon https://t.co/JfH6WsqIFr", "Facebook Gives Staff Greenlight To Protest Trump On May 1 https://t.co/LY4t72q60Y", "Old Man Yells At Cloud.... https://t.co/hpmyVVOkye", "RT @redsteeze: Fixed https://t.co/4bOdIFLtce", "US Sends Two More Aircraft Carriers To Korean Peninsula https://t.co/gJ7i3RW36n", "Who wants to tell this clown show that the statue is a marketing stunt by a billion dollar Wall St marketing firm? https://t.co/PiTAqVXOoL", "RT @thatbillokeefe: Corporate mascot poses with corporate stooge. You decide which is which. https://t.co/WvyuIjB6zE", "Alt-tweet: Man with two vacation homes whines about rich people. https://t.co/zbtKYd3DA9", "Comrade De Blasio Raises His Rents While Pushing Rent-Control Policy https://t.co/qdxej1d17o", "More Than 70 Liberal Groups Partnered for Anti-Trump Tax Day Protests https://t.co/FumD3GiPGU", "North Korean Commandos Ready To Kidnap Americans, Says Defector https://t.co/W3ABTK5Ktm", "University Plans To Spend Thousands Training New Student Revolutionaries https://t.co/qwCtg4DLfq", "Haitians Get Word Of Trump Crackdown, Slow Flow To Border By 97% https://t.co/uAeFTS7wmy", "Trump Got China To Crack Down On North Korea https://t.co/UWsE55sWyP", "Army Ranger Has Message For College Students Triggered By Chick-fil-A On Campus https://t.co/3yz7ALlA4f", "Nearly A Third More Immigration Arrests Under Trump Compared To First Months Of 2016 https://t.co/64VaAkLen7", "Cleveland Facebook Killer Still On Loose, Possibly Was Near Erie, PA https://t.co/C9TcKvP3zY", "...ok then. https://t.co/2UtTkoboMh", "Trump Got China To Crack Down On North Korea https://t.co/UWsE55sWyP", "RT @HistoryInPix: Easter presents for Hitler https://t.co/myxJE4MJ6V", "Happy Easter! https://t.co/Ee5zKMluE7", "RT @thatbillokeefe: North Korea fails to launch missile.\n\nhttps://t.co/GT2lMxv3cE https://t.co/LpfIy4xnBe", "Local Muslims Try To Shut Down Sharia Law Patrol In Minneapolis Neighborhood https://t.co/ya7Ie0GsJp", "RT @WTEN: #BREAKING: (AP) Personal doctor says Emma Morano, at 117 the world's oldest person, has died in her Italian home.", "Good News! Number Of ISIS Killed By Mother Of All Bombs Rises To 94, Includes Leaders https://t.co/38PhwF8yMh", "North Korea Has Parade Flaunting Military Might, Including Prototype ICBMs (But No Nuclear Test) https://t.co/qUoo6ny3sB", "RT @thatbillokeefe: North Korea unveils solid fuel ICBM. https://t.co/CotdiG9waM", "Blame the victim. https://t.co/GtTky51rw0", "RT @thatbillokeefe: Didn't actually happen. #FakeNews https://t.co/bShN82e0dO", "Ex-Obama Officials Say Hesitation To Use Force In Syria, Elsewhere, Emboldened Adversaries https://t.co/Zfgo8GoHjE", "Illegal Alien Who Raped Under-Age Girl Arrested At Atlanta Airport While Trying To Flee Country https://t.co/9uIlcFxTUs", "RT @thatbillokeefe: Live feed of Episode 8  \"The Last Jedi\" teaser https://t.co/XodU7L0aqG", "What part of ISIS' brand of Islam do you agree with? https://t.co/ZDEHGVhfDc", "Arizona Democrat Said He Wants to Punch Female Colleague In Throat Over School Choice Bill https://t.co/q3MiRrSJqA", "Sessions Urged To Purge Obama Staff From Civil Rights Division https://t.co/5AKya7WiFi", "Chicago Asks Trump To Clear Up The Nuclear Waste Left By Obama https://t.co/rQUcFBWAAm", "Which was dropped on terrorists. Problem? https://t.co/tgEObyMT87", "House Republicans Urge Justice Department To Investigate IRS Targeting Scandal https://t.co/1CUdN3tDUO", "North Korea Preparing To Test Sixth Nuclear Bomb Here's A Live Look....\n\nhttps://t.co/YF0qqnWdu6 https://t.co/28NLEB0QcL", "BREAKING: U.S. May Launch Pre-Emptive Strike If They Think North Korea Goes Thru With Nuclear Test https://t.co/YF0qqnWdu6", "Somebody who realizes North Korea is bluffing and and can't do anything. https://t.co/9hRJQbH9sq", "RT @thatbillokeefe: Trump plans war with North Korea and Syria. Joe and Barry play with stickers. https://t.co/ZQci1LEHNS", "DEVELOPING: White House says ready to hit North Korea if nation tests nuclear bomb", "New Images Show North Korea Planning To Detonate Nuclear Bomb https://t.co/LkTX9OAWfw", "Doctor Pulled Off United Airlines Suffered Concussion, Broken Nose, Lost 2 Front Teeth https://t.co/Q6tCRpn9CV", "China Sends Warning To North Korea Not To Mess With US https://t.co/I0aD08WlHq", "Assad Denies Any Involvement In Chemical Attack, Blames U.S., Terrorists https://t.co/GIc9c4eBnl", "China Sends Warning To North Korea Not To Mess With US https://t.co/JaBnVck9Dk", "Illegal Alien With Felony Convictions Charged With Molesting 12-Year-Old Girl At Daycare https://t.co/1sZICUpSKh", "Eleven States Threatened With Lawsuits If No Action Taken To Clean Voter Rolls https://t.co/TblMp3T9bv", "Democrats Are Outraged Over Kansas House Seat Loss https://t.co/BNWfdOR4C1", "Gorsuch Will Have Immediate Effect On Gun Rights, Religious Liberty Cases https://t.co/JzW12cN4aS", "Federal Judge Finds Texas Voter ID Law Discriminates Against Minority Voters https://t.co/467is04qZv", "Nancy Pelosi Politicizes Faith At Rally In California https://t.co/VHhoHI8fin", "North Korea Warns Of Nuclear Strike If Any Sign Of Strike From U.S. Ships https://t.co/t2fUgDXEpZ", "lulz https://t.co/kzemKybTsi", "Chicago Police say man seen being beaten bloody and dragged off a @United flight \"fell\" https://t.co/5sA3Gpsl2a https://t.co/XxMnPMPCam", "Official: U.S. Concludes Russia Had Advanced Knowledge of Syrian Chemical Weapons Attack https://t.co/WIDPu62StF", "Manhunt For Man Police Believe Is Planning An Attack And Is Fixated On Trump https://t.co/oCfZ42KzBe", "RT @UnitedOverBooks: sorry sir we said this seat is taken! https://t.co/S3n2peZnMu", "Cook County Judge Killed, Woman Wounded In South Side Chicago Shooting https://t.co/truXa2mq1O", "RT @kaylyn_davis: #flythefriendlyskies my husband was on that flight. Screw you United!! @united https://t.co/4EcxrMy5jZ", "Fly the unfriendly skies with @United Airlines.\n\nhttps://t.co/cedoAWFRez https://t.co/phdsEyt1Ny", "RT @KatMcKinley: *Brilliant Idea*\n\nLet @united remove Assad. They are good at it.", "You are a despicable company. https://t.co/jUjwUkDmXu", "Horrible: @united Forcefully Rips Elderly Passenger Out Of His Seat, So Employees Can Ride https://t.co/ZN8Qxpa5eb", "Unreal. https://t.co/Hlo1y1ajIX", "Horrible: United Forcefully Rips Elderly Passenger Out Of His Seat, So Employees Can Ride https://t.co/cedoAWFRez", "Budget Director To Tell Federal Agencies To Plan For Major Cuts: Report https://t.co/TrMrIuOrcn", "New York Lawmakers Approve Free College Tuition For Middle-Class Students https://t.co/CoXQukV08z", "British Police Poisoned While Investigating Fatal Poisoning Of Russian Defector https://t.co/fykErbfs5W", "Researcher: Teachers Should Allow Ebonics Because English Grammar Is Too Hard For Minorities To Learn https://t.co/9q2RJ1jVOj", "Stockholm Terrorist Was Rejected Asylum-Seeker https://t.co/nsaozkK3Aq", "U.S. Carrier Strike Group Ordered To The Korean Peninsula https://t.co/QVHXgd1v6j", "RT @weaselzippers: Nuggets are delicious and bi-partisan. We approve!! Do @SenTedCruz and @CoryBooker agree? https://t.co/HVn2z0EtJp", "James Woods Pummels TIME After They Ran False Story About GOP And Gorsuch https://t.co/ijaeYSmVEs", "RT @philhartmark: I want to know what @KenWahl1 @RealJamesWoods and @therealroseanne Think...... https://t.co/IWr3S7H3ch", "Hey @Wendys our little friend needs some spicy nuggets. Help him out. #PolloFritoPorMexy https://t.co/bXiBQOiYIH", "Nuggets are delicious and bi-partisan. We approve!! Do @SenTedCruz and @CoryBooker agree? https://t.co/HVn2z0EtJp", "Germany Moves To Ban Child Marriages After Finding 1500 Cases Among Refugees https://t.co/ziDH1ba25a", "I hope Gorsuch lives to be 200 just to annoy you. https://t.co/iX73J5AbNv", "Russia Moves Warship To Syria https://t.co/JGaYhNCmGA", "First Images Appear Of Syrian Airbase Devastated By U.S. Cruise Missile Strike https://t.co/rJJ8IMZcPe", "Russia Bans Images Depicting Putin As A Gay Clown https://t.co/hSpopTawtZ", "Susan Rice Pushed False Claim About Obama Admin Getting Rid Of Chemical Weapons In Syria https://t.co/WmDuED7MlD", "BREAKING: GOP Invokes Nuclear Option https://t.co/FSSvKNzTsr https://t.co/U7aMulCjPH", "WAR: Rex Tillerson: U.S. Organizing Coalition To Remove Assad https://t.co/3XYvrSuYn3", "RIP Don Rickles.", "McConnell Persists.....\n\nhttps://t.co/FSSvKNzTsr", "BREAKING: Democrats Block Gorsuch, Setting Up Nuclear Response https://t.co/m2FsM96Wdk", "BREAKING: Rep. Devin Nunes Steps Aside From Russia Probe https://t.co/lAEbQKleri", "Crazy Fat Kid Strikes Out - Missile Test A Firry Mess ....\n\nhttps://t.co/5xWiH0gXe5", "RT @VitruvianMonkey: https://t.co/cf0aOQoGCI", "Lindsay Lohan Wears Burkini In Thailand https://t.co/QBscwmy3R6", "Trump Authorization Rescues Ranchers Racked By Wildfires https://t.co/dq4zFVRxYW", "$4.3 million solar road of fail generates only enough juice to power a microwave https://t.co/mHEUlWzEYV https://t.co/bisH3d1in2", "BREAKING: Trump Drops Bannon From NSC https://t.co/JBubuiARfz", "Bring back Crystal Pepsi. Then we'll talk. https://t.co/DYAo7CBntt", "RT @BecketAdams: Pepsi Crystal Clear With Apology https://t.co/P17VJ8FyAy", "FINISH THE DAMN BOOK https://t.co/bZNmbJGKS2", "Break a leg. https://t.co/fY4Ty9pnRG", "On Equal Pay Day, Remember That All Of HuffPo's Editors Are Women - That's Some Diversity....\n\nhttps://t.co/9CttrCPlN2", "Sessions Tells DOJ To Revisit Agreements Obama Forced On Local Police Departments https://t.co/Tdh2JloKPo", "RT @thatbillokeefe: Dishonest Injun: Elizabeth Warren pays female staff $20,000 less than male staff https://t.co/UbJ8qAv1Re", "Knoxville, TN Will be First US City Set To See Complete Obamacare Collapse https://t.co/GG5TpFUaVj https://t.co/hzqUFa5mcy", "Marvel Comics Tries To Appeal To SJWs, Sale Take A Dive https://t.co/3N7opwwxWm", "Justice Department Warns Companies Not To Discriminate Against US Workers https://t.co/MbesRGcCg7", "This man got a \"C\" on a paper about Madison's lost amendment. So he made it his life work to make it happen https://t.co/BZTNi8z1YD", "Report: NSC Has Computer Logs Of Susan Rice Accessing Intelligence On Trump Associates https://t.co/OXj5fEbBMu", "Hail to the chief....\n\nhttps://t.co/cA7zW500na https://t.co/ae8ZX5LjDJ", "Gorsuch Wins Senate Panel Endorsement, Setting Up Floor Showdown https://t.co/8dZHQnWoe1", "Black Lives Matter Philly Bans White People From Its Meetings https://t.co/dPb7fZkN0W", "Dems have votes to filibuster Gorsuch.... \n\nhttps://t.co/y5NeKwjc4N", "Another Evelyn Farkas? Dem Strategist Claims Obama Admin Began Investigating Trump..In Spring 2015? https://t.co/ucO0mB3EmH", "California Transgender Inmates May Soon Be Given Bras, Mascara, Lip Gloss https://t.co/A9aWh5sWT6", "BREAKING: 2 Nail Bombs Explode On Metro In St. Petersburg, Russia, Killing At Least 10 https://t.co/bZyLi364XJ", "BREAKING: Another Dem To Vote For Gorsuch https://t.co/bdr0cpHgU3", "Senate Investigating Why FBI Offered Money To Man To Investigate Trump https://t.co/Je4FmLpa67", "*spit take* https://t.co/iXCLNu4c10", "RT @redsteeze: Two writers huh. https://t.co/LcsHW8NiCI", "RT @thatbillokeefe: At least Pence never drove off a bridge with a woman in his car then refused to sit with her while she drowned.", "Feminist Lawyer Gloria Allred Under State Bar Investigation for Possible Misconduct https://t.co/Zl6xIl7odt", "Look At How Al Jazeera Reports On Palestinian Woman Who Tried To Stab People https://t.co/TUjNEqxSxd", "Terrorists May Have Developed Laptop Bombs That Can Evade Airport Security https://t.co/RUmYqbp329", "No, There Was Nothing Abnormal About Nunes Going To WH To View Intelligence https://t.co/UWTK8LoaO2", "Border Wall Funding Solved: GOP Pushes For 2% Fee On Money Immigrants Send Home https://t.co/aezomMKwpn", "NSA Set To Provide Classified Communications Intercepts To House Committee https://t.co/kjS7cHAcbI", "BREAKING: Michael Flynn Reportedly Agrees To Testify, If Offered Immunity https://t.co/TVvkbGKZAT", "Were Jihadists Responsible For Security At Montreal Airport? https://t.co/eOBr3Wlxay", "Bill Nye: Global Warming Could Be Solved By Cows Genetically Engineered To Cut Fewer Farts [VIDEO] https://t.co/I9hJsnjr81", "Emails Between Dem Lawmakers And Planned Parenthood Show Collusion To Create Law To Get Activists Behind Videos https://t.co/KNI2UFxjXd", "Young Communists Flip Off The Millions Of Victims Of Communism https://t.co/sOktanohzx", "Planned Parenthood Videos: Anti-Abortion Activists Charged With 15 Felonies For Secret Tapes https://t.co/ZxsfUFlekE", "Britain Officially Triggers Brexit https://t.co/ckznOXaLHM", "New DNC Chairman Asks All DNC Staff To Resign.... https://t.co/jGryvJ1oZC", "Trump Puts End To War On Coal https://t.co/msfNa9HaS0", "De Blasio Fires Back At Trump Admin, Issues Formal Order Telling NYPD To Block FBI, ICE https://t.co/pFFIO7845s", "Chicago Mayor: We Welcome Immigrants https://t.co/NpXnwXs64O", "White House Goes On Lockdown Because Of Suspicious Individual https://t.co/s1vA9gkxYl", "NC School District Fights To Keep Pro-Transgender Message In First-Grade Curriculum https://t.co/xICqhiTodn", "Taxpayer Relief Shot X 3 https://t.co/XRHU47grCh", "Chelsea Clinton Shares 4 Tips For Young Activists To Fight Trump https://t.co/I6r6IfEGdE", "HARD.\nPASS. https://t.co/DGr96SpRWc", "RT @VixenRogue: Find someone who feels for you the way @peterdaou feels for Hillary Clinton.\n\nAnd file a restraining order.", "Grab Her By The License Plate....\n\nhttps://t.co/SSDV4s9XTh https://t.co/W08SK8weXz", "ICE Arrests 26 Illegal Aliens While They Are Doing Community Service As Part Of Parole Deals https://t.co/lJdQEM7pHx", "Democrats Filibuster Plan Against Gorsuch May Not Work https://t.co/uXwqVnd0Q1", "BREAKING: Dems Delay Senate Panel Vote On Supreme Court Nominee Gorsuch https://t.co/n0LHQz50iP", "Josh Earnest Is Now A Political Analyst For NBC News and MSNBC https://t.co/P6U7x7I4uD", "Sick: Huma Abedin Reportedly Giving Anthony Weiner Another Chance https://t.co/3P6cclw8fi", "Report: Paul Ryan Got Down On One Knee To Beg For Health Care Votes https://t.co/cZ5GVAU3XA", "Illegal Alien Kidnaps And Ties Up Texas Woman, After She Helped Him Near Border https://t.co/t9WdN7pHBf", "Hundreds Arrested In Protests Against Putin And Corruption In Russia, Including Opposition Leader https://t.co/c80LUsrpAf", "Chelsea Gets Triggered By MAGA Hat On Abraham Lincoln https://t.co/CwjvB18fR6", "Phoenix Man Accused Of Planning ISIS-inspired Terror Attack Released On Bail https://t.co/7ngVDRC3rC", "RT @thatbillokeefe: If your ideas were any good you'd be president now. https://t.co/pkDAIRkHXp", "Mondays, am I right? https://t.co/yhFD4PJggY", "This is the most Florida thing ever. https://t.co/pqz27KIFqP", "Boom! Keystone Would Make US And Canada Bigger Competitors With OPEC https://t.co/2VsDwSCOW3", "RT @Popehat: Beam me up Scotty.  Everything just sucks down here. https://t.co/7dFKqO0PXe", "@JSwiftTWS https://t.co/Dr26aqKx1e", "Vets Get Rights Back: House Passes Bill to Roll Back Obama-Era VA Gun Regulations https://t.co/tfjMG8WnxK", "Trump Approves Keystone Pipeline https://t.co/cPgmaSpyAv", "Trump: Pass Obamacare Replacement On Friday Or I Will Leave It https://t.co/jpeA9oUb3P", "She never took a break. From being a professional student. https://t.co/1KRgpF6PUR", "BREAKING: House Will Not Vote On Obamacare Replacement Today https://t.co/Sb71I3Pi3k", "State Department To Approve Keystone Pipeline Permit https://t.co/oB9FnceSsF", "Men should pay for maternity care. Right? https://t.co/trJkUyqUT5", "RT @artemwkzishubin: https://t.co/gQ7IEEJHCv", "RT @thatbillokeefe: #Obamacarerepeal https://t.co/belW2EikXV", "RT @thatbillokeefe: Healthcare Wars Episode V - The Swamp Bites Back.", "Schumer Says Dems Will Filibuster Gorsuch https://t.co/4TfctfrKsR", "FEC Dems Resume Their Campaign to Regulate Conservative Media, Facebook, Twitter https://t.co/DlQU6blTHT", "BREAKING: Westminster Terrorist Is Identified https://t.co/FcfH0bipkS", "Like Lobster? Lobstermen Would Like To Bring Them To You, But Obama Regs Are Hindering And Hurting Them https://t.co/XccLIdPN3v", "Freedom Caucus To Oppose Healthcare Bill With 25 Members, Sinking It https://t.co/704qXkZaTh", "Obama Admin Tried to Legalize Immigrant Now Accused of Killing Teenage Stepdaughter https://t.co/ZALH7My7ia", "BREAKING: British Parliament Attacker Was Radical Muslim Cleric, Abu Izzadeen (aka Trevor Brooks) https://t.co/17aaet4clL", "Your Goofy Tweet Of The Day Courtesy Of Susan Rice https://t.co/7jul3lpakA", "NOT.\n\nTHE.\n\nONION. https://t.co/GCABioF3ZI", "CNN Priorities: Is Trump Afraid Of Stairs? https://t.co/1K5egg5ogz", "It's our fault we think people shouldn't be murdered walking to lunch or walk. Gotcha. https://t.co/SRoM3VG9yS", "John Podesta, Clinton Campaign Manager, Was Board Member Of Firms Linked To Russian Investors https://t.co/Yf3axcWWEv", "RT @thatbillokeefe: After a lifetime of achieving nothing Chelsea Clinton is awarded with lifetime achievement award https://t.co/aWIfu81TDD", "Comrade De Blasio: We Are Preparing NYC Schools To Resist ICE Agents https://t.co/jNd8bOBMKv", "\"Firearms Incident\" https://t.co/ihIraUVpQ7", "RT @thatbillokeefe: Get a life. https://t.co/Hqq39fhPMG", "UPDATE: Reuters now reporting a member of the Metropolitan Police Service has been stabbed INSIDE of Parliament https://t.co/8ZfKZamGDj", "UPDATE: separate attacks in London near Parliament. One on Westminster Bridge and the other outside of Parliament https://t.co/8ZfKZamGDj", "BREAKING: At least a dozen people run over by a vehicle in London outside of Parliament in apparent terror attack https://t.co/8ZfKZamGDj", "RT @AndrewLawton: BREAKING: AP reporting two people shot outside the British House of Commons. Sitting suspended.", "Kagan, Breyer Join Other Justices To Strike Down Unconstitutional Obama Appointment https://t.co/BUnhI0LQof", "How Would The Founders Have Dealt With Left-Wing Violence? https://t.co/on32nWgAvQ", "Going to be a long eight years for you. Thankfully, you won't have to get a real job in the meantime. https://t.co/zACS53TpWm", "Just like Hillary. https://t.co/8zwFxyk3ib", "Take that poor people! https://t.co/1CBXAkQMW3", "RT @SethAMandel: I would like Russia to hack Mike Huckabee's phone/computer and make his jokes funny.", "President Trump Bans Electronics During Flights From Some Middle Eastern Countries https://t.co/TpKVVN7dif", "Sanctuary Travis County, Texas Released 142 Criminal Illegal Aliens In Just One Week, Says ICE https://t.co/VJWRKYSe6u", "Former DNC Official Partnered With Convicted Bomb Maker To Investigate Trump https://t.co/QpbhN4qS1P", "cc: @thatbilloakley @Joshstrangehill https://t.co/I2Ma3VVNAf", "RT @Bmac0507: When no one watches your videos so you have to tweet them out every 20 minutes https://t.co/OyoyEpRXYP", "Russian Meddling Had More To Do With Hillary Than Trump, Comey Implies https://t.co/rUcqAUpqLf", "Chelsea Clinton To Be Honored for Humanitarian Work https://t.co/lFMwzsVTAB", "Suggestion: Run Chelsea Clinton and Elizabeth Warren for president in 2020. Prove you've learned nothing. https://t.co/eztJlY0yug", "RT @thatbillokeefe: I thought Sesame Street was on HBO now? https://t.co/RsLtUzQ7mX", "EPA Receives Hundreds of Cookies From Concerned Citizens Fearing Trump Budget Cuts https://t.co/hNbMaWsYW4", "RT @jason_howerton: So much big news going on today, and it all suddenly seems to so insignificant to me.", "RT @TheRickWilson: Comey just called you a liar, @realDonaldTrump. \n\nProceed.", "RT @charlescwcooke: One year later. https://t.co/Il6FrJUZVj", "RT @charlescwcooke: One year ago today. https://t.co/RRc0bVNjQI", "Trump Admin To Boycott UN Human Rights Council For Anti-Israel Agenda https://t.co/9dbv9MqETB", "RT @DepressedDarth: Still better than Nickelback https://t.co/iHvmhBeZVv", "Get Ready To Rumble! Gorsuch Hearings Set To Begin https://t.co/MZX98z5GTc", "Starbucks CEO To Step Down After His Anti-Trump Vow To Hire 10,000 Refugees Backfires https://t.co/H4hJnZXmwh", "Dershowitz: Courts Essentially Saying If Obama Issued Trump Travel Ban, It Would Be Constitutional https://t.co/3ChqXChy1S", "Comey To Testify Tomorrow On Wiretap, Russia https://t.co/ERFiYOtqGR", "House Intel Chair: No Evidence Of Trump-Russia Collusion, But Were Leaks Designed To Hurt Trump https://t.co/UwUdsdqrX8", "Man In Custody After Driving Up To White House Checkpoint Claiming He Had Bomb https://t.co/njTimo074k", "Report: Trump Looking at Legal Action Over Release of His Tax Returns https://t.co/gIlBrEJTvH", "Brazile Defends Her Decision to Leak Questions to Clinton https://t.co/zQexOKfKjp", "Congress Considers Splitting The 9th Circuit https://t.co/KxHa58ueSK", "RT @TrumpDraws: leprakan https://t.co/zzvDbn174F", "OK! https://t.co/2g6AqeTPqa", "The best gravestone ever. THE BEST. https://t.co/wNGMKjTMPQ", "RT @RachelFeltman: Here are some drones herding some sheep because Ireland https://t.co/rBuQmU0QdI via @PopSci https://t.co/omuUxZ2QC3", "Always there are two.... https://t.co/3y8TTH7TKb", "Report: Students From Immigrant Households In U.S. Public Schools Has Doubled Since 1990 https://t.co/7pgGkhyCdU", "Suspected Hack Attack Snagging Cell Phone Data Across D.C. https://t.co/I8ZrBfhU4W", "Violent Threats Against The President Are OK Now? https://t.co/0U5kSQcveq", "RT @USATODAY: #BREAKING USA Gymnastics CEO who handled sexual abuse scandal resigns https://t.co/i3O8ZFisxA", "OMG! Global Warming May Shrink Horses To The Size Of Cats https://t.co/NnGYVn6W3n", "Bomb Parts Found In Suitcase At Port Authority Bus Terminal In NYC https://t.co/jJR2a5tbsV", "Don't listen to him. Bring it back. https://t.co/s5LT0XaKro", "With great ideas like \"Block him on Twitter\" I can't imagine how you guys lost this election. https://t.co/2tIf1czZrk", "Rachel Maddow Blames Her Viewers For Her Tax Reveal Dud https://t.co/HNfbduMD8N", "Obama Acting CIA Director Mike Morell: No Evidence Of Collusion Between Trump Team And Russia https://t.co/WWHpKdrJuX", "Trump Presents First Budget, Eliminates Funding For NPR, PBS https://t.co/O8MZsIrGOD", "RT @thatbillokeefe: .@McDonaldsCorp Come on. You know you want to. https://t.co/UdJsz3sxsR", "RT @AFP: #BREAKING 8 injured in French school shooting: ministry https://t.co/Qz4DBl8twc", "RT @NessaAdelaide: @weaselzippers @McDonaldsCorp also, bring back the Big &amp; Tasty please", ".@McDonaldsCorp But seriously. Alls forgiven if you bring back the McRib.", ".@McDonaldsCorp When you guys are done fixing this, can we talk about bringing the McRib back again? #Hungry https://t.co/og8MJe7Zwk", "Migrant Crime And Violence Soars In German States https://t.co/QE2NdT8PmK", "RT @piercecp: I've been followed by an account in Russian that only retweets Ben Stiller. ??? https://t.co/ZWDgC9tsY6", "RT @jason_howerton: Rhymes with Merle Barber https://t.co/VP6vgX3GnY", "Patiently awaiting @thehill tweets/stories on this helpful household tip. https://t.co/XtYuzrEszX", "UC Davis Language Guide Claims Only White People Are Racist https://t.co/FdeRJ7fISd", "Obama Aides Spread Climate Change Money Across The Government To Elude Cuts https://t.co/fdE0MmnNJe", "BREAKING: Explosives Found In Suspicious Package Sent To Finance Ministry In Berlin https://t.co/P6S0ZK95bh", "How Many Times Can @TheHill Tweet About Chelsea Clinton In Three Days? https://t.co/18uuc0aZBn", "BREAKING: Maddow Says She Has Trump 2005 Tax Returns. WH Says Trump Paid $38 mil on $150 mil income \n\nhttps://t.co/0cpUNRAzWm", "Swedish Minister: Country Needs To Integrate Returning Islamic State Fighters https://t.co/8q31On7ry0", "Dear @TheHill --\n Please stop trying to make Chelsea Clinton a thing. Also, seek help!\n\nhttps://t.co/QghkjXVumk https://t.co/1ADgnQhfVE", "Bernie Sanders: A Whole Lot Of People Will Die If Obamacare Is Repealed https://t.co/oThvrFnpbh https://t.co/ByKxvfwcF0", "RT @thatbillokeefe: .@thehill Seriously. Stop. Seek help. https://t.co/a4ZZLaPjHf", "RT @thatbillokeefe: .@TheHill needs to stop trying to make Chelsea Clinton a thing. Seriously. Enough already. https://t.co/GISUtNpjpD", "Oh Joy, Shaun King Plans To Save Brooklyn By Becoming A Politician https://t.co/SVrWgc5C64", "House Hacking Suspects Could Read Every Email Dozens Of Congressmen Sent And Received https://t.co/jdvkuh8gOp", "Overnight Open Thread: Here Comes The Robot To Help You! https://t.co/Sfn64b0oHT", "Filmmaker Pushing Doctored Ferguson Market Video Freaks Out In Fox Interview https://t.co/P0CWXEthix", "British Foreign Aid Is Funding Palestinian Schools That Are Named After Terrorists And Teach Hatred Of Israel https://t.co/sUglEY2iQI", "Soros Fellow Flees Country While Wife Arrested For Welfare Scam https://t.co/g3PPCSVbFi", "Hawaii Considering Bill To Force Church, Pro-Life Centers To Promote Abortion https://t.co/kGtg5jVTwn", "You are history's greatest monster. https://t.co/xgfiuFW3FC", "Make America Great Again. https://t.co/thNk4J9oZU", "Ferguson Police Officer Gets Broken Nose Trying To Make Arrest At Protest At Market https://t.co/386r1Bu6VF", "Cory Booker: Republicans Cannot Just Force GOP Healthcare Bill Down Our Throats https://t.co/zYHpS9srPN", "Dem Texas Lawmaker Wants To Impose Fines On Men For Masturbation https://t.co/1WsQSTQqzm", "RT @thatbillokeefe: Happy Daylight Savings Time. https://t.co/leNqjYXvmk", "Nope. https://t.co/MV6WsXmPDX", "Students Denounced As Racist For Wearing US Flag Colors https://t.co/eEtnor6v1L", "Trump Transition Team Member In Running To Replace Preet Bharara https://t.co/JYTz1OTyiO", "Intel Panel Calls For Trump To Provide Wiretap Evidence By Monday https://t.co/8efSf2iweO", "Inventor Of Internet: Fake News And Government Surveillance Threatens To Destroy It https://t.co/feA3CFbTp3", "Inventor Of Internet (not Al gore): Fake News And Government Surveillance Threatens To Destroy It https://t.co/7MRmr7uZ9e", "Democratic Craziness Is Causing Immigrants Legally In Country To Leave For Canada https://t.co/pMSfonjr4y", "Report: U.S. Attorney Preet Bharara Refusing To Resign On Trump Request https://t.co/VbU1mZK14k", "RT @thatbillokeefe: Jeb Bush visits Venezuela. https://t.co/uunnRsHBYJ", "Orlando Judge Revokes Bond For Widow Of Pulse Nightclub Shooter Who Will Now Stay In Jail Until Her Trial https://t.co/OqSyHctTL2", "Progressive Strategy Memo Shows Dems Have No Idea How Trump Won https://t.co/qUAELrnqz8", "Pelosi Says She Would Have Quit Had Hillary Won https://t.co/BKPa2kpbuH", "National Sorority Begins Accepting Dudes Who Pretend To Be Women https://t.co/PglfbUuXqd", "National Sorority Begins Accepting Dudes Who Pretend To Be Women https://t.co/jwG8HZPmAD", "Islamic Prayer Ritual Can Help Some Bad Backs https://t.co/wUuUqi6qA7", "Sessions May Bring In Outside Lawyer To Investigate Obama-Era Abuses At DOJ https://t.co/G9usS5ICFv", "Caption. This. Tweet. https://t.co/1x0gaIvDL9", "\"Motive unknown\" lol https://t.co/b3k8YWSqmk", "Awful. https://t.co/UmNnvMkv6y", "EPA Chief Scott Pruitt Says Carbon Dioxide Is Not A Primary Contributor To Global Warming https://t.co/H2Ih3WnjO1", "Pelosi Suggests Russia Is Blackmailing Trump https://t.co/JWUXq7G4ib", "STOP TRYING TO MAKE CHELSEA CLINTON A THING. SHE CAN'T EVEN GRAMMAR.... \n\nhttps://t.co/yYzxgiY2uq", "CNN Presenter Eats Human Brains On Camera With Cannibal Cult https://t.co/j32HT33L58", "Did Obama Admin Let A Terror Suspect Disappear Just Before Election To Help Hillary? https://t.co/wG3oHxvITT", "Dem Congressman Interrupts Obamacare Hearing 10 Times In Two Minutes https://t.co/y3CDjYtjvd", "\"There was a hand with that, you didn't happen to find it did you?\" https://t.co/4kc08MZtgN", "White House: CIA Programs Exposed By WikiLeaks Occurred Under Obama https://t.co/FFIRlAsmRH", "Tweet Of The Day: A Few Choice Words For Bernie Sanders https://t.co/qwlcr4Mtmk", "RT @BecketAdams: Obamacare vs. GOP Replacement https://t.co/doiIroRgnq", "Palestinian Authority Names Youth Camp After Terrorist Who Killed 38 Israelis https://t.co/AUzB5si77y", "No one cares. https://t.co/tpGz9rfwvP", "Robby Mook, Hillary Campaign Manager, Says There Were Wiretaps That Picked Up Trump Aides https://t.co/PlYC9bDaWV", "Son Of Tim Kaine Arrested For Disrupting A Trump Rally In Minnesota https://t.co/Hw46cVfzZY", "California State Journalism Assignments Disparage Conservatives https://t.co/oo9kVIUaE3", "Despite Boycott Effort, Ivanka Trump Clothing Line Reports Record Sales https://t.co/rsRWMEIojI", "New Yorkers To Hillary Clinton: No Thanks https://t.co/xSsDNk3QIf", "121 Released Gitmo Detainees Have Returned To Terrorism https://t.co/7SENsvtsT9", "Democrat Senator: I Have More Personal Time With Trump In 2 Months Than Obama In 8 Years https://t.co/J65IhOWgCu", "NSA Whistleblower Backs Trump Up On Wiretap Claims https://t.co/2g6yk2dutq", "lulz. https://t.co/pVm8njAQW4", "Navy Veteran Takes His Own Life After VA Denied Him Full Disability Benefits https://t.co/yZj8RUIIia", "Immigrant Named Elvis Arrested For Threatening To Behead Mom, Trying To Join ISIS https://t.co/i7Gz2B9cuq", "RT @GaltsGirl: You lie. https://t.co/sHSTpie3WQ", "RT @thatbillokeefe: There are currently 9,720 leaks by @Wikileaks on the United States and 57 on Russia. Really makes you think doesn't it?", "Key Pipeline Protester Is Convicted Sex Offender Leading A Double Life https://t.co/rfUANU6IAP", "Write the treasury a check for what you think is your fair share. They will keep it. Promise. https://t.co/VuZ9xmsezh", "#StayWoke https://t.co/LuNOhr1kxf", "ISIS Launches Chemical Weapons Attack On Women And Children In Mosul https://t.co/siOVIGJd9o", "Michael Moore Moons Over Hugo Chavez And The Success Of Socialism In Venezuela https://t.co/Kz6HjvfE1E", "BREAKING: New Immigration Order To Take Effect March 16, Iraq Is No Longer Included https://t.co/32UcNK9yyA", "Florida Judge: Dade County Holding Arrested Illegal Immigrants For ICE Is Unconstitutional https://t.co/TNb23nRtb9", "BREAKING: Supreme Court Scraps Case On Transgender Bathroom Rights https://t.co/uz6vLHoV4J", "Former AG Loretta Lynch Calls For More Marching, Blood, Death On Streets https://t.co/WlsT0mvQRB", "Barbra Streisand Claims Donald Trump Is Making Her Gain Weight https://t.co/Hq4PsX10lC", "Former AG Loretta Lynch Calls For More Marching, Blood, Death On Streets https://t.co/KqSBjioZN8", "White House Calls For Congress To Investigate Claims Of Obama Surveillance https://t.co/CoA8guBd8z", "More Pro-Trump Rallies Across The Country in 28 Different Cities https://t.co/51wWr5lBsJ", "Obama Denies Ordering Surveillance On Trump In Carefully-Worded Statement https://t.co/oVl5f4oKBf", "Media Trying To Push This Pic Of Hillary To Whip Up Attack On Pence https://t.co/vhP0HT1IjF", "EU Calls For End To Visa-Free Travel For Americans In Swipe At Trump https://t.co/Z0Hk3fXmap", "Leftist Students Physically Assault Conservative Scholar, Professor Over Speech https://t.co/YiNvAMeaUI", "Daughter Of Valerie Jarrett To Cover Trump DOJ For CNN https://t.co/qSe4NEv6Jt", "Star Wars Actor: Put Muslims On TV Or They Will Join ISIS https://t.co/QybrN5NJrO", "Anti-Trump Communist Reporter made terror calls to Jewish Community Centers nationwide https://t.co/ZCY4sVoTQf", "Russian Ambassador Sergey Kislyak Appeared As Obama White House Visitor At Least 22 Times https://t.co/vFxFmt4Nmf", "BREAKING: Liberal reporter fired from @theintercept responsible for recent spur of bomb threats to Jewish Centers\n\nhttps://t.co/ZCY4sVoTQf", "Maxinne Waters: \"I was a millennial one too\" https://t.co/fBEngZe4Y7 https://t.co/xJFx41KsKK", "Colin Kaepernick To Stand Next Season https://t.co/kkF4HdfMAO", ".@heatstreet wut? https://t.co/16ctqjZVVd", "House Dems Paid $4 Million to Pakistani IT Professionals Now Under Criminal Investigation https://t.co/foV2aUTpEb", "Hillary Clinton, Next Mayor Of NYC? https://t.co/HhaXSBD2PE", "Canadian Sanctuary City Mayor Seeks Federal Funding For Illegals https://t.co/zFtAxEicXa", "Congressional Black Caucus PAC Spends More On Posh Resorts Than It Gives To Candidates https://t.co/Hj3GQmahvg", "RT @AmesCG: .@sarahkliff Thank you Congressman, but our healthcare bill is in another castle! https://t.co/O5y2V1oiDX", "RT @VetsForMattis: @TheMercedesXXX @GlomarResponder Please. Encourage them to get help. https://t.co/OXkpE7vqNd", "RT @_wintergirl93: So Sioux him. https://t.co/EHx5N5dyyX", "Dem Sen. Claire McCaskill Says She Never Met With The Russian Ambassador, But She Did https://t.co/OCrqTrh3pp", "RT @thatbillokeefe: Rand Paul right now. @Popehat https://t.co/GssqXRvhgR", "RT @Popehat: .@Phil_Mattingly @RandPaul SEND NICHOLAS CAGE IN TO SWAP IT WITH A SOUVENIR BILL AND STEAL IT", "OMG https://t.co/1e3lyMaDBV", "RT @JSwiftTWS: Let's just be straight here: Rand Paul has no right to demand a copy of any House committee's draft bill. \n\nWhat a blowhard.", "RT @pdmcleod: The bill is not here. Rep House: \"We cannot find the bill.\" https://t.co/9tqrKEoDal", "Defense Sec. Mattis Livid At Media Reports Disputing Value Of Yemen Raid https://t.co/dtJ9hEeTXZ", "BREAKING: Ben Carson Confirmed As Housing Secretary https://t.co/QH7ZaDbwXG", "What's the rest of the video say Scott? https://t.co/fDLul6LDvt", "Dying.... https://t.co/rDKVgshDur", "Valerie Jarrett Is Now LIving With Obama Again....\n\nhttps://t.co/Ka08tEep1r", "Clinton/Obama Volunteer Loses Job After Taking Swipe At Widow Of Navy SEAL Honored During Trump Speech https://t.co/HyOhLBTnKP", "You know what to do Internet. https://t.co/7fDYthRckZ", "RT @MiceeMouse: @itchydog22 @weaselzippers https://t.co/gTMBGlg5lq", "Special Moment Of Tribute During Trump Speech For Wife Of Justice Scalia https://t.co/kzxlirQR7n", "\"I thought this was a game of baseball\" - Guy who just got blitzed by the LAPDs top running back. https://t.co/KGKfrJ8NXK", "RT @thatbillokeefe: Man attacks police station with a bat. Watch what happens next.\n\nhttps://t.co/Zmr1PngaAt https://t.co/6e1d3Rq6P6", "RT @AFP: #BREAKING Russian jets accidentally bombed US-backed forces in Syria: US general", "Re-upping because it's funny. https://t.co/3iVbseUReD", "&lt;Insert \"This is why Trump won\" joke here&gt; https://t.co/oHf9Yxf6wn", "Crying....lol https://t.co/OkshLXShik", "RT @americaisnow: Media: \"Trump was like a box of chocolates. You never know what you're gonna get.\" https://t.co/m5eJTCjoYv", "CNN Poll: Americans Loved Trump Speech, 7 In 10 Said Moving Right Direction https://t.co/pDUNFGcpRK", "McAuliffe Vetoes Bill To Investigate Virginia Voter Rolls With More Registered Than Eligible Voters https://t.co/6a8pz14WHT", "BREAKING: Trump Says Open To Immigration Compromise That Provides Path To \"Legal Status\" https://t.co/h1QMKYzemI", "Hundreds Of Feds Caught Watching Porn At Work, Including Child Porn https://t.co/3n2U7tdQts", "RT @czechov: #OneDayWithoutAWoman https://t.co/8gQwPDszV4", "RT @Weirddave0: @JonahNRO https://t.co/Gf6PQEQPoo", "Media More Concerned About Kellyanne Conway Kneeling Than Trump Meeting With Historically Black College Reps https://t.co/hFfCuZLLxr", ".@Spacekatgal That's no moon. https://t.co/ha9IjXKvWM", "Why do you hate America? https://t.co/DwnJIsUrJA", "Seems legit. https://t.co/ZoT61bQfGB", "RT @pocbully: A peek inside the mind of Brianna Wu, engineer. https://t.co/xmIrdxuUlv", "RT @DefendWallSt: I thought Asian people were supposed to be good at this science stuff? https://t.co/lGqR7VajGC", "Of course not. They're just eating their pets and dirt because they're foodies. https://t.co/HS52mWAamP", "Leaked Audio Reveals Anti-Trump Forces Manufacturing Hostile Town Hall https://t.co/28TrdnvVUC", "WaPo: The Insane End To Oscars Sends False Message Of Racial Progress https://t.co/McWzrxG8v9", "Iranian Foreign Minister Lauds Iranian Foreign-Language Film Win, Anti-Trump Stance At Oscars https://t.co/ChjQdkJMMF", "DYING https://t.co/Wa9laZQzNl", "Plot twist. https://t.co/R1PoGykNFA", "RT @DefendWallSt: La La Land won the popular vote #Oscars", "Jimmy Kimmel Calls Trump A Racist During Oscar Monologue https://t.co/3qnAAMEREQ", "Rachel Dolezal Is Nearly Homeless, On Food Stamps And Still White https://t.co/ubnQ16pLM4", "RT @danielhalper: The truth is, this is sanctimonious and tedious. https://t.co/0JlwMEpGKV", "RT @DefendWallSt: Deep thinkers of #ResistCapitalism.\n\n#StayWoke https://t.co/d3O6nMjfr7", "RT @SooperMexican: Rep. @NancyPelosi loses bid to place extra legal protections for her and her family. https://t.co/0b7hUOLuke", "Lawyer: Racist Note Given To Black Waitress In Virginia Is A Fake https://t.co/bBGHqeDINA", "Lawyer: Racist Note Given To Black Waitress In Virginia Is A Fake https://t.co/kGOrwnbSrD", "Comrade De Blasio Questioned By Federal Prosecutors Over Fundraising Scandal https://t.co/OVy6A2K2mC", "Comedian Leslie Jones Makes Fun Of White Women Supporting Black Lives Matter https://t.co/IMnrMjh7jR", "Cuomo Absent From CNN After Transgender Comments https://t.co/FPgNWIbS2g", "Holy *@#~! https://t.co/Ca2705Q34c", "She Persisted: GOP State Senator Forcibly Removed By Dems While Criticizing Communist Sympathizer, Tom Hayden https://t.co/V7tpIuBaaT", "Anti-Semitic Graffiti Made Out Of Human Waste Found In Gender-Neutral Bathroom At Rhode Island School of Design. https://t.co/zUmhByn7Hb", "RT @DefendWallSt: .@CAIRFlorida I found out who set the fire in Tampa. His name was 'arson'. What do I win? https://t.co/qKvj8gslAe", "Ted Cruz At CPAC: We May Have Another Supreme Court Vacancy By Summer https://t.co/VrPbGVz0Pr", "Nestle Leaves California Due To Oppressive State Laws, Taxes https://t.co/B2LhjKM6n3", "Witches Plan To Cast Mass Spell Against Donald Trump https://t.co/jhg7Xy6H67", "That settles that once and for all. Thank God. https://t.co/cPBlHbwLt4", "Man Who Illegally Fundraised For Clintons Made Tell-All Video Because He Feared Assassination https://t.co/uhnmXuGt2A", "Two Minors Were Injured, One Severely, By Fires Deliberately Set By DAPL Protesters https://t.co/5ZGi6a6CAW", "Revealed: Democrats Behind Mexico City Demonstration Against Tillerson https://t.co/cE1CQxXg6a", "Keith Ellison Calls For Impeachment Investigations Of Trump https://t.co/GIYoHWg6EY", "RT @DefendWallSt: 2-23-45 https://t.co/VHkUIIWALA", "BREAKING: Fox News contributor Alan Colmes dead at age 66. https://t.co/uS0woj6lEA", "Trump Admin Strips Funding For Illegal Aliens, Reallocates Money To Victims Of Their Crimes https://t.co/xU3gdx4UeX", "Hundreds Of Campuses Encourage Students To Turn In Fellow Students For Offensive Speech https://t.co/LruEmQa1FB", "Michigan State Bans Whiteboards To Prevent Offensive Messages https://t.co/CfgRsMTqjJ", "Robert Reich Blames Trump For Riots In Sweden https://t.co/pmVT9fKXsx", "Nope. We're not making the same mistakes over again. https://t.co/cxXYRhmrR3", "House IT Staffers Owed Money To Hezbollah-Connected Fugitive https://t.co/B04lsOtYat", "House IT Staffers Owed Money To Hezbollah-Connected Fugitive https://t.co/hAfe2kkGpv", "Missouri Man Accused Of Plotting ISIS Attack In Kansas City https://t.co/yKpt3VlLfc", "These Senators Opposed Vouchers Backer Betsy DeVos But Send Their Kids To Fancypants Private Schools https://t.co/lOAO92zlUA", "Sweden: Looting, Cars Torched, Police Attacked As Riots Break Out In Migrant Suburb https://t.co/3BRCpxS7RS", "Ivanka Trump Calls For Religious Tolerance After Slew Of Threats Against Jewish Community Centers https://t.co/ClthYi1MfN", "House Dem IT Guys In Security Probe Secretly Took $100K In Iraqi Money https://t.co/jidP9eUksQ", "RT @BenHowe: https://t.co/ar34auqezJ", "RT @TheRealStanLee: Happy Presidents' Day!\n(Art by @PaoloMRivera ) https://t.co/lCasMgLuWV", "TSA Allows 11 JFK Passengers To Bypass Security Screenings, 2 Of Which Set Off Metal Detectors https://t.co/dihUXswZwO", "RT @soledadobrien: I accept your generous offer. Pls dm me to work out details. https://t.co/tdETJ7n4LB", "Revised Travel Ban Targets Same Seven Countries, Exempts Green Card Holders https://t.co/tZUrlE1lRx", "Texas Students Skip School To Protest Arrests Of Violent Illegal Alien Criminals https://t.co/BBhXY5TKlR", "California Proposes Single-Payer Healthcare System To Include Illegal Aliens https://t.co/YG7FHbkFiz", "Trump: Hour Of Negotiations Saved More Than $1 Billion On Air Force One https://t.co/AQ8n6WwRBs", "Miami Formally Drops Sanctuary City Status Because Of Trump, Liberals Freak https://t.co/yLyWCqSq5s", "Bono Meets With, Praises Mike Pence https://t.co/SILN1DDi4b", "Good. https://t.co/aeLj8eaO87", "BREAKING: World Trade Center Bomber Blind Sheikh Finally Buys The Farm https://t.co/vMHsfByPGZ", "BREAKING: World Trade Center Bomber Blind Sheikh Finally Buys The Farm https://t.co/egGBK5knT2", "RT @DefendWallSt: Clinton Foundation\nUranium One-Rosatom\nWhitewater Development Corp\nHooters https://t.co/w5XcnSWS5Z", "VA Employees Spent A Million Hours On Taxpayer-Funded Union Activities Rather Than Veterans https://t.co/r66Ke90rTy", "Black Leaders In Chicago Finally State The Obvious About Violent Crime https://t.co/Gd3VfMRyep", "BREAKING: Senate Votes On Party Lines To Confirm Scott Pruitt As EPA Administrator https://t.co/ios3WfKYms", "RT @DefendWallSt: Headlines that never appeared 2009-2016 https://t.co/aYF3yMVKlx", "Bogus NY Times Scoops On Trump, Russia Are Recycled Propaganda https://t.co/Qq6Ji5g1Dp", "Former Clinton IT Aide May Face Criminal Charges Over Email Server https://t.co/ytIogiTG7o", "Shocker: Al Gore Warns Of Dangers Of Climate Change At Atlanta Meeting https://t.co/mKY297HVpc", "Walls Work: Illegal Migration Collapses In EU Countries With Strong Borders https://t.co/VF82Smmy8Y", "You know the @ACLU also opposed this bill too? https://t.co/YqpmKtJjMd", "Christian University In Texas Opens Prayer Room For Muslim Students https://t.co/OXaousvaQJ", "You seem nice. https://t.co/8gLU15ryN9", "California Schools Cut Meat, Cheese From Lunches To Fight Global Warming https://t.co/0DD7I3gLSi", "GOP Bill To Eliminate The EPA Is Literally One Sentence Long https://t.co/WRvdsA5wNp", "FBI Randomly Releases Trump Real Estate Investigation Records From The 1970s https://t.co/SRDfdCUZoT", "Special Forces Commander: U.S.-Led Coalition Forces Have Killed 60,000 ISIS Militants https://t.co/JBTUuvFtqZ", "RT @CalebHowe: Man rocket science has really changed focus in the last few years. https://t.co/elGTj6CZNW", "Compare Media Coverage Of Flynn To Real Compromise Of U.S. Intel By Democratic Employees, The Awan Brothers https://t.co/BksoNRIbHF", "Hilarious: Sally Kohn Has Plan To Install Hillary Clinton As President https://t.co/Z4CszQtGBL", "Small Canadian Towns Being Inundated With Refugees Crossing The Border Illegally From America https://t.co/8xxarWGsXC", ".@sallykohn https://t.co/A4Dl63HzHr", "Former Obama Officials, Loyalists Waged Secret Campaign to Oust Flynn https://t.co/TBVGt5EIek", "NYT Reporter Apologizes For Calling Melania Trump A Hooker https://t.co/OW73cXXM8l", "New York Times Punishes Reporter Who Called Melania Trump A Hooker https://t.co/peJMH5unEA", "RT @Roran_Stehl: @nytimes https://t.co/HUC3hB9PCU", "The 20 Cities With The Highest Number Of Illegal Aliens https://t.co/wHaNuOU57Z", "New Katy Perry Song Gets Political, Urges Uprising Against Trump https://t.co/1xIdDtXtV2", "RT @THEJeremyChoate: My two-year old admitted for pneumonia, tonight. Moving him to ICU, now. Please pray.", "RT @samwhiteout: The GIF we didn't know we needed.\nhttps://t.co/uppvVtLk12", "Obama PACs Are Busing Protesters To GOP Town Halls https://t.co/DSqlNJZuMK", "Indicted Democrat Who Partied With Pelosi, Flew With Obama And Campaigned for Clinton https://t.co/JVJpKzA3Ra", "Trump Could Remake The Federal Judiciary: There Are Still 117 Court Vacancies To Be Filled https://t.co/iYv8DtL7QX", "NYU Student Calls For Shutting Down College Republicans https://t.co/dimXNSQJHg", "Gym Owner Goes After Ivanka Trump For Signing Up For One Of Her Classes https://t.co/7ooI7a61B6", "New York Doll Maker Will Be Selling What It Believes To Be First Transgender Doll https://t.co/xN9HaodSl8", "BREAKING: 9th Circuit Deciding Whether To Reconsider Travel Ban Decision https://t.co/67rmLIpCjT", "Georgetown Islamic Studies Professor: Slavery OK, So is Non-Consensual Sex https://t.co/dwZOoyxx1a", "Michelle Obama To Appear On Reality Television Show https://t.co/N2uzbn9j6x", "Democratic Party Bracing for a Clinton-Kennedy Face Off for NY Senate Seat https://t.co/m7w8Unn2dB", "Gowdy: 9th Circuit Has Well-Earned Rep For Being Presumptively Reversible https://t.co/CHqG37sQOt", "BREAKING: Protesters Surround Betsy DeVos, Scream At Her, Physically Prevent Her From Entering DC School https://t.co/aaBcmfcLJX", "Hillary Clinton Was Replaced On Vogue Cover After Election Loss https://t.co/zvrKniR2BB", "Muslim Olympic Fencer Claims She Was Detained By Customs After Travel Ban https://t.co/ruslXiuqbm", "Dem Sen. Tim Kaine: Robert Byrd Was Not A Racist, But Attorney General Jeff Sessions Is https://t.co/0FsNYryY7S", "Muslim Olympic Fencer Claims She Was Detained By Customs After Travel Ban https://t.co/m0GPBGjdlA", "Comic Ilana Glazer Trashes Ivanka Trump Over Photo With Baby Son https://t.co/7mp5MQbZAj", "Dershowitz: Trump Will Likely Lose In Court Of Appeals, Win In Supreme Court On Travel Ban https://t.co/VwwHEJfzZX", "Democrats Quickly Build Massive Network to Combat Voter ID Laws https://t.co/eD3SjWpxw9", "White House Preparing Exec Order To Send ISIS Detainees To Guantanamo Bay https://t.co/WsWHR6eq3m", "Buffalo Mom Arrested, Kids Seized After Decision To Homeschool https://t.co/MZB8rae22o", "Evidence Shows ISIS May Be Forging Passports https://t.co/PZo2Afve1d", "Days Before Inauguration, Hackers Breached D.C. Traffic And Security Cameras https://t.co/YqBPnjkHxO", "Police Investigate Explosion At Norwegian Asylum Centre https://t.co/vWkg44jXei", "BREAKING: Jeff Sessions Confirmed As US Attorney General https://t.co/atcASwW4vq", "Rubio Gives Brilliant Defense Of Shutting Down Warren https://t.co/6lJrEBxkc3", "Planned Parenthood Urging Women To Boast About Their Abortions https://t.co/ah2IvaGWJ1", "State Department Whistleblower: I Have Seen First-Hand The Abuse And Fraud In The U.S. Refugee Program https://t.co/a3SCJTgkIl", "Berkeley Student Paper Publishes Columns Praising Anti-Milo Riot https://t.co/YJf82qA4wF", "Elizabeth Warren Gagged By Senate For Violating Rules When Attacking Jeff Sessions https://t.co/rb7XN5NXuk", "RT @Julio_Rosas11: What you order online vs. what you actually get: \n#CNNDebateNight https://t.co/lVTWqILkhI", "RT @Joshmccarty10: I think Cruz should be charged with a hate crime... you can't smack around an old man like this  #CNNDebateNight", "Live Debate: Cruz vs Sanders On Healthcare https://t.co/ffSqHOp4zW", "RT @benshapiro: For the love of God, markets are not rationing. They are consensual transactions. #CNNDebateNight", "Looks Like Team Trump Just Made Iran Blink https://t.co/EZz6WpjoDH", "Chelsea Clinton Outraged Republicans See ISIS as Greater Threat Than White Terrorists https://t.co/j2yDRqUEDn", "92% Of Left-Wing Activists In Berlin Live With Parents, 1 in 3 Is Unemployed https://t.co/7P3I6yV9Zv", "Alert Title IX. Joe Biden is about to become a college professor.\n\nhttps://t.co/PeOsHlNI23 https://t.co/YNSoy6TAhC", "RT @politics_n_prep: https://t.co/u89gk5Q9JD", "RT @KatTimpf: Note: \"Sad day for children\" and \"sad day for teachers unions\" is not the same thing", "RT @danieltobin: \"Government  is rigged!\"  - - Government https://t.co/RlMCjJICvW", "RT @DefendWallSt: Democrats won the popular vote again. Too bad it doesn't count. https://t.co/TO7NWyrjAh", "Now there is. Welcome to history. https://t.co/u5skdAey34", "There are 245 other ties broken in the senate by a vice president. https://t.co/VeU8FFhYNf", "Hillary Clinton: The Future Is Female https://t.co/FfU1SeSbPv", "Life comes at you fast. https://t.co/0bs8DwRaL4", "CNN Doesn't Know John McLaughlin Is Dead....\n\nhttps://t.co/QMz7hlsnYh", "Left Bashes Lady Gaga For Not Attacking Trump During Super Bowl Halftime Show https://t.co/EGy8E4h2Xl", "Woke AF Level: 9001 https://t.co/aYycEWBJfk", "Leftists Planning Nationwide Strike Against Trump For February 17 https://t.co/nlmra9XzXM", "RT @DefendWallSt: Don't get mad, vote. ~ Obama who knew it was over. https://t.co/YyMXx9mvWX", "RT @DefendWallSt: Just going to call it now and say this is a hoax. https://t.co/Kf87J9dIcY", "Texas Sheriff Releases 39 Criminal Aliens In First Two Days Of Sanctuary Policy https://t.co/zBZVq0N0IK", "Previously Deported Illegal Alien Arrested For Sexual Assault https://t.co/uRu8HnuZhM", "NOAA Scientists Manipulated Temperature Data To Make Global Warming Seem Worse https://t.co/ZBWSuZ5ZBJ", "Previously Deported Illegal Alien Arrested For Sexual Assault https://t.co/i4go6rkHnK", "BREAKING: House Intelligence, Foreign Affairs Committee Members Compromised By Rogue IT Staff https://t.co/0EPbA9eBk3", "Liberals Desperate To Keep Justice Ruth Bader Ginsburg In Good Health https://t.co/7GXG3qgV2B", "Trump To Send Federal Help To Clear Out Protesters From Standing Rock https://t.co/AJFSxRUwWq", "Joy Behar Asks Dr. Phil To Declare Trump A Narcissist https://t.co/HDCj3mtChA", "RT @DefendWallSt: How will they indeed? https://t.co/JNv3Kt1iFh", "RT @DefendWallSt: .@mattyglesias It's like you don't even read your own website. https://t.co/neenSjkh7x", "UPDATE: French Officials Identify Man Involved In Machete Attack At Louvre As 29-year-old Egyptian National https://t.co/zPLTITUUXx", ".@TheDemocrats going to need some ointment for that burn.... https://t.co/c1rBCd3pNw", "Climate Change Warriors Barack And Michelle Obama Take Helicopter To Airport To Catch Private Jet Flight https://t.co/IJc8OJq9RD", "ISIS Amputate The Hands Of Two Boys Aged Ten And Twelve Who Refused To Execute Two Civilians https://t.co/PQqqmqRLx0", "RT @SpaceRacer423: BREAKING: if you're in Pairs, be on the lookout for ....#someone...\nvia @AP https://t.co/sbrFCA66S6", "RT @akaplenko: @weaselzippers Shhh... it's a mystery. https://t.co/cVsjoK1ZqS", "Machete-wielding terrorist shot dead at Louvre in France https://t.co/zPLTITUUXx", "DHS Secretary: Border Wall Could Be Complete Within Two Years https://t.co/N98BRNF01X", "Moonbats at @OccupyOakland declare war on gov't https://t.co/zvVevjUUZ6 https://t.co/hy1eon3VH2", "Botched SEAL Mission Planned Under Obama, But Left To Trump https://t.co/H4TyQC66ER", "RT @exjon: #neverforget https://t.co/N8GYpyqrPV", "On the plus side, the customer service can't get any worse. https://t.co/flSyjgKSxX", "RT @Safe5pace: @BlissTabitha @weaselzippers https://t.co/pLBAIp3c7R", "Obama DHS Awarded $400,000 to Group Whose Leader Called for Overthrowing Trump https://t.co/JwvBXkFZHR", "RT @bethanduncalf: Glasgow vs Cambridge https://t.co/qyTiBH1KrZ", "GOP Senators Opposing DeVos Are Funded By Teachers Unions https://t.co/bL2yVxoJLx", "You know coffee comes in decaf now right? https://t.co/lXJX0uemsI", "Fed Employees Coordinate With Obama Officials To Thwart Trump Initiatives https://t.co/WijrqKSvyI", "RT @CuffyMeh: They're just words, you infant. https://t.co/sgSSu36StH", "RT @DefendWallSt: .@JesseArreguin You call this a community? https://t.co/YlOwUvBGHk", "FLASHBACK: NYC Mayor Bill De Blasio drops groundhog which then subsequently dies...\n\nhttps://t.co/p6CoIw5oNh https://t.co/nHbFU21RRo", "Do over? @smod4real https://t.co/FQn8bBcyXD", "Berkeley Cancels Speech By Breitbart Writer After Violent Riot At Berkeley....\n\nhttps://t.co/XctRPfiXZL https://t.co/JMDupmr4jB", "RT @sevenlayercake: @drklrdbill @DefendWallSt @rachelveronica https://t.co/EHM3j0Qby5", "Senator Finds Hilarious Proof Liberals Were Ready To Protest Any Trump SCOTUS Nominee https://t.co/AJhbr2yKwH", "Fake news bro. https://t.co/1MNs0dVvmQ", "Delete your account. https://t.co/XxYCjnJ6qX", "Trump Honors The Wife Of Antonin Scalia During Gorsuch Nomination https://t.co/3nDOB3N2mT", "No Jewish diplomats allowed though right Sadiq? https://t.co/WSu6uokAFH", "BREAKING: Senate Republicans Vote To Suspend Committee Rules, Advance Nominations Of Mnuchin And Price https://t.co/tm0NAByEAd", "RT @Tiffany1985B: Overheard this morning:\n\n\"Dad, why do I have to wear a jacket?\"\n\n\"White privilege, you'll learn about it later.\"", "Budweiser Debuts Pro-Immigration Super Bowl Ad https://t.co/VS4DMoedg8", ".@FreeBeacon @BrentScher \"HA-HA! Your money is gone!\" https://t.co/JJh2lIwUlL", "RT @rumpfshaker: Can we get #GorsuchPickle trending? https://t.co/3wDK4JaMNf", "What do YOU think? https://t.co/GYuB1fU9EB", "RT @PhilipWegmann: Why'd you vote for him then? https://t.co/oshXaoR5bc", "RT @DefendWallSt: In July 2006, Sen Schumer voted to confirm Neil Gorsuch to the 10th Circuit Court Of Appeals.", ".@EmpressTrump1 @tweetwen115 @KatiePavlich You seem nice.", "They're making it official :) https://t.co/JvNzA36SA0", "Wall just got 10 feet higher. https://t.co/BpfyEFwFxj", "RT @VixenRogue: BREAKING: Racists furious at Gorsuch nomination https://t.co/ceJDCaMpYS", "RT @JoePerticone: OH HERE COMES MERRICK GARLAND https://t.co/HelLRJMKfr", "Anthony Weiner May Face Child Pornography Charge https://t.co/eVbJIQjWS8", "NY Post Sports Columnist Fired For Tweet Comparing Trump Inauguration To 9/11 https://t.co/3WYBd5s88E", "RT @ollieblog: Left: normal American\n\nRight: insufferable liberal https://t.co/CQatPuHTBF", "RT @clairecmc: We should have a full confirmation hearing process and a vote on ANY nominee for the Supreme Court.", "RT @DefendWallSt: Agreed. Let's do that. How's tomorrow? https://t.co/ccZMK87Y1y", "RT @DefendWallSt: Try again. https://t.co/59ycF88NSm", "You don't know what a tank is, do you? https://t.co/VpvzHCOlMw", "Question Of The Day: What The Hell Is Winona Ryder On And Can We Have Some? https://t.co/jolpHvcIAL https://t.co/RkWX4YoA5d", "RT @Yair_Rosenberg: America is already great https://t.co/zb20wcDvWn", "RT @ellencarmichael: I repeat: WYDEN guaranteed he'd show up today. He is the ranking member. He lied.", "Question Of The Day: What The Hell Is Winona Ryder On And Can We Have Some? https://t.co/jolpHvujsj", "Science ....or something? https://t.co/wvus7N66V3", "RT @DefendWallSt: never forget. https://t.co/GSEEmD6X0o", "FLASHBACK: Democrats Tried To Block Thousands Of Vietnam War Refugees, Including Orphans https://t.co/TCPdeM4saC", "Tim Kaine Accuses The Trump Administration Of Being Holocaust Deniers https://t.co/i2l6kZaGkY", "BREAKING: Quebec Mosque Shooting Suspects Identified As Alexandre Bissonnette And Mohamed Khadir https://t.co/BwF4e8IWip", "Rapper Who Burned Donald Trump Mask Arrested In Connection With Violent Home Invasion https://t.co/eABTggir0B", "RT @CuffyMeh: Great. My chances are greater than Hillary ever becoming president. https://t.co/MSZV3VR2qT", "Rapper Who Burned Donald Trump Mask Arrested In Connection With Violent Home Invasion https://t.co/SuoAArIP3E", "Muslims Praying At Airport In Dallas During Protest: What Do You See? https://t.co/PfZIqmjXav", "Colorado Frame Shop Turns Away Lady For Being Pro-Trump https://t.co/jcE8GO0Kxt", "Most Of The Muslim Countries Trump Targeted Have Discriminatory Visa Policies https://t.co/z6Uf7afDUz", "Video: What Happens When The Immovable Protester And The Unstoppable Force Collide.. https://t.co/JCSQeeFOCB", "BREAKING: Iran To Ban U.S. Visitors In Retaliation For Trump Immigrant Ban https://t.co/hqOZpC9nxr", "Passengers From Iraq, Yemen Barred From NYC-bound Flight After Trump Refugee Ban https://t.co/hj1F0V9Q3s", "Trump Plans To Give Persecuted, Such As Christians, Priority Refugee Status https://t.co/lG98QJxcwy", "Nah bro. https://t.co/iH72y81cSj", "RT @redsteeze: But then again Mia Love didn't kidnap, torture and murder a gay man. So she's got that going against her.", "Trump Admin Starts Obamacare Rollback, Pulls $5 Million In Ads For https://t.co/3fwEb8otmp Website https://t.co/iSXS3ePKUu v", "RT @DefendWallSt: .@Deadspin This is my favorite flop. https://t.co/UNj9JXYdYM", "Democrats Trying To Take Nukes Away From Trump https://t.co/hWS46MrCh0", "Trump Wants 20 Percent Import Tax To Pay For Mexico Wall https://t.co/imSSLatv6v", "Ungrateful Traitor Manning Slams Obama For Accomplishing Nothing, Calls For Resistance Against Trump https://t.co/WoJ4tbLftp", "Inspector General Investigating Obama Admin Cyber Attacks On Georgia Election System https://t.co/Z8acdGHYYs", "RT @DefendWallSt: Really loving the new @Deadspin logo. https://t.co/9dSHbrq6UN", "RT @DefendWallSt: .@Deadspin Do you guys have any pictures of Ted Cruz playing tennis.", "Surprise: Bay Area Restaurants Disappear After Minimum Wage Hike https://t.co/B2Izs9thD1", "President Trump To Sign Executive Order Dramatically Reducing Funding Of United Nations https://t.co/G5AWBBjK9S", ".@BlissTabitha https://t.co/JOZ5Xe6Qu6", ".@KeithOlbermann Sorry to see you go. It's been fun! https://t.co/RIw6guiXkk", "Spicer Calls On A Conservative Outlet First And Pisses Off Reporters Yet Again https://t.co/QaIapyvObm", "Epic Rap Battles of mediocrity: Ted Cruz owns @deadspin at its own game https://t.co/0UU7B6kaxN https://t.co/ioS0u1nPk9", "Sorry @Joss -- Age Of Ultron still sucked https://t.co/Sz1qRnO67y https://t.co/8WeSAfGd5F", "Dear Palestine. https://t.co/2bmcOqXpdG https://t.co/C4xFCD9br6", "Democrats And Republicans Unite To Rescind Last-Minute Obama Order Seeking Federal Election Takeover https://t.co/ap5vfJz0l4", "Chelsea Handler Doubles Down On Attacks On Melania Trump https://t.co/MY3DbKcKvk", "Queso. https://t.co/bkVLFjs57N", "*of course* there's a fee involved.... https://t.co/uojOYt9E8e", "Ted Cruz Introduces New Bill  Would Let States Reject Refugees https://t.co/gF16LVyCI4", "California Bill Aims To Teach Kids That Russia Helped Trump Win Presidency https://t.co/PmUxfSQ3O8", "High School Principal And Assistant Principal Placed On Leave For Skit Mocking Donald Trump And Kellyanne Conway https://t.co/1wzS9ot50L", "@GayPatriot Yay! Finally one of the kool kids! https://t.co/SmajcE9KaR", "Trump Expands Ban On U.S. Funding Of Abortions To All US Global Health Aid https://t.co/Lxyf0uSP7b", "New FCC Chairman A Win for Free Speech, Free Enterprise https://t.co/4yzEDQZpWD", "Days Into Trump Admin, Corrupt Employees Are Already Being Fired At The VA https://t.co/zFFSXT2ocm", "BREAKING: U.S. House Votes To Permanently Ban Taxpayer Funding Of Abortion https://t.co/TnxTI39dBq", "The Limo Rioters Torched At Inauguration Belonged To Muslim Immigrant https://t.co/OReh64nUjR", "Obama Finally Getting Invite To Join Exclusive Golf Club https://t.co/yVwVhe5YVu", "You see nice.\n\nJUST KIDDING. https://t.co/0dBXKPqwIK", "RT @VixenRogue: Many warned me that keeping him would ruin my life. Instead he redeemed it. #MyUnintendedJoy https://t.co/Z6xmeUbHvZ", "Environmental Activist Hit, Killed By SUV Walking Barefoot Across America To Raise Awareness About Climate Change https://t.co/jCNGKVWEBi", "Karma! Hollywood Picked A Fight With Trump, Guess On Budget Chopping Block? https://t.co/GkGtB3pg9u", "Obama Gave Palestinians $221 Million Dollar Present In Last Hours Of Presidency https://t.co/owTrAKAWMh", "Report: Clintons Planning Comeback? https://t.co/R8GTuZummY"]}